{"title":"Knight-Brotherhood-Secret World of Freemasons(controversial expo","uid":5081393,"size":1324755,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00d38f9a79b56423cc34f2f7eac70452053ec893&amp;dn=Knight-Brotherhood-Secret+World+of+Freemasons%28controversial+expo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"red_gonzo","files":1,"time":1252337361,"description":"This is Stephen Knight's explosive book The Brotherhood - The Secret World of the Freemasons (1984) which is a most controversial expose of this secret brotherhood that probably got the author killed later. What does it mean to be 'On the Square'? 700,00 Freemasons, all male, probably make the largest secret society in Britain today. What exactly are they? Why are they so incredibly secretive? Is Freemasonry a positive, charitable organization which incorporates a certain amount of harmless mumbo-jumbo, or does it in fact represent something more sinister? Unlike other expositions of Freemasonry, this fascinating book does not focus upon any ideological goal of the Masonic hierarchy, nor on their very existence, save a brief description of the full thirty-three degrees of Freemasonry. Instead, the author explores Freemasonry in the lower ranks, describing the effect that ordinary Freemasons have upon various sectors of British society, particularly in the City of London. Much time is spent examining the influence of Freemasonry in legal fields, such as the police service, the courts and the government and, through many 'inside' interviews, detailing the corrupting effects of the brotherhood in these organizations. Despite the shrill claims of Masonic apologists to the contrary, Knight has clearly done extensive research into the subject, and the many interviews conducted with Freemasons dispel the claim that a membership of the Fraternity will not enable a speedier advancement in life; nor opposition to this set-up result in any negative consequences, something that should provide consternation for all non-Masonic readers. Further chapters describe the possible results of unchecked Masonic affiliations within the legal system, such as the infamous P2 scandal in 1980s Italy. Another chapter discusses the spiritual aspects of Freemasonry, describing their beliefs and practices, and their compatibility with Christianity. It should be noted that, unlike other anti-Masonic literature, this book is not an assault on Freemasonry itself. Indeed, the author often goes out of his way to stress, what he sees as, positive elements to Freemasonry and the good character of many members. However, his findings insist that a society operating in secrecy within the very heart of British society, and any other national society, should be considered a threat worthy of notice. 315 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:00d38f9a79b56423cc34f2f7eac70452053ec893","amp;dn":"Knight-Brotherhood-Secret+World+of+Freemasons%28controversial+expo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00d38f9a79b56423cc34f2f7eac70452053ec893","infoHashBuffer":{"type":"Buffer","data":[0,211,143,154,121,181,100,35,204,52,242,247,234,199,4,82,5,62,200,147]},"announce":[],"urlList":[]}}