{"title":"02.08.09_FC.08.Villingen-FC.St.Pauli_MP3[AFM-Webradio]","uid":5038573,"size":89128713,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:01a88f5c52cee7ff4dcc93b010ba08c64165b0c8&amp;dn=02.08.09_FC.08.Villingen-FC.St.Pauli_MP3%5BAFM-Webradio%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"paulifan","files":-1,"time":1249253161,"description":"Seid gegrÃƒÂ¼ÃƒÅ¸t, Freunde des gepflegten Nervenkitzels! Die Sommerpause ist vorbei, zum Saisonstart steht die 1. Runde des DFB-Pokals an, und verlÃƒÂ¤sslich wie immer bescheren uns unsere geliebten Helden SchweiÃƒÅ¸ausbrÃƒÂ¼che, WutanfÃƒÂ¤lle und Herzattacken genauso wie FreudensprÃƒÂ¼nge, Jubelschreie und - besonders nach diesem Spiel - grenzenlose Erleichterung.\n\nIst der alte AuswÃƒÂ¤rtsfluch wieder da - oder ist es ein neuer, der Dacia-Fluch, der Rote-Hemden-Fluch? Die Partie beim FÃƒÂ¼nftligisten FC 08 Villingen war jedenfalls eine nervenzerfetzende QuÃƒÂ¤lerei fÃƒÂ¼r den ZuhÃƒÂ¶rer, ein Spiel, das nur dank einer Riesenportion GlÃƒÂ¼ck und der besseren Kondition unserer Mannen gewonnen werden konnte. Da gibt es fÃƒÂ¼r den frischgebackenen Cheftrainer noch viel zu tun...\n\nEin ganz groÃƒÅ¸es Kompliment an die Mannschaft aus Villingen, die nichts zu verlieren hatte und das Beste daraus gemacht hat. Sie hat begeisternd gekÃƒÂ¤mpft, ihre Chancen gesucht und gefunden. Passenderweise spielte in der Halbzeitpause eine Brass-Band &quot;Born To Be Wild&quot;... Auf jeden Fall hat sich heute der eine oder andere Spieler fÃƒÂ¼r HÃƒÂ¶heres empfohlen.\n\nIhr hÃƒÂ¶rt den Mitschnitt der LiveÃƒÂ¼bertragung des AFM-Webradios (www.fcstpauli.tv), diesmal mit den Kommentatoren Wolf Schmidt und Han-Ul Park.\n\n\n\nWICHTIG: Niemand weiÃƒÅ¸, was nach dem Verkauf mit The PirateBay passieren wird. Sollte TPB demnÃƒÂ¤chst abgeschaltet werden, findet Ihr mich bei www.torrentbox.com unter dem gleichen Usernamen (paulifan)!\n\nAUCH WICHTIG: Das AFM-Webradio plant, die vollstÃƒÂ¤ndigen Mitschnitte seiner Streams in Zukunft auf seiner Website im MP3-Format zum kostenlosen Download zur VerfÃƒÂ¼gung zu stellen. Sobald dieses Vorhaben umgesetzt ist, besteht fÃƒÂ¼r mich natÃƒÂ¼rlich keine Notwendigkeit mehr, selbst Mitschnitte zu machen und hochzuladen.\n\nSUPERWICHTIG: Am 15. Mai 1910 wurde der FC St. Pauli gegrÃƒÂ¼ndet. Am 15. Mai 2010 findet in Berlin das Finale des DFB-Pokals statt. Es versteht sich von selbst, was das Ziel dieser Saison ist... \n\nIn diesem Sinne...\nFORZA ST. PAULI!\n","torrent":{"xt":"urn:btih:01a88f5c52cee7ff4dcc93b010ba08c64165b0c8","amp;dn":"02.08.09_FC.08.Villingen-FC.St.Pauli_MP3%5BAFM-Webradio%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01a88f5c52cee7ff4dcc93b010ba08c64165b0c8","infoHashBuffer":{"type":"Buffer","data":[1,168,143,92,82,206,231,255,77,204,147,176,16,186,8,198,65,101,176,200]},"announce":[],"urlList":[]}}