{"title":"No Doubt - Sunday Morning","uid":5055559,"size":155672580,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0271ba83156384be08903adc6574904a3c707340&amp;dn=No+Doubt+-+Sunday+Morning&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1250393262,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Sunday Morning&quot; is a song written by Tony Kanal, Gwen Stefani, and Eric Stefani for No Doubt's third album Tragic Kingdom (1995). It was released as the album's sixth single in 1997.\n\nComposing the song began when Tony Kanal was having a fight with Gwen Stefani, who was then his girlfriend, through the bathroom door of his parents' house in Yorba Linda, California. Stefani later changed the lyrics to discuss dealing with her breakup with Kanal.\n\nThe song's music video was directed by Sophie Muller. It opens with a scene of the band performing the song in a garage. Stefani's ex-boyfriend (played by Terry Hall, the lead singer of The Specials.) walks by the house and sits down on a swing. After the first refrain, Stefani leaves for a grocery store where she buys canned tomatoes, and Kanal begins boiling water. Adrian Young sets the table outside while the other three band members begin cooking a meal in the kitchen. While chopping the tomatoes, Stefani cuts her finger and begins bleeding. After she rinses her finger, there are several time-edited shots, after which Stefani carries the spaghetti outside to the table. After rinsing her finger Stefani says 'now you're looking like I used to' while Tony Kanal is cleaning the tomato sauce off the floor. This is most likely a reference to one of Stefani's teenage job of scrubbing floors at Dairy Queen. After the group serves each other and begins eating, a food fight ensues. After the music ends, the ex-boyfriend is shown to still be sitting on the swing.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:0271ba83156384be08903adc6574904a3c707340","amp;dn":"No+Doubt+-+Sunday+Morning","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0271ba83156384be08903adc6574904a3c707340","infoHashBuffer":{"type":"Buffer","data":[2,113,186,131,21,99,132,190,8,144,58,220,101,116,144,74,60,112,115,64]},"announce":[],"urlList":[]}}