{"title":"The Three Stooges Collection - Volume Two - DvDRip - XviD","uid":5080595,"size":5281536000,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:027983aafd01cec88d56e2f53ad33ce963bedc27&amp;dn=The+Three+Stooges+Collection+-+Volume+Two+-+DvDRip+-+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FatFreddy379","files":24,"time":1252258840,"description":"The Three Stooges Collection - Volume Two - 1937-1939\n\nThese are remastered in high definition shorts of the Stooges. I kept the original AC3 stream because it was &lt;10MB difference between that and a 128kbps MP3 stream.\nThey are laid out easily for you to pick and choose whichever short you want to get, no RAR's! If all goes well, I will encode and upload the additional volumes. \n\nEnjoy! \n\n\nXviD - 640 x 480 Full Screen - AC3\n\n\n\nDisc 1\n\n001 - Grips, Grunts and Groans\nWhen the Stooges get a prizefighter drunk, Curly has no choice but to step in and take his place inside the ring.\n\n002 - Dizzy Doctors\nThe Stooges' wives have issued a warning: you snooze, you lose. So they get a job selling a miracle medicine, but it'll be a miracle if they can sell it.\n\n003 - Three Dumb Clucks\nTheir father's plan to marry prompts the Stooges to break out of jail to save him from himself...and, it turns out, from his intended's dangerous posse.\n\n004 - Back to the Woods\nThe Stooges get sentenced to fifty-five years in a British jail but are instead sent to America to protect the colonist from the Indians.\n\n005 - Goofs and Saddles\nThe stakes are higher than ever when the Stooges ante up to play poker with General Muster's nemesis, Longhorn Pete.\n\n006 - Cash and Carry\nCon Men or Good Samaritans? Larry, Moe and Curly blast into the U.S. Treasury in order to get cash to help a poor girl's disabled brother.\n\n007 - Playing the Ponies\nA horse is a Stooge, of course, of course. When the Stooges get saddled with a lame horse, they discover what will make him hot on the track: chili pepperinos!\n\n008 - The Sitter-Downers\nMarriage isn't all bliss, as Larry, Moe and Curly find out when they set up house with Corabell, Florabell and Dorabell. You could call them the Dumbbells.\n\n009 - Termites of 1938\nThe Stooges make pest of themselves at a high society party when a maid mistakenly phones their exterminator company instead of an escort service.\n\n010 - Wee Wee Monsieur\nParis is for lovers, and for the Three Stooges, as struggling artists who paint themselves into a corner when they try to rescue a military captain from kidnappers.\n\n011 - Tassels in the Air\nMoe pretends to be trendy interior designer Omay (Omay is Moe in Pig Latin) and he, Larry and Curly proceed to make an essmay of a socialite's home.\n\n012 - Healthy, Wealthy and Dumb\nWhen Curly wins $50,000 the Stooges start living the high life...until they get the lowdown on exactly how much they get after taxes.\n\n013 - Violent is the Word for Curly\nIt's full service fun when three college professors are literally blown away by the Three Stooges when they Stop at their filling station.\n\n\n\n\nDisc 2\n\n001 - Three Missing Links\nLarry, Moe and Curly go on location to Africa when Curly is cast as a gorilla, and there there come face-to-face with danger when they encounter a real gorilla on the set.\n \n002 - Mutts to You\nWhen the Stooges find a baby, they take it back to their dog laundry business, but wind up in the dog house when they are accused of kidnapping the baby.\n\n003 - Flat Foot Stooges\nMoe, Larry and Curly take care of the horses that draw the fire chief's trucks, but when a crooked fire truck salesman turns up the heat, they get fired up for action.\n\n004 - Three Little Sew and Sews\nWorking as tailors on a navy ship puts the Stooges in a pressing situation after Curly wears the admiral's jacket to a party and is seduced by a spy.\n\n005 - We Want Our Mummy\nThe Stooges trek to Cairo to rescue a kidnapped professor and return a priceless mummy, a case that may take them awhile to wrap up.\n\n006 - A Ducking They Did Go\nAfter recruiting the police chief, governor and mayor into what turns out to be a sham duck hunting club, the Stooges cleverly find a way to avoid jail.\n\n007 - Yes, We Have No Bonanza\nGold prospectors Larry, Moe and Curly set out to make a better life life for themselves and three waitresses, but get served more than they can swallow.\n\n008 - Saved By the Belle\nWhen the Stooges are arrested for treason, a crime punishable by death in the kingdom of Valeska, they use a loudly slurping guard to help cover their noisy escape.\n\n009 - Calling All Curs\nVeterinarians Moe, Curly and Larry find their business going to the dogs when one of their prize patients is stolen and held for ransom.\n\n010 - Oily to Bed, Oily to Rise\nThe Stooges fall in love with three beautiful girls whose widowed mother is robbed of the lease to her oil-oozing land.\n\n011 - Three Sappy People\nWhen phone repairmen Larry, Moe and Curly inadvertently answer a call meant for three psychiatrists, they try to cure a socialite of her wild behavior.","torrent":{"xt":"urn:btih:027983aafd01cec88d56e2f53ad33ce963bedc27","amp;dn":"The+Three+Stooges+Collection+-+Volume+Two+-+DvDRip+-+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"027983aafd01cec88d56e2f53ad33ce963bedc27","infoHashBuffer":{"type":"Buffer","data":[2,121,131,170,253,1,206,200,141,86,226,245,58,211,60,233,99,190,220,39]},"announce":[],"urlList":[]}}