{"title":"Linda Olsson - Taushetens Konsekvenser","uid":5116411,"size":459416755,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:03918840b96d8a6a05be0ffad0808b1780aa8ac3&amp;dn=Linda+Olsson+-+Taushetens+Konsekvenser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"schneide240","files":83,"time":1255048452,"description":"Omtale\nFiolinisten og komponisten Adam Anker bor pÃƒÂ¥ New Zealand, men kommer opprinnelig fra Polen. Han ble fÃƒÂ¸dt under annen verdenskrig, men har ingen forbindelse med fortiden sin. Da hans eneste barn, Miriam, blir drept, kollapser hele hans tilvÃƒÂ¦relse. Han bestemmer seg for ÃƒÂ¥ konfrontere sin gÃƒÂ¥tefulle tilblivelse og det faktum at han har fortiet Miriams for henne. Han reiser til Krakow og fÃƒÂ¥r kontakt med en liten gruppe overlevende etter Holocaust. FÃƒÂ¸rst da Adam fÃƒÂ¥r vite om sin mors fortid blir han klar over hvilken feil han selv begikk mot Miriam.\n\nFra bokomslaget\nFiolinisten og komponisten Adam Anker bor pÃƒÂ¥ New Zealand. Fortiden hans befinner seg pÃƒÂ¥ den andre siden av jordkloden: i Polen, der han ble fÃƒÂ¸dt under andre verdenskrig - og i Sverige, der han vokste opp. Ã‚Â«Jeg har aldri hatt noen forbindelse med fortiden min,Ã‚Â» sier Adam til en gammel kvinne som sitter med nÃƒÂ¸kkelen til opphavet hans. Ã‚Â«Det fÃƒÂ¸les som om jeg aldri har hatt noe annet enn nÃƒÂ¥tiden.Ã‚Â» Adams eneste barn, Miriam, blir drept i en ulykke, og hele hans tilvÃƒÂ¦relse kollapser. Ut av sorgen vokser en trang til ÃƒÂ¥ konfrontere sin gÃƒÂ¥tefulle tilblivelse og det faktum at han har fortiet Miriams for henne. Adam reiser til Krakow, og fÃƒÂ¥r kontakt med en liten gruppe overlevende etter Holocaust. Ved hjelp av deres brevbunker, fotografier og minner pusler han sammen sin historie - bit for bit. FÃƒÂ¸rst da Adam fÃƒÂ¥r vite om sin mors fortid, blir han klar over hvilken feil han selv begikk mot Miriam. Ã‚Â«Jeg gjorde mot datteren min det samme som ble gjort mot meg. Jeg gjorde henne morlÃƒÂ¸s.Ã‚Â» ","torrent":{"xt":"urn:btih:03918840b96d8a6a05be0ffad0808b1780aa8ac3","amp;dn":"Linda+Olsson+-+Taushetens+Konsekvenser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03918840b96d8a6a05be0ffad0808b1780aa8ac3","infoHashBuffer":{"type":"Buffer","data":[3,145,136,64,185,109,138,106,5,190,15,250,208,128,139,23,128,170,138,195]},"announce":[],"urlList":[]}}