{"title":"The Book of Eli 2010 ibarak","uid":5663342,"size":3930837962,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:047e440a8560101f34acad2c613c3eb890346d74&amp;dn=The+Book+of+Eli+2010+ibarak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ibarak","files":3,"time":1278046626,"description":"Reparto:\n\nDenzel Washington (Eli)\nGary Oldman (Carnegie)\nMila Kunis (Solara)\nRay Stevenson (Redridge)\nJennifer Beals (Claudia)\n\nDirector: Albert Hughes y Allen Hughes\nGuionista: Gary Whitta\n\n\nEsta pelÃƒÂ­cula en principio me pareciÃƒÂ³ un film entretenido, interesante. Con un intento por mostrar la religiÃƒÂ³n como punto fuerte y trascendente para la humanidad (cosa que no discuto ya que me parece que, para bien o para mal es asÃƒÂ­), estÃƒÂ¡ claro que quien escribiÃƒÂ³ el guiÃƒÂ³n estÃƒÂ¡ completamente a favor de la religiÃƒÂ³n catÃƒÂ³lica y su &quot;Fe&quot;.\n\nLo que me resultÃƒÂ³ interesante es cÃƒÂ³mo esta persona muestra los dos lados por el cual la religiÃƒÂ³n puede ser tomada: por un lado tenemos a Gary Oldman, quien busca desesperadamente una biblia (la pelÃƒÂ­cula transcurre en un futuro en el que todas las biblias fueron quemadas durante una sÃƒÂºperguerra) y poder utilizarla para controlar a la gente con sus palabras. Por otro lado, nos muestra a Denzel Washington como el hombre de Fe que realmente cree en los dichos de la biblia y la estudia sin cesar para estar mÃƒÂ¡s cerca de Dios y pretende salvar ese &quot;raro&quot; ejemplar que posee para &quot;salvar&quot; a la humanidad.\n\nClaro que en la pelÃƒÂ­cula &quot;gana&quot; el creyente y tipo de Fe, cosa que en nuestra realidad no pasa... pero por eso mismo la pelÃƒÂ­cula transcurre en un futuro ficticio donde el ser humano tiene que empezar de cero, porque en la actualidad resulta imposible pensar en ese desenlace.\n\nLo que me queda picando es justamente eso, por quÃƒÂ© si la actualidad es tan &quot;detestable&quot; el guionista se esfuerza por destruir el mundo y reconstruirlo tal cual lo tenemos ahora, con la Biblia como partida de inicio cultural, social y enseÃƒÂ±anza de Fe. Me parece que algo mÃƒÂ¡s interesante hubiese sido una reconstrucciÃƒÂ³n diferente para que no todo se repita (al fin y al cabo gran parte de nuestras guerras y genocidios fueron y son en nombre de una religiÃƒÂ³n). Pero bueno, el guionista (Gary Whitta) asÃƒÂ­ lo quizo y nos llevÃƒÂ³ a una segunda autodestrucciÃƒÂ³n sin remedio...\n\nLa pelÃƒÂ­cula es evidentemente un intento por &quot;remoralizar&quot; las enseÃƒÂ±anzas bÃƒÂ­blicas y la Fe religiosa, las cuales estÃƒÂ¡n muy devaluadas y perdiendo territorio y poder frente a pensamientos mucho mÃƒÂ¡s abiertos e interesantes.\n\n\n\n\n--------------------------------------------------------------------------------\n\n\nidioma: inglÃƒÂ©s   |    subs: espaÃƒÂ±ol (archivo aparte)\n\nduraciÃƒÂ³n: 1:57:36\n\nVideo\n\nBRRip \nformato: avi\nresoluciÃƒÂ³n: 1280x536\nbitrate: 4456kbps\nfps: 23\n\nAudio\n\nbitrate: 448kbps\n48khz\n &lt;a href=&quot;\nhttp://ojo-al-cine.blogspot.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ojo-al-cine.blogspot.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:047e440a8560101f34acad2c613c3eb890346d74","amp;dn":"The+Book+of+Eli+2010+ibarak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"047e440a8560101f34acad2c613c3eb890346d74","infoHashBuffer":{"type":"Buffer","data":[4,126,68,10,133,96,16,31,52,172,173,44,97,60,62,184,144,52,109,116]},"announce":[],"urlList":[]}}