{"title":"Blind side por memitoxxx etorrents.org ( ingles - latino - portu","uid":5660670,"size":4508999680,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:04a0a017d7a1653a025daf6f8bc93ded2522bfb8&amp;dn=Blind+side+por+memitoxxx+etorrents.org+%28+ingles+-+latino+-+portu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"memitoxxx","files":-1,"time":1277963693,"description":"Directed by \tJohn Lee Hancock\nProduced by \tBroderick Johnson\nAndrew Kosove\nGil Netter\nWritten by \tStory:\nMichael Lewis\nScreenplay:\nJohn Lee Hancock\nStarring \tSandra Bullock\nQuinton Aaron\nTim McGraw\nJae Head\nKathy Bates\nMusic by \tCarter Burwell\nCinematography \tAlar Kivilo\nEditing by \tMark Livolsi\nStudio \tAlcon Entertainment\nDistributed by \tWarner Bros.\nRelease date(s) \tNovember 20, 2009 (2009-11-20)\nRunning time \t129 minutes\nCountry \tUnited States\nLanguage \tEnglish\nBudget \t$29 million[1]\nGross revenue \t$301,575,361\n\nFor 17 years, Michael Oher (Quinton Aaron) has been in foster care with different families. Every time he is sent to a new home, he runs away. One of his friend's fathers, whose couch Mike had been sleeping on, enrolls him into a Christian school, after the father convinces the coach that &quot;Big Mike&quot; is a natural athlete, yet he refuses to beat people to the ground. The coach convinces the school principal to enroll him in the school.\n\nAfter school one day, Michael meets Sean &quot;SJ&quot; Jr. (Jae Head), who quickly befriends Michael. Leigh Anne Tuohy (Sandra Bullock) is a fiery interior designer, mother to SJ and Collins (Lily Collins), and wife to Sean Tuohy (Tim McGraw). After a pre-holiday Thanksgiving school festival, Leigh Anne notices Michael walking on the road, shivering in the freezing cold; she pities his situation and offers him a place to spend the night. The next morning, much to her dismay, she finds Michael leaving their driveway and asks him to spend Thanksgiving with her family. Slowly, Michael starts becoming a part of the Tuohy family, even as Leigh Anne's friends warn her that Michael could affect SJ and Collins' social life. Nonetheless, SJ and Michael become buddies. Leigh Anne goes to the school about Michael's academic performance and is surprised to learn that even though he has scored low in essentially every aspect, he scored in the 98th percentile in 'protective instincts'. Sean also talks to Michael and lists the Tuohys as his emergency contact and talks to the school coach to get Michael enrolled in the football team.\n\nPossessed of enormous stature and titanic strength, Michael performs exceptionally on the field and catches the eye of many college coaches from around the state. SJ tells Michael that his mother cannot stand Tennessee. Leigh Anne discovers that to get a NCAA Division I Scholarship, Michael needs a 2.5 GPA. His current GPA is too low, so they hire a private tutor, Miss Sue (Kathy Bates), to raise his grades. The school teachers also take a special interest and start giving his tests orally rather than in written format. During one of his private tutor classes, Miss Sue, a University of Mississippi (&quot;Ole Miss&quot;) alumna, tells him that the FBI bury the body parts of unidentified dead people under the University of Tennessee's Neyland Stadium. Michael's heart aches and this is shown as a possible reason for Michael opting to join University of Mississippi. Michael ends up with a GPA of 2.52. Subsequently, Michael receives a call from the NCAA, who suspects that the Tuohys forced Michael to select Mississippi, rather than Tennessee, his home-state team. The investigator also tells him that the Tuohys were from Mississippi and his high school coach got a better job at Ole Miss after Michael chose Mississippi. Michael leaves the investigation room and confronts Leigh Anne; he asks her if she only took him in so that he would play football for her alma mater. Michael goes to his birth mother's apartment in the projects, where his old friends at first welcome him, then make sexually suggestive remarks about his adoptive mother and sister. A fight ensues, in which Michael easily dispatches three armed thugs, and flees the scene. Leigh Anne goes in search of Michael. He finally calls her, and they meet at a neighborhood laundromat. Leigh Anne tells him that she wants him to choose which university he accepts a scholarship from and any decisions he makes in life will be supported by her. Michael returns to the NCAA office and tells the investigator that he chose Ole Miss because his whole family has gone to school there. Michael is accepted by Ole Miss with a football scholarship. Leaving Michael at school, Leigh Anne feels happy for what she has done for Michael and also what he has done for them all.\n\nThe film ends with the 2009 NFL Draft, showing the real Michael Oher being drafted by the Baltimore Ravens. The end credits include a dedication to director John Lee Hancock's father, a football player and coach who died in 2009.\n &lt;a href=&quot;\nhttp://img41.imageshack.us/img41/6038/83117369.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img41.imageshack.us/img41/6038/83117369.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img41.imageshack.us/img41/9917/20051973.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img41.imageshack.us/img41/9917/20051973.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img338.imageshack.us/img338/368/41583975.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img338.imageshack.us/img338/368/41583975.png&lt;/a&gt;","torrent":{"xt":"urn:btih:04a0a017d7a1653a025daf6f8bc93ded2522bfb8","amp;dn":"Blind+side+por+memitoxxx+etorrents.org+%28+ingles+-+latino+-+portu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04a0a017d7a1653a025daf6f8bc93ded2522bfb8","infoHashBuffer":{"type":"Buffer","data":[4,160,160,23,215,161,101,58,2,93,175,111,139,201,61,237,37,34,191,184]},"announce":[],"urlList":[]}}