{"title":"Pro.Evolution.Soccer.2010.PAL.SPANiSH.XBOX360 [BajandoJuegos.eu]","uid":5132569,"size":7838695456,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:04ced71414e8e0de272884edee094f4186f24417&amp;dn=Pro.Evolution.Soccer.2010.PAL.SPANiSH.XBOX360+%5BBajandoJuegos.eu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Morck22","files":2,"time":1256160124,"description":"PES 2010 destaca por su espÃƒÂ­ritu innovador, mayor que en ninguna otra entrega de la saga. En todos los aspectos del juego se han realizado importantes mejoras. AdemÃƒÂ¡s, los significativos avances en la experiencia de juego hacen de PES 2010 el juego de simulaciÃƒÂ³n futbolÃƒÂ­stica mÃƒÂ¡s realista.\n\nLas novedades mÃƒÂ¡s destacadas incluyen:\n\nJugabilidad\n\nPES 2010 se centrarÃƒÂ¡ en aumentar la emociÃƒÂ³n en los partidos entre jugadores, haciÃƒÂ©ndolos realmente exigentes y convirtiÃƒÂ©ndolos en un reto constante para el usuario. La inclusiÃƒÂ³n de presiÃƒÂ³n zonal en las tareas defensivas cubrirÃƒÂ¡ de forma mucho mÃƒÂ¡s efectiva los espacios y obligarÃƒÂ¡ a comprobar constantemente nuevas vÃƒÂ­as de ataque para romper la barrera defensiva rival.\nLas decisiones arbitrales en el juego tambiÃƒÂ©n han sido completamente renovadas, con nuevos elementos de IA que los equilibrarÃƒÂ¡n mucho mÃƒÂ¡s durante los partidos.\n\nGrÃƒÂ¡ficos mejorados\n\nPES 2010 ha sido sometido a un importante lavado de cara en el aspecto grÃƒÂ¡fico, con los increÃƒÂ­bles parecidos fÃƒÂ­sicos de los jugadores y sus animaciones ahora mucho mÃƒÂ¡s cercanos a los jugadores de verdad.\n\nSe incluirÃƒÂ¡n nuevas animaciones y expresiones de los jugadores sobre el terreno de juego, que vendrÃƒÂ¡n acompaÃƒÂ±ados de un sistema de iluminaciÃƒÂ³n mejorado que variarÃƒÂ¡ segÃƒÂºn las condiciones climatolÃƒÂ³gicas.\n\nMotor de animaciones y movimientos completamente renovados\n\nEn este sentido, varios elementos han sido completamente redefinidos, con las animaciones de regate, giro y disparo a puerta completamente fieles a la realidad, con una diferencia enorme entre la forma de pasar el balÃƒÂ³n si un jugador estÃƒÂ¡ en carrera o si se encuentra fijo en una posiciÃƒÂ³n.\n\nAtmÃƒÂ³sfera del dÃƒÂ­a del partido\n\nLas reacciones de la grada sobre la acciÃƒÂ³n en el terreno de juego son ahora mucho mÃƒÂ¡s variadas, con nuevos cÃƒÂ¡nticos y griterÃƒÂ­o por parte de la aficiÃƒÂ³n.\n\nUn detalle a destacar es la sutil diferencia entre jugar en el estadio local o fuera de casa, ya que el pÃƒÂºblico reaccionarÃƒÂ¡ espontÃƒÂ¡neamente a situaciones especÃƒÂ­ficas, demostrando su desacuerdo o aceptaciÃƒÂ³n sobre lo que ocurra en el trascurso del partido; como por ejemplo, cuando se comete una falta o se marca un gol.\n\nIA\n\nAhora, los centrocampistas y defensas comparten tareas defensivas, cubriendo espacios y desbaratando jugadas de ataque rivales.\nEste detalle ha hecho que ahora sea mucho mÃƒÂ¡s difÃƒÂ­cil marcar goles, con PES 2010 volviendo a sus orÃƒÂ­genes de simulador.\n\nHabilidades de juego individuales\n\nEn tareas defensivas y de ataque se verÃƒÂ¡n totalmente integradas en el conjunto del equipo. Cada jugador cuenta con una IA ÃƒÂºnica segÃƒÂºn sus mejores caracterÃƒÂ­sticas, lo que tambiÃƒÂ©n se verÃƒÂ¡ reflejado en el comportamiento de sus rivales.\n\nLiga MÃƒÂ¡ster\n\nEl popular modo incorporarÃƒÂ¡ la Champions League y la UEFA Europa League en los calendarios de enfrentamientos y competiciÃƒÂ³n de los equipos, ofreciendo asÃƒÂ­ toda la emociÃƒÂ³n de una temporada completa para el disfrute de sus usuarios. El ÃƒÂ©xito de los equipos en la Liga MÃƒÂ¡ster los clasificarÃƒÂ¡ para estas dos competiciones, lo que servirÃƒÂ¡ tambiÃƒÂ©n para que la fama del equipo aumente y atraiga a otros jugadores, ya que el sistema de fichajes y contratos serÃƒÂ¡ ahora mucho mÃƒÂ¡s realista.\n\nComentaristas\n\nPES 2010 contarÃƒÂ¡ con Carlos MartÃƒÂ­nez (Canal+) como comentarista, y Julio Maldonado &quot;Maldini&quot; como analista en la cabina de retransmisiÃƒÂ³n. Con un sistema de comentarios muy mejorado, ahora las intervenciones estarÃƒÂ¡n mucho mÃƒÂ¡s acorde con la acciÃƒÂ³n sobre el terreno de juego, con referencias a las habilidades de cada jugador, sus actuaciones mÃƒÂ¡s destacadas y anÃƒÂ¡lisis, lo que harÃƒÂ¡ que los comentarios sean mucho mÃƒÂ¡s concisos y con mucho mÃƒÂ¡s detalle, mucho mÃƒÂ¡s parecidos a los reales.","torrent":{"xt":"urn:btih:04ced71414e8e0de272884edee094f4186f24417","amp;dn":"Pro.Evolution.Soccer.2010.PAL.SPANiSH.XBOX360+%5BBajandoJuegos.eu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04ced71414e8e0de272884edee094f4186f24417","infoHashBuffer":{"type":"Buffer","data":[4,206,215,20,20,232,224,222,39,40,132,237,238,9,79,65,134,242,68,23]},"announce":[],"urlList":[]}}