{"title":"Vip Mi Hermano Superhombre","uid":5669059,"size":730007552,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:05537513407ad1f909ec80afc2f841c91a6c3738&amp;dn=Vip+Mi+Hermano+Superhombre&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"malagahuelin","files":1,"time":1278264719,"description":"Era una pelÃƒÂ­cula animada con un estilo muy tÃƒÂ­pico de fines de los aÃƒÂ±os sesenta creada por Bruno Bozetto, uno de los mÃƒÂ¡s famosos y productivos directores de dibujos animados italianos (nominado entre otras cosas al Oscar en 1991 por su corto &quot;Grasshopers&quot;) y creador de la popular producciÃƒÂ³n italiana &quot;La familia Spaghetti&quot;.\n\n&quot;Vip&quot; no contenÃƒÂ­a el tÃƒÂ­pico relato del invulnerable personaje de ficciÃƒÂ³n. Bozetto satirizaba la tradicional imagen del poderoso superhÃƒÂ©roe y lo hacÃƒÂ­a con carisma y sin perder el respeto a otros clÃƒÂ¡sicos de la animaciÃƒÂ³n.\n\nLos protagonistas eran los hermanos Vip, dos descendientes de una familia de superhombres. Super Vip era el ejemplar A1, el invulnerable, dueÃƒÂ±o de una amplia legiÃƒÂ³n de fans y como todos los superhÃƒÂ©roes puro en el alma y fuerte en el cuerpo. Su hermano Mini Vip, era todo lo opuesto, un acomplejado anti-hÃƒÂ©roe al cual una falla genÃƒÂ©tica lo habÃƒÂ­a convertido en chato, miope y con poderes bastante limitados. Eran como un Abbot y Costello convertidos en paladines de la justicia.\n\nEn uno de sus fracasados vuelos, Mini Vip aterriza aparatosamente en una tropical isla desierta y es capturado por la demente Happy Betty (HB), dueÃƒÂ±a de una global cadena de supermercados, los cuales eran utilizados por lo bajo para fabricar unos misiles cerebrales que transformarÃƒÂ­an a la humanidad en una masa de autÃƒÂ³matas. Mediante diversas ÃƒÂ³rdenes electrÃƒÂ³nicas, los afectados por estos misiles consumirÃƒÂ­an entonces toda clase de productos HB. La tÃƒÂ©cnica de lavado de cerebro es probada primero con los empleados de Happy Betty, los llamados &quot;colaboradores&quot; (unos chinitos con chips incrustados en la cabeza), quienes se sacaban la mugre construyendo la malÃƒÂ©vola bomba.\n\nHappy Betty era una tirana de renombre, tenÃƒÂ­a muchos lujos, entre otros varios vehÃƒÂ­culos. Pero su transporte preferido era una silla de ruedas en forma de tanque que sÃƒÂ­mbolizaba su despotismo y sus aires de poder.\n\nSuper Vip se entera de la desapariciÃƒÂ³n de su hermano y vuela en busca de Happy Betty, pero la pelÃƒÂ­cula quiere rescatar otros valores y es Mini Vip quien derroca a la villana con sus virtudes principales: la inteligencia y la autoironÃƒÂ­a. El inseguro personaje crece en el traje y ayuda al perplejo hermano a salvar la situaciÃƒÂ³n.\n\nLa pelÃƒÂ­cula mostraba temas maduros como el creciente capitalismo de la sociedad, el consumismo y la influencia de la publicidad, todo al ritmo de divertidas y frenÃƒÂ©ticas melodÃƒÂ­as donde los gÃƒÂ©neros pop, jazz y charleston se mezclaban fluidamente. Nuestros jÃƒÂ³venes ojos presenciaban casi sin darse cuenta, una obra maestra.","torrent":{"xt":"urn:btih:05537513407ad1f909ec80afc2f841c91a6c3738","amp;dn":"Vip+Mi+Hermano+Superhombre","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05537513407ad1f909ec80afc2f841c91a6c3738","infoHashBuffer":{"type":"Buffer","data":[5,83,117,19,64,122,209,249,9,236,128,175,194,248,65,201,26,108,55,56]},"announce":[],"urlList":[]}}