{"title":"Blue.Seduction.2009.DVDRip.XviD-VoMiT","uid":5592448,"size":735276222,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:05981c4da4bf7b19798b1e8b941e7f0acb7fa261&amp;dn=Blue.Seduction.2009.DVDRip.XviD-VoMiT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thelad53","files":-1,"time":1274914161,"description":"Description\n\nBlue Seduction (2009)\n\nVideo Codec: XviD-1.2.1\nVideo Bitrate: 900 kbps\nAudio Codec: MP3 VBR Stereo\nAudio Bitrate: 160 kbps\nAspect Ratio: 1.81:1\nResolution: 640 x 352\nFrame Rate: 23.976 fps\nGenre: Thriller\nRuntime: 90 mins\nRAR Count: 50x15\nAudio Language: English\nSubtitles: N/A\nDVD Date: 12.01.2009\nRelease Date: 11.09.2009\nTheater Date: 04.06.2009\nIMDB Rating: N/A &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1337040&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1337040&lt;/a&gt;\n\nA middle aged music composer finds himself trapped in the\nseductive web of a young, sexy vocalist who is looking\nfor her own fifteen seconds of fame. Mikey Taylor, once\nthe very popular lead singer of the hot rock and roll\ngroup, THE SAINTS , lived a life of sex, drugs and rock\nand roll, until he met JOYCE, a real estate broker, now\nhis wife of ten years. Joyce was instrumental in sobering\nMike up through various rehabs, and always supportive\nbut then the real estate market took a dive, and Mike had\nto go back to writing songs for a new record album deal\nwith his former partners STANLEY and DICKIE. Mikey, now\nknown as MIKE TAYLOR, is in the Studio waiting to lay\ndown the new tracks, when MATTY MCPHERSON, strikingly\nyoung and beautiful, introduces herself as the new demo\nsinger. As she begins to sing, there is an immediate\nattraction between Mike and Matty, who is not only\ngorgeous and young, but a brilliant artist. Matty follows\nMike back to his hotel and seduces him, which is\nreminiscent of his exciting &quot;groupie&quot; rock and roll days\nHe immediately becomes smitten with the very young and\nbeautiful Matty, but tells himself this affair will pass\nas soon as the album is finished. The problem is, Mike\ncan not finish the album without Matty, who truly\ninspires him, but who also leads him back down the road\nof destruction by encouraging him to relive his days of\nalcohol, drugs and sex abuse. Matty tells Mike she is his\nnew addiction and convinces him he cannot succeed without\nher. As weeks go by, Mike is filled with the expected\nguilt of a cheating husband, but the more he tries to get\naway from Matty, the more she tempts him back with a new\nsong she has written. To celebrate, she offers more\nbooze, drugs and erotic sex; taking Mike deeper into the\ndark side: closer to Matty but further from Joyce. Mike's\nfriends encourage him to go to the police, citing she is\na stalker who is out to destroy him, but when he tries\nthe police take Matty's side, who convinces the police\nshe is pregnant with Mike's child. To retaliate Matty\nkidnaps Joyce, and invites Mike to &quot;save Joyce, or\nsuccumb to me&quot;. Will Mike be able to save Joyce from the\nevil web of Matty, or succumb to his addiction as he has\nso many times before with the beautiful Matty?\n\nBilly Zane: Mikey Taylor\nEstella Warren: Matty\nBernard Robichaud: Stanley\nJane Wheeler: Joyce\nLalesha Railsback: Nurse\nBunthivy Nou: TV Hostess\nJosh Linton: Officer Eddie\nRobbie O'Neill: Dickie Kline\nMandy Maclean: Jennifer\nPaul F. McCarthy: Paramedic\n","torrent":{"xt":"urn:btih:05981c4da4bf7b19798b1e8b941e7f0acb7fa261","amp;dn":"Blue.Seduction.2009.DVDRip.XviD-VoMiT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05981c4da4bf7b19798b1e8b941e7f0acb7fa261","infoHashBuffer":{"type":"Buffer","data":[5,152,28,77,164,191,123,25,121,139,30,139,148,30,127,10,203,127,162,97]},"announce":[],"urlList":[]}}