{"title":"S09 E09 FC De Kampioenen  - Interim sponsor.avi","uid":5133645,"size":337778688,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:05a463bc8e8f9d1ab1c5b27c412492b56c7c0d18&amp;dn=S09+E09+FC+De+Kampioenen++-+Interim+sponsor.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xkissie","files":1,"time":1256325139,"description":"PLEASE SEED... ALSO THE OTHER SEASONS OF F.C. DE KAMPIOENEN! THANK YOU!\n\nVerhaallijnen\n\n\n    * Nadat DDT in de gevangenis vloog wegens fraude, probeert zijn moeder de garage te verkopen. Bieke en Boma zijn kandidaat-kopers.\n    * Bernard Theofiel Waterslaeghers (BTW) koopt de garage van DDT en wil er een toprestaurant van maken.\n    * Nu DDT in de gevangenis zit, is Doortje werkloos.\n    * Voor de inrichting van zijn restaurant doet BTW een beroep op Xavier en Marc.\n    * BTW opent zijn restaurant &quot;Bij Mij&quot;.\n    * Pol raakt geblesseerd. Hij vervangt Xavier als trainer. Xavier wordt opnieuw keeper en Marc wordt spits.\n    * Carmen is het er niet mee eens dat Xavier geen trainer meer is. Ze trekt tijdelijk bij BTW in om de Kampioenen de duvel aan te doen.\n    * Boma krijgt bezoek van zijn jongere zus Bertha. BTW ziet in haar de vrouw van zijn leven.\n    * Boma denkt dat de koning een levering worsten persoonlijk komt ophalen en bereidt feestelijkheden voor. BTW organiseert een royal lunch in zijn restaurant.\n    * Pascale maakt het uit met Boma.\n    * BTW lijkt geÃƒÂ¯nteresseerd te zijn in Pascale, maar ook in Bieke.\n    * Pascale heeft een nieuwe vriend: een echte baron. Ze wil niet dat hij ziet dat ze in een ordinair cafÃƒÂ© woont en inviteert hem bij Boma.\n    * Doortje volgt een assertiviteitscursus bij Truus Pinckers, de ex van BTW.\n    * Truus Pinckers en BTW maken plannen om te hertrouwen maar ze geraken het niet eens over de datum.\n    * Boma wordt afgezet als sponsor nadat hij inging op een poging tot omkoping.\n    * BTW wordt tijdelijk de nieuwe sponsor. Boma lijkt het zich erg hard aan te trekken dat hij geen deel meer uitmaakt van de Kampioenen. Zo erg dat de Kampioenen denken dat hij zelfmoordplannen heeft.\n    * Eddy Wally komt zingen in het restaurant van BTW. Wanneer hij echter niet komt opdagen moet Xavier hem vervangen.\n    * De Kampioenen gaan op survival. BTW wordt door de vrouwen meegestuurd als begeleider.\n    * Doortje zoekt werk. Ze gaat aan de slag als serveuse bij BTW.\n    * Bieke hoort een gesprek tussen Boma en Vandesijpe denkt dat de Boma Vleesindustrie NV failliet gaat na een vernietigend artikel van haar in Publitime. Ze biedt gratis haar diensten aan. Wat ze echter niet weet, is dat het om de Pussycat ging, en niet over de Vleesindustrie.\n","torrent":{"xt":"urn:btih:05a463bc8e8f9d1ab1c5b27c412492b56c7c0d18","amp;dn":"S09+E09+FC+De+Kampioenen++-+Interim+sponsor.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05a463bc8e8f9d1ab1c5b27c412492b56c7c0d18","infoHashBuffer":{"type":"Buffer","data":[5,164,99,188,142,143,157,26,177,197,178,124,65,36,146,181,108,124,13,24]},"announce":[],"urlList":[]}}