{"title":"Win7codecs 1.2.9 Final(Murlok)","uid":5059670,"size":20522474,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0632be175f10d5ab5e1c91c0e22735b3d2efc44e&amp;dn=Win7codecs+1.2.9+Final%28Murlok%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Murlok","files":-1,"time":1250605816,"description":"The Win7codecs package which I have created does not change or interfere with what Microsoft has going on concerning native codec support in Windows Media Player 12 and Media Center.\nDXVA accelerated H264 playback is provided by the codec package for all other capable players.\n\nThe latest release contains a new Settings Application which enables the user to choose a different splitters 'on the fly' for specific filetypes. The application will also allow you to choose from 10 different speaker configurations from 'same as input' and all the way up to full 7.1 channel output.\n\nCodecs have been a problem for most users at one time or another. This is because there has never been an 'out of the box' working solution that the average computer user could install and just have everything work properly from the beginning. There are several decent codec package solutions out there, but none of them did everything I wanted. I was always in need of a tweak, adjustment, or even a re-installation just to get the codecs I needed/wanted and most of the time, the file still didn't play properly. I've never claimed to be a media guru. My media experience prior to creating these packages was to double-click a file I downloaded and hope that it played.\n\nThe installer will automatically remove most other popular codec releases from your computer before installing this concise yet comprehensive package. For a list of all things automatically uninstalled by the Win7codecs installer, Click Here You won't need to make any adjustments or tweaks to enjoy your media content immediately. Windows Media Player and Media Center will instantly recognize all your files as playable.\n\nIt does not contain a media player and it does not associate file-types. With this package installed you will be able to use any media player, limited only by the players' capabilities, to play all movies and video clips. Streaming video is supported in several formats in all popular web browsers. Users of the Win7codecs have the ability to choose what is installed and where to install it using the public redistributable. After installation you can select to remove specific portions without removing the entire package. You can also re-add the removed items at any time.\n\nThis package supports 18 localizations. The default is English and the installer includes support for the following other languages; Chinese Simplified/Traditional, Japanese, Czech, Dutch, Finnish, French, German, Greek, Italian, Norwegian, Portuguese, Russian, Spanish, Polish, Swedish and Turkish. Languages can be added upon request.\n\nChangelog:\n- update ffdshow v3056\n- update gabests splitters\n- update settings application\n- add save and restore settings\n\n:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-::-:-::-:-::-:-::-:\n:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-::-:-:-:-:-::-:-::-:-::-:\n \n                   Greetings fly to:\n\n  Planet-Master, W13,Hoofa,Room101bellboy asterastripp,virusofsaten, ill88eagle,RobbingHood,Lama,Kentucky-Kid,Looksee,srijantje,Benny2guns,Toblakai,Ube1,Subtob, V-F,Reactor90  \n \n also to WCT-SWE even if we not agree always. To you who help me seeding my torrents and at last to \n\n&quot;The Scene give me Stuff to work with&quot;\n\nand to all I forgot!\n :-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-::-:-::-:-::-:-::-:\n:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-:-::-:-:-:-:-::-:-::-:-::-:\n\n\n\nAll is fine you got you u/l back lol Any problem just tell!!!!!\n","torrent":{"xt":"urn:btih:0632be175f10d5ab5e1c91c0e22735b3d2efc44e","amp;dn":"Win7codecs+1.2.9+Final%28Murlok%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0632be175f10d5ab5e1c91c0e22735b3d2efc44e","infoHashBuffer":{"type":"Buffer","data":[6,50,190,23,95,16,213,171,94,28,145,192,226,39,53,179,210,239,196,78]},"announce":[],"urlList":[]}}