{"title":"Insomnia [DVDRIP][Spanish].","uid":5048483,"size":733179904,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:07be23cc620241434efe7aa91e95400dcce1e0a6&amp;dn=Insomnia+%5BDVDRIP%5D%5BSpanish%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gamolama","files":1,"time":1249764243,"description":"Titulo original: Insomnia Ano: 2002 Pais: USA Duracion: 118 min Estreno en Espana: 11-10-2002 Estreno en USA: 24-05-2002 Director: Christopher Nolan Reparto: Al Pacino, Robin Williams, Hilary Swank, Maura Tierney, Martin Donovan, Nicky Katt, Paul Dooley, Jonathan Jackson Guion: Hillary Seitz Musica: David Julyan Productora: Warner Bros. Pictures Genero: Intriga - Thriller Will Dormer (Al Pacino) es un veterano detective de la policia de Los Angeles que viaja con su companero Hap (Martin Donovan) a un pequeno pueblo de Alaska para investigar el inquietante asesinato de una adolescente. Bajo la luz perpetua de la region, Dormer y Hap se van acercando al principal sospechoso, el novelista Walter Finch (Robin Williams), que vive apartado del pueblo. Durante una tensa operacion de vigilancia en una playa rocosa y envuelta en niebla, Finch se esfuma en la bruma, consiguiendo escabullirse de Dormer. De repente se oyen unos disparos y Hap cae muerto. Mientras lucha por afrontar los sentimientos de culpa y remordimientos por la muerte de su companero, Dormer se ve obligado a entrar en un juego psicologico dirigido por el brillante y malvado Finch. Tambien tiene que colaborar con la agente de la policia local (Hilary Swank), que no tiene gran experiencia pero si mucha intuicion. Suben las apuestas del juego y Dormer se enreda cada vez mas en la telarana tejida por Finch. Incapaz de descansar por el implacable sol de medianoche el juicio del detective se distorsiona y al final peligra su estabilidad mental.\nInsomnia","torrent":{"xt":"urn:btih:07be23cc620241434efe7aa91e95400dcce1e0a6","amp;dn":"Insomnia+%5BDVDRIP%5D%5BSpanish%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07be23cc620241434efe7aa91e95400dcce1e0a6","infoHashBuffer":{"type":"Buffer","data":[7,190,35,204,98,2,65,67,78,254,122,169,30,149,64,13,204,225,224,166]},"announce":[],"urlList":[]}}