{"title":"Jurassic Park Trilogie 3OP1DVD 2Lions-Team","uid":5591651,"size":4667901789,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:08dc3f814eb3166ea13d9a2ddd25565e352f566e&amp;dn=Jurassic+Park+Trilogie+3OP1DVD+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Rens0101","files":-1,"time":1274884988,"description":"[img]http://img267.imageshack.us/img267/1954/jurassicparkthecomplete.jpg[/img]\n\n!!Dit zijn 3 DVD's op 1!!\n\n[b]Jurassic Park (1993)[/b]\nVerenigde Staten\nAvontuur / Science-Fiction\n127 minuten\n\ngeregisseerd door Steven Spielberg\nmet Sam Neill, Jeff Goldblum en Laura Dern\n\nWetenschappers slagen er in om dinosauriÃƒÂ«rs te klonen uit een druppel dino-bloed afkomstig uit een mug. De ondernemende miljonair John Hammond wil de gekloonde dino's aan het publiek laten zien en bouwt daarvoor een gigantisch thema-park. Een paar gelukkigen, waaronder een advocaat, een wiskundige, twee dino-experts en Hammonds kleinkinderen zijn die eersten die het park mogen bezoeken. Bij de eerste de beste onweersbui valt echter de elektriciteit uit in het park en slagen een aantal gevaarlijke dinosaurussen erin om uit hun paddocks te ontsnappen.\n\n[url=http://moviemeter.nl/film/365]Moviemeter[/url]\n\nOn a remote island, a wealthy entrepreneur secretly creates a theme park featuring living dinosaurs drawn from prehistoric DNA. Before opening the attraction to the public, he invites a top paleontologist, a paleobotanist, a mathematician/theorist, and his two eager grandchildren to experience the park -- and help calm anxious investors. However, their park visit is anything but tranquil as the park's security system breaks down, the prehistoric creatures break out, and the excitement builds to surprising results\n\n\n[url=http://www.imdb.com/title/tt0107290/]IMDB[/url]\n\n\n[b]Lost World: Jurassic Park, The (1997) [/b]\nVerenigde Staten\nScience-Fiction / Avontuur\n129 minuten\n\ngeregisseerd door Steven Spielberg\nmet Jeff Goldblum, Julianne Moore en Vince Vaughn\n\nVier jaar na de gebeurtenissen in de eerste Jurassic Park film verklapt John Hammond aan Ian Malcolm dat er nog een ander eiland was vol dino's. Deze zijn verder met rust gelaten, en Hammond is erg benieuwd naar de dieren in een natuurlijke omgeving. Het team gaat naar het eiland, waar ze er echter achterkomen dat ze niet de enige mensen op het eiland zijn.\n\n[url=http://moviemeter.nl/film/364]Moviemeter[/b]\n\nFour years after the failure of Jurassic Park on Isla Nublar, John Hammond reveals to Ian Malcolm that there was another island (&quot;Site B&quot;) on which dinosaurs were bred before being transported to Isla Nublar. Left alone since the disaster, the dinosaurs have flourished, and Hammond is anxious that the world see them in their &quot;natural&quot; environment before they are exploited\n\n[url=http://www.imdb.com/title/tt0119567/]IMDB[/url]\n\n\n\n[b]Jurassic Park III (2001) [/b]\nVerenigde Staten\nScience-Fiction / Actie\n92 minuten\n\ngeregisseerd door Joe Johnston\nmet Sam Neill, William H. Macy en TÃƒÂ©a Leoni\n\nDr. Alan Grant wil graag zijn dinosaurus-onderzoek voortzetten. Hij wordt door de rijke avonturier Paul Kirby en zijn vrouw Amanda uitgenodigd om als gastheer op te treden bij een tour over Isla Sorna. Hun vliegtuig stort echter neer, met als gevolg dat Grant weer tegenover de dino's komt te staan.\n\n[url=http://moviemeter.nl/film/341]Moviemeter[/b]\n\nDr. Alan Grant is now a happy man with the previous incidents of Jurassic Park now behind him. Grant is that happy that he announce in public, that nothing on Earth can persuade him back onto the islands. Maybe nothing, except Paul Kirby. Kirby and his wife, Amanda want a plane to fly them over Isla Sorna, with Dr. Grant as their guide. But not everything Kirby says is true. When the plane lands, Dr. Grant realizes that there is another reason why they are there, that he doesn't know of. Now, Dr. Grant is stuck on an island he has never been on before, with what was a plane journey now turned into a search party\n\n[url=http://www.imdb.com/title/tt0163025/]IMDB[/b]\n\n\nKwaliteit/Quality........: RetailDVD\nFormaat/Format...........: DVD5\nAudio....................: Dolby 5.1 \nSpeelduur/playtime.......: 121Min/123Min/88Min\nMenu.....................: Custom made\nExtras...................: No\nCover....................: Yes\nTaal/Language............: English\nOndertiteling/subs.......: Dutch\n\n\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                    &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam \n\nworden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!","torrent":{"xt":"urn:btih:08dc3f814eb3166ea13d9a2ddd25565e352f566e","amp;dn":"Jurassic+Park+Trilogie+3OP1DVD+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08dc3f814eb3166ea13d9a2ddd25565e352f566e","infoHashBuffer":{"type":"Buffer","data":[8,220,63,129,78,179,22,110,161,61,154,45,221,37,86,94,53,47,86,110]},"announce":[],"urlList":[]}}