{"title":"S07 E12 FC de kampioenen - De helderziende.avi","uid":5045120,"size":314556416,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:097e5f19606623f0718740570667c9e27b3a2897&amp;dn=S07+E12+FC+de+kampioenen+-+De+helderziende.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"xkissie","files":1,"time":1249589972,"description":"Verhaallijnen\n\n    * De Kampioenen organiseren een Sinterklaasfeestje om meer supporters te lokken. DDT belt de collega van Pol, die voor Sinterklaas zou spelen af en neemt zelf deze rol voor zijn rekening om de Kampioenen te pesten. Uiteindelijk duikt de echte Sinterklaas op.\n    * De Boma Vleesindustrie heeft een nieuwe worst ontworpen: Boma Light.\n    * Xavier vindt op zolder een oud schilderij van zijn vader: Bos dahlia's met afhangende bloem. Niemand wil het hebben tot men ontdekt dat het wel eens veel geld waard zou kunnen zijn...\n    * De Kampioenen worden na een gewonnen wedstrijd positief bevonden bij een dopingcontrole. Ze proberen in allerijl te ontdekken wat de oorzaak is van deze positieve uitslag want Boma wil het veld verkopen.\n    * Marc wil stoppen met zijn doktersstudies, tegen de zin van Pascale. Ze probeert Marc op andere gedachten te brengen want ze wil niet dat haar zus Madeleine, die op bezoek komt, ontdekt dat haar toekomstige schoonzoon toch geen dokter wordt.\n    * Doortje wint een reis naar een exotische bestemming. Pol moet echter op skiklas en daardoor kunnen de twee de reis niet zelf maken. Ze besluiten ze te geven aan iemand van de Kampioenen die 3 dagen aan zijn verslaving kan weerstaan. Xavier mag geen dagschotels drinken, Carmen moet van de porto en de sigaartjes afblijven, Pascale mag geen pralines eten en Boma moet van de vrouwen afblijven. DDT probeert deze beloftes te dwarsbomen in de hoop om zelf de reis te krijgen.\n    * Pol erft van een Afrikaans stamhoofd die hij ooit gered heeft van een krokodil. Alle Kampioenen hopen op een deel van de erfenis. Uiteindelijk blijkt het over een aapje te gaan.\n    * De Kampioenen willen een rat verdelgen. DDT denkt verkeerdelijk dat ze hem willen vermoorden.\n    * De ouders van Marc komen op bezoek. Hij heeft hen nog niet verteld dat hij gestopt is met zijn doktersstudies en is bang dat ze zullen willen dat hij in hun begrafenisonderneming komt werken. De Kampioenen besluiten dat hij moet doen alsof hij onderdirecteur is bij de Boma Vleesindustrie. Aangezien Boma enkele dagen naar een congres is kan hij niet voor problemen zorgen. DDT wil het plannetje verklappen aan Marcs ouders. De Kampioenen vertellen hen dan maar dat DDT de dorpsgek is.\n    * Pol ontvangt geparfumeerde brieven uit Afrika. Carmen denkt dat hij Doortje bedriegt. Uiteindelijk blijken de brieven te komen van een Plan Internationalkindje.\n    * DDT tapt elektriciteit af van de Kampioenen.\n    * Xavier gaat bij de aankoopdienst van het leger werken. Boma en DDT hopen hier profijt uit te halen. Wanneer Xavier plots geld blijkt te hebben om zijn schulden in het cafÃƒÂ© te betalen, denkt Bieke dat hij smeergeld kreeg van Boma.\n    * Marc verkoopt van deur tot deur stofzuigers.\n    * Carmen verneemt van dokter Van Tichelen dat Balthazar niet lang meer te leven heeft. Iedereen wil het Boma zo aangenaam mogelijk maken op het einde van zijn leven. DDT is eerder uit op de erfenis. Wat Carmen echter niet weet is dat dokter Van Tichelen een dierenarts is en Balthazar de hond van Boma's moeder.\n    * Marc is tijdelijk hulppostbode.\n    * DDT speelt voor helderziende. Hij steelt brieven van Marc om de toekomst te kunnen voorspellen.\n    * Op aanraden van Carmen behandelt Boma Pascale slecht. Dit zou ervoor zorgen dat ze uiteindelijk toch voor hem valt. Het heeft echter een averechts effect: Pascale doet alsof ze een nieuwe vriend heeft: Pierre.\n","torrent":{"xt":"urn:btih:097e5f19606623f0718740570667c9e27b3a2897","amp;dn":"S07+E12+FC+de+kampioenen+-+De+helderziende.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"097e5f19606623f0718740570667c9e27b3a2897","infoHashBuffer":{"type":"Buffer","data":[9,126,95,25,96,102,35,240,113,135,64,87,6,103,201,226,123,58,40,151]},"announce":[],"urlList":[]}}