{"title":"Electro House (June 2010)","uid":5664167,"size":298624821,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0a2fed634242c1a187fcc1c8ddda268d57d8d130&amp;dn=Electro+House+%28June+2010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nauriss","files":53,"time":1278079236,"description":"Bon Jovi - You Give Love A Bad Name (Tony Pryde Remix)\n50 Cent - P.I.M.P (South &amp; Adoo Radio Edit)\nAtb - You Are Not Alone (Extended Version Evo Remix DJ LIGA)\nBig Ali - Number One (Swedish House Mafia Cover)\nBlue Affair &amp; Sasha Dith Feat Carlprit - Ya Odna (Greysound Remix)\nBrooklyn Bounce - Bass, Beats &amp; Melody Reloaded! (Disco Freak Remix)\nCabella Feat. Daisy - My Heart Goes Boom (Godlike Music Port Remix)\nClub Revolution - Go !!!  (Original Mix)\nCool Project - MYaSO MUSIC ver 8.0(Dj LeD RemiX)\nCoolio - Gangstas Paradise (Rico Bernasconi &amp; Max Farenthide Remix)\nDada Life - Cookies With A Smile (Remakerz Remix)\nDani B. Vs. Karim R. - Be Together (Dani B. &amp; Dark Angel Remix)\nDavid Guetta ft Tiesto - In On\nDelia Matache - The beach is on fire (Miami beach 2010)\nDisco Sound - Techtonic (Gread Beat radio edit)\nDisco Superstars - Slice Me Nice (OceansBasse rmx)\nDiscotronic meets Tevin - To The Moon And Back (M. Deejay &amp; Tunebot Remix)\nDiscotronic vs.Tevin - To The Moon and Back (Mark Pride Radio Edit 2010)\nDJ Antoine - Starting Tonight (Steve Murano Radio Edit)\nDJ Jeroenski,Bjorn B - Electro Blue (Deekly Club Mix)\nDJ Optick, Avi, DJ Andi, Serban Cazan, Chris Mayer  Connect-R - Free Your Mind 2010 (Imnul Liberty Parade)\nDJ Smash - Ptitca (Radio Edit)\nDJ's DaOzlshinoda - Apologize ( Sweet Dream Electro Cover )\nDK and TJC - Maybe You Can Get My Beat (The Mobb Remix Edit)\nDr Alban vs Sash! - Hello South Africa (Rico Bernasconi &amp; Max Farenthide Mix)\nFeeldi &amp; Daan'D - Mamy Blue 2010 ( System &amp; Berry Cake Rmx )\nFely feat. Puya - Vreau sa te sun\nFinger and Kadel - So Sehn Sieger Aus (Scha la la) (Bigroom Mix)\nGeo Da Silva vs Dj Magnum - Cine Bea Cu Noi bootleg Horny\nGreg Parys - Why Don't We Just Fuck (Extended Mix)\nInna - Moon Girl (Jay Amato Elektro Mix)\nInna vs David Guetta - Hot Memories (TopFloorDjs Summer Edit Mash)\nInusa Dawuda &amp; DJ Chick - We Want More (Greysound Remix)\niTone ft Craig Smart - Im Aleady There (ClubDJTeam Remix)\nJay Ko - High Note (Radio 21 Edit)\nK-Tronic &amp; Meyson - Infinity 2k10 (Original Version)\nK-Tronic &amp; Meyson - Infinity 2k10 (Summer Club Version)\nMark Pride - Prince of Persia (Original Mix)\nMax Furtado &amp; e'Attis - Message From My Heart (Original Mix)\nMenyo - Follow Your Heart (Klaas Remix)\nMoreno feat. Alan Basski - Celebration (Dj Cargo Radio Remix)\nRadio Killer - Voila ( DJ Nejtrino DJ Baur Killer Cut)\nReel 2 Real (Feat Sean Paul, Pitbull, Flo Rida &amp; T Pain) - I Like To Move It (Electro Urban Remix)\nRock City - Live As One (Feat. Akon)\nRyan S. - Breakaway (Original Mix)\nSean Kingston - Eenie Meenie (DJ Skarsvogue Electro Edit)\nSean Kingston - Fire Burning (Cherry Coke Remix)\nSir Colin Feat. Patrick Miller - Have Mercy (Fuzzy Remix)\nStuff  Floor - Up To The Beat (Gordon Doyle Ft. Players 69 Remix)\nStuff &amp; Floor - Up To The Beat (Mondo Remix)\nT-Buck - Angele Sarge\nWill Smith - Gettin' Jiggy Wit It (DJ Nejtrino &amp; DJ Baur Jiggy Edit)","torrent":{"xt":"urn:btih:0a2fed634242c1a187fcc1c8ddda268d57d8d130","amp;dn":"Electro+House+%28June+2010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a2fed634242c1a187fcc1c8ddda268d57d8d130","infoHashBuffer":{"type":"Buffer","data":[10,47,237,99,66,66,193,161,135,252,193,200,221,218,38,141,87,216,209,48]},"announce":[],"urlList":[]}}