{"title":"Wolfenstein v1.1 Update","uid":5064586,"size":33206347,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0b6854383d741dc2c8068902af51232c964d49e0&amp;dn=Wolfenstein+v1.1+Update&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Abdallah9","files":1,"time":1250863917,"description":"Wolfenstein v1.0 -&gt; v1.1 patch for SINGLE PLAYER\n\n\nInstructions:\n\nInstall Wolfenstein\nReplace .exe from Razor1911 folder\nApply update\nPlay!\n\n\n\nNOTES:\nPatch for single player only; not for dedicated server\nSavegames will work after update!\nDoes not update SP EXE\n\n\n\nv1.1 Fixes:\n\n- When on the purchase upgrade confirmation screen, ESC now cancels the purchase instead of returning to the menu.\n\n- Sounds added for navigating menus.\n\n- In order to prevent names from running off the screen, character limit has been reduced to 10 characters on names\n\n- Fixed issue causing the Healing icon to remain after dying.\n\n- Sprint functionality has been modified so user can sprint longer, but has longer duration before being able to sprint again\n\n- Global chat now disables properly if disabled through the Server Launcher.\n\n- Fixed bug causing the grenade ammo indicator to reflect having one more grenade in your inventory.\n\n- End-of-round countdown voice-over takes priority over objective status voice-overs.\n\n- When a round ends, the scoreboard will default to the chat window.\n\n- Truck model in Canals has been updated so it is easier to complete the objective\n\n- Clan Tag text box in the Options Menu has been realigned\n\n- Audio countdown has been readjusted\n\n- The kill ticker color has been adjusted to the proper team color\n\n- MP43 melee attack speed has been slightly decreased\n\n- Added Quick voice chat that can be binded via the console (the new binds are _needEngineer, _needMedic, _needSoldier, _needHealth, _needAmmo)\n\n- Both teams should now be able to mute users properly\n\n- Soldier arm when holding Kar 98 has been improved\n\n- Reduced how far packs are thrown\n\n- Reduced how far grenades are thrown\n\n- Removed a chair near the crucifix in Canals to prevent the crucifix from dropping into an area where it could not be reached\n\n- Control options now feature separate binds for Use (resurrect, objectives) and Item (Ammo, Health, Satchel)\n\n- Choosing a random map rotation will work properly now\n\n- Added ability to change cross hair appearance through the menu\n\n- Fixed issue causing the crouch icon to remain after dying","torrent":{"xt":"urn:btih:0b6854383d741dc2c8068902af51232c964d49e0","amp;dn":"Wolfenstein+v1.1+Update","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b6854383d741dc2c8068902af51232c964d49e0","infoHashBuffer":{"type":"Buffer","data":[11,104,84,56,61,116,29,194,200,6,137,2,175,81,35,44,150,77,73,224]},"announce":[],"urlList":[]}}