{"title":"Great White - Stick It","uid":5137580,"size":152242180,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0b9ae3a122d35880ba0fd0fe11cc9943c1e8b9b8&amp;dn=Great+White+-+Stick+It&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1256623984,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nGreat White (Released under the name &quot;Stick It&quot; in some territories) is the first full-length album by the American rock band Great White. Several of the tracks are taken from the band's previous EP, albeit in re-recorded versions. Stylistically, this is a very different Great White, as they display a more hard-driving metal sound as opposed to their later, blues-infused rock sound.\n\nGreat White is an American hard rock band, formed in Los Angeles in 1978. The band gained popularity during the 1980s and early 1990s. The band released several albums in the late 1980s and gained airplay on MTV with music videos for songs like &quot;Once Bitten, Twice Shy&quot;. The band reached their peak popularity with the album ...Twice Shy in 1989.\n\nThe band continued to release new material into the 1990s, although none of their material charted in the United States. In 2003, the band made headlines when The Station nightclub fire led to the deaths of 100 people in West Warwick, Rhode Island, including the band's guitarist Ty Longley, who had been a member of the band for three years. Great White made a comeback in 2007 with the release of a new album and an accompanying tour.\n\nGreatest Hits is a compilation album released by the American hard/glam rock band Great White in *2001. The album is perhaps the most widely available greatest hits package from the band, who have had several packages released, many without their express consent or wishes. This particular collection features a live version of the track Desert Moon, which the band were performing when the fire with killed 100 of their fans and their guitarist Ty Longley, started. It also includes a cut from the bands MTV Unplugged session. Like many artists of the late 80s, including Ratt and Poison, the band recorded an unplugged session for MTV which was not subsequently released.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:0b9ae3a122d35880ba0fd0fe11cc9943c1e8b9b8","amp;dn":"Great+White+-+Stick+It","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b9ae3a122d35880ba0fd0fe11cc9943c1e8b9b8","infoHashBuffer":{"type":"Buffer","data":[11,154,227,161,34,211,88,128,186,15,208,254,17,204,153,67,193,232,185,184]},"announce":[],"urlList":[]}}