{"title":"Dr House 1er Temporada _ Audio_latino(by mc guti Mexico)","uid":5031500,"size":2089155628,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0c188f2774d656b6e6e676225bbd9159cf7ce2f8&amp;dn=Dr+House+1er+Temporada+_+Audio_latino%28by+mc+guti+Mexico%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mcguti","files":22,"time":1248938428,"description":"Argumento\n\nLa serie gira alrededor del Dr. Gregory House (Hugh Laurie), un mÃƒÂ©dico egÃƒÂ³latra, de fuerte y marcada personalidad que es capaz de experimentar en su propio cuerpo y poner en juego su vida con tal de resolver el caso del paciente. Es experto en enfermedades infecciosas ademÃƒÂ¡s de una especialidad en nefrologÃƒÂ­a, y dirige el departamento de diagnÃƒÂ³stico que conforman, aparte de ÃƒÂ©l mismo, los doctores Eric Foreman, Robert Chase y Allison Cameron. Adicionalmente se agrega uno de sus pocos amigos, el jefe de OncologÃƒÂ­a del hospital James Wilson. House es adicto a la vicodina a causa de un dolor crÃƒÂ³nico en la pierna derecha derivado de una necrosis muscular (causada por un aneurisma mal diagnosticado) y tiene un carÃƒÂ¡cter misÃƒÂ¡ntropo, pero posee un gran sentido del sarcasmo y la ironÃƒÂ­a.\n\nAl departamento de diagnÃƒÂ³stico se le asignan casos complejos a los que House se suele enfrentar de forma impersonal procurando no tratar con los pacientes en persona, siempre que pueda evitarlo, ya que presupone que ÃƒÂ©stos siempre mienten (en varias oportunidades usa la frase &quot;Todo el mundo miente&quot;). Demuestra falta de respeto por las normas (siempre que crea que con ello contribuirÃƒÂ¡ a la salvaciÃƒÂ³n del enfermo) y escaso interÃƒÂ©s en llevar a cabo otros cometidos diferentes a la resoluciÃƒÂ³n de casos complejos.\n\n\nPersonajes Principales\n\n* Dr. Gregory House (Hugh Laurie): InfectÃƒÂ³logo y NefrÃƒÂ³logo. Afamado no sÃƒÂ³lo por su gran inteligencia sino tambiÃƒÂ©n por su misantropÃƒÂ­a, y mÃƒÂ¡s concretamente por su aversiÃƒÂ³n a tratar a los pacientes. Dirige el departamento de diagnÃƒÂ³stico mÃƒÂ©dico, y es el encargado de resolver los casos mÃƒÂ¡s complicados con la ayuda de su equipo y, ocasionalmente, de su amigo el doctor James Wilson. El personaje estÃƒÂ¡ inspirado en el famoso y brillante detective ficticio Sherlock Holmes, y tambiÃƒÂ©n se le ha comparado con otros personajes caracterizados por su ingenio como Cyrano de Bergerac o el profesor Henry Higgins (protagonista de la obra de teatro PigmaliÃƒÂ³n y su popular adaptaciÃƒÂ³n al cine, My Fair Lady). Es cojo debido a un infarto muscular en su pierna derecha. Odia pasar consulta y se escabulle siempre que puede, aunque si se le plantea un caso interesante, ÃƒÂ©l es el primero en tomarlo. Es adicto a la vicodina, que le ayuda a calmar el dolor crÃƒÂ³nico que sufre su pierna derecha.\n\n* Dr. Eric Foreman (Omar Epps): NeurÃƒÂ³logo, se siente habitualmente maltratado por su jefe, aunque tambiÃƒÂ©n lo reconoce como un gran mÃƒÂ©dico. Es muy inteligente y la mayorÃƒÂ­a de las veces suele ser enviado a las investigaciones menos convencionales, tales como los constantes allanamientos de morada que realizan, debido a sus antecedentes como delincuente juvenil, por los cuales dijo en una ocasiÃƒÂ³n House que lo habÃƒÂ­a contratado. DejÃƒÂ³ el equipo de House porque pensaba que si continuaba trabajando con ÃƒÂ©l acabarÃƒÂ­a siendo como ÃƒÂ©l, pero luego regresa para vigilar todos los movimientos que hace House con su nuevo equipo.\n\n* Dr. Robert Chase (Jesse Spencer): intensivista, es un australiano que muestra una gran ambiciÃƒÂ³n y oportunismo, cosa que en ocasiones le lleva a enfrentarse con todos sus compaÃƒÂ±eros. Procedente de una familia rica. House lo hostiga constantemente a causa de ello. Su padre, un reumatÃƒÂ³logo de fama mundial, tambiÃƒÂ©n ha aparecido en la serie. Estuvo en el seminario pero para complacer a su padre se convirtiÃƒÂ³ en mÃƒÂ©dico. Actualmente trabaja en cirugÃƒÂ­a ya que fue despedido por House, que creyÃƒÂ³ que ya habÃƒÂ­a aprendido todo lo que podÃƒÂ­a. Es novio de la Dra. Cameron en la 4ta temporada.\n\n* Dra. Allison Cameron (Jennifer Morrison): inmunÃƒÂ³loga a quien House afirma que la contratÃƒÂ³, por ser una buena doctora pero sobre todo por su fÃƒÂ­sico. En el pasado se casÃƒÂ³, movida por un amor confundido con compasiÃƒÂ³n, con un hombre que tenÃƒÂ­a una enfermad terminal. Hay cierta tensiÃƒÂ³n amorosa entre ella y el Dr. House, ya que en determinados momentos ella se ha mostrado atraÃƒÂ­da por ÃƒÂ©l, y algunas veces (aunque House no lo quiera aceptar), ÃƒÂ©l tambiÃƒÂ©n por ella. Actualmente es la jefa de urgencias del hospital debido a que renunciÃƒÂ³ a su puesto en el ÃƒÂºltimo capÃƒÂ­tulo de la tercera temporada a su equipo de House al igual que todos sus compaÃƒÂ±eros. Es novia del Dr. Chase en la cuarta temporada.\n\n* Dr. James Wilson (Robert Sean Leonard): jefe de oncologÃƒÂ­a del hospital. Es el mejor y ÃƒÂºnico amigo de House, por lo que solo ÃƒÂ©l se atreve a hablarle con sinceridad y discutirle de tÃƒÂº a tÃƒÂº, aportando un contrapunto a los a veces extravagantes razonamientos de House y siempre soporta sus bromas y maltratos. Por lo general no participa en el diagnÃƒÂ³stico de los casos. Es un mÃƒÂ©dico ejemplar y siempre apegado al protocolo (todo lo contrario a House). ViviÃƒÂ³ en casa de House durante algunos capÃƒÂ­tulos, debido a una infidelidad de su mujer.\n\n* Dra. Lisa Cuddy (Lisa Edelstein): endocrinÃƒÂ³loga y directora del hospital, y por tanto jefa de House, con quien se enfrenta constantemente por su poco ortodoxa manera de hacer su trabajo. Pese a ello, y a todos los problemas que le ha causado, se niega a plantearse su despido, al considerarle el mejor mÃƒÂ©dico del hospital y uno de los mejores mÃƒÂ©dicos diagnostas del mundo. A lo largo de la serie ha demostrado sus intenciones de ser madre por lo que ha intentado mÃƒÂ©todos de inseminaciÃƒÂ³n artificial. ConociÃƒÂ³ a House en la ÃƒÂ©poca de la universidad y lo contratÃƒÂ³ porque ningÃƒÂºn otro hospital lo habÃƒÂ­a admitido. En la tercera temporada la tensiÃƒÂ³n sexual entre ella y House se hace mÃƒÂ¡s evidente: incluso, en el episodio 16 (de dicha temporada) &quot;Top Secret&quot;, se hace entrever que han tenido relaciones sexuales, por lo menos una vez.\n\n* Dr. Lawrence Kutner (Kal Penn): Medico del deporte y RehabilitaciÃƒÂ³n. Es uno de los mÃƒÂ©dicos contratados por House en la cuarta temporada. Es de origen indio, y a los 6 aÃƒÂ±os vio como sus padres eran asesinados en un atraco a la tienda que regentaban.\n\n* Dra. Remy Hadley (Olivia Wilde): Internista contratada por House en la cuarta temporada. House siente mucha curiosidad por ella por lo que al final la contrata. AdemÃƒÂ¡s tiene la Enfermedad de Huntington la cual tenÃƒÂ­a un 50% de probabilidad de padecer al ser un trastorno genÃƒÂ©tico que tenÃƒÂ­a su madre. La Dra. Hadley no conoce esto hasta que se hace la prueba en el capÃƒÂ­tulo 16 de la cuarta temporada, &quot;El corazÃƒÂ³n de Wilson&quot;. AdemÃƒÂ¡s, House y Foreman creen que es bisexual, aunque ella no lo ha confirmado. Es llamada &quot;Trece&quot; (apodada por House) ya que era el nÃƒÂºmero que usaba en la &quot;competencia&quot; para ser uno de los mÃƒÂ©dicos contratados por House.\n\n* Dr. Chris Taub (Peter Jacobson): Cirujano plÃƒÂ¡stico. Es el tercer candidato contratado por House en la cuarta temporada. AbandonÃƒÂ³ la cirugÃƒÂ­a plÃƒÂ¡stica al mantener relaciones con una enfermera por lo cual sus compaÃƒÂ±eros le dijeron que se largara o se lo contarÃƒÂ­an a su esposa.","torrent":{"xt":"urn:btih:0c188f2774d656b6e6e676225bbd9159cf7ce2f8","amp;dn":"Dr+House+1er+Temporada+_+Audio_latino%28by+mc+guti+Mexico%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c188f2774d656b6e6e676225bbd9159cf7ce2f8","infoHashBuffer":{"type":"Buffer","data":[12,24,143,39,116,214,86,182,230,230,118,34,91,189,145,89,207,124,226,248]},"announce":[],"urlList":[]}}