{"title":"Reconnecting to Spirit - by Jonathan (adampants2008)","uid":5498122,"size":504520688,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0ca3471a0672985079218b3cc74283b66e03bbb1&amp;dn=Reconnecting+to+Spirit+-+by+Jonathan+%28adampants2008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ghis1964","files":-1,"time":1271383867,"description":"About the AudioBooks\n--------------------\n\nJonathan shares his lessons from the creative spirit, and very clearly explains much about our reality, and how it works. Through the love of creative spirit,we will be reconnected to ourselves as life, even through all this manipulation.\n\n\nSuggested Order\n---------------\n\n1 - The Healing Begins Now\n\n2 - Phase Three\n\n3 - Another Lesson From Spirit\n\n4 - Important Teaching For Spiritual Healers\n\n5 - Propaganda, Parables, and Perception\n\n6 - Church Defined\n\n7 - Knowledge\n\n\nMessage from Jonathan\n---------------------\n\nWhat is the difference between the &quot;mind/ego&quot; and &quot;spirit&quot;? If, perhaps, your spirit shines through your being at a time, someone may say, &quot;your eyes are youthful and sparkling&quot;. The &quot;ego&quot; will then look in a mirror and SEE...OBSERVE...the sparkle in the eyes. The insane ego LIKES how it feels in that moment. In an attempt to feel more of it, it attempts &quot;replication&quot;. The person/ego will then TRY...ATTEMPT...to MAKE their eyes sparkle with &quot;behavior&quot;. Perhaps they will try to &quot;widen&quot; their eyelids...try to induce the sparkle. It is at this point that the &quot;ego&quot; blocks the access of your spirit to you and the sparkle goes away. \nInfluences: The essence of life itself. \n\nChurch: The spontaneous formulation of a mutual identity involving life forms that are organized around itself. I/We. The birth and death of an identity..an expression. The what is the why. When it is formulated from love, explosive expression involving ALL of the components equally is observed and leaves any other organization of consciousness in observation of this in AWE. Church is the organization of life around love/spirit and not a place that you &quot;go to&quot;. This is when TRUE creation occurs. A &quot;church&quot; can form within your own body as well. When this occurs, one is neither displaying positivity nor negativity. They will display CERTAINTY. They will be piercing, commanding, and the voice of life in that time. The reason &quot;song&quot; came about is that when a group of people experience this they can not help but to express. Since they ALL need to express in an explosive creation of love...the obvious result would be a chorus within which all are equal, yet unique contributions...the bursting into SONG. When this happens within a person individually, you can see where &quot;art&quot;, &quot;architecture&quot;, or anything else creative comes from. The love of spirit.\n\nIt is VERY simple. Do the cells in your body attack each other when they are healthy? Do they hurt each other in any way? We are just a few scales up from cells. We are all cells to something larger. I believe life is a dream. Is that so bad? Would you want the cells in your body to be aware that they are just sitting there being cells? No. Wouldn't you want your cells to be able to dream? I think they might. I think we are larger cells dreaming. \n\nBasically the truth is this. &quot;Radiating&quot; energy is NO different than &quot;doing&quot; anything else. If you send &quot;energy&quot; that is no different than giving a &quot;hug&quot;. But, that is NOT &quot;love&quot;. It can be the &quot;result&quot; of love. There is only ONE way to love....love.\n\nIt requires no more effort than that. So VERY simple that it has eluded almost EVERYONE. All of your cells in your body are unique systems, right? WHAT is animating them? YOU. YOU are EVERY cell in your body. If you know the scalar nature of this reality, there is only one truth. YOU are ME. If that is true, HOW can you &quot;send&quot; me love? Just LOVE ME.\n\nPicture two people in your mind, standing there looking at each other. Now, picture these two being in love with each other. Picture them loving and expressing love to each other. WHO &quot;really&quot; did that? You have two characters in your mind &quot;interacting&quot; with love. But that love was an INTENT. It was YOUR intention. In your mind, you had two people &quot;expressing&quot; your intention.\n\nThe beauty of life is that YOU are a CREATION and also the CREATOR. As a creation, you get to express the intent of the creator (the larger part of you) and also be able to &quot;create&quot;, so you can observe the manifestation of YOUR intent.\n\nI love you. \n\n\n:)\n\n\n\n\n__________\n\n\nFile Info:\n__________\n\n\n\nMP3 AudioBook: 7 of 7\nsize: 480 MB\nbitrate: VBR\nSample Rate: 48.000 kHz\nChannel count: 2\nDuration:\n\t1 - 04:08:32\n\t2 - 03:43:03\n\t3 - 00:25:07\n\t4 - 00:14:26\n\t5 - 01:32:19\n\t6 - 00:34:11\n\t7 - 02:06:22\n\n\nlisten and pass on","torrent":{"xt":"urn:btih:0ca3471a0672985079218b3cc74283b66e03bbb1","amp;dn":"Reconnecting+to+Spirit+-+by+Jonathan+%28adampants2008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ca3471a0672985079218b3cc74283b66e03bbb1","infoHashBuffer":{"type":"Buffer","data":[12,163,71,26,6,114,152,80,121,33,139,60,199,66,131,182,110,3,187,177]},"announce":[],"urlList":[]}}