{"title":"Matt Alber - Hide Nothing (2008)","uid":5510017,"size":60699159,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0cc7515b9c058d865e436fa3390323ed5c337fef&amp;dn=Matt+Alber+-+Hide+Nothing+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rubusdemonoid","files":-1,"time":1272014933,"description":"Please help to seed this torrent when you are completed as my ISP has a monthly limit that I always max out on since I have over 50 torrents that I seed for you all. My ISP is going to terminate my service if I max out my monthly limit, so I just can't continue to seed all by myself so often. PLEASE help to seed. Thank you.  :)\n\n\n\n\nThis album isn't quite my usual taste in music, but there's just something so hauntingly beautiful about his voice, and some of the songs are just so beautiful they give me goosebumps. He sounds a bit like Rufus Wainwright, so if you're a Rufus fan, give Matt a try - you won't be disappointed. My personal favorites are &quot;End Of The World&quot; and &quot;Walk With Me&quot;. They give me goosebumps SO intensely, it almost hurts (in a good way)!\n\nYou may or may not be familiar with Matt and his video for &quot;End Of The World&quot; from the 'tube, but check it out and I double-dog-DARE you to NOT get goosebumps. Beautiful video for a beautiful song!\n\n\n\n\nI'm copying someone's review of the album from Amazon, not because I'm lazy, but because his review hits it spot-on. Enjoy!  :-)\n\n \n\nClassical superstar goes pop, becomes asensation and...I'm getting ahead of myself. OK, bad stuff first: Imogen Heap's &quot;Hide and Seek,&quot; though brave, flirts with disaster, especially when Alber starts swooping up and down the scales. In contrast, &quot;The End of the World&quot; is a flat-out masterpiece in the Rufus Wainwright mode--haunting, lyrical, romantic, tragic, impassioned, heart-rending. The rest of the CD falls between the two extremes (the final track sounds like a music box winding down), with &quot;Field Trip Buddy&quot; and &quot;The Slow Club&quot; being standouts of dreamy, adult-oriented pop. Is this a perfect CD? No. Is Matt Alber an artist of potentially staggering gifts, and is this disc a potential foreshadowing of brilliant musicianship and craft that just might set the world on its ear if he fulfills his obvious pop potential? Ab-so-lute-ly.\n\n\n\n\nMore of my music &amp; movie downloads that you may find of interest are located here: &lt;a href=&quot; http://thepiratebay.se/user/rubusdemonoid/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/rubusdemonoid/&lt;/a&gt;","torrent":{"xt":"urn:btih:0cc7515b9c058d865e436fa3390323ed5c337fef","amp;dn":"Matt+Alber+-+Hide+Nothing+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cc7515b9c058d865e436fa3390323ed5c337fef","infoHashBuffer":{"type":"Buffer","data":[12,199,81,91,156,5,141,134,94,67,111,163,57,3,35,237,92,51,127,239]},"announce":[],"urlList":[]}}