{"title":"Gli uccelli - The birds","uid":5110526,"size":4547348480,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0cd80d8227088824dd8b8c7305f606db10fcfc17&amp;dn=Gli+uccelli+-+The+birds&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":23,"time":1254700462,"description":"Visit this info link: http://forum.tntvillage.scambioetico.org/tntforum/index.php?showforum=56 http://img59.Imageshack.us/img59/5120/logodi8.jpg\n\nVisit this info link: http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=94252 http://img165.Imageshack.us/img165/554/alfredhitchcockaw8.jpg\n\nGli uccelli - The birds\n &lt;a href=&quot;\nhttp://img218.Imageshack.us/img218/9590/51b12grh6glss500513fee3ve7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img218.Imageshack.us/img218/9590/51b12grh6glss500513fee3ve7.jpg&lt;/a&gt;\n\nVisit the IMDB link: http://www.Imdb.com/title/tt0056869\n\n Visit this link: http://img465.Imageshack.us/img465/4804/commentiyq5.jpg\n\nTratto da un racconto di Daphne Du Maurier, Gli Uccelli ÃƒÂ¨ uno di quei film che hYears fatto la storia del cinema horror e del cinema in generale. Un motivo fra tutti ÃƒÂ¨ dato dal grandissimo spessore tecnico e tematico che posside la pellicola, uno spessore tale da prestare il film ad innumerevoli interpretazioni, nessuna delle quali ÃƒÂ¨ stata suggerita direttamente dal regista, che vogliono Gli Uccelli un'opera psicologica, morale, metafisica. E' piÃƒÂ¹ probabile che tale capolavoro sia tutte queste cose insieme, tanto piÃƒÂ¹ che Hitchcock, furbescamente, non si spreca in spiegazioni per quello che avviene nel film ed per l'angoscia che traspira da esso. Gli uccelli sono variabilmente l'incarnazione dei timori edipici di mamma Tandy per l'abbandono del &quot;nido&quot; famigliare da parte del figlio/uomo cresciuto, sono una punizione per la gioiosa ma inetta vita di Melanie, sono il volto oscuro della natura che si ribella all'uomo, il volto piÃƒÂ¹ tetro di un Dio punitore. Nessuna specifica spiegazione, solo la paura dell'uomo assediato dall'orrore ed un finale aperto, ed in questo puÃƒÂ² essere paragonato ai migliori zombi-movies. PiÃƒÂ¹ di un semplice racconto dell'orrore, questo film mette in scena una perfetta allegoria dell'imprigionamento emotivo e del bisogno di aiuto delle persone. Hitchcock, che divide virtualmente il film in due parti, quella in cittÃƒÂ  e quella a Bodega Bay, non manca di inserire soprattutto nella prima degli elementi smaccatamente comici come i due pappagallini che &quot;seguono&quot; la strada mentre la Hedren va di gran carriera dal suo nuovo amore. Storico l'esaurimento nervoso che patÃƒÂ¬ la Hedren durante le riprese, e mi spiace dirlo ma questo accidente ha dato un maggior rilievo al suo personaggio sulla pellicola, ne ha migliorato la performance, cosÃƒÂ¬ che il suo stato di shock non ÃƒÂ¨ solo recitato ma veramente sentito. Ottima la scelta del vestito verde della protagonista, un colore che fa da perfetto contrappunto alle scene di sangue che sono poche ma ben dosate e di certo effetto. La piÃƒÂ¹ notevole ÃƒÂ¨ sicuramente quella del ritrovamento dell'uomo senza occhi in camera da letto. Altra cosa strana, il film non ha una vera e propria colonna sonora a parte il ciclico e pungente rumore degli uccelli e la filastrocca cantata ad oltranza dai bambini chiusi nella scuola (fra l'altro una scena davvero splendida). Dopo Psycho (1960), con i suoi riferimenti agli uccelli (la dermotassia), Gli Uccelli, il terzo film del regista basato su un lavoro di Daphne Du Maurier, ÃƒÂ¨ stato visto da alcuni anche come una vaga allegoria sessuale misogina, con Taylor che ÃƒÂ¨ l'unico uomo che accentra su di sÃƒÂ© le attenzioni di diverse donne. Insomma, il tema centrale rimane ancora incerto e questo ne fa un'opera ambigua donando al prodotto ancor piÃƒÂ¹ fascino. Innegabile la qualitÃƒÂ  tecnica degli effetti che ÃƒÂ¨ valsa una nomination agli Oscar. Questi vYears dall'uso di uccelli veri ammaestrati (non sempre bene viste le continue cure ospedaliere alle quali sono ricorsi i membri della troupe), alla costruzione di modelli, all'uso delle sovrapposizioni fotografiche, fino ad arrivare ai suoni. Va da sÃƒÂ© che la visione di questo film ÃƒÂ¨ un imperativo categorico.\n\n Visit this link: http://img147.Imageshack.us/img147/8655/vlcsnap875827ej2.jpg\n Visit this link: http://img165.Imageshack.us/img165/7181/vlcsnap876165zh8.jpg\n Visit this link: http://img148.Imageshack.us/img148/7448/vlcsnap877028ug2.jpg\n Visit this link: http://img502.Imageshack.us/img502/6272/vlcsnap878202va9.jpg\n Visit this link: http://img507.Imageshack.us/img507/4200/vlcsnap871933ku3.jpg\n\n Visit this link: http://img520.Imageshack.us/img520/5716/datitecniciac7.jpg\n\nLength: 1.54.36\nLanguages:Ita Eng Esp Fra \nSubtitles: Ita Eng Esp Fra Por \nVideo Format:PAL \nCompression:n/a \n\n Visit this link: http://img171.Imageshack.us/img171/6502/p2pny2.jpg\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:0cd80d8227088824dd8b8c7305f606db10fcfc17","amp;dn":"Gli+uccelli+-+The+birds","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cd80d8227088824dd8b8c7305f606db10fcfc17","infoHashBuffer":{"type":"Buffer","data":[12,216,13,130,39,8,136,36,221,139,140,115,5,246,6,219,16,252,252,23]},"announce":[],"urlList":[]}}