{"title":"The silencers -NTSC-Audio.Eng+Subs.Eng+Fre-FLIpresentation","uid":5054648,"size":4386336768,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0dcd72dd5b947c9b0a5093349b0c10e87ad98e71&amp;dn=The+silencers+-NTSC-Audio.Eng%2BSubs.Eng%2BFre-FLIpresentation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kaminer","files":43,"time":1250347393,"description":"The silencers - 1966   &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0060980/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0060980/&lt;/a&gt;\n\nOriginal DVD full rip\nAudio - Eng\nSubs - Eng+Fre\nNTSC\nGenre: Comedy / Action\n\nIn this, the first Matt Helm movie, we see Matt Helm coaxed out of semi-retirement by an attractive ex-partner. It seems that the evil Big O organization has a nefarious plan called &quot;Operation: Fallout.&quot; If this plan comes to fruition, Big O will explode an atomic bomb over Alamagordo, NM, and start WWIII. Only Matt Helm can stop them. (imdb.com)\n\nThe first in the Matt helm series (with the great super-cool Dean Martin); some say the best of all the James Bond spoofs. Violence and humor are equally mixed, as they are in the Bond pictures. &quot;The Silencers&quot; probably has the most alluring collection of femmes fatales as Hollywood has ever assembled. Klutzy (or is she really?) Stella Stevens, brunette Dahlia Lavi, blond Nancy Kovack, and dancer Cyd Charisse all have important roles. It is not giving away too much to say that of these four women, two are good, two are bad, and three of them suffer the fate of getting shot to death at surprising moments.\n\nA bit of trivia: Beverly Adams, Helm's curvaceous secretary, married Yvres St. Laurent. And deadly Nancy Kovack married conductor Zubin Mehta, the lucky devil. Kovack, clad in only her high heeled shoes and one of Martin's white shirts, tries to seduce him into coming back to work for ICE, his old outfit. It is perhaps the most erotic three minute scene in any spy movie. (reader at imdb.com)\n\nAmazing comedy full of hilarious 60's humor in a series of movies that proved the popularity of Martin already in his sixties but still a major sex symbol. A rare gem. More movies in the series to come soon.\n\n=================================================================================\n\nOn peut violer les lois sans qu'elles crient. (Talleyrand)","torrent":{"xt":"urn:btih:0dcd72dd5b947c9b0a5093349b0c10e87ad98e71","amp;dn":"The+silencers+-NTSC-Audio.Eng%2BSubs.Eng%2BFre-FLIpresentation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dcd72dd5b947c9b0a5093349b0c10e87ad98e71","infoHashBuffer":{"type":"Buffer","data":[13,205,114,221,91,148,124,155,10,80,147,52,155,12,16,232,122,217,142,113]},"announce":[],"urlList":[]}}