{"title":"Coast to Coast AM - Oct 23 2009 - Lunar Hoax","uid":5134935,"size":56481610,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0dfe7c8702c937fbbe76ea96206c8760767a350f&amp;dn=Coast+to+Coast+AM+-+Oct+23+2009+-+Lunar+Hoax&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"0vercast","files":-1,"time":1256406639,"description":"Lunar Hoax\n\nDate: 10-23-09\nHost: Art Bell\nGuests: Stephen Rorke\n\nArt Bell continued his conversation with scientific and paranormal investigator Dr. Stephen Rorke, who appeared for the full four hours of the program. They discussed the work of the late Ralph Rene, who wrote extensively about the lunar-landing hoax theory. Rorke, who was bequeathed all of Rene's research, did not fully endorse the theory that the moon landings were hoaxed. On the contrary, he said, &quot;I think there is evidence we went to the moon. My difficulty is with the Apollo record.&quot; To that end, Rorke said &quot;absolutely there are aspects which were hoaxed, in my mind.&quot;\n\nRorke highlighted one particularly compelling inconsistency which emerged by way of reports from Apollo astronauts when they returned from the moon. He played a sound clip from a Neil Armstrong press conference where the astronaut said that he could not remember seeing any stars while on the lunar surface. Rorke then contrasted that by reading an excerpt from Michael Collins' book where he did describe seeing stars during his visit to the moon. &quot;The astronauts, themselves, cannot make their minds up whether they saw stars or not,&quot; Rorke observed. He also discussed the debate over the viability of traveling through the Van Allen radiation belts, the recent Dutch fake moon rock revelation, and theories that Stanley Kubrick helped fake the moon landing.\n\nThroughout the evening, Rorke repeatedly stressed that he was presenting the evidence accumulated by the late Ralph Rene, whom he credited with advancing early, rudimentary, moon hoax research. Rorke noted that he had been a fierce critic of Rene's research when he was alive and it is that stance which most likely resulted in the late researcher leaving his work to him. &quot;He would rather have someone bequeathed the responsibility of presenting his research in a way that really does cite the compelling evidence and ask people to think without just being dogmatic about it,&quot; Rorke mused, &quot;I think that says a lot about the man.&quot;\n\nWebsite(s):\nspiricomstudy.com\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224","torrent":{"xt":"urn:btih:0dfe7c8702c937fbbe76ea96206c8760767a350f","amp;dn":"Coast+to+Coast+AM+-+Oct+23+2009+-+Lunar+Hoax","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dfe7c8702c937fbbe76ea96206c8760767a350f","infoHashBuffer":{"type":"Buffer","data":[13,254,124,135,2,201,55,251,190,118,234,150,32,108,135,96,118,122,53,15]},"announce":[],"urlList":[]}}