{"title":"Gunship!","uid":5659511,"size":638379572,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0e93ea70c14c85821dd7f8cd48831e1537b29ac6&amp;dn=Gunship%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rastamanvibe","files":-1,"time":1277920207,"description":"Russian Nationalism is back with a vengeance. Eastern Europe? Nothing less than the flashpoint for World War III. Russian forces have amassed on one side, NATO on the other. You? You're about to deploy the most devastating weapon in the inventory of war: the helicopter GUNSHIP! Finesse, raw power, stealth and speed blended in a high-wire balancing act of exact proportions. In the 21st century, the fate of war can turn on one micro-engagement in the epicenter of action. \n\nFeatures: \n\n* Rolling terrain for intense low altitude action: take cover behind trees, hills and ridges. \n* Mobilize in two hard-hitting modes: Instant-Action Target-Rich onslaught or Realistic World Campaign System. \n* Selectable play modes for the pure Sim fanatics and Action addicts. \n* Solo action or multiplayer capacity for head-to-head and cooperative play. \n\nThe Russian Bear Is Stirring. Eastern Europe Just Went Code Red! \n\nAll the white-knuckle crises of combat deployment that can only be found in WWIII. \n\n&quot;The third title in the GUNSHIP! Series looks beautiful and is a lot of fun to boot.&quot; \n- IGNPC.com \n\n&quot;Graphically, GUNSHIP! Is leaps and bounds above any helicopter sim that we've ever seen (or any sim for that matter).&quot; \n- IGNPC.com \n\nFly the AH-64D Apache, Westland Apache, Eurocopter Tiger and Mil-28 Havoc. \n\n* Stunning Graphics. \n* Generate Unlimited Battles. \n* Multiplayer Missions. \n* 85 Realistic Weapon Types. \n* 114 Different Vehicle Types. \n* Selectable Play Modes for the Pure Sim Fanatics and Action Addicts. \n* Command gunships from the pilot's seat or the gunner's cockpit. \n* Unparalleled attention to detail: weapon systems, sounds, threats and terrain. \n* Accurate field communications for calling artillery, air support or contacting other units. \n* Fully modeled weapons systems, system failures, flight models. \n\nJump into a state-of-the-art warbird and hit the ground gunning in a furnace of incendiary action. Taste the action from all sides in U.S., British, German and Russian Gunships. Experience total immersion at the front line in one of today's most advanced weapons platforms. \n\nSystem Specs: \nOperating System: WindowsÃ‚Â® 95/98 \nProcessor: PentiumÃ‚Â® 266 MHz or higher \nMemory: 32 MB RAM \nHard Disk Space: 150 MB Free \nVideo: SVGA video card with 2MB VRAM (video memory)* \nSound: Sound card* \nDirect XÃ‚Â®: DirectX version 7.0 (included) or higher \n\n* These devices should be compatible with both Windows 95/98 and DirectX version 7.0 or higher ","torrent":{"xt":"urn:btih:0e93ea70c14c85821dd7f8cd48831e1537b29ac6","amp;dn":"Gunship%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e93ea70c14c85821dd7f8cd48831e1537b29ac6","infoHashBuffer":{"type":"Buffer","data":[14,147,234,112,193,76,133,130,29,215,248,205,72,131,30,21,55,178,154,198]},"announce":[],"urlList":[]}}