{"title":"PowerArchiver Pro v11.50.66 Portable","uid":5049209,"size":19339234,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0ea36e60bdb424955df6cd348c051d7b7b0dd1be&amp;dn=PowerArchiver+Pro+v11.50.66+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoExcuses","files":3,"time":1249815710,"description":"PowerArchiver 2010 11.50.66 (RC3) made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and License are included...\n\n\nPowerArchiver 2010 - universal archiver with support of all popular formats. This archive supports ZIP, RAR, 7-ZIP, CAB, LHA (LZH), TAR, TAR.GZ, TAR.BZ2, BH, ARJ, ARC, ACE, ZOO, GZ, BZIP2, XXE, MIME, UUE, XPI , EAR, WAR, REP, JAR, BK, QWK, Quake PK3, skins WinAMP, self-extracting executable file format ZIP and CAB, as well as CD-images: ISO, BIN, IMG and NRG. At the time the program is free, but as the expansion of its capabilities, has moved into the commercial status that, if we look at the overall trend, it is not surprising. This current application, which combines support practically all popular archival formats. If necessary, you can use encrypted archives using AES algorithm with varying degrees of stability (128-bit/192-bit/256-bit). The interface supports the change of skin, works as in classical or contemporary form.\n\nFeatures: \n- Complete built-in support for 7-ZIP, ZIP, CAB, LHA (LZH), TAR, TAR.GZ, TAR.BZ2, BH, RAR, ARJ, ARC, ACE, ZOO, GZ, and BZIP2 file formats\n- Support for reading and extracting disc image formats: ISO, BIN, IMG and NRG\n- Built-in support for XXE, UUE, and yENC encoded files and full MIME (Base 64) support\n- Creating ZIP and CAB and PAE encrypted self-extracting archives using a Wizard interface\n- Support for unlimited size ZIP archives, with improved performance when working with 100,000+ files\n- Support for Deflate64, providing improved compression results (both size and speed)\n- Complete support for PKZIP 4.0 and PKZIP 4.5 disk spanning\n- Compression Profiles to store frequently used compression settings\n- Full support for ZIP AES encryption, 128-bit/192-bit/256-bit (supports: PKZip 5.1 (full), Secure Zip 8.0 and WinZip 9.0 AE-1 &amp; AE-2) and proprietary PAE format using 5 different methods: Blowfish (128-bit), DES (64-bit), Triple DES (128-bit), AES 128-bit, and AES 256-bit\n- Support for AES encrypted 7-Zip archives and multivolume 7-Zip archives\n- Uploading archives or backups directly to FTP or SFTP (SSH) sites with multiple profiles supported and timeout option\n- Password manager for saving frequently used passwords\n- Tool for creating PBS backup scripts and running automated backups\n- Internal viewer that supports TXT, RTF, GIF, PNG, BMP, ICO, TIFF, GFI, SGI, EMF, WMF, PPM, Adobe Photoshop, Autodesk, Truevision, - ZSoft Paintbrush, Kodak Photo-CD, JASC PaintShop Pro, and Dr. Halo file formats\n- Many powerful archive operations (including: renaming files in archive, spanning archives, testing archives, viewing and writing comments, installing archives, and checking archives for viruses)\n- Drag and Drop from/to Windows Explorer and the Desktop\n- Two ways of viewing archives (Classic - all files in the same listing; Explorer - browsing through an archive like folders in Windows Explorer)\n- Complete integration with Windows (extracting archives and creating archives directly from Windows Explorer using powerful &quot;Explorer Shell Extensions&quot;)\n- Ability to edit files within an archive using one single operation\n- Printing file listing to text file or HTML document\n- Tool for repairing corrupted ZIP archives\n- Converting between file formats (for example: changing a ZIP archive to CAB archive, or LHA archive to ZIP archive)\n- Extracting multiple archives at the same time\n- Batch Zip function to create multiple different archives at once\n- Favorite Folders to quickly locate archives\n- Powerful Find function for searching within an archive\n- Auto Update to automatically download and install new versions of PowerArchiver\n- Powerful help in HTML and a tutorial with pictures for beginners\n- Full skinning support via PSF files - includes interface skins, toolbar skins, icons and customizable application settings\n- Customizable toolbar that can be docked to any side of the application or float independently \n- Windows XP Theme and ClearType support\n\n\nVersion 11.50 [June/2009]\n\nNew Features:\n  \n  Brand new ZIP Engine:\n    * Multicore deflate zip engine, almost 4x faster than single \n      core systems on quad core computers.  \n    * Improved speed of zip compression and extraction on any occassion.\n    * Support for LZMA, PPMd, BZIP2 and WAVPACK in ZIP, according to \n      latest ZIP standards. Both write and read support, making PowerArchiver\n      only application that supports\n Winzip 12 and earlier files, while providing\n      faster and stronger compression (up to 4x) compared to WinZip 12.\n    * Full support for new .zipx extension for advanced compression methods.\n    * Multicore LZMA engine for ZIP.\n    * Support for Unicode in ZIP, both read and write. Implemented throughout \n      application.\n    * Faster loading of archives with thousands of files.\n\n  Windows 7: \n    * Full Windows 7 support with jump lists, taskbar progress and taskbar \n      icon overlays. First archiver to do so.\n    * First application with new DirectSkin 6.0 engine that supports \n      Windows 7 (32bit).\n\n  PA Shell Extensions 2.0:\n    * Added Extract MRU shell extensions.\n    * Added Compress to MRU zip shell extensions.\n    * Added FTP profiles in shell extensions, ftp directly to selected \n      account via shell.\n\nBackup Improvements:  \n  * Moved backup to standalone application for easier handling, faster load \n    times.\n  * You can add multiple folders in backup filelist.\n  * Considerably faster zip backup when handling 10,000+ files.  \n  * Better info on files/folders in file list (number/size).\n  * Fixed major issue with 7-Zip backups and larger number of files.\n\nImprovements:\n  * RAR optimizations - up to 20% faster RAR extraction than before, \n    including WinRar. Faster unrar engine on the market.\n  * Faster compression - &quot;Preparing compression&quot; stage up to 10x faster both \n    in main PA and PA Backup for all compression formats.\n  * Interface improvements in Modern interface - faster and better looking.\n  * Interface improvements in Classic interface - more MRU's, more usable.\n  * New Add window in main Powerarchiver, most usable options are now shown \n    on first screen.\n  * You can now select multiple folders in all folder selection windows \n    (backup, tools, etc).\n  * Optimized 7-Zip's Optimized compression - Ultra and Max feature stronger \n    compression now.\n  * Added New Folder and Network buttons in Add window, improved look of \n    other icons.\n  * Unicode support for other formats that support unicode in rest of \n    PowerArchiver interfaces.\n  * Added method property in file list and properties window.\n  * Better support for Enterprise installations.\n  * Many smaller improvements in Burner and FTP applications.\n  * Other smaller improvements throughout the rest of application.\n\nBug Fixes:\n  * Fixed Bug #1000: No caption in burner taskbar under special conditions.\n  * Fixed Bug #987 : Doubleclick on file sometimes uses 100% cpu if preview is on. \n  * Fixed Bug #303 : Support for multiple selection in burner.\n  * Fixed Bug #958 : D&amp;D inside of folder in archive does not save path properly.\n  * Fixed Bug #997 : Cant align toolbar properly when some windows are on (Preview, etc).\n  * Fixed Bug #969 : Various burner options shown in shell/starter even if Standard.\n  * Fixed Bug #970 : CRC error when not enough space on disk (rar).\n  * Fixed Bug #703 : Cancelling extraction of large files takes long time.\n\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.powerarchiver.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.powerarchiver.com/&lt;/a&gt;\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=34&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=34&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:0ea36e60bdb424955df6cd348c051d7b7b0dd1be","amp;dn":"PowerArchiver+Pro+v11.50.66+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ea36e60bdb424955df6cd348c051d7b7b0dd1be","infoHashBuffer":{"type":"Buffer","data":[14,163,110,96,189,180,36,149,93,246,205,52,140,5,29,123,123,13,209,190]},"announce":[],"urlList":[]}}