{"title":"Colombian.Teens.[English].XXX.DVDRiP.XviD-","uid":5669656,"size":1465057280,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:0f35949d64911ff58d7d7cac63e0cd39b1988ef7&amp;dn=Colombian.Teens.%5BEnglish%5D.XXX.DVDRiP.XviD-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"trxt","files":2,"time":1278293627,"description":"Nacho Vidal, the world's favorite Spanish porn stud/filmmaker, went down to Colombia and came back with booty fresher and more addictive than the South American country's better known export. And the young, native hotties in the five new scenes of Colombian Teens are actually legal. Most of the sessions start with the girls posing for still photos, then succumbing to Nacho's macho charm and his club-like cock. Natural-bodied, blue-eyed blonde Sasha makes penetrating eye contact with the camera as she blows his dong; he fucks her roughly, his foot forcing her head to the ground, and she steams up the mirror kissing her own mouth as he nails her doggie-style. Voluptuous Bodylicious' thick rump bounces like twin volleyballs as she rides his bone. In his scenes with Yessica Gold and Sweet Sugar, Nacho ejaculates multiple, almost surreal fountains of cum, pumping monster jism geysers high in the air to shower the amazed girls. That giant cock makes Sweet Sugar's rectum gape. Cute, innocent July is excited when her boyfriend sells her services to Nacho and pal Carlos, and up in their apartment she doesn't behave like a sexual novice.","torrent":{"xt":"urn:btih:0f35949d64911ff58d7d7cac63e0cd39b1988ef7","amp;dn":"Colombian.Teens.%5BEnglish%5D.XXX.DVDRiP.XviD-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f35949d64911ff58d7d7cac63e0cd39b1988ef7","infoHashBuffer":{"type":"Buffer","data":[15,53,148,157,100,145,31,245,141,125,124,172,99,224,205,57,177,152,142,247]},"announce":[],"urlList":[]}}