{"title":"This Sceptred Isle  (61-70)   (BBC Radio)","uid":5101465,"size":129045035,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0f837353ffb9ef2b07735799243e5d8758aed547&amp;dn=This+Sceptred+Isle++%2861-70%29+++%28BBC+Radio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eddie1969","files":15,"time":1254010199,"description":"THIS SCEPTRED ISLE  051-060 (BBC7 History)\n\n44Khz, 128Kbps, CBR, Stereo \n\n 61.   1-61   Oct 16 95   The End of the Monasteries and Little Jack Horner\n 62.   1-62   Oct 17 95   The Auld Alliance and the Death of Henry VIII\n\nElizabeth I to Cromwell: 1547-1660 \n\n 63.   1-63   Oct 18 95   A Decade of Rebellion\n 64.   1-64   Oct 19 95   Bloody Mary and the Burning of Cranmer\n 65.   1-65   Oct 20 95   The Elizabethans\n 66.   1-66   Oct 30 95   The Spinster, the Hapsburg and the Scottish Widow\n 67.   1-67   Oct 31 95   Trading, Slaving, Piracy and the Spanish Armada\n 68.   1-68   Nov  1 95   Essex, Ireland and Sturdy Beggar\n 69.   1-69   Nov  2 95   How a King of Scots Became King of England\n 70.   1-70   Nov  3 95   A Damp Squib, a Bible and Widow Thirkettle\n\n\nFrom Wikipedia, the free encyclopedia\n-----------------------------------------\n\nThis Sceptred Isle was created as a series of short 12-14 minute radio programmes by the BBC for transmission daily on Radio 4 from 1995 about the history of the lands and peoples of the British Isles. The producer was Pete Atkin.\n\nStarting in 55 BC with the arrival of Julius Caesar and initially concluding in 1901 with the death of Queen Victoria, the series was read by Anna Massey and included extracts from the book A History of the English-speaking Peoples written by Sir Winston Churchill, interwoven into Christopher Lee's main account of the history. The extracts were read by Paul Eddington, who died during the production and his role was taken by Peter Jeffrey. In total the series contained 216 episodes, ran 29 hours, and was first broadcast in daily episodes between June 1995 and June 1996.\n\nThe series was very successful, being broadcast twice each day in the morning and late at night, and in 1999 the BBC extended the programme to cover the twentieth century; picking up from where the first series had finished to the end of the millennium. This new series was a total of 15.25 hours long and although it used the same narrator, the quotations were read by Robert Powell. The first episode of this new series was broadcast on August 30 1999 and the final episode on December 31 1999.\n\nIn 2001 another shorter series entitled This Sceptred Isle: Dynasties was produced. This told the stories of the powerful and influential families of Britain's history, including the Godwines, the Despensers and the Churchills. The series consisted of 10 episodes and was again narrated by Anna Massey.\n\nOver the course of several months in 2005 and 2006 This Sceptred Isle: Empire a 90-part history of the British Empire was broadcast on Radio 4. Each part was approximately 15 minutes long. The narrator was Juliet Stevenson and the cast of readers of various historical documents--including poems, songs, personal letters, and first-hand accounts--included Jack Davenport, Joss Ackland, Christopher Eccleston, and Anna Massey among others.\n\nThe programme's title is a quotation from act 2 scene 1 of Shakespeare's King Richard II, attributed to John of Gaunt: &quot;This royal throne of kings, this scepter'd isle, This earth of majesty, this seat of Mars ... This blessed plot, this earth, this realm, this England&quot;.\n\n\nBBC7\nCategories:\nGenre: Factual History\nFormat: Documentaries","torrent":{"xt":"urn:btih:0f837353ffb9ef2b07735799243e5d8758aed547","amp;dn":"This+Sceptred+Isle++%2861-70%29+++%28BBC+Radio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f837353ffb9ef2b07735799243e5d8758aed547","infoHashBuffer":{"type":"Buffer","data":[15,131,115,83,255,185,239,43,7,115,87,153,36,62,93,135,88,174,213,71]},"announce":[],"urlList":[]}}