{"title":"Vidres A La Sang - Som (2009)","uid":5137290,"size":56142268,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0fe258992c86e5e31134cb1431e6d97d382f5c25&amp;dn=Vidres+A+La+Sang+-+Som+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Baphom3t","files":7,"time":1256589523,"description":"VIDRES A LA SANG was formed in february 2002 as an xtreem music Project. Eloi(rythm guitars an lead vocals) along with Carles ,(drums) started to work on a few songs. Later on, Albert(lead guitars), and Marcos(bass and backing vocals) , joined up. It is then when the band starts to develop new ideas and shape their style by for instance deciding to sing in Catalan (their native lenguage)and borrowing poems by the most relevant contemporary catalan poet Miquel MartÃƒÂ­ i Pol adapting his poetry to their music. Red and black will be the colors chosen as their body painting signifying a personal view to represent life and dead and also to distance ourselves from the black and white body painting cliche so widely used on stage. As the band keeps evolving their sound gets more death metal and hevy metal oriented, two styles that in convination with black metal set the style of the band. \nThe group is always working their own way with rigor and dedication searching for the writing perfection in order to reach the desired result. Up to date Vidres a la sang boasts of 3 records , 3 diferent stages of personal and emotional growth. Ups and downs, joy and memories but also setbacks and disapointments but above all else constancy , strength and the expierence gained through years and the acknowledgement of those who have listened to their music closely knowing that Vidres a la sang is one of those bands that never leaves anything to improvisation but on the contrary writes its own destiny with effort,self-criticism, humbleness and will as standar bearers of nonconformity. Vidres a la sang to sum up, is a band that gathers black metal, death metal, heavy metal, emotional and extreme music as it is, but first and foremost is feeling, honesty, rage , pain and a true challenge to death in poetical terms. .\n\nCurrent line-up \nEloi Boucherie - Guitar, Vocals \nAlbert - Guitar (Fire of Revenge)\nMarcos - Bass, Vocals \nCarles - Drums \n\nThe band's name is taken from a compilation of Miquel MartÃƒÂ­ i Pol poetry book called &quot;Amb Vidres a la Sang: Obra PoÃƒÂ¨tica III&quot;. Vidres a la Sang means 'crystals in the blood' in the Catalan language.\n\nFormat = mp3\nBit Rate = 128 kbps\nFile Size = 53.5 mb\nGenre = Death / Black Metal\n\nTrack Listing\n01. Som \n02. Policroma \n03. Esclaus De La Modernitat \n04. A L'ombra \n05. El Crit \n06. No Tornar A Ser Jove ","torrent":{"xt":"urn:btih:0fe258992c86e5e31134cb1431e6d97d382f5c25","amp;dn":"Vidres+A+La+Sang+-+Som+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fe258992c86e5e31134cb1431e6d97d382f5c25","infoHashBuffer":{"type":"Buffer","data":[15,226,88,153,44,134,229,227,17,52,203,20,49,230,217,125,56,47,92,37]},"announce":[],"urlList":[]}}