{"title":"Rostam and Sohrab-AVI","uid":5566709,"size":290299394,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1017509c62cf5637207e641e06bb58368d928c59&amp;dn=Rostam+and+Sohrab-AVI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"roloman","files":13,"time":1274007368,"description":"The Timeless Story of Rustam and Sohrab from Shahnama in 10 Parts\n\nBackground queted from internet documents:\n\nThis is the story of &quot;Rustam and Sohrab&quot; from the great Shahnama (Book of the Kings). The Shahnama is a poetic epic written by the Persian/Tajik poet Ferdowsi around 1000 AD. The Shahnama tells the mythical and historical past of Persia from the creation of the world up until the Arab invasion of Persia. \n\nThe Shahnama, written in Persian, has been pivotal for reviving the Persian language subsequent to the influence of Arabic. The Book of the Kings is regarded as a literary masterpiece which reflects Persia's history, cultural values, its ancient religion, Zoroasterianism, and its profound sense of nationhood.\n\nThis particular story of Rustam and Sohrab is only one of the many chapters in the Shahnama. Rustam has always been a hero to Persians/Tajiks as well as other Persian speakers. The Shahnama is very important, especially nowadays, because contrary to what people think today, it does not represent just the political country of Iran. Instead, the epic covers parts of modern-day Afghanistan, as well as Iran, Tajikistan, and the cities of Samarqand and Bukhara. Though the peoples of these regions are separated against their will by such political borders it can not change the fact that they share the same language, culture and history and, importantly, Rustam is still their hero. \n\nThe Shahnama is valued above the Quran and fortunately the Persians/Tajiks are rediscovering their roots and shaking loose from the hold that Arabic had on them. They are realizing just how barbaric the Arabs are and they are moving away from the Arab culture and Islam and going towards their own culture and beliefs. Though there are still Persians/Tajiks who defend the savage acts of the Arabs i.e. forcing their language on the Persians/Tajiks, changing their livelihood, abolishing their legends, etc. These Persians/Tajiks do not realize the errors of their ways and the fact that they are just pawns being used by the Arabs. As the saying goes, &quot;When there is no enemy within, the enemies outside cannot hurt you.&quot; Others work to keep the Persians/Tajiks separated for their own advantage. \n\nIt is legends like Rustam who serve as reminders of the greatness the Persians/Tajiks come from. And it is books like the Shahnama that captures the timeless power of a great culture.\n\nThe Timeless Story of Rustam and Sohrab from Shahnama AVI Files.\n\nI compiled this AVI files fromsegments in FLV format and converted them to AVI. Credit id due the good people how posted them on\n\nThe Torrent for these files was first posted with Iraniantorrents.com, but they have a strange way of uploading it which did not work. So I posted thepiratebay.se.\n\nEnjoy,\n\nRolo Mankin.\n","torrent":{"xt":"urn:btih:1017509c62cf5637207e641e06bb58368d928c59","amp;dn":"Rostam+and+Sohrab-AVI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1017509c62cf5637207e641e06bb58368d928c59","infoHashBuffer":{"type":"Buffer","data":[16,23,80,156,98,207,86,55,32,126,100,30,6,187,88,54,141,146,140,89]},"announce":[],"urlList":[]}}