{"title":"Sound and Fury: 6 Years Later (2006)","uid":5585121,"size":362005492,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:101f4dc37eaadc9ed00bcbb5b759f714fa8dabb5&amp;dn=Sound+and+Fury%3A+6+Years+Later+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":1,"time":1274677002,"description":" &lt;a href=&quot;http://soundandfuryfilm.com/sixyears/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://soundandfuryfilm.com/sixyears/index.php&lt;/a&gt;\n\nRunning time: 28:55\n\n&quot;Sound and Fury: Six Years Later&quot; is an engaging look at what has happened to the Artinians since their family saga captured audiences around the world in &quot;Sound and Fury&quot; in 2000. &quot;Sound and Fury&quot; ended with 6-year-old Heather's parents deciding not to implant her. With the family painfully divided over this, Heather's parents moved their family away to a signing community to bring their kids up in the signing deaf world. In this stand-alone follow-up film we learn that Heather finally did get the implant at 9 years-old, as did her 2 younger brothers, her mother, her deaf aunt and her 2 deaf cousins. Now 12, Heather is the only deaf child in her Long Island school. She plays basketball and volleyball, stays near the top of her class and is popular with her hearing peers. Though she got the implant &quot;late,&quot; Heather's speech is understandable and she delights in her communication skills. Heather still signs like a native and slides easily between the hearing world she is now a part of and the signing deaf world of her parents. Heather's father, who was so resistant to the implant in &quot;Sound &amp; Fury,&quot; says that through observation and education, he has learned how useful the implant can be for deaf children and how glad he is that his children have it. This resilient family is a remarkable testament to family devotion, tireless responsibility to children and enduring love.\n\nPlease help seed, and comments are appreciated.","torrent":{"xt":"urn:btih:101f4dc37eaadc9ed00bcbb5b759f714fa8dabb5","amp;dn":"Sound+and+Fury%3A+6+Years+Later+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"101f4dc37eaadc9ed00bcbb5b759f714fa8dabb5","infoHashBuffer":{"type":"Buffer","data":[16,31,77,195,126,170,220,158,208,11,203,181,183,89,247,20,250,141,171,181]},"announce":[],"urlList":[]}}