{"title":"Super Flexible File Synchronizer 4.60e-serial incl","uid":5024331,"size":5673263,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:10600a57a66a8c9eb9b145fafebf36886a383769&amp;dn=Super+Flexible+File+Synchronizer+4.60e-serial+incl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jmb2012","files":2,"time":1248625435,"description":"\nSuper Flexible File Synchronizer Features\n\nHere's a list of some of the basic capabilities of Super Flexible File Synchronizer. To get a full impression of the available features, it is recommended to download and try the software and take a direct look at the available options.\n\nThis is one of the most comprehensive file synchronization tools available. Be sure to read this independent and very helpful review by Alex Forbes.\n\n    *\n\n      Synchronizes or Backs Up Files and complete folder structures in different locations, such as a PC, laptop, or online storage. There are no limits in terms of file sizes, the number of files, or filename lengths. The program fully supports Unicode characters so that it can copy filenames in all languages.\n    *\n\n      Each sync job is saved as a profile so that you only need to specify the settings once. You can run multiple profiles with a single click. You can also run profiles from the command line. Profiles can be created using a wizard, or in advanced mode.\n    *\n\n      Includes a scheduler. Schedule the synchronization of your data on a backup hard disk at a convenient time each day, or as frequently as you wish. You can also schedule profiles to run upon shutdown or log-off. On Windows NT/2000 or higher, the scheduler can run as a service - without users having to log on.\n    *\n\n      Internet Support. Supports various Internet protocols, including FTP, FTPS, SFTP/SSH, WebDAV, SSL, HTTP, and Amazon S3 web storage.\n    *\n\n      Compression and Encryption Support. Easily zip your files and encrypt them with strong 256-bit encryption. To unzip and decrypt, simply make a copy of your profile and copy in the opposite direction.\n    *\n\n      Detects Moved Files. If you reorganized your folders by moving files to different locations, Super Flexible File Synchronizer will detect this and quickly perform the same moves, for example, on your laptop. No extraneous copying!\n    *\n\n      SmartTracking. This feature keeps a database of all files so that it can detect file deletions and conflicts. You will find the SmartTracking checkbox on the Modes tab sheet (in Advanced Mode). A separate dialog will appear with related settings.\n    *\n\n      Unattended Mode In this mode, no questions are asked while the profile is run. You can specify beforehand which kinds of files may be overwritten.\n    *\n\n      Exact Mirror Mode. If desired, you can create an exact mirror of your data, even if this means that some files are deleted or replaced with older files.\n    *\n\n      Copy Locked Files. If some files cannot be copied due to other software accessing these files, Volume Shadowing can be used on Windows XP or later to copy the files. If files can't be copied, the synchronizer will continue copying the remaining files, and then retry all those files that were locked, until all files have been copied successfully. A limit for the time spent on retries can be specified.\n    *\n\n      Versioning: this feature enables you to keep multiple older versions of each file in the backup. There are several naming schemes available. See also Versioning / Filename Mangling.\n    *\n\n      Partial File Updating (or delta copying): this feature copies only the changed portions of files in order to speed up the synchronization. See the Partial File Updating documentation\n    *\n\n      Database-safe mode: This mode requires exclusive access to the files to be copied. If exclusive access is not possible, Volume Shadowing is used, or the program will wait until the exclusive access becomes possible.\n    *\n\n      Can Use Recycle Bin for older versions of files that are overwritten, as well as for deleted files. This is a fairly unique feature because most programs will permanently replace older versions of a file. Using Super Flexible File Synchronizer, you will have a chance of retrieving overwritten files if you select the appropriate options.\n    *\n\n      File Masks &amp; Filters. Numerous ways to select/deselect files and folders are available.\n    *\n\n      Daylight Savings Time / Time Zones. Since exact hour time differences can be ignored if the file size matches, you won't have any more problems if the file systems of two computers are off by one hour, or even several hours. Whenever possible, UTC (world time) is used to compare the timestamps of files.\n    *\n\n      Easy Resuming On Disk Full. You simply make more space and ask the software to continue copying. It can pause right in the middle of a file until additional space is freed.\n    *\n\n      Obsolete File Folders. If you occasionally move obsolete files to a specially designated folder, this usually causes trouble with traditional file synchronizers. They will copy the obsolete files back from your laptop right into the folders where you moved them out of. No longer! If you use the Select Folders and Files option, you can specify folders for obsolete files using the right mouse button. These folders are then taken into account for moving files into them, but not for copying files out. Thus, the synchronizer does the same moving of obsolete files on your laptop that you  previously did on the PC, but it does not waste any time copying all obsolete files  between the two machines.\n\n\nwin/all\n","torrent":{"xt":"urn:btih:10600a57a66a8c9eb9b145fafebf36886a383769","amp;dn":"Super+Flexible+File+Synchronizer+4.60e-serial+incl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10600a57a66a8c9eb9b145fafebf36886a383769","infoHashBuffer":{"type":"Buffer","data":[16,96,10,87,166,106,140,158,185,177,69,250,254,191,54,136,106,56,55,105]},"announce":[],"urlList":[]}}