{"title":"S05 E06 FC de kampioenen - filmster.avi","uid":5047923,"size":309356104,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:10d73ff596154292b41e97f5773236a197623c28&amp;dn=S05+E06+FC+de+kampioenen+-+filmster.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"xkissie","files":1,"time":1249740076,"description":"    * Pico is vertrokken met zijn nieuwe vriendin: Ria De Stekker.\n    * Oscar, die op het einde van reeks 4 vertrok naar Tenerife, is niet meer teruggekomen. Hij verblijft nu bij de Hari Krishnas, een sekte in Kathmandu.\n    * Pol De Tremmerie, een neef van DDT die 5 jaar in Afrika werkte als ontwikkelingshelper, komt in BelgiÃƒÂ« wonen.\n    * Boma wordt tijdelijk trainer-voorzitter. Zijn strenge bewind zorgt voor veel problemen.\n    * Xavier wordt de nieuwe trainer. Marc vervangt hem in doel. Pol wordt spits.\n    * Pascale wint een cruise voor 2 personen. Ze gaat op zoek naar een partner. Carmen wil haar koppelen aan Alex Cooremans, een voetbaltrainer.\n    * DDT en Boma zijn uit op dezelfde vrouw: Lea De Wilde.\n    * Wanneer Bieke &quot;over tijd&quot; is met een artikel, denken de Kampioenen dat ze zwanger is. Door een misverstand denkt Marc dat Bieke zwanger is van een andere man en denkt Bieke dat Marc een andere vrouw heeft zwanger gemaakt.\n    * DDT wil in de verkoop van exotisch vlees stappen. De Kampioenen denken echter dat hij in de vrouwenhandel beland is.\n    * Er wordt een promotiefilmpje voor het leger opgenomen. Iedereen wil meespelen.\n    * Doortje wil een relatie met Pol. Boma wil een relatie met Pascale. Wanneer duidelijk antwoorden van hun geliefden uitblijven, doen Boma en Doortje alsof ze een koppel zijn.\n    * Pascale wil van het cafÃƒÂ© een taverne maken. Bieke wil niet meer meehelpen. Als alternatief wil Pascale een stagiaire aannemen.\n    * Marc volgt een workshop zelfvertrouwen. Hij keert als een echte macho terug.\n    * De Kampioenen nemen een steward aan. Hij blijkt een ex van Carmen te zijn. Carmen maakt plannen om Xavier te verlaten.\n    * De Kampioenen organiseren een succesvolle tombola.\n    * Pol heeft geen geld om een Valentijnscadeautje te kopen voor Doortje. Wanneer de clubkas leeg blijkt te zijn, verdenkt men Pol van diefstal.\n    * Carmen spoort aardstralen op met een wichelroede. Ze denkt dat de slechte uitslagen van de Kampioenen en de slaapproblemen van Pascale daaraan te wijten zijn.\n    * Ma DDT heeft de ideale vrouw voor DDT gevonden. DDT en Pascale doen alsof ze een relatie hebben om Ma DDT te misleiden.\n","torrent":{"xt":"urn:btih:10d73ff596154292b41e97f5773236a197623c28","amp;dn":"S05+E06+FC+de+kampioenen+-+filmster.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10d73ff596154292b41e97f5773236a197623c28","infoHashBuffer":{"type":"Buffer","data":[16,215,63,245,150,21,66,146,180,30,151,245,119,50,54,161,151,98,60,40]},"announce":[],"urlList":[]}}