{"title":"El Leon En Invierno - Miniserie Completa DVDRip Spanish","uid":5057706,"size":1467235494,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1212a94fe229e6f7048ee560d1c5319407c3c166&amp;dn=El+Leon+En+Invierno+-+Miniserie+Completa+DVDRip+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":3,"time":1250468464,"description":"\nAÃƒÂ±o 1183. El rey Henry II (Patrick Stewart) se encuentra rodeado por parientes engaÃƒÂ±osos y ambiciosos, todos dispuestos a obtener ganancias personales y ventajas polÃƒÂ­ticas a sus expensas. El es un monarca formidable que ha gobernado Inglaterra por muchos aÃƒÂ±os, pero ha comenzado a cuestionar su propia mortalidad en los dÃƒÂ­as postreros de su vida. Con la llegada de las fiestas navideÃƒÂ±as, Henry quiere usar la ocasiÃƒÂ³n para anunciar a quiÃƒÂ©n ha escogido como heredero del trono. Henry invita a su esposa, la reina Eleanor de Aquitania (Glenn Close), a asistir a las celebraciones que van a tener lugar en el castillo Chinon, en Francia. Eleanor es una paria real y ha estado prisionera por orden de Henry por conspirar en su contra durante un golpe polÃƒÂ­tico una dÃƒÂ©cada atrÃƒÂ¡s. Usando su carisma, ella estÃƒÂ¡ determinada a prevenir que los planes de Henry se hagan realidad. Para complicar el asunto, la querida de Henry, Alais (Julia Vysotsky) y su hermano conspirador, el rey Philip II de Francia (Jonathan Rhys-Meyers), tambiÃƒÂ©n asistirÃƒÂ¡n a las festividades. El acosado Henry debe escoger su sucesor de entre los tres hijos conspiradores: el temible y prÃƒÂ³digo Richard CorazÃƒÂ³n de LeÃƒÂ³n (Andrew Howard), el oportunista Geoffrey (John Light) y el apagado John (Rafe Spall)","torrent":{"xt":"urn:btih:1212a94fe229e6f7048ee560d1c5319407c3c166","amp;dn":"El+Leon+En+Invierno+-+Miniserie+Completa+DVDRip+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1212a94fe229e6f7048ee560d1c5319407c3c166","infoHashBuffer":{"type":"Buffer","data":[18,18,169,79,226,41,230,247,4,142,229,96,209,197,49,148,7,195,193,102]},"announce":[],"urlList":[]}}