{"title":"Yusuf - I Think I See the Light (Live Yusuf's Cafe Session 20","uid":5675205,"size":53749624,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:127b152b8851e6e216d9c9446f26c0117ddcbab5&amp;dn=Yusuf+-+I+Think+I+See+the+Light+%28Live+Yusuf%5C%27s+Cafe+Session+20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RosaMannen","files":1,"time":1278496116,"description":"Yusuf Islam (born Steven Demetre Georgiou; 21 July 1948 in London, England),  commonly known by his former stage name Cat Stevens, is a British musician. He is a singer-songwriter, multi-instrumentalist, educator, philanthropist, and prominent convert to Islam.\n\nHis early 1970s record albums Tea for the Tillerman and Teaser and the Firecat were both certified as Triple Platinum by the RIAA in the United States; his 1972 album Catch Bull at Four sold half a million copies in the first two weeks of release alone and was Billboard's number-one LP for three consecutive weeks. He has also earned two ASCAP songwriting awards in consecutive years for &quot;The First Cut Is the Deepest&quot;, which has been a hit single for four different artists.\n\nStevens converted to Islam at the height of his fame, in December 1977, and adopted his Muslim name, Yusuf Islam, the following year. In 1979, he auctioned all his guitars away for charity and left his music career to devote himself to educational and philanthropic causes in the Muslim community. He has been given several awards for his work in promoting peace in the world, including 2003's World Award, the 2004 Man for Peace Award, and the 2007 Mediterranean Prize for Peace. In 2006, he returned to pop music with his first album of new pop songs in 28 years, entitled An Other Cup. He now goes professionally by the single name Yusuf.[ His newest album, Roadsinger, was released on 5 May 2009.\n\n\n\n.ooOO ROSA MANNEN 2010 OOoo.\n                                                                                   &lt;a href=&quot; http://thepiratebay.se/user/RosaMannen&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/RosaMannen&lt;/a&gt;\t","torrent":{"xt":"urn:btih:127b152b8851e6e216d9c9446f26c0117ddcbab5","amp;dn":"Yusuf+-+I+Think+I+See+the+Light+%28Live+Yusuf%5C%27s+Cafe+Session+20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"127b152b8851e6e216d9c9446f26c0117ddcbab5","infoHashBuffer":{"type":"Buffer","data":[18,123,21,43,136,81,230,226,22,217,201,68,111,38,192,17,125,220,186,181]},"announce":[],"urlList":[]}}