{"title":"Greys Anatomy S06E23 720p HDTV x264-CTU","uid":5577383,"size":1173162348,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:12cb9a47840437c3c0a1a9bba7cdb8230d4d7575&amp;dn=Greys+Anatomy+S06E23+720p+HDTV+x264-CTU&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"CHD242522","files":-1,"time":1274428406,"description":"Grey's Anatomy is an American medical drama television series. It follows the lives of five surgical interns, later residents and their mentors in the fictional Seattle Grace Hospital in Seattle, Washington. Besides their careers the series also follows their personal lives. The pilot episode, &quot;A Hard Day's Night&quot; premiered on March 27, 2005 on ABC. Since then, five seasons have aired, with a sixth announced. The show has attained commercial success and critical acclaim. Initially airing as a mid-season replacement for the legal drama Boston Legal it gained high viewership, with the first episode watched by 16.25 million viewers, and the first season finale gaining 22.22 million viewers. The show is one of the most watched primetime television series. It is also winner of two Emmy Awards and two Golden Globe Awards. Prior to broadcast, it was announced that the show's title would change from Grey's Anatomy to Complications, although ultimately this did not come to pass. Grey's Anatomy is derived from Henry Gray, author of the medical textbook Gray's Anatomy.","torrent":{"xt":"urn:btih:12cb9a47840437c3c0a1a9bba7cdb8230d4d7575","amp;dn":"Greys+Anatomy+S06E23+720p+HDTV+x264-CTU","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12cb9a47840437c3c0a1a9bba7cdb8230d4d7575","infoHashBuffer":{"type":"Buffer","data":[18,203,154,71,132,4,55,195,192,161,169,187,167,205,184,35,13,77,117,117]},"announce":[],"urlList":[]}}