{"title":"Maxwell - Bad Habits","uid":5090437,"size":163497988,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:133b03ba43a8fbb8f59e20c03cbaac316b32e4f3&amp;dn=Maxwell+-+Bad+Habits&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1253098038,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nBLACKsummers'night is the fourth studio album by R&amp;B and neo soul musician Maxwell, released July 7, 2009 on Columbia Records. Recording sessions for the album took place during 2007 to 2009 at Chung King Studios, Bowery Digital, and Platinum Sound Recording Studios in New York City. Production for the album was handled by Maxwell and musician Hod David. BLACKsummers'night is Maxwell's first album since Now (2001), and serves as the first part of a trilogy of albums by Maxwell. The music of BLACKsummers'night is rooted in general soul music, and is more straightforward than previous albums such as Embrya (1998).\n\nBLACKsummers'night debuted at number one on the Billboard 200 albums chart with first week sales of 316,000 units. Upon release, the album received universal acclaim from most music critics, based on an aggregate score of 85/100 from Metacritic. It earned praise for its production and was perceived as an improvement over Maxwell's previous work, in terms of lyrical quality and instrumentation.\n\nThe album was released on July 7, 2009 in multiple formats: digital, physical CD only, physical CD/DVD (Deluxe Version), and vinyl. The deluxe version includes video, entitled &quot;5DAYSofBLACK&quot;, which discusses the development of songs and also includes the music video for &quot;Pretty Wings&quot;. BLACKsummers'night debuted at number one on the Billboard 200 albums chart with first week sales of 316,000 units, according to Nielsen SoundScan. Maxwell's previous album, Now, also opened at number one with an opening week of 296,000 copies sold. &quot;Pretty Wings&quot;, the first single from the album, peaked at number 33 on the Billboard Hot 100, number 1 on the Hot R&amp;B/Hip-Hop Songs, number 1 on the Hot Adult R&amp;B Airplay, and number 24 on the Mainstream R&amp;B/Hip-Hop chart. Maxwell described &quot;Pretty Wings&quot; to MTV as being &quot;a bittersweet love song about meeting the right girl at the wrong time.&quot; &quot;Bad Habits,&quot; the second single from the album, peaked at number 24 on the Hot R&amp;B/Hip-Hop Songs charts. &quot;Cold&quot;, which is not a single, also made the Hot R&amp;B/Hip-Hop Songs at number 62.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:133b03ba43a8fbb8f59e20c03cbaac316b32e4f3","amp;dn":"Maxwell+-+Bad+Habits","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"133b03ba43a8fbb8f59e20c03cbaac316b32e4f3","infoHashBuffer":{"type":"Buffer","data":[19,59,3,186,67,168,251,184,245,158,32,192,60,186,172,49,107,50,228,243]},"announce":[],"urlList":[]}}