{"title":"Bringing Down the House (2003) 2Lions-Team","uid":5061155,"size":4406250357,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:13c4d808dcf0393b6c4d1e868c1748e8669cee77&amp;dn=Bringing+Down+the+House+%282003%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rocco64","files":-1,"time":1250711145,"description":"Runtime:105 min \nCountry:USA \nLanguage:English \n\n\nDutch:\n\nDe hilarische Steve Martin (Father Of The Bride) en de voor een Academy AwardÃ‚Â®-genomineerde Queen Latifah (Chicago) schitteren in deze kaskraker: de waanzinnige comedy BRINGING DOWN THE HOUSE. Advocaat Peter Sanderson (Martin)- een nette, gescheiden, zenuwachtige workaholic - ontmoet een intelligente, wellustige juriste tijdens het chatten op internet en ze maken een afspraakje. Peter verwacht zijn soulmate, maar hij komt oog in oog te staan met Charlene (Latifah) - een spontane, impulsieve vrouw die net uit de gevangenis is ontsnapt. Ze wil dat Peter haar naam zuivert, maar hij wil absoluut niets met haar te maken hebben. Dat zet Charlene ertoe aan om het zorgvuldig georganiseerde leven van Peter totaal op zijn kop te zetten. Hilarische ontwikkelingen te over, en Peter komt er al snel achter dat hij Charlene wel eens net zo hard nodig kon hebben als zij hem.\nTaalversie: Engels/Frans \nOndertiteling: Engels/Engels voor doven en slechthorenden/Frans/Nederlands \nBeeld: 16x9 1.66:1 \nGeluid: Dolby Digital 5.1 \nCover: Meegepost\nDvd label: Meegepost\n\nEnglish:\n\nPeter Sanderson is a divorced, straight-laced, uptight attorney who still loves his ex-wife and can't figure out what he did wrong to make her leave him. However, Peter's trying to move on, and he's smitten with a brainy, bombshell barrister he's been chatting with online. However, when she comes to his house for their first face-to-face, she isn't refined, isn't Ivy League, and isn't even a lawyer. Instead, it's Charlene, a prison escapee who's proclaiming her innocence and wants Peter to help her clear her name. But Peter wants nothing to do with her, prompting the loud and shocking Charlene to turn Peter's perfectly ordered life upside down, jeopardizing his effort to get back with his wife and woo a billion dollar client. Written by Sujit R. Varma\n\n\n************************************************\n\nBrought to you by \nRocco van 2Lions-Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n************************************************","torrent":{"xt":"urn:btih:13c4d808dcf0393b6c4d1e868c1748e8669cee77","amp;dn":"Bringing+Down+the+House+%282003%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13c4d808dcf0393b6c4d1e868c1748e8669cee77","infoHashBuffer":{"type":"Buffer","data":[19,196,216,8,220,240,57,59,108,77,30,134,140,23,72,232,102,156,238,119]},"announce":[],"urlList":[]}}