{"title":"Infectados.(2009).Trailer.Spanish.LanzamientosDivx.es","uid":5126844,"size":18787488,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:13c49d9f8248762cdd1c81c48aa0fba9150955f2&amp;dn=Infectados.%282009%29.Trailer.Spanish.LanzamientosDivx.es&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LDivx","files":3,"time":1255653356,"description":"| Drama, Thriller | 87 min\nTÃƒÂ­tulo: Infectados\nTÃƒÂ­tulo original: Carriers\nPaÃƒÂ­s: USA \nEstreno en USA: 04/09/2009 \nEstreno en EspaÃƒÂ±a: 16/10/2009 \nProductora: Paramount Vantage \nDirector: Ãƒâ‚¬lex Pastor, David Pastor \nGuiÃƒÂ³n: Ãƒâ‚¬lex Pastor, David Pastor \nReparto: Chris Pine, Piper Perabo, Christopher Meloni, Emily VanCamp, Lou Taylor Pucci, Kiernan Shipka, Dylan Kenin, Josh Berry, Brighid Fleming, Jason E. Hill, Stacy Marie Warden, Sequoyah Adams-Rice, Jeremy Burnell, Dale Malley\n\nSinopsis: \nNos situamos en un mundo apocalÃƒÂ­ptico en el que toda la poblaciÃƒÂ³n estÃƒÂ¡ expuesta a una pandemia vÃƒÂ­rica. Con el propÃƒÂ³sito de huir del mortÃƒÂ­fero virus, Danny (Lou Taylor Pucci), su hermano Brian (Chris Pine), la novia de ÃƒÂ©ste, Bobby (Piper Perabo) y la amiga de clase de Danny, Kate (Emily Vancamp) cruzan a todo gas el suroeste de EEUU en busca de un lugar seguro. Danny recuerda unas idÃƒÂ­licas vacaciones familiares en una playa aislada y convence al grupo de que esa es su mejor opciÃƒÂ³n: una retirada playa de surferos en el Golfo de MÃƒÂ©jico. Al llegar allÃƒÂ­, podrÃƒÂ¡n vivir tranquilamente y esperar a que se extinga el virus, incluso si eso significa que serÃƒÂ¡n los ÃƒÂºnicos supervivientes de esta enfermedad apocalÃƒÂ­ptica. \nEste nuevo mundo se rige por unas reglas bien sencillas: sÃƒÂ³lo se utilizarÃƒÂ¡n carreteras secundarias poco transitadas y se evitarÃƒÂ¡ el contacto con otros humanos cueste lo que cueste. No obstante, el viaje va haciendo mella en sus actitudes despreocupadas y su inocencia juvenil comienza a desvanecerse entre las ruinas de autopistas y pueblos vacÃƒÂ­os, segÃƒÂºn van enfrentÃƒÂ¡ndose por el camino a otros combativos supervivientes o a infectados que lanzan un desesperado grito de ayuda. Es una lucha por la supervivencia. \nEn el curso de cuatro dÃƒÂ­as, el grupo se ve obligado a tomar decisiones morales a las que ningÃƒÂºn ser humano quisiera tener que enfrentarse nunca. Descubren que su mayor enemigo no es el mortÃƒÂ­fero virus, sino la crueldad y la maldad que habitan en lo mÃƒÂ¡s profundo del ser humano. ","torrent":{"xt":"urn:btih:13c49d9f8248762cdd1c81c48aa0fba9150955f2","amp;dn":"Infectados.%282009%29.Trailer.Spanish.LanzamientosDivx.es","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13c49d9f8248762cdd1c81c48aa0fba9150955f2","infoHashBuffer":{"type":"Buffer","data":[19,196,157,159,130,72,118,44,221,28,129,196,138,160,251,169,21,9,85,242]},"announce":[],"urlList":[]}}