{"title":"Stargate SG-1 S06 D5 PAL 2Lions-Team","uid":5507053,"size":4643733684,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:140d0f0031904588df4541991fda4f077f588cb3&amp;dn=Stargate+SG-1+S06+D5+PAL+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wietseherman","files":-1,"time":1271870099,"description":"Stargate SG-1 S06 D5 PAL 2Lions-Team\n\nNL Info\n\nDisclosure - Senator Kinsey doet wederom een poging om de Stargate onder de NID te krijgen. Nu doet hij dat door de stargate bekend te maken aan China, Groot-BrittanniÃƒÂ« en Frankrijk. Hammond probeert dit te verhinderen.\n\nForsaken - SG-1 ontdekt een neergestort ruimteschip. Als ze de bemanning helpen met repareren worden ze aangevallen.\n\nThe Changeling - Teal'C &amp; Bra'Tac worden in een hinderlaag gelokt. Teal'C en Bra'tac moeten samen op 1 symbioot leven. Hierdoor krijgt Teal'C een visioen hoe zijn leven op aarde eruit gezien zal hebben.\n\nMemento - Een testvlucht met de Prometheus loopt anders dan gepland als de naquadria reactor onstabiel wordt.\n\nEnglisch Information\n\nDisclosure - The Americans and the Russians reveal the existence of the Stargate to the Chinese, French, and British governments. Senator Kinsey tries to use the meeting to hijack the program, but Hammond has a card up his sleeve.\n\nForsaken - SG-1 finds a wrecked spacecraft whose crew claims to have been fighting off aggressive aliens ever since they crashed. It later turns out that the crew are in fact prisoners of the Serrakin ship Seberus. The Serrakin are an advanced race who once helped free the human Hebridans, descendends from the Celts, from the Goa'uld millennia ago. \n\nThe Changeling - Teal'c finds himself jumping between different realities of Earth and the planet Kresh'ta, where a meeting of 108 Jaffa rebel leaders are ambushed by the Goa'uld System Lords. Only Daniel seems to display any continuity. \n\nMemento - On the maiden flight of the Prometheus, the reactor overloads, and SG-1 must find the Stargate buried on the alien planet Tagrea in order to obtain spare parts from Earth. Tagrea was once ruled by the Goa'uld Heru-ur, and the memory of his occupation was so traumatic that the Tagreans buried their Stargate and wiped out all traces of their earlier history, so as to make a new start.\n\n\nSource : retail\nFormat : DVD5\nVideo : Pal\nSound : DD 5.1\nLanguages : EN\nMenu : Yes\nExtra : No\nSubs : EN NL FR\nCover: Included\n\nWeblink: http://www.imdb.com/title/tt0118480/\n\nBrought to you by\nB2B\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum   &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl/index.php&lt;/a&gt;\n\n2Lions-Team for all your Dutch MOVIES and more\n*****************************************************\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.\nDon`t quit after you finished the download, but keep seeding.\n*****************************************************\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name.\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\nto the fakers , get a life !!!\n\n*****************************************************\t\n\n\n","torrent":{"xt":"urn:btih:140d0f0031904588df4541991fda4f077f588cb3","amp;dn":"Stargate+SG-1+S06+D5+PAL+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"140d0f0031904588df4541991fda4f077f588cb3","infoHashBuffer":{"type":"Buffer","data":[20,13,15,0,49,144,69,136,223,69,65,153,31,218,79,7,127,88,140,179]},"announce":[],"urlList":[]}}