{"title":"Madonna - Celebration","uid":5101668,"size":137617412,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:145f49603bcec922f593ff5ab278b59903fe2d69&amp;dn=Madonna+-+Celebration&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1254034957,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Celebration&quot; is a song by American recording artist Madonna from her third greatest hits compilation, Celebration. It was written by Madonna, Paul Oakenfold, Ciaran Gribbin and Ian Green, and produced by Madonna and Paul Oakenfold . The song was released digitally on July 31, 2009 by Warner Bros. Records. Madonna collaborated with Oakenfold to develop a number of songs. Amongst all the songs they developed, two were chosen for the album with &quot;Celebration&quot; acting as the first single. It is a dance-oriented song with influences of Madonna's singles from the eighties and nineties. The song invites one to come and join a party.\n\n&quot;Celebration&quot; received mixed reviews from contemporary critics. The song reached the top of the charts in countries like Finland, Italy and Sweden, while reaching the top-ten in other European nations. It became Madonna's fifty-fifth entry to the Billboard Hot 100 and her fortieth number-one song on the Billboard Dance Club chart. The music video uses the Benny Benassi remix of the song. It portrays Madonna and her dancers solo dancing to the song. Cameo appearances are made by her daughter Lourdes and model Jesus Luz.\n\nThe music video was filmed in Milan, Italy between the dates of the 2009 leg of her Sticky &amp; Sweet Tour. The concept of the video is in similarity to the title of the song; celebration of Madonna's career. According to MTV, the video is a throwback to Madonna's Erotica era and encompasses a dark music image. The Benny Benassi remix of the song is used in the video. It starts with Madonna asking the line &quot;Haven't I seen you somewhere before?&quot;. The music starts and the scenes cut between Madonna and her dancers start dancing to the music of the song. Madonna wore a crystal embossed, shouldered dress with knee-high boots. While she is present in almost every frame of the camera, she does not perform choreographed dance moves. Her dance is mostly confined to casual maneuvours. The dancers on the other hand, performed choreographed moves as a solo act. As the song progresses, more dancers are shown and they ultimately reach a club. The DJ in the club is portrayed by model Jesus Luz. Madonna indulges in sensual poses with him and removes his clothes in an attempt to recognize him, as the line &quot;I guess I don't recognize you with your clothes on&quot; is played. The two of them brush their lips together, and Madonna moves away to the dancefloor again. Lourdes makes an appearance near the end of the video. She appears in an eighties styled, polka-dotted leotard and pants, and does a back arch on the ground. Madonna is then shown on the ground on all fours, or dancing while grabbing her groin. Both Madonna's and her dancer's moves were edited to appear in fast forward. Hip-hop styled dancing is showcased towards the end of the video. The end shot of the video portrays Madonna sliding down on the ground. Teaser trailers for the video, showed Oakenfold dancing to the song, but his scenes were edited from the final version.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:145f49603bcec922f593ff5ab278b59903fe2d69","amp;dn":"Madonna+-+Celebration","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"145f49603bcec922f593ff5ab278b59903fe2d69","infoHashBuffer":{"type":"Buffer","data":[20,95,73,96,59,206,201,34,245,147,255,90,178,120,181,153,3,254,45,105]},"announce":[],"urlList":[]}}