{"title":"The WotWots - Scary Sucky Nose_[720x404].mp4","uid":5123496,"size":88926005,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:14ef396b577c2d506583cbbdb9fedd0a8d9a5266&amp;dn=The+WotWots+-+Scary+Sucky+Nose_%5B720x404%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"StryfeNZL","files":1,"time":1255480171,"description":"From the creative minds of the Academy Award-winning Weta Workshop comes the WotWots, a stunning television series for preschoolers.\n\nFilmed at Wellington and Auckland Zoos, this homegrown sensation follows the adventures of two adorable siblings from outer space, SpottyWot and DottyWot. \n\nThese delightful creatures come to explore planet earth in their steam-powered spaceship and arrive in the middle of a zoo. \n\nThis inquisitive and energetic brother and sister duo delight in discovering all the exotic animals that live at the zoo, as they scoot around on their hover-chairs.  \n\nThe WotWots wonder who they are and what they'll look like when they are fully grown adults.  \n\nWill they look like one of the zoo animals outside?\n\nThrough their escapades, the WotWots encourage children to be creative, inventive and expressive as they share their discoveries with their preschooler audience.\n\nThe show is energetic, colourful and entertaining, with all adventures built on one central ingredient which defines the series - the joy of learning and discovery. In each episode the WotWots help children to celebrate and understand the diversity of the animal world. They recognise kindness and co-operation as core values, delight in learning new words and enjoy exploring their creativity through drawing.","torrent":{"xt":"urn:btih:14ef396b577c2d506583cbbdb9fedd0a8d9a5266","amp;dn":"The+WotWots+-+Scary+Sucky+Nose_%5B720x404%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14ef396b577c2d506583cbbdb9fedd0a8d9a5266","infoHashBuffer":{"type":"Buffer","data":[20,239,57,107,87,124,45,80,101,131,203,189,185,254,221,10,141,154,82,102]},"announce":[],"urlList":[]}}