{"title":"Memsahab Lost in Mirage 2008 l 500 MB DvD RiP","uid":5579511,"size":560836539,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:151895cd62fb97a87b16dd9e5b9e5c2679aa7a1a&amp;dn=Memsahab+Lost+in+Mirage+2008+l+500+MB+DvD+RiP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"p9211","files":-1,"time":1274487822,"description":"Cast\n\nYukta Mookhey ... \nAnjali Vijay Raaz Govind Namdeo ... \nKashinath Rafique Khan ... \nRahul Rajpal Yadav Ehsaan Khan\nLalji Mohnish Behl Akshay Verma ... \nNandu Nilanjana Bhattacharya Shoorveer Tyagi \n\n\n\nMemsahab is based on the cruel incidents post the 1984 riots between a section of Hindus and the Sikhs in Delhi and other parts of North India.. Ensuing these riots, the Sikhs were targeted by the Hindu fundamentalists and several Sikh families were ruined.\n\nYukta Mookhey plays the character of Anjali, who is a victim of the riots and is pushed into prostitution. This young girl Anjali?s mother is raped by the villains and her father is shot dead. What an horrifying impact would this have on the girl! This Anjali grows up with such traumatic memories of her childhood.\n\nThe director seeks to portray reality by actually shooting in a few bye lanes of Kamathipura (a red light area in Mumbai), where Anjali is one of the many women indulging in flesh trade. Every night, this woman has a new ?Sahab?.\n\nSome unexpected incidents take place and she stumbles upon the killers of her parents. She starts searching for them and hunting them one by one. In the process where she takes revenge on the killers of her dad, she realizes that the violence wouldn't help her get back her victimized parents. She then realizes that even after taking revenge she still could not erase her traumatic memories of childhood. Wisdom dawns on her and then she takes startling decision in the end.","torrent":{"xt":"urn:btih:151895cd62fb97a87b16dd9e5b9e5c2679aa7a1a","amp;dn":"Memsahab+Lost+in+Mirage+2008+l+500+MB+DvD+RiP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"151895cd62fb97a87b16dd9e5b9e5c2679aa7a1a","infoHashBuffer":{"type":"Buffer","data":[21,24,149,205,98,251,151,168,123,22,221,158,91,158,92,38,121,170,122,26]},"announce":[],"urlList":[]}}