{"title":"Battlestar Galactica (1978) - DvDrip Xvid - Omifast Greek","uid":5024132,"size":1021480192,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1529a9f8abe5412e4f802ae43fef82d3a5495a40&amp;dn=Battlestar+Galactica+%281978%29+-+DvDrip+Xvid+-+Omifast+Greek&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"OmifastGR","files":-1,"time":1248616360,"description":"GREEK SUBTITLES ARE EMBEDDED, YOU CAN NOT TURN THEM OFF.\n\nOriginal DvDrip to Xvid\n\nSample and Trailer Included\n\n-------------------------------------------------------------------------\n\nBattlestar Galactica - The Movie(1978) &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0077215/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0077215/&lt;/a&gt;\n\nAt some point in the distant past, the Nine Colonies (named Gemini, Caprica, Taurus, etc. as per astrological signs) are finally poised to sign a peace treaty with the Cylons, a robot civilization with whom they have fought for centuries. Commander Adama (Lorne Greene), top officer on the Battlestar Galactica, doesn't trust the Cylons to hold to the truce, and sends clandestine patrols out to search for trouble. One of these locates a vast armada of Cylon ships hidden on a nearby planet, ready to strike. The Cyclons launch their pre-planned attack on the unprepared Colonial fleet, and most of the huge Battlestars are wiped out. Only Galactica, protected by her own fighter screen (led by Richard Hatch as Apollo), and with weapons fully armed, is able to escape.\n\nMeanwhile, the Cylon base stars are attacking the main Colonies. All major cities are destroyed, and the Cylons prepare to finish off the surviving humans. The Galactica signals for any and all ships to rally to her, taking whatever survivors they can carry. A rag-tag fleet is soon formed, and they head away to seek their fortune among the stars under the protection of the Battlestar.\n\nUnfortunately, they are quite short on fuel, and are forced to blast a corridor through an old space minefield to reach a planet with fuel supplies. The local inhabitants (an insectoid race) agree to provide the fuel, and even offer to let the Humans rest and recreate at a fancy casino/resort they maintain. Starbuck (Dirk Bendict) grows suspicious when he does too well at the gaming tables. He checks out the lower levels of the facility, and realizes that the insectoid creatures are using humans to nourish their larval young! Also, the locals are in league with the Cylons, and soon betray their whereabouts.\n\nUsing a clever ruse, Commander Adama convinces the Cylons that his fighter pilots are actually on the surface at a banquet, while the real pilots are at full combat readiness. When the Cylon base ships arrive, his forces barely manage to repel them. The humans take their fuel and escape toward a legendary planet supposed colonized by a 10th human colonial group -- Earth.\n\n\nAwards:3 nominations &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0077215/awards&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0077215/awards&lt;/a&gt;\n\nDirector:\nRichard A. Colla\n\nStarring:\nRichard Hatch, Dirk Benedict, Lorne Greene\n\nOriginal DvDrip to Xvid\n\n-----------------------------------------------------------------------------------\n      &lt;a href=&quot;\nhttp://thepiratebay.se/user/OmifastGR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/OmifastGR&lt;/a&gt;\n\n!","torrent":{"xt":"urn:btih:1529a9f8abe5412e4f802ae43fef82d3a5495a40","amp;dn":"Battlestar+Galactica+%281978%29+-+DvDrip+Xvid+-+Omifast+Greek","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1529a9f8abe5412e4f802ae43fef82d3a5495a40","infoHashBuffer":{"type":"Buffer","data":[21,41,169,248,171,229,65,46,79,128,42,228,63,239,130,211,165,73,90,64]},"announce":[],"urlList":[]}}