{"title":"Where.Is.Your.God.Now [Dox]","uid":5070940,"size":17630844,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:15ce5249ef2facbae5f85ecf18a05f01789efe6c&amp;dn=Where.Is.Your.God.Now+%5BDox%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ChiHappens","files":2,"time":1251403412,"description":"A collection of email addresses and passwords to a Christian dating site.\n\n\nDue to the (in)security of users on the Internets, I am forced to alert you all about the stature of its users.\nNow, you see, all these registered emails are often sharing the same password and username globally online. Bad idea. One site's databses get dropped, all your sites get dropped.\n\n\nI am not uploading this collection of documents simply because I dislike Christians; I am doing it to make a point to anyone who uses insecure 'security'. I am hoping anyone who sees this will notice if they use the same passwords and will get different passwords for any site they use. It is of vital importance.\n\n\n\n\nTo any admin or mod reading this: I apologize if this torrent is breaking any rules; I looked through the rules many times before making this file, and see nothing that says that this is not allowed. If it IS NOT allowed, please simply delete it, and send me a message (on IRC) explaining why, thank you.\n\n\n\n\n\n\n\n\n\nEnjoy, keep your online life safe (use Linux, and do not use the same password everywhere; just common sense), so you do not end up like these people!","torrent":{"xt":"urn:btih:15ce5249ef2facbae5f85ecf18a05f01789efe6c","amp;dn":"Where.Is.Your.God.Now+%5BDox%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15ce5249ef2facbae5f85ecf18a05f01789efe6c","infoHashBuffer":{"type":"Buffer","data":[21,206,82,73,239,47,172,186,229,248,94,207,24,160,95,1,120,158,254,108]},"announce":[],"urlList":[]}}