{"title":"Nova Prospect - Usurper (2009) - insane new metal!","uid":5034894,"size":80674255,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:16054c756136e3fbe2782602db4fe831b1cf1706&amp;dn=Nova+Prospect+-+Usurper+%282009%29+-+insane+new+metal%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"d3m0n1k","files":10,"time":1249073685,"description":"Insane New Metal!!!!\n\nNova Prospect, formed in 2006, isn't your standard death metal band at all. Formed on the OH/WV/PA border, this band is a group of six dudes who don't necessarily want to leave this world without having something to remember them by. Music is one hell of an important factor in the lives of the members of this band, and they plan on making some powerful music for you to enjoy and maybe be moved by, especially in your pants. Nova Prospect is a house built with six walls and each one is an important factor. The voices of Bryce Seditz and Matt Tluchowski are fine tuned and a wider ranged than most bands with dual vocalists. Chris Vogagis' mastery of the kit pushes the band and moves the songs along. Rick Miclea holds down and tightens the band with his quick fingers and unreal potential for brutality. Last but not least, the founding members of NP, Doug Hodges and Cory Waugh are continuing the dream they had three years ago of having the hottest and greatest group of dudes to help them make the best music they possibly can. They couldn't ask for more. \n\n\n\n&quot;Usurper&quot; is a relentless death/thrash onslaught with everything from blisteringly fast blast beats and double bass to groovy breaks to ferocious riffing and extremely catchy, memorable choruses. &quot;Usurper&quot; goes above in beyond achieving all that you'd want in a metal album. \n\n\n\nOverall, Nova Prospect is a band that cares about nothing more than writing the absolute best material they can performing it for everyone who wants to hear it. They are completely committed to do whatever it takes to eternally continue their testament to heavy metal.\n\nFans of Black Dahlia, Job For A Cowboy, Dethklock, etc....enjoy!\n\nI know, I know...My upload speed is complete crap!\nBe patient,please....it is worth it.\n\nCOMMENTS ON THE CD WOULD BE APPRECIATED!","torrent":{"xt":"urn:btih:16054c756136e3fbe2782602db4fe831b1cf1706","amp;dn":"Nova+Prospect+-+Usurper+%282009%29+-+insane+new+metal%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16054c756136e3fbe2782602db4fe831b1cf1706","infoHashBuffer":{"type":"Buffer","data":[22,5,76,117,97,54,227,251,226,120,38,2,219,79,232,49,177,207,23,6]},"announce":[],"urlList":[]}}