{"title":"La Tropical","uid":5565209,"size":1462732685,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1696353fd96d36309de892841399e88eb3c4297f&amp;dn=La+Tropical&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rubusdemonoid","files":-1,"time":1273960563,"description":"Please help to seed this torrent when you are completed as my ISP has a monthly limit that I always max out on since I have over 50 torrents that I seed for you all. My ISP is going to terminate my service if I max out my monthly limit, so I just can't continue to seed all by myself so often. PLEASE help to seed. Thank you.  :)\n\n\n\n\nSpanish with hard-coded English subtitles.\n\nIn his first feature film as a director, Pulitzer Prize-winning photographer David Turnley turns his monochromatic lens to the Havana dancehall affectionately known as &quot;La Tropical&quot; to explore the positive affects that the flourishing club has had on Cuban culture since first opening its doors in the segregated 1950s. Founded by a beer company for completely commercial reasons and transcending all expectations by remaining successful even through the Cuban Revolution, La Tropical catered to an almost exclusively Afro-Cuban clientele while gaining a reputation as the place to go to experience the very best in local music. Through intimate interviews with the regulars and employees who have helped the famed venue retain its vitality even in times of social upheaval, Turnley explores just how much impact something as simple as a low-rent musical venue can have on a culture desperate to establish an identity, and how, once found, that same sense of identity can give back to the community in ways the population could never have anticipated.\n\n\n\nMore of my music &amp; movie downloads that you may find of interest are located here: &lt;a href=&quot; http://thepiratebay.se/user/rubusdemonoid/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/rubusdemonoid/&lt;/a&gt;","torrent":{"xt":"urn:btih:1696353fd96d36309de892841399e88eb3c4297f","amp;dn":"La+Tropical","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1696353fd96d36309de892841399e88eb3c4297f","infoHashBuffer":{"type":"Buffer","data":[22,150,53,63,217,109,54,48,157,232,146,132,19,153,232,142,179,196,41,127]},"announce":[],"urlList":[]}}