{"title":"Nayakan (2010).mp4","uid":5656455,"size":732731734,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:17226ea12ca678b41d440a721ee98757b604ee73&amp;dn=Nayakan+%282010%29.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"p9211","files":-1,"time":1277820252,"description":"Director:\n\nLijo Jose Pellisserry\n\nCast:\n\nIndrajith\nDhanya\nSiddhique\nThilkan\nJagathy\nLalu Alex\nSreejith Ravi\nVijay Menon\nRekha Pillai\nSumi\n\nProduced by\n\nAnoop Johnson Karedan\n\nOriginal Music by\n\nPrashant Pillai\n\nSynopsis:\n\nBasically Nayakan is a revenge story on the backdrop of the Kerala art form Kathakali. Indrajith plays the role\nof a Kathakali artist Varadanunni, who takes to revenge on the mighty dons there with the help of an ageing don Vincent\nKaranavar (Thilakan) and his daughter Maria (Dhanya Mary Varghese). The use of Kathakali to narrate the story has been\na new concept and the director has been successful in winning that part. Choosing right from costumes to the characters\nthat Varadanunni chooses to play, there are some links that gives an altogether different mood.\n\n\nThe story has been divided into parts like Purappadu, Kelikkai, Thodayam and Kalasham. The first half of the story seems\nto be an interesting as well as a one with a best format. Although its an already seen concept, it is implemented in a\ndifferent manner. The second half seems to be a bit dragged one and lengthy too and seems to have lost its grip.\n\nIndrajith's performance as Varadanunni is one of his finest performances that need an applause. He has toned his body quite\nwell to suit his role perfectly. It's a pity that such a talented actor is not used very well by the filmmakers here. Thilakan's\nperformance shows why he is still the adorned actor in the industry. Siddique is good at times, but then, it's his lengthy\nrole and confusions surrounding him portray weak links in the whole film. The director's brief role and a brilliant performance\nby the actor who plays a brash cop are the highlights of the film. Heroine Dhanya Mary Varghese fails to impress with her\nacting though she looks quite beautiful.\n\nNayakan is of course the apt title for the film and the credit for it should mainly go to its director, whose signature is there\nall along. Manoj Paramahamsa's visuals is an added advantage to the film and Prashant Pillai's music is the best thing about\nthe film. The back ground score and sound design also make things look impressive. ","torrent":{"xt":"urn:btih:17226ea12ca678b41d440a721ee98757b604ee73","amp;dn":"Nayakan+%282010%29.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17226ea12ca678b41d440a721ee98757b604ee73","infoHashBuffer":{"type":"Buffer","data":[23,34,110,161,44,166,120,180,29,68,10,114,30,233,135,87,182,4,238,115]},"announce":[],"urlList":[]}}