{"title":"Star Trek DVD-Screener Spanish Line 2009","uid":5096029,"size":1159267494,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:17279700e18f05e5dce642133c9045f48c3c5a7d&amp;dn=Star+Trek+DVD-Screener+Spanish+Line+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":2,"time":1253573619,"description":"Nueva entrega de la mÃƒÂ­tica saga de Star Trek, dirigida por el creador de la serie &quot;Perdidos&quot; (Lost), donde se cuenta cÃƒÂ³mo se conocieron el capitan Kirk y Spock. Todo estÃƒÂ¡ preparado para el viaje inaugural de la nave mÃƒÂ¡s moderna que jamÃƒÂ¡s se haya creado: la USS Enterprise. Su joven tripulaciÃƒÂ³n tiene una importante misiÃƒÂ³n: encontrar una manera de detener al malvado Nero (Eric Bana), que movido por la venganza amenaza a toda la humanidad. Pero el destino de la galaxia estÃƒÂ¡ en manos de dos jÃƒÂ³venes rivales que nacieron en mundos diferentes. Uno de ellos, Tiberio James Kirk (Chris Pine), joven de una granja de Iowa que busca emociones, es un lÃƒÂ­der nato a la bÃƒÂºsqueda de una causa. El otro, Spock (Zachary Quinto), que creciÃƒÂ³ en el planeta Vulcano, es un paria debido a su parte medio humana, lo que lo hace susceptible a la inestabilidad de las emociones de los Vulcanos. Pero Spock es tambiÃƒÂ©n un brillante y decidido estudiante. La tripulaciÃƒÂ³n de la USS estÃƒÂ¡ liderada por el CapitÃƒÂ¡n Christopher Pike (Bruce Greenwood). TambiÃƒÂ©n estÃƒÂ¡n el Oficial MÃƒÂ©dico, Leonard &quot;Bones&quot; McCoy (Karl Urban); el hombre que pasarÃƒÂ¡ a ser el ingeniero jefe del buque, Montgomery &quot;Scotty&quot; Scott (Simon Pegg); el oficial de comunicaciones Uhura (ZoÃƒÂ« SaldaÃƒÂ±a); el experimentado Timonel Sulu (John Cho) y el joven de 17 Chekov (Anton Yelchin). Todos se enfrentan a un angustioso primer ensayo.","torrent":{"xt":"urn:btih:17279700e18f05e5dce642133c9045f48c3c5a7d","amp;dn":"Star+Trek+DVD-Screener+Spanish+Line+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17279700e18f05e5dce642133c9045f48c3c5a7d","infoHashBuffer":{"type":"Buffer","data":[23,39,151,0,225,143,5,229,220,230,66,19,60,144,69,244,140,60,90,125]},"announce":[],"urlList":[]}}