{"title":"018-Coast to Coast-goerge knapp and Philip Imbrogno 26 Apr 10 .m","uid":5568114,"size":91781854,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:19cb2f469f9a715154851630c9717e6e8b27c645&amp;dn=018-Coast+to+Coast-goerge+knapp+and+Philip+Imbrogno+26+Apr+10+.m&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"panzerfaust69","files":1,"time":1274055748,"description":"High Strangeness\n\nDate:04-25-10\n\nHost:George Knapp\n\nGuests:Philip Imbrogno\n\nGeorge Knapp welcomed paranormal expert and scientist Philip Imbrogno (book link), who discussed accounts of high strangeness, and his theory of interdimensional contact. Among the unusual cases he studied, was that of a Connecticut executive who told of a UFO encounter, contact with an alien via his TV set, and subsequent experiences of time travel in which he helped to avert a nuclear attack along the East Coast in 2012.\n\nAnother case concerned a woman, who as a child said she had repeated contacts with a silver shape-shifting robot/alien. Years later, the robot reappeared along with a yellow sphere and she was taken to a foggy world illuminated by multi-colored lights, and the being shifted into a hideous entity. Shortly afterward, the woman reported being abducted by government agents who removed some type of device from her body.\n\nImbrogno doubts the Extraterrestrial Hypothesis (that aliens come here from other planets), and finds it more likely that mysterious beings interface with us from another dimension that exists close to ours. This other dimension is likely the source for a host of paranormal beings and creatures, such as the jinn, demons, Bigfoot, ghosts, sea serpents, and the Chupacabras, he added.\nBook(s):\n# Files From the Edge: A Paranormal Investigator's Explorations into High Strangeness\n# Interdimensional Universe\n# Contact of the 5th Kind\n","torrent":{"xt":"urn:btih:19cb2f469f9a715154851630c9717e6e8b27c645","amp;dn":"018-Coast+to+Coast-goerge+knapp+and+Philip+Imbrogno+26+Apr+10+.m","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19cb2f469f9a715154851630c9717e6e8b27c645","infoHashBuffer":{"type":"Buffer","data":[25,203,47,70,159,154,113,81,84,133,22,48,201,113,126,110,139,39,198,69]},"announce":[],"urlList":[]}}