{"title":"WinMend History Cleaner 1.3.2 Incl serial(trees)","uid":5101591,"size":8150539,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1a065840fdb632b3a0b1cbc3b91a5bdb8a62bdb7&amp;dn=WinMend+History+Cleaner+1.3.2+Incl+serial%28trees%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ProDvDRipper","files":2,"time":1254023057,"description":"WinMend History Cleaner is a utility that can comprehensively clean histories produced by various programs in the system. It can effectively scan and clean histories generated by more than 100 programs. These histories include cookies, browsing histories and cache files by browsers such as Internet Explorer, Firefox and histories by a great number of other applications such as Microsoft Office, WinRAR, Windows Media Player and RealPlayer. Clearing these histories not only can boost system speed, but can also effectively prevent your privacy from being disclosed. WinMend History Cleaner can give you a cleaner and safer operating system!\n\n\nFeatures\n1. Comprehensive Scan\nWinMend History Cleaner scans the histories of system programs, browsers and other various applications. Its comprehensive categories help you select, scan and clear history with ease.\n2. Safe Scan Results\nThe scan engine of WinMend History Cleaner can intelligently screen scan targets and leave out results that may affect Windows system files. We guarantee the safe history deletion.\n3. Clear Results Display\nWinMend History Cleaner shows the results with detailed and clear classification. The result list tells you what those histories are, so that you can decide to keep or delete them with much confidence.\n4. Cookies Management\nWinMend History Cleaner manages Internet Explorer cookies independently and makes it easy for users to keep the cookies they need.\n","torrent":{"xt":"urn:btih:1a065840fdb632b3a0b1cbc3b91a5bdb8a62bdb7","amp;dn":"WinMend+History+Cleaner+1.3.2+Incl+serial%28trees%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a065840fdb632b3a0b1cbc3b91a5bdb8a62bdb7","infoHashBuffer":{"type":"Buffer","data":[26,6,88,64,253,182,50,179,160,177,203,195,185,26,91,219,138,98,189,183]},"announce":[],"urlList":[]}}