{"title":"Yo Soy El Solitario - Miniserie Completa DVB Spanish","uid":5050201,"size":1491478046,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1a58cd52893c0d4ede91f3b04a623a7e4c301a69&amp;dn=Yo+Soy+El+Solitario+-+Miniserie+Completa+DVB+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":3,"time":1250160227,"description":"Cuando el pasado julio se detuvo en Portugal a El Solitario, un atracador de bancos al que se acusa de tres asesinatos, Antena 3 corriÃƒÂ³ la voz de que estaba gestando un proyecto con su historia, para que ninguna cadena se le adelantase.\n\nA fecha de hoy ya se confirma que el proyecto estÃƒÂ¡ en un estado muy avanzado, con la producciÃƒÂ³n a cargo de BocaBoca y el rodaje ya empezado. El Solitario serÃƒÂ¡ interpretado por Pepo Oliva, muy conocido por su personaje en CompaÃƒÂ±eros, y el investigador de la Guardia Civil serÃƒÂ¡ interpretado por Emilio GutiÃƒÂ©rrez Caba.\n\nLa historia de El Solitario se hizo cÃƒÂ©lebre porque el atracador mantuvo una constante actitud de burla y de prepotencia ante su detenciÃƒÂ³n. Realizaba los atracos disfrazado y caracterizado con moldes de lÃƒÂ¡tex para ocultar su personalidad y la foto de su ficha policial dio la vuelta al mundo.\n\nEra cuestiÃƒÂ³n de tiempo que una cadena guionizase esta historia porque el personaje puede resultar un atractivo protagonista para una serie, aunque tendrÃƒÂ¡n que enfrentarse a la verosimilitud de la historia porque, en estas circunstancias, va a ser difÃƒÂ­cil determinar quÃƒÂ© hay de verdad en los relatos de alguien como El Solitario, a quien la notoriedad adquirida por la vÃƒÂ­a del crimen le resulta, como poco, divertida.","torrent":{"xt":"urn:btih:1a58cd52893c0d4ede91f3b04a623a7e4c301a69","amp;dn":"Yo+Soy+El+Solitario+-+Miniserie+Completa+DVB+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a58cd52893c0d4ede91f3b04a623a7e4c301a69","infoHashBuffer":{"type":"Buffer","data":[26,88,205,82,137,60,13,78,222,145,243,176,74,98,58,126,76,48,26,105]},"announce":[],"urlList":[]}}