{"title":"Coast to Coast AM July 29th 2009 - Federal Reserve Revealed","uid":5033616,"size":56646162,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1a5d90504b7b4ac7c8f17b4300890ea890a7456a&amp;dn=Coast+to+Coast+AM+July+29th+2009+-+Federal+Reserve+Revealed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ColdWorldx","files":5,"time":1249008180,"description":"Federal Reserve Revealed\n\nDate:\n07-29-09\n\nHost:\nGeorge Noory\n\nGuests:\nG. Edward Griffin, Lionel Fanthorpe\n\nDuring the first three hours, writer and documentary film producer G. Edward Griffin explained how the Federal Reserve system is primarily responsible for our economic crisis. He shared facts about the secret meeting where the Fed was created, and the surprising reality of the Fed's structure and purpose. In 1910, plans for the Federal Reserve were drawn up on Jekyll Island, a resort island off Georgia, that was privately owned by a group of billionaires. At the time, the United States faced severe problems with banking in individual states, and voters were demanding reform. But what was created with the Federal Reserve amounted to a &quot;banking cartel,&quot; said Griffin. The Fed doled out regulations under the guise of a governmental agency, but was actually serving to benefit the members of its own group, he alleged.\n\nThe members of the &quot;cartel&quot; are technically Americans, said Griffin-- the owners of the Federal Reserve System are the member banks in the US, but in many cases we don't know who the controlling interests are of some of the largest banks in America. The Rockefellers remain a banking dynasty, but &quot;I'm sure if we were able to peel back all the layers we would find there's an interlock with European financial interests as well,&quot; he commented. The move today is to coalesce all the world's banking into a global system, and it's quite out in the open, he added.\n\nGovernment/politicians spend more money than they take in in taxes, so they continue borrowing, building up the national debt, Griffin explained. The Fed's loan money to the government in a convenient partnership between the two, yet the Fed is often creating funds out of thin air, he revealed. The Fed's allow private banks to have only 10% in reserves, and lend up to 90%, creating more money out of nothing, which amounts to a license to steal, as they collect on the interest, he continued. The fallacy of the system is that &quot;the money supply must continually expand in order to create the appearance of prosperity,&quot; he noted.\n\nStrange &amp; Ghostly Tales\n\nLast hour guest, storyteller, author, and researcher Lionel Fanthorpe discussed ghostly activities and strange tales. There are two different types of ghosts, he noted-- purposeful ghosts who return for a specific reason, and 'recorded' ghosts who are not aware of us. He cited an example of the former-- a ghost of a monk was said to repeatedly search the floor of a cathedral. But after a valuable coin was found there, the visitations stopped, suggesting that the monk wanted the coin to be discovered.\n\nWebsite(s):\n# gedwardgriffin.com\n# freedomforceinternational.org\n# realityzone.com\n# lionel-fanthorpe.com\n\nBook(s):\n# Creature from Jekyll Island: A Second Look at the Federal Reserve\n# Secrets of the World's Undiscovered Treasures\n# Mysteries and Secrets of Time\n","torrent":{"xt":"urn:btih:1a5d90504b7b4ac7c8f17b4300890ea890a7456a","amp;dn":"Coast+to+Coast+AM+July+29th+2009+-+Federal+Reserve+Revealed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a5d90504b7b4ac7c8f17b4300890ea890a7456a","infoHashBuffer":{"type":"Buffer","data":[26,93,144,80,75,123,74,199,200,241,123,67,0,137,14,168,144,167,69,106]},"announce":[],"urlList":[]}}