{"title":"Mi Vida Es Una Ruina DVDRip Spanish 2007","uid":5069707,"size":730625190,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1b560b848a2765cbc39537c5c3194af95578fbf7&amp;dn=Mi+Vida+Es+Una+Ruina+DVDRip+Spanish+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":2,"time":1251291735,"description":"Bill (Aaron Eckhart) se siente de otro planeta cada vez que estÃƒÂ¡ cerca de la familia de su mujer. Su esposa Jessica (Elizabeth Banks) es encantadora, pero no puede decir lo mismo del padre y del hermano, propietarios del banco en el que trabaja Bill. La familia se reÃƒÂºne para celebrar la inauguraciÃƒÂ³n de la nueva capilla de un colegio privado. En un momento de la celebraciÃƒÂ³n, Bill acaba embaucado en un programa de voluntariado, para hacer de mentor de uno de los estudiantes del colegio. El chico al que Bill tendrÃƒÂ¡ que tutelar es un joven de 15 aÃƒÂ±os, rico y malcriado (Logan Lerman). Tras descubrir las infidelidades de su esposa con Chip (Timothy Olyphant), un presentador de TV, Bill quedarÃƒÂ¡ hundido. Y el trato despectivo de su jefe no ayudarÃƒÂ¡ mucho. El chico le acusarÃƒÂ¡ de ser un pelele y soportar demasiadas humillaciones. Aunque Bill odia admitirlo, el joven listillo tiene razÃƒÂ³n. Bill intentarÃƒÂ¡ dar un golpe de timÃƒÂ³n a su destino de fracasado con la ayuda de su tutelado y de Lucy (Jessica Alba), una guapa empleada de Victoria's Secret.","torrent":{"xt":"urn:btih:1b560b848a2765cbc39537c5c3194af95578fbf7","amp;dn":"Mi+Vida+Es+Una+Ruina+DVDRip+Spanish+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b560b848a2765cbc39537c5c3194af95578fbf7","infoHashBuffer":{"type":"Buffer","data":[27,86,11,132,138,39,101,203,195,149,55,197,195,25,74,249,85,120,251,247]},"announce":[],"urlList":[]}}