{"title":"Fiocchi di Cotone per Jeanie S1e31-38[Xvid - ITA JAP Mp3][TNTVil","uid":5556501,"size":1979271168,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1b68ef7062b3acf341365169cee0f38fc01b7312&amp;dn=Fiocchi+di+Cotone+per+Jeanie+S1e31-38%5BXvid+-+ITA+JAP+Mp3%5D%5BTNTVil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"erik971","files":8,"time":1273702940,"description":"[IMG]http://img374.imageshack.us/img374/vlcsnap56827eu2.png/1/w640.png[/IMG]\n\nFiocchi di cotone per Jeanie ÃƒÂ¨ un anime realizzato nel 1992 dalla Nippon Animation, ed andato in onda per 52 episodi. L'anime ÃƒÂ¨ stato trasmesso su Italia 1 dal giugno 1994. La storia dell'anime ÃƒÂ¨ basata sul romanzo del 1854 Jeannie With the Light Brown Hair di Stephen Foster. L'anime ÃƒÂ¨ accompagnato dalle canzoni composte dallo stesso Sthephen Forster.\n\nDal romanzo era gia stato adattato un anime nel 1979 intitolato Jeanie dai lunghi capelli, di cui Fiocchi di cotone per Janie rappresenta un remake. E' interessante notare che nella serie uno dei plot principali ÃƒÂ¨ rappresentato dalla storia d'amore fra Jeanie e Steven, un chiaro riferimento all'autore Stephen Foster ed a sua moglie Jeanie, a cui il romanzo era dedicato.\n\nLa storia dell'anime comincia in una piccola cittÃƒÂ  in Pennsylvania nel 1838. Jeanie MacDowell ÃƒÂ¨ un graziosa ragazza dai lunghi capelli castano chiaro (benchÃƒÂ¨ graficamente appaiano biondi). Jeanie adora suonare il pianoforte, di cui prende lezioni dalla madre. Steven, un buon suonatore di armonica, e Bill, un ragazzo di colore che suona il banjo, sono i migliori amici di Jeanie. I tre ragazzi suonano spesso insieme come fossero una piccola banda.\n\nTuttavia la vita di Jeanie cambia drammaticamente dopo l'improvvisa morte della madre. Avendo fatto tesoro della triste esperienza, Jeanie decide di dedicare la propria vita nell'aiutare le persone che soffrono per malattia.\n\nFonte: wikipedia","torrent":{"xt":"urn:btih:1b68ef7062b3acf341365169cee0f38fc01b7312","amp;dn":"Fiocchi+di+Cotone+per+Jeanie+S1e31-38%5BXvid+-+ITA+JAP+Mp3%5D%5BTNTVil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b68ef7062b3acf341365169cee0f38fc01b7312","infoHashBuffer":{"type":"Buffer","data":[27,104,239,112,98,179,172,243,65,54,81,105,206,224,243,143,192,27,115,18]},"announce":[],"urlList":[]}}