{"title":"Seventh-day Adventist Church vs. Walter McGill and CSDA Church","uid":5063126,"size":35519579,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:1b72ef9d9d2f7843a75bacedb5ac425a60f0c27a&amp;dn=Seventh-day+Adventist+Church+vs.+Walter+McGill+and+CSDA+Church&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Qinael","files":215,"time":1250799017,"description":"All available online legal papers as of 08/20/2009 tracing the litigation enacted against the Creation Seventh Day Adventist Church by the Seventh-day Adventist denomination. Includes papers from the WIPO domain name dispute and the subsequent U.S. federal court case regarding the name &quot;Seventh-day Adventist.&quot; \n\n---\n\n\n&quot;Have you heard of the Creation Seventh Day Adventists?\n\nMost haven't, and if a certain denomination has it's way, they never will.\n\nMany internet-users are familiar, or at the least aware of, the growing unease with the actions of the Church of Scientology to censor criticism of it's practices. Especially famous is their use of copyright protection as a means to accomplish the ends of silencing it's detractors, and this has lead to a wide variety of protests - from picket-lines to internet attacks - from those who call this a violation of their freedom of speech, citing &quot;fair-use&quot; clauses in the law.\n\nIt can be noted that the American public in general is not particularly friendly towards violations of their first amendment rights, especially when such is done by what many claim to be a business masquerading as a church, using copyright law to protect itself from it's critics.\n\nWhat may surprise many, however, is that this is not a matter limited to the well-known Scientology conflict; another religious organization is doing precisely the same thing, although admittedly, to a far greater extent.\n\nThe Seventh-day Adventist denomination is one not well known among the general populace, however to those that are familiar with them, they are known for beliefs that are considered &quot;outside of the mainstream.&quot; Especially noted, however, is their historical stance regarding that very first amendment in question; particularly the &quot;Establishment Clause.&quot;\n\nAmong those who are aware of the reputation the denomination has in this regard, are many who may be very surprised to learn that in 1981, the General Conference Corporation, that is the leading and managing body of the Seventh-day Adventist denomination, received a trademark on the name &quot;Seventh-day Adventist&quot; from the U.S. Patents and Trademarks Office.\n\nIn the years following, they continued to maintain a religious liberty department and protest very vocally regarding the rights of Sabbath-keepers - those who keep Saturday as the Sabbath, which their church is known for - to not be discriminated against for their beliefs. Simultaneously, they were involved in several lawsuits against people calling themselves Seventh-day Adventists while being outside of their church structure, one of which ended in jail-time for the prosecuted party.\n\nIn almost all instances during this long history of litigation, the defendants have maintained a constant position; each one claimed that the name &quot;Seventh-day Adventist&quot; was a matter of who they are and what they believe, not of a product or business. An interesting point to note is that Seventh-day Adventism is also well-known for it's acceptance of a woman named Ellen G. White as a source of inspired counsel; essentially, they believe her to be a prophet.\n\nFor a Seventh-day Adventist, then, the statement of this woman that &quot;The name Seventh-day Adventist is the name the Lord has given us,&quot; has a special meaning. It means that, as a matter of faith, one must call themselves a Seventh-day Adventist if they subscribe to the common beliefs of the church; and that there really is no other term that can be applied to someone who keeps the seventh-day Sabbath, believes in Ellen G. White as a prophetess, and the various other distinctive beliefs of Seventh-day Adventism.\n\nWalter McGill and the Creation Seventh Day Adventists are no exception in this regard. The various groups and individuals against whom the Seventh-day Adventist leadership have brought suit have had various reasons for their separations from the church; ranging from vast changes in doctrine having taken place in the church, to outrage at the actions of the denomination in this very matter of trademark prosecution.\n\nWhether one agrees with the CSDAs, as they are called, regarding their distinct doctrines is a matter to be taken up with them; but the simple fact remains that, right or wrong, the Constitution grants them the right to practice their beliefs free from the regulation of the government, so long as such practice does not cause damage to other's property or livelihood.\n\nThis is the crux of the issue - does the court have a right to decide who are the &quot;True Seventh-day Adventists?&quot; What about if the court should endeavor to decide who are the &quot;True Protestants?&quot; What if it should endeavor to define who is a &quot;True Christian&quot; or a &quot;True Jew&quot; or a &quot;True Muslim?&quot;\n\nThis is the very essence of establishing a religion - not as the &quot;Official State Church,&quot; but as the only possible authentic Church of that type. There can be no Seventh-day Adventists outside of the denomination's control, because Seventh-day Adventists have to call themselves that - and the courts have been forbidding them to do this for almost 30 years.\n\nWe, as a society, understand some very basic principles regarding faith and belief. We understand that if a man is held at gunpoint and asked if he is a Christian, he must, if he is one, answer &quot;Yes&quot; if he is to be true to his faith.\n\nWe conclude the same for a Protestant, a Catholic, a Mormon, or a Seventh-day Adventist. It would be a denial of their beliefs and their God to deny what they are when held at gunpoint; those who risk and suffer death for the sake of honesty are hailed as courageous and valiant martyrs.\n\nBut change &quot;gunpoint&quot; to &quot;lawsuit&quot; and suddenly, everything changes.&quot;","torrent":{"xt":"urn:btih:1b72ef9d9d2f7843a75bacedb5ac425a60f0c27a","amp;dn":"Seventh-day+Adventist+Church+vs.+Walter+McGill+and+CSDA+Church","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b72ef9d9d2f7843a75bacedb5ac425a60f0c27a","infoHashBuffer":{"type":"Buffer","data":[27,114,239,157,157,47,120,67,167,91,172,237,181,172,66,90,96,240,194,122]},"announce":[],"urlList":[]}}