{"title":"bruno R5.XviD-COALiTiON","uid":5075341,"size":734480384,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1b90312f6ca5ff3f6359ff7718a5c64bf0e6af26&amp;dn=bruno+R5.XviD-COALiTiON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"joiflon","files":1,"time":1251779236,"description":"BrÃƒÂ¼no is a gay Austrian fashion reporter impersonated by the man that notoriously starred as Borat in... Borat.\n\n(For those that have seen Borat: you probably know what to expect. If you did not like Borat for the painfully explicit content, stay away from BrÃƒÂ¼no. If you almost died of laughter during a certain hotel scene in Borat, go see BrÃƒÂ¼no immediately and prepare for almost certain death.) \n\nObviously, having made Borat, the producers of BrÃƒÂ¼no had a hard time to repeat the surprise effect. It should therefore not come as a surprise that the movie contains substantially less confrontations between the main character and innocent (famous) bystanders. Still, confrontations with a number of people, among which a few famous ones, seem sincere, and work on multiple levels, as in Borat. Others are clearly scripted, but not less funny for that (watch the ending credits for an example).\n\nIn general, compared to Borat, BrÃƒÂ¼no focuses more on a) effectively shocking it's viewers with the (sexual) misconduct of the main character and b) stunts of this main character in front of a large audience. Essentially, this time the shock effect is moved from the 'random' people that appear in the movie, to the audience looking at the movie.\n\nFor many, it will definitely be more shocking than Borat, given the shamelessly explicit content that exploits every possibility for jokes concerning men making out. For others, the never-ending provoked racism of Borat will have a longer-lasting impact.\n\nAll I know is that I laughed a lot during this movie. It will once again lead to lots of controversy and imitation at thousands of workplaces around the globe. Maybe it is therefore best if you know what it is about.\n\nBut be warned. If you are easily offended, you will be offended. Majorly.\n","torrent":{"xt":"urn:btih:1b90312f6ca5ff3f6359ff7718a5c64bf0e6af26","amp;dn":"bruno+R5.XviD-COALiTiON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b90312f6ca5ff3f6359ff7718a5c64bf0e6af26","infoHashBuffer":{"type":"Buffer","data":[27,144,49,47,108,165,255,63,99,89,255,119,24,165,198,75,240,230,175,38]},"announce":[],"urlList":[]}}