{"title":"The Health Wyze Report - Episode 6","uid":5023407,"size":41804374,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1c57537b5ba8bec3c412809f2b5665e3fb2ac196&amp;dn=The+Health+Wyze+Report+-+Episode+6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mandalasarah","files":1,"time":1248575487,"description":"This episode briefly describes the new health care reform bill, H.R. 676, which does not reform health care, but instead offers another incentive for illegal aliens to sneak into this country. We explain that S.S.R.I. antidepressants, which are known for causing psychotic reactions, also fuel future diseases by causing extreme malnutrition. Also discussed are the chemicals (such as MSG), which are hidden in your foods behind intentionally deceptive labeling, and the pesticide fumes inhaled through air 'fresheners'. Additionally covered are the many foods and drinks, which are consumed in the name of health, but are actually toxic, with an emphasis on chewing gums and flavored waters, including the dirty trick used to get &quot;sugar free&quot; labels on products laced with sugar. We also mention the political games which have led to the changed names of diseases by the medical establishment, ignoring science when it is unpopular, and the whole (but unpopular) truth about HIV/AIDS. We also discuss how and why to avoid synthetic vitamins.\n\nThis has been released into the public domain by the Naturally Good Magazine Staff. Redistribution is encouraged. ","torrent":{"xt":"urn:btih:1c57537b5ba8bec3c412809f2b5665e3fb2ac196","amp;dn":"The+Health+Wyze+Report+-+Episode+6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c57537b5ba8bec3c412809f2b5665e3fb2ac196","infoHashBuffer":{"type":"Buffer","data":[28,87,83,123,91,168,190,195,196,18,128,159,43,86,101,227,251,42,193,150]},"announce":[],"urlList":[]}}