{"title":"Coast  (BBC - Series 3 - Complete)","uid":5065184,"size":6253266991,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1db92d80684498800f7ccacf4808a4785ec2b65f&amp;dn=Coast++%28BBC+-+Series+3+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"eddie1969","files":9,"time":1250981957,"description":"TV : Documentary : DVD quality : English\n \n\nThe journey continues in the third and most ambitious series of the BAFTA award winning series. Coast's team of experts explore new stretches of British coastline and visit a few old favourites, discovering fresh stories and hidden secrets from the northern most tip of Britain to the continental charms of the Channel Islands. Uncover the fascinating stories of the people who live where land and sea meet.\n\nAs usual, the series takes an innovative cross-genre approach to documentary TV by bringing together social and natural history, ecology, technology, science of environmental change and other fascinating details. Resident experts, archaeologist and author Neil Oliver, doctor and anatomy expert Alice Roberts, archaeologist Mark Horton, zoologist Miranda Krestovnikoff, geographer and journalist Nicholas Crane - are on hand once again to guide viewers through eight more journeys around the most extreme edges of the British Isles.\n\nPart 1: Shetland to Orkney\nOver 230 islands make up the Northern Isles - The Shetland and Orkney. These magnificent islands are made up of rock stacks, secret inlets and spectacular scenery, surrounded by sometimes extreme sea and weather conditions that have shaped these islands.\n\n\nPart 2: Bournemouth to Plymouth\nThe stunning stretch of coast has attracted holidaymakers for years and is one of the most exclusive places in the world to live. It has seen some remarkable engineering feats, from battling against the sea to build a lighthouse on the Eddystone Rocks to the construction of a coastal railway.\n\n\nPart 3: Southport to Whitehaven\nThis stretch of coast is not just the playground of the industrial north. World events have reached here, and it has seen innovations that have impacted on every part of the globe, making it a truly international coast.\n\n\nPart 4: Cardiff to St Davids\nThis stretch of coast is rich in industry - both past and present. It has many beautiful and breathtaking sites, with the Gower Peninsula being the first Area of Outstanding Natural Beauty in the UK.\n\n\nPart 5: Berwick-upon-Tweed to Aberdeen\nThe east coast from Berwick-upon-Tweed to Aberdeen is Scotland's Capital coast. Events that started here have shaped the British Isles as we know it today.\n\n\nPart 6: Galway to Baltimore\nFor thousands of years, the west coast of Ireland has been gnawed and mauled by the Atlantic. But this relentless pneumatic drilling by gales, wind, waves and rain has helped carve a coastline of truly majestic beauty.\n\n\nPart 7: Kings Lynn to Felixstowe\nThe Coast team journey around the breathtaking shoreline of East Anglia.\n\n\nPart 8: Channel Islands to Dover\nThe last journey in the series starts in the Channel Islands as the team make their way back to Dover, where their epic adventure around the shore began.\n\n\n\n\nVideo Codec: XviD\nVideo Bitrate: 1570 kbps\nVideo Resolution: 704x384\nVideo Aspect Ratio: 1.833:1\nframes Per Second: 25.000\nAudio Codec: AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: English\nRunTime Per Part: 59 mins\nNumber Of Parts: 8\nPart Size: 746mb\nSubtitles: NO\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:1db92d80684498800f7ccacf4808a4785ec2b65f","amp;dn":"Coast++%28BBC+-+Series+3+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1db92d80684498800f7ccacf4808a4785ec2b65f","infoHashBuffer":{"type":"Buffer","data":[29,185,45,128,104,68,152,128,15,124,202,207,72,8,164,120,94,194,182,95]},"announce":[],"urlList":[]}}