{"title":"EMERGENCY! Lyndon Larouche, Lindsey Williams and Gerald Celente","uid":5066666,"size":4515233792,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1f9fab8da4daee9b94f2db006fc5bf1f4699a4a4&amp;dn=EMERGENCY%21+Lyndon+Larouche%2C+Lindsey+Williams+and+Gerald+Celente&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"thisisthat33","files":1,"time":1251045639,"description":"NEW UPDATE! 12-11-09\n\nFolks, a major city will be attacked in a very short time. It is delayed because people know. The new information talk about something before christmas. My warning will be here but if we have succeeded stopping the attack even after late 2009 i have no more time to give. \n\nPART 2\n\n\nTIME TO WAKE UP! The hour is near. I beg on you listen to these people and get on your knees and take Jesus Christ as your saver.\n\nThis year 2009 or the next years ahead will be hard and the people in New York City, Manhattan area will feel a big scary happening and that will be the start for a new global money system effecting all people all over the world because the elite have a plan for the next 3 years ahead and they are scared only for one thing: The people!\nLEAVE the area New York, Manhattan, New Jersey, Washington and the places around it RIGHT NOW! If this fails the warning will still be here because the timeline can be changed.\n\nThe CIA has a database which they can use to track down if certain words or group of words are being used anywhere online. If they happened to find out that their &quot;secret&quot; plan has been exposed on the exact date or time frame, then they simply can not go further with the plan so therefore: Combined disasters...Just look at the illuminati card game people!!! It is going to happen and don't think it gonna happen now. Obama and Rockefeller ? Obama must get through with his sick reform first and Rockefeller with his Internet stop. just wait...OR take action to stop this! a clue...the church on the card &quot;Combined Disasters&quot; what time is it? Hmmm. maybeÃƒÂ¯Ã‚Â»Ã‚Â¿ CIA read this. in this case. Congratulations we have just figured out your illuminati plan. We know what you are doing.\n\n\n\nPLEASE it is time to understand that this is not going to be better! You can not do anything about this only stop their agenda about date and time! All this has to be done and you better wake up now when we still have time to do something for our lives.","torrent":{"xt":"urn:btih:1f9fab8da4daee9b94f2db006fc5bf1f4699a4a4","amp;dn":"EMERGENCY%21+Lyndon+Larouche%2C+Lindsey+Williams+and+Gerald+Celente","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f9fab8da4daee9b94f2db006fc5bf1f4699a4a4","infoHashBuffer":{"type":"Buffer","data":[31,159,171,141,164,218,238,155,148,242,219,0,111,197,191,31,70,153,164,164]},"announce":[],"urlList":[]}}