{"title":"The Rising: Before They Were Left Behind  (unabridged)","uid":5098333,"size":299514733,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:205e90b0f06f2f7a5fa83b5a8bfeeddd36cba4ae&amp;dn=The+Rising%3A+Before+They+Were+Left+Behind++%28unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FractalFlame","files":-1,"time":1253763992,"description":"The Rising: Before They Were Left Behind is the thirteenth novel in the Left Behind series and the first prequel. It was written by Tim LaHaye and Jerry B. Jenkins in 2005. The paperback edition has the title and subtitle as The Rising: Antichrist Is Born / Before They Were Left Behind.\n\n--\n\nThe Rising is Prequel 1 of 3 in the books leading up to the events mentioned in Left Behind itself. It focuses 27 years before the main Left Behind series starts.\n\nMarilena Carpathia has only one dream: to be a mother. So when a mysterious clairvoyant promises the fulfillment of this dream, Marilena does not hesitate. Through genetic engineering and the power of the Prince of Darkness himself, Marilena is about to become a chosen vessel, one who will unknowingly give birth to the greatest evil the world has ever known.\n\nHalfway around the world, God's plans are subtly being carried out too. Young Ray Steele is determined to avoid one day taking over the family business. Instead, Ray sets his heart on becoming a pilot.\n\nSoon Carpathia and Steele's lives will intersect. And good and evil will clash in an explosion that will shake the world.","torrent":{"xt":"urn:btih:205e90b0f06f2f7a5fa83b5a8bfeeddd36cba4ae","amp;dn":"The+Rising%3A+Before+They+Were+Left+Behind++%28unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"205e90b0f06f2f7a5fa83b5a8bfeeddd36cba4ae","infoHashBuffer":{"type":"Buffer","data":[32,94,144,176,240,111,47,122,95,168,59,90,139,254,237,221,54,203,164,174]},"announce":[],"urlList":[]}}