{"title":"Met-Art.video.DMA4_201002.1080P.Avi","uid":5563542,"size":1090814649,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:219ecdc30ac26bec41c3aa7b9abf3255b0ade8ae&amp;dn=Met-Art.video.DMA4_201002.1080P.Avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"perses","files":-1,"time":1273913528,"description":"This is my very first attempt at uploading a torrent so any CONSTRUCTIVE suggestions on changes for next time would be more than welcome.\n\nI have ALL Met-Art videos and would be willing to upload more if there is enough interest in them. The video qualities and resolutions, and therefor filesizes do vary greatly. This video is the highest resolution available at 1080 x 1920 so most others are much smaller in size.\n\n==================================================================\n\nWelcome to MET ART! As you probably already know we offer the largest, freshest, classiest collection of nude art and fine photography in the world. Our daily updated site offers beautiful, natural, nude girls captured in sensuous, professional, dazzling photos of the highest aesthetic quality by the World's best photographers! MET also has an extensive archive of high quality movies MET ART is  a  complete  immersion  in  flawless beauty.  Welcome to  the   most   imitated  nude  art   site  in the World.\nMost Of New Famous Models On The Web Pose First For MetArt. We Have Been, For Years, The Biggest Talent Scout Website On The Net. Here Are Some Of Our Over 2000 Models. Met-Art Features A Staggering Amount Of New Models; On Average, These Days, We Present A New Face Almost Every Day. If A New Beautiful Girl Is Anywhere To Be Found, Most Likely You Will Find Her Here First. It's No Secret That The Biggest Names In Nude Media, And Most Nude Sites On The Web, Visit MetArt On A Daily Basis For Inspiration. Met-Art Is The Original Pure Beauty Site. Everything Else Is A Mere Copy, Featuring Mostly Our Discarded Photographers, And Models. That Is Why We Are The One And Only Number 1 Nude Site In The World. \n\nSASHA J \nAge: 20\nEyecolor: GREEN\nHaircolor: BLOND\nHeight: 166 cm\nWeight: 47 kg\nBreast Size: Small\nMeasurements: 87/60/91\nCountry: Russian Federation\nEthnicity: Caucasian\nBio: I love to travel. I like to swim, going kayaking and living in a tent. I like the eastern culture and want to visit India really badly. I love \n\nplaying sports, fitness, and also to scamper around the stadiums. I sometimes take part in competitions run by the institute. I ride bicycles all the \n\ntime with friends.\n\n==================================================================\n\nEnjoy!\n\n\n\n\n\n\n\n\n\n\n\n\n[http://bayimg.com/EamEOAACL]","torrent":{"xt":"urn:btih:219ecdc30ac26bec41c3aa7b9abf3255b0ade8ae","amp;dn":"Met-Art.video.DMA4_201002.1080P.Avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"219ecdc30ac26bec41c3aa7b9abf3255b0ade8ae","infoHashBuffer":{"type":"Buffer","data":[33,158,205,195,10,194,107,236,65,195,170,123,154,191,50,85,176,173,232,174]},"announce":[],"urlList":[]}}