{"title":"2010 Tour De France (in HD) - Prologue - 2010-07-03 (Cycling)","uid":5669593,"size":2477057779,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:21ec21470732b79d17016001fb83b884b85297a6&amp;dn=2010+Tour+De+France+%28in+HD%29+-+Prologue+-+2010-07-03+%28Cycling%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Bumpcityfunk","files":4,"time":1278292280,"description":"TV Show: Prologue of the 2010 Tour De France\nAir Date: Saturday, July 3, 2010\nNetwork: Versus HD (Live Coverage)\nVideo Codec : 2-pass H.264 (M4V extension)\nResolution : 710 x 404p\nAudio Codec : AAC Dolby Logic; Stereo; 160 kbps\nAnnouncers: Phil Liggett &amp; Paul Sherwen\nFiles: Part 1 - M4V H.264 (818MBs) Part 2 - M4V H.264 (759MBs) Part 3 - M4V H.264 (783MBs)\n\nSPECIAL NOTE: To get updates from me on the capturing, editing, and compression process of the torrents, you can get more information by visiting a Twitter page I created atI created this so that you will all have a good idea on when to expect the torrents in the coming weeks.\n\nTORRENT NOTE: This video has been edited with no commercials and covers the entire race live, no highlights. Part 1, Part 2, &amp; Part 3 are separate files so that you can download Part 1 first to watch the race while you are downloading Part 2 &amp; 3. All coverage is live and none of the race was removed during the commercial removal process. Enjoy.\n\nPROLOGUE DETAILS:\n[img]http://www.letour.fr/PHOTOS/TDF/2010/0/CARTE.gif[/img]\n[img]http://www.letour.fr/PHOTOS/TDF/2010/0/PROFIL.gif[/img]\nType: Individual time-trial\nWeather: Cloudy with a Chance of Rain\nStart And Finish: Rotterdam\nDistance: 8.9 km (5.5 Miles)\n\nStage Profile: By Paul Sherwen\nJuly 2, 2010\n\nThe prologue has always been used as a showcase and this year is no exception as it shows off the ultra modern backdrop of downtown Rotterdam -- the fourth largest sea port in the World and the largest in Europe.\n\nPainted against this backdrop will be the best bike riders in the world and some of the greatest specialists at this &quot;race of truth&quot;. At just inside of 9km its length will be ideal for the biggest specialist in the world at the discipline, Fabian Cancellara, who will want to continue with his stellar season.\n\nWith the difficult first three days of the Tour through Belgium and Holland, the Swiss Olympic champion at the time trial would love to grab the lead and hold on to it for the first week.\n\nThe route is mainly flat and straight boulevards, which lends itself to Cancellara as a rider who can use the impressive power that helped him win Tour of Flanders and Paris Roubaix this year. However, he is not the only specialist at this race against the clock.\n\nIf Cancellara is the man to beat, then you have to think about Bradley Wiggins on the new Sky Team as a real challenger. He has been Olympic champion in the individual pursuit and has prepared specifically for this stage.\n\nPersonally, I cannot discount Alberto Contador who will be up to show those who wish to challenge him over the first three dangerous stages that he's ready to take them on.\n\nOf the other challengers, the Schleck brothers will want to make sure that they don't lose too much time in their least favorite side of the sport. As always, despite the beauty of the race of the clock it gives a clear indication of who's ready and who isn't.\n\nRoll on tomorrow. Ohh - and don't forget to wish the men in Orange, the Dutch &quot;footie&quot; team good luck tonight in their World Cup tie against Brazil. It'll be a tough one, too.","torrent":{"xt":"urn:btih:21ec21470732b79d17016001fb83b884b85297a6","amp;dn":"2010+Tour+De+France+%28in+HD%29+-+Prologue+-+2010-07-03+%28Cycling%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21ec21470732b79d17016001fb83b884b85297a6","infoHashBuffer":{"type":"Buffer","data":[33,236,33,71,7,50,183,157,23,1,96,1,251,131,184,132,184,82,151,166]},"announce":[],"urlList":[]}}