{"title":"Outbreak(multi-subs)(2Lions-Team)","uid":5498710,"size":4386019587,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:221b528ec027bfd73f09049c40704acb9a2a6a67&amp;dn=Outbreak%28multi-subs%29%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JUULTJE","files":-1,"time":1271379476,"description":"Outbreak  (1995) \n\nVerenigde Staten\nActie / Thriller\n125 minuten\n\ngeregisseerd door Wolfgang Petersen\nThriller van Wolfgang Petersen met Dustin Hoffman, Morgan Freeman en Kevin Spacey - in Afrika wordt een aan Ebola verwant dodelijk virus gevonden\n\nIn Afrika wordt een aan Ebola verwant dodelijk virus gevonden door een team virologen. Het virus, dat zich via de lucht verspreidt, is dan al verantwoordelijk voor de gruwelijke dood van de bevolking van een heel dorp. Ondanks pogingen het virus te isoleren, komt de gevaarlijke ziekte in de Verenigde Staten terecht. De gastheer is een aapje dat bedoeld is als huisdier, maar het dier ontsnapt en trekt een dodelijk spoor. Voor de militaire viroloog Sam Daniels en zijn ex-vrouw Robby, ook een virologe, breekt er een race tegen de klok aan om het virus te isoleren, de paniek onder controle te brengen en de oorspronkelijke gastheer te vinden. Zonder de drager is het namelijk onmogelijk een vaccin tegen de dodelijke ziekte te ontwikkelen\n\nEngels\n\nA virus similar to Ebola &amp; Lassa is discovered in Africa in 1969. 25 years later, it resurfaces - and Col. Sam Daniels of the U.S. Army is sent in to investigate it. When he returns he warns his boss, Brigadier-Gen. Ford, of the lethal nature of the virus and wants to put out an alert. Ford, who had been one of the men who first dealt with the virus, insists the virus is contained and unlikely to show up in the U.S. What neither man knows is that the host - a monkey - has been brought into the U.S. by freighter. Through an under-the-table bribe, a young man gets the monkey out of the animal-testing lab it was bound for. Soon, the man is infected - and Col. Daniels' ex-wife, Dr. Keough - now with the CDC - is called into Boston when the young man is brought to a hospital in critical condition. Dr. Keough discovers that the man has died from the virus, and at the same time - on the other side of the country - a new outbreak is starting in a little California town. A quarantine is set up to stop the virus from spreading, while Ford's boss, the sinister Major-Gen. McClintock, has his own agenda in mind - to harness this lethal bug for use as a bioweapon. With the President about to order a fuel-air bomb to be dropped on the little town to stop the outbreak, Daniels must find a way to unravel McClintock's sinister plan.\n\nWeblink http://www.imdb.com/title/tt0114069/\nWeblink http://www.moviemeter.nl/film/478\n\nVideo                 : DVD Rip\nAudio                 : Engels,Frans,Italiaans\nSubs                  : Engels,Frans,Italiaans,Nederlands,Arabisch,Spaans,Portugees,Engels voor slechthorenden\nID                    : 0xE0\nFormat                : MPEG Video\nFormat version        : Version 2\nBit rate mode         : Variable\nWidth                 : 720 pixels\nHeight                : 576 pixel\nDisplay aspect ratio  : 16:9\nFrame rate            : 25.000 fps\nStandard              : PAL\nCover                 : Yes\n\n\n*****************************************\n\nBrought to you by Juultje\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                          &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\t\t\n\n\n","torrent":{"xt":"urn:btih:221b528ec027bfd73f09049c40704acb9a2a6a67","amp;dn":"Outbreak%28multi-subs%29%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"221b528ec027bfd73f09049c40704acb9a2a6a67","infoHashBuffer":{"type":"Buffer","data":[34,27,82,142,192,39,191,215,63,9,4,156,64,112,74,203,154,42,106,103]},"announce":[],"urlList":[]}}