{"title":"Leap Year With Greek Subs","uid":5571633,"size":735655776,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:22278c1f6941ac8ee8e46f9e2d8e547fa2172e21&amp;dn=Leap+Year+With+Greek+Subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DimoAn","files":-1,"time":1274266927,"description":"Trailer:\n\nA woman who has an elaborate scheme to propose to her boyfriend on Leap Day, an Irish tradition which occurs every time the date February 29 rolls around, faces a major setback when bad weather threatens to derail her planned trip to Dublin. With the help of an innkeeper, however, her cross-country odyssey just might result in her getting engaged.  \n\n-----------------------------------------------------------------------------------\n\nOverview:\n\nUser Rating: 6.1/10  4,329 votes\nMovie Meter: Down 36% in popularity this week.\nDirector: Anand Tucker\nRelease Date: 8 April 2010\nGenre: Comedy | Romance\nTagline: Anna planned to propose to her boyfriend on February 29th. This is not her boyfriend. \n\n-----------------------------------------------------------------------------------\n\nAdditional Details:\n\nRuntime: 100 min \nCountry: USA | Ireland \nLanguage: English\nAspect Ratio: 2.35:1\nSound Mix: DTS Dolby Digital SDDS\nCompany: Universal Pictures \n\n-----------------------------------------------------------------------------------\n\nGoofs:\n\nWhen Anna and Jeremy are at the restaurant, Jeremy says they &quot;might have to go in through the spine.&quot; No surgery of any kind ever goes &quot;through the spine,&quot; particularly any cardiac surgery. In human anatomy, the common term &quot;spine&quot; actually is the vertebral column. The statement made by Jeremy literally would mean you would split the patient's vertebrae to get to the heart.\n\n\nErrors in geography: Despite supposedly being in Dingle, Co. Kerry, the end of the film is quite recognisably the ancient fort of Dun Aongus on the Aran Islands, about 5 hours drive from Dingle.\n\nThe carrots that Anna picked from the garden were not the same carrots that she was chopping in the kitchen in the next scene. The garden carrots were rather small and thin. The carrots in the kitchen were much larger and thicker.\n\nWhen flying from Boston to Dublin, Anna's flight is diverted to Wales. Unless she had a layover in London, the more likely diversion would be to Shannon Airport in the West of Ireland. After all the flights are canceled, she then takes a boat from Wales to Dingle. Again, unlikely since Dingle is on the west coast of Ireland. While in Dingle, it is shown to be a tiny village, which it is not as small as depicted. Also, several shots are shown on the Cliffs of Moher. Which is North of Shannon, whereas Dingle is south of Shannon.\n\n-----------------------------------------------------------------------------------\n\n                          Enjoy And Please Seed :D\n\n","torrent":{"xt":"urn:btih:22278c1f6941ac8ee8e46f9e2d8e547fa2172e21","amp;dn":"Leap+Year+With+Greek+Subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22278c1f6941ac8ee8e46f9e2d8e547fa2172e21","infoHashBuffer":{"type":"Buffer","data":[34,39,140,31,105,65,172,142,232,228,111,158,45,142,84,127,162,23,46,33]},"announce":[],"urlList":[]}}