{"title":"Invasor Zim","uid":5053684,"size":2897322477,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:224448279c2d2599dbf1c6875acf588feabd076c&amp;dn=Invasor+Zim&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":-1,"time":1250291708,"description":"Invasor Zim (en inglÃƒÂ©s Invader Zim) es una serie de televisiÃƒÂ³n, que fue transmitida por Nickelodeon en el 2001 en Estados Unidos, creada por el dibujante y guionista Jhonen Vasquez y dirigido por Steve Ressel, tambiÃƒÂ©n conocido por sus comics: Johnny The Homicidal Maniac, Filler Bunny, SQUEE! y I Feel Sick.\n\nLa trama gira alrededor de un extraterrestre llamado Zim, originario del Imperio Irken, cuyo deseo es controlar todo el universo. Los MÃƒÂ¡s Altos lo envÃƒÂ­an, junto al robot G.I.R., a colonizar un planeta desconocido y lejano para deshacerse de su inutilidad y los destrozos que deja a su paso. Ese planeta es la Tierra y allÃƒÂ­ Zim encuentra a su nÃƒÂ©mesis, Dib.\n\nInvasor Zim es una serie llena de sarcasmo, crÃƒÂ­ticas sociales, humor negro, exagerado y de temÃƒÂ¡tica oscura. A pesar de tener buena aceptaciÃƒÂ³n por parte del publico, Nickelodeon cancelÃƒÂ³ la serie en 2002, dando como motivos, la falta de audiencia del publico infantil ya que la mayoria de los fans de la serie eran jovenes y adultos, por considerar que era muy &quot;oscura&quot; para un pÃƒÂºblico infantil y por diferencias con los escritores de la serie y con su creador Jhonen Vasquez. La cancelaciÃƒÂ³n de la serie dejÃƒÂ³ al menos 7 episodios y una pelicula que servirÃƒÂ­a como final de la serie, incompletos.","torrent":{"xt":"urn:btih:224448279c2d2599dbf1c6875acf588feabd076c","amp;dn":"Invasor+Zim","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"224448279c2d2599dbf1c6875acf588feabd076c","infoHashBuffer":{"type":"Buffer","data":[34,68,72,39,156,45,37,153,219,241,198,135,90,207,88,143,234,189,7,108]},"announce":[],"urlList":[]}}