{"title":"British Teen Girls 9 (DVD.xvid) - anal + DP","uid":5096471,"size":733673472,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2264f38d251807bf035a9068b5adb01a614afa55&amp;dn=British+Teen+Girls+9+%28DVD.xvid%29+-+anal+%2B+DP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pure_screens","files":1,"time":1253617336,"description":"UK Student House 7\n\n\n\nscreens (+ DVD-covers): &lt;a href=&quot;\nhttp://www.cmylink.com/BritishTeenGirls9&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cmylink.com/BritishTeenGirls9&lt;/a&gt;\n\n\n\n\nAKA:\n\n* British Teen Girls Volume 9\n* UK Student House 7: Cum And Meet The Girls\n\n\n\n\nWith a new director on board, Terence Alan Watkins, the nymphomaniacs at the Student House are still as active as ever. The production team have a winning formula, and they're not going to change it - well not much anyway. Like episode 6, the scenes this time are loosely linked.\n\nSarah and Karina Curie are having a gossip about the rest of the girls in the house. Sarah explains that she has an interview for a part time job, which turns out to be with Lee Henshaw and Dimitri. Sarah has dressed demurely in white shirt, tie and trousers, but in no time she's down to her red undies and black stockings. The action ranges over the desk, chair and floor with both guys, anal with Lee followed by a reverse cowgirl dp. The dp is seen almost entirely in close-up so we miss out on Sarah's reactions. The scene ends with Lee shooting over her bum and a facial from Dimitri. Sarah is a tall, slim blonde girl who I haven't seen before but, based on this performance, one I look forward to seeing again.\n\nKarina decides to give her (real life) boyfriend Arran, as Viper, a treat and pops round to the garage where he works. Arran unzips his overalls and soon has Karina stripped to her high heels. Oral and 69 on the floor is followed by Karina easing herself onto Arran's cock. Karina looks superb and, for Karina fans, the video is worth the money for this scene alone. Non Karina fans won't be disappointed either. The action continues all over the workshop, but there is no anal and the scene ends with a languid facial.\n\nBack at the house Steve Hooper and Bonnie Heart are in the sitting room with the house's dildo-queen Louise Louellen. Louise is expecting sex-toy saleslady Jane Whitehouse with a fresh stock of toys. Jane arrives and the girls retire to another room where some rather mechanical stripping and licking is followed by mixed dildo use; personally I find Jane's current manufactured look a little offputting and much prefer her early work when she still did bg. Jane puts on a giant pink strap-on and, while she lies across the table looking like a giant transsexual, the diminutive Louise eases herself onto the plastic cock and attempts to fuck her own brains out. The scene ends abruptly when Louise dismounts.\n\nMeanwhile, on the sofa, Steve is starting to get Bonnie out of her pale blue lace dress and matching pants. Before they get too carried away they retire to Bonnie's bedroom. In her 5 inch heels Bonnie is an inch or two taller than Steve, but they are soon horizontal as the pair go through all the positions on the bed including anal (spoon and doggy). The scene ends with a facial.\n\nEpisode 7 has one of the smallest casts of all the series, but the action is none the worse for that. There are fine performances by relative newcomers Bonnie and Sarah and the lovely Karina. Only big tit lovers will be disappointed with all the girls in bg action small up top. But for me, lovely.\n\n\nContent: \nAnal, DP/double penetration, European/British, Straight, Teen\n\nStarring:\n* Bonnie Heart\n* Jane Whitehouse\n* Karina Currie\n* Louise Louellen as Lou Lou\n* Sarah Lou\n\n\nStudio:          MSS\nReleased:        2003\nFormat:          Xvid\nLanguage:        English\n\n\n3,500+ torrents: \n(ALWAYS with honest screens &amp; detailed info)\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/pure_screens&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pure_screens&lt;/a&gt;\n\n\n\n\nFile Information:\n\nSize: 699 MB\nDuration: 1h 37m 30s\n\nVideo codec: XviD\nResolution: 512 x 384\nFrame rate: 25fps\nBitrate: 870kbps\nQf: 0.177\n\nAudio codec: MP3\nSample rate: 48kHz\nBitrate: 137kbps VBR\nChannels: 2 \n\n\n\n\n","torrent":{"xt":"urn:btih:2264f38d251807bf035a9068b5adb01a614afa55","amp;dn":"British+Teen+Girls+9+%28DVD.xvid%29+-+anal+%2B+DP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2264f38d251807bf035a9068b5adb01a614afa55","infoHashBuffer":{"type":"Buffer","data":[34,100,243,141,37,24,7,191,3,90,144,104,181,173,176,26,97,74,250,85]},"announce":[],"urlList":[]}}