{"title":"Coast to Coast AM August 1st 2009 - Economy Collapse","uid":5038203,"size":56438853,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:235321831fcf9b06c85c736ca1bdc55a34873ce9&amp;dn=Coast+to+Coast+AM+August+1st+2009+-+Economy+Collapse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jeffchil","files":6,"time":1249234951,"description":"Economy Collapse\n\nDate:\n08-01-09\n\nHost:\nIan Punnett\n\nGuests:\nRobert Chapman, R. Gary Patterson\n\nEditor and publisher of International Forecaster, Bob Chapman, discussed the economic crisis, how brokerage firms such as Goldman Sachs played a part in fueling the collapse, and where he sees the economy heading into the future. He dismissed news that the economic crisis may be abating. Instead, Chapman said, we are merely seeing a &quot;barrage of government propaganda, the psy ops that go on everyday, convincing people that everything is going to be okay.&quot;\n\nHe decried the use of derivatives by large firms like Goldman Sachs and alleged that their nefarious activity goes even further than that. According to Chapman, these companies pay a fee to have their automated trading computers positioned closest to the central computer of the New York Stock Exchange, which processes incoming and outgoing trades. &quot;Because of its proximity, in nanoseconds,&quot; Chapman explained, the computers, and thus the firms, become &quot;privy to orders before anybody else is and they are able to counteract what is going on with the orders, in order to make a larger profit.&quot;\n\nLooking ahead to the future, Chapman foresaw the further devaluing of the dollar, estimating that over the course of the next two to three years, &quot;it will lose two thirds of its value versus other currencies.&quot; He was skeptical about a one world currency, but did suggest the possibility that one could be created &quot;for trading purposes only.&quot; This specialized currency would allow for countries to keep their own internal monetary systems. Perhaps most troubling, he was adamant that the financial crisis will lead to a global war, saying &quot;you can take that to the bank, if the bank is still there.&quot;\n\nMichael Jackson Death Fallout\n\nDuring the first hour, author R. Gary Patterson reacted to the stories emerging in the wake of Michael Jackson's death. Based on how previous rock musicians' deaths have unfolded, he predicted that conspiracy theories surrounding Jackson's demise will continue and &quot;may last for years.&quot; He also anticipated that sightings of Jackson will begin to start happening and noted that there have already been rumblings of glimpses of the deceased &quot;King of Pop.&quot; Patterson also gave his perspective on James 'Tappy' Wright's theory that Jimi Hendrix was murdered, as discussed on the 7.11.2009 edition of C2C. ","torrent":{"xt":"urn:btih:235321831fcf9b06c85c736ca1bdc55a34873ce9","amp;dn":"Coast+to+Coast+AM+August+1st+2009+-+Economy+Collapse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"235321831fcf9b06c85c736ca1bdc55a34873ce9","infoHashBuffer":{"type":"Buffer","data":[35,83,33,131,31,207,155,6,200,92,115,108,161,189,197,90,52,135,60,233]},"announce":[],"urlList":[]}}