{"title":"Ashanti - Rain On Me","uid":5110828,"size":176484356,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:23d29d89e74a2fccfebe2522749d509a032b87b4&amp;dn=Ashanti+-+Rain+On+Me&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1254721873,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nRain on Me is a single released by R&amp;B singer Ashanti in 2003 from her second album Chapter II. The single reached number seven on the Billboard Hot 100 chart in the United States and the top 20 in the United Kingdom. In the video Ashanti plays a superstar abused by a jealous boyfriend, played by actor Larenz Tate. The video was released on August 28, 2003. The video was shot in Barcelona, Spain, and directed by Hype Williams. It contains a sample of &quot;The Look Of Love&quot; by Isaac Hayes. The rap remix found of her &quot;Collectibles&quot; album interpolates &quot;Can I Live?&quot; by Jay-Z. Jay-Z used the same sample for his song off his 1996 debut album, Reasonable Doubt. The remix also features Hussein Fatal and fellow The Inc. Records labelmates Charli &quot;Chuck&quot; Baltimore &amp; Ja Rule. \n\nIn 2004, the song earned Ashanti her a Grammy nomination for Best Female R&amp;B Vocal Performance.\n\nChapter II is the Grammy nominated second studio album by American R&amp;B singer Ashanti, released by Murder Inc. and Island Def Jam on July 1, 2003 in the United States. The album involves production by Irv Gotti and Chink Santana and features a guest appearance by Ja Rule. Chapter II spawned three singles including the Billboard Hot 100 number two song Rock Wit U (Awww Baby), the melodrama R&amp;B-ballad Rain On Me and the Irv Gotti-produced Breakup 2 Makeup (Remix).\n\nThe album debut at number one on the Billboard 200 chart in July 2003 with first-week sales of 326,000 units. It earned Ashanti three Grammy nominations for Best Contemporary R&amp;B Album, Best Female R&amp;B Vocal Performance, and Best R&amp;B Song. Chapter II was certified platinum by the RIAA on August 14, 2003.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:23d29d89e74a2fccfebe2522749d509a032b87b4","amp;dn":"Ashanti+-+Rain+On+Me","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23d29d89e74a2fccfebe2522749d509a032b87b4","infoHashBuffer":{"type":"Buffer","data":[35,210,157,137,231,74,47,204,254,190,37,34,116,157,80,154,3,43,135,180]},"announce":[],"urlList":[]}}