{"title":"NHL 10 [NTSC][X360][www.BjanadoJuegos.eu]","uid":5085789,"size":6818974874,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:23da8bae2df6da14156209e0616dc22f059044c0&amp;dn=NHL+10+%5BNTSC%5D%5BX360%5D%5Bwww.BjanadoJuegos.eu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Morck22","files":71,"time":1252700947,"description":"Marca como una estrella con NHL 06. Muestra tu estilo de tiro con el nuevo EA SPORTS Skill Stick y enciende haz que se ilumine la sirena de gol con movimientos especiales de toda clase. El Control ClÃƒÂ¡sico de Fintas se aÃƒÂ±ade a tu arsenal de movimientos permitiÃƒÂ©ndote maniobrar alrededor de los defensas y marear a los porteros antes de lanzar peligrosos disparos. Y domina la pista de hielo en los dÃƒÂ­as de gloria de EA SPORTS classic NHL? 94!\n\n\nCaracterÃƒÂ­sticas\nNuevo EA SPORTS Skill Stick:\nFinta,dispara y marca como nunca antes lo habÃƒÂ­as hecho con NHL06. Busca tu espacio con un toque del stick analÃƒÂ³gico derecho y ejecuta potentes disparos controlando perfectamente el lugar al que va dirigido tu tiro. Despliega todo un arsenal de movimientos para aprovechar cada oportunidad de gol que se presente.\n\n\nEA SPORTS FÃƒÂ­sica Realista del Puck:\nLa nueva y realista fÃƒÂ­sica del puck viene a significar que el puck es peligroso. Los tiros pueden lesionar a defensas, agitar a los porteros, romper la red o hacer saltar botellas de agua de la porteria.\n\nControl clÃƒÂ¡sico de Fintas:\nEl movimiento sobre el hielo es ahora mÃƒÂ¡s intuitivo que nunca al patinar y fintar usando tu stick analÃƒÂ³gico izquierdo para esquivar oponentes y engaÃƒÂ±ar a porteros que realizarÃƒÂ¡n nuevas y desesperadas paradas.\n\nNuevo Momentum Skating:\nSiente lo que es patinar sobre una superficie helada. La velocidad del jugador y su tamaÃƒÂ±o tiene ahora efecto en el momentum y radio de giro. Durante los acelerones de velocidad los jugadores empujarÃƒÂ¡n el puck en mayor profundidad para quitarse oponentes de encima. Y ahora tambiÃƒÂ©n mientras paras y giras dejarÃƒÂ¡s marcas sobre el hielo.\n\nZona de CreaciÃƒÂ³n:\nEl nuevo editor te permite crearte a ti mismo dentro del juego con los nuevas posibilidades de ediciÃƒÂ³n facial con el contro analÃƒÂ³gico. Ponte ojos negros y cicatrices para causar temor a tus rivales. O crea un equipo NHL en tu ciudad y crea una dinastÃƒÂ­a, o edita un jugador en una liga cualquiera con el nuevo editor de jugadores.","torrent":{"xt":"urn:btih:23da8bae2df6da14156209e0616dc22f059044c0","amp;dn":"NHL+10+%5BNTSC%5D%5BX360%5D%5Bwww.BjanadoJuegos.eu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23da8bae2df6da14156209e0616dc22f059044c0","infoHashBuffer":{"type":"Buffer","data":[35,218,139,174,45,246,218,20,21,98,9,224,97,109,194,47,5,144,68,192]},"announce":[],"urlList":[]}}