{"title":"Haysi Fantayzee - Sister Friction [1983].mpg","uid":5122360,"size":66396164,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2427cc505a2159a2530f071bd39c23f8cf567008&amp;dn=Haysi+Fantayzee+-+Sister+Friction+%5B1983%5D.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"claudeq","files":1,"time":1255423160,"description":"Formed in 1981 and fronted by white dreadlocked singers Jeremy Healy (also known as Jeremiah) and Kate Garner, and with Garner's boyfriend songwriter/producer/manager Paul Caplin in the background. During this period Garner and Healy used the surname &quot;Fantayzee&quot;. The band released four singles in 1982 and 1983: &quot;John Wayne is Big Leggy&quot;, &quot;Holy Joe&quot;, &quot;Shiny Shiny&quot;, and &quot;Sister Friction&quot;, and an album, Battle Hymns For Children Singing. The band never broke through to the same kind of success in the United States, although they did enjoy some popularity there. Originally Caplin and Garner had intended to make music with just Garner performing, but then they met Healy (who at nineteen, was a few years younger than Garner) and decided to pair them up. The band used their artsy look as a selling point, making a crude video performance and using that instead of a demo tape to sell the band to record companies. Their attention-grabbing outfits were often designed by Garner. The two singers looked like distorted mirror images of each other, with similar hair and make-up. Their glamorous ragamuffin style was frequently compared[by whom?] to Boy George's look. In a 1983 interview with David Maples on the Los Angeles-based TV show &quot;MV3&quot;, Jeremy Healy accused the singer known as Boy George (George O'Dowd) of stealing his infamous look.\n\n\nEnjoy this rare one","torrent":{"xt":"urn:btih:2427cc505a2159a2530f071bd39c23f8cf567008","amp;dn":"Haysi+Fantayzee+-+Sister+Friction+%5B1983%5D.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2427cc505a2159a2530f071bd39c23f8cf567008","infoHashBuffer":{"type":"Buffer","data":[36,39,204,80,90,33,89,162,83,15,7,27,211,156,35,248,207,86,112,8]},"announce":[],"urlList":[]}}