{"title":"Counter Strike 1.6","uid":5562282,"size":223471917,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:247b575f95d63877abffdf8683835d37b1d1d2aa&amp;dn=Counter+Strike+1.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Vegasqq","files":-1,"time":1273870831,"description":"Counter-Strike is a first-person shooter in which players join either the terrorist or counter-terrorist team (or become a spectator). Each team attempts to complete their mission objective and/or eliminate the opposing team. Each round starts with the two teams spawning simultaneously, usually at opposite ends of the map from each other. A player can choose to play as one of eight different default character models (four for each side, although Counter-Strike: Condition Zero added two extra models, bringing the total to ten). Players are generally given a few seconds before the round begins (known as &quot;freeze time&quot;) to prepare and buy equipment, during which they cannot attack or walk/move (a player can still take damage, having the player drop from a certain height during freeze time was the only way somebody could control the players starting &quot;HP&quot;). They can return to the buy area within a set amount of time to buy more equipment (some custom maps included neutral &quot;buy zones&quot; that could be used by both teams). Once the round has ended, surviving players retain their equipment for use in the next round; players who were killed begin the next round with the basic default starting equipment.","torrent":{"xt":"urn:btih:247b575f95d63877abffdf8683835d37b1d1d2aa","amp;dn":"Counter+Strike+1.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"247b575f95d63877abffdf8683835d37b1d1d2aa","infoHashBuffer":{"type":"Buffer","data":[36,123,87,95,149,214,56,119,171,255,223,134,131,131,93,55,177,209,210,170]},"announce":[],"urlList":[]}}