{"title":"Jerome Kugan - Songs For A Shadow [Special Edition]","uid":5048884,"size":72375130,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:254882c2a33fa99f617e547e9167d9d94ee6d37d&amp;dn=Jerome+Kugan+-+Songs+For+A+Shadow+%5BSpecial+Edition%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cyclopede","files":-1,"time":1249791540,"description":"Jerome Kugan's first album &quot;Songs For A Shadow&quot; \n \nMore information and preview at http://www.popfolio.net/jeromekugan/ and\n\nAfter bumming around for far too long, Jerome Kugan finally releases his first album, entitled &quot;Songs For A Shadow&quot;. \n\nBio \n\nWho is Jerome Kugan? Originally from Kota Kinabalu, Jerome Kugan is a 33 year old singer songwriter who first dabbled in music while still a student in Australia in 1996 when he joined a Casio punk band called C.U.N.T. Imploding after four shows, Jerome struck out on his own, first singing a capella songs, then collaborating with electro musicians. Upon returning to Malaysia, Jerome started writing music more seriously, but it wasn't until he relocated to Kuala Lumpur in 2000 that he started performing in earnest. Between 2001 and the present time, Jerome has performed in various venues in KL, featuring his quirky yet accessible brand of music (no doubt a result of his rather artless self-taught approach). Performing in both acoustic and electronic (MIDI) formats, Jerome's music and vocal stylings have been compared to Bjork, Morissey, Depeche Mode, Jeff Buckley, PJ Harvey, and The Notwist, among others. On the same token, he has also been descibed as &quot;a poor man's Kylie in shorts.&quot; Aside from bewildering local audiences with his unconventional performances, Jerome's instrumental MIDI compositions have been featured in early films by local filmmakers Amir Muhammad and James Lee. He was even awarded the 3rd Cameronian Performing Arts Awards Most Promising Artist and Best Original Music (Theatre) for the music he composed for the 2005 stage production &quot;Ops Ophelia: A Fashion Opera&quot; directed by Rohaizad Suhaidi. Aside from making music, Jerome is also a gig organiser. As one-third of Troubadours Enterprise together with fellow singer songwriters Azmyl Yunor and Tan Sei Hon, Jerome co-organised KL Sing Song at KLPAC which is an annual showcase of local singer songwriters. He also co-organises the recurring spoken word show Wayang Kata with Doppelganger and The British Council. Jerome is also a published poet and writer. He has previously been invited to participate in the Ubud Writers Festival, Singapore Writers Fest and Utan Kayu Literary Biennale. Exactly what were these people thinking?\n\nAlbum \n\nAnyway. in 2006, Jerome began recording his solo debut album &quot;Songs For A Shadow&quot; with producers Hardesh Singh and Ariff Akhir. After one and a half years of recording sessions (with a lot of breaks in between), it's finally done! It's set to be independently released as CD and digital download in March 2008. It contains eleven original songs written by Jerome, concerning various well-trod topics including love, relationships, flowers, homophobia, and cats, delivered in Jerome's inimitable style. Continuing with the adventurous spirit that has defined Jerome's artistic output in the past, the style of the album is defiantly electro-folksy, featuring Jerome's untutored vocals and minimal guitar playing against pulsating austere arrangements courtesy of Hardesh Singh and Ariff Akhir. But the album is not avant garde by any means. For those who are afraid of new music, be rest assured that &quot;Songs For A Shadow&quot; is quite accessible, melodic, poetic and polished even, thanks to years of humbling experiences and a childhood of being forced to listen to disco and country music.\n\nThis Special Edition includes an acoustic version of &quot;Tomas&quot;, the single &quot;City of Mud&quot; and an interview with Jerome Kugan from the Malaysian radio station BFM","torrent":{"xt":"urn:btih:254882c2a33fa99f617e547e9167d9d94ee6d37d","amp;dn":"Jerome+Kugan+-+Songs+For+A+Shadow+%5BSpecial+Edition%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"254882c2a33fa99f617e547e9167d9d94ee6d37d","infoHashBuffer":{"type":"Buffer","data":[37,72,130,194,163,63,169,159,97,126,84,126,145,103,217,217,78,230,211,125]},"announce":[],"urlList":[]}}