{"title":"Antagony - Days Of Night (2009)","uid":5039913,"size":57126226,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:25c3e68645a8b0a6f0f887f05e1f574140aabc2b&amp;dn=Antagony+-+Days+Of+Night+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Baphom3t","files":15,"time":1249322374,"description":"ANTAGONY from Oakland, California fuse the raw power of traditional metal with the hardcore infused death metal of Beneath the Massacre to form a massive conjuration of passion, darkness and unmatched heaviness. Three years since their critically acclaimed debut &quot;Rebirth&quot; and after 8 years of setbacks with constant lineup changes, Antagony is taking their classically composed brand of metal to the masses full throttle in 2009 with their debut album for Deepsend Records. The band recently completed the Gas Budget Obliteration west coast tour to rave fan reviews and will be touring again throughout the year. \n\nWithin our music you will always find a focus upon emotion, passion, and dark beauty. Most reviews of Metal today use catch phrases that apply to many bands; brutal, punishing, epic, etc. While these terms can easily apply to our music we don't feel the need to fulfill these expectations. If you love the raw power of Metal and subtle elegance of Classical composition - listen to Antagony.\n\nSome listeners have described listening to Antagony on the same level as entering a temple. While others have felt as if they were on a voyage deep into musical expression. Either way, listening to Antagony is an experience...a memorable story. Antagony strives for musical depth and a unique sound that sets them apart from their peers.\n\nCombining their influences from intense Classical composers, Taiko drumming, Black Metal, Death Metal, Grindcore, and Hardcore; Antagony focuses on beautiful darkness and emphasizes on Epic melodic sections. They have never gone the standard way of arranging their songs in ABABC (Verse Chorus Verse...) but evolve each part into a new section taking anyone following along onto a journey to the unexpected. Antagony's unique strength lies in their transitions which are developed in such a way where you feel like you are constantly being pushed forward. Check out their newest release &quot;Rebirth&quot; which was pressed in limited quantities for promotion, and let the music speak for itself.\n\n\nCurrent line-up \nCarlos Saldana - Vocals\nNick Vasallo - Guitar, Vocals \nKyle Anderson - Guitar\nRyan - Guitar\nChristian Mitchell - Bass\nBrian Camara - Drums (Prelude to Ruin)\n\nGenre = Death Metal / Deathcore\nFormat = Mp3\nBit Rate = Vbr\n\nTrack Listing\n1. Terror \n2. The Truth Will Be Known \n3. The Ladder \n4. Voyage \n5. Exhale Her Poison \n6. Interlude \n7. Undying Sun \n8. El Banquete \n9. Days Of Night \n10. Outro ","torrent":{"xt":"urn:btih:25c3e68645a8b0a6f0f887f05e1f574140aabc2b","amp;dn":"Antagony+-+Days+Of+Night+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25c3e68645a8b0a6f0f887f05e1f574140aabc2b","infoHashBuffer":{"type":"Buffer","data":[37,195,230,134,69,168,176,166,240,248,135,240,94,31,87,65,64,170,188,43]},"announce":[],"urlList":[]}}