{"title":"The Mentors - Crustin'  &amp; Grossin'","uid":5585208,"size":57767258,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2619c30ea9137aab637ca1f662cc71ddaac1bf7b&amp;dn=The+Mentors+-+Crustin%5C%27++%26+Grossin%5C%27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Judge_Scum","files":12,"time":1274679019,"description":"!!!!!NOTE!!!!!\n\nThis was never an official release this is a Compilation album i put together a &quot;Mix-Tape&quot; if you will. this is a Compilation of some of the rarest mentors shit i could find.\nTracks 1, 2, 3, 6, &amp; 8 were the hardest to find and are all part of the same release, as i believe.\n\nTracks 4, 5, 7, were originaly released on &quot;Houses of the Horny&quot;in 94 the rest of the tracks on that released were unmasterd tracks from other albums.\n\nDonkey Dick (Live)- if have no idea were this came from. as far as i know the Mentors only have three Live albums and i don't think this track was among them. this is a great track it contanes lyrics a tad differant from the &quot;To The Max&quot; version.\n\nSpew On The Hooker- is a live cover of Deep Purple's &quot;Smoke on The Water&quot; and just as Donkey Dick i know not of were this track originates. it is a great and hilarious recording.\n\nYou Really Suck Me- just like the track above it is a live cover and of corse it is of Van Halan's &quot;You Really Got Me&quot; like i had to tell you that.\n\nUnknown Live Track- just as the title states i have no idea of its ogin's or of its title. the sound doesnt ring a bell and the recording is so raw i cant tell much anything. mabey some of you will have better luck at this than me.  thats all if theres somthing about these tracks or of there orgins please let me know on the commints page.","torrent":{"xt":"urn:btih:2619c30ea9137aab637ca1f662cc71ddaac1bf7b","amp;dn":"The+Mentors+-+Crustin%5C%27++%26+Grossin%5C%27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2619c30ea9137aab637ca1f662cc71ddaac1bf7b","infoHashBuffer":{"type":"Buffer","data":[38,25,195,14,169,19,122,171,99,124,161,246,98,204,113,221,170,193,191,123]},"announce":[],"urlList":[]}}