{"title":"FRAPS 2.9.9 FULL","uid":5081916,"size":1613598,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:26ee8dca687e38d1e3b61d03db4111e32e67843e&amp;dn=FRAPS+2.9.9+FULL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"digao3000","files":1,"time":1252384423,"description":"Fraps is a universal Windows application that can be used with games using DirectX or OpenGL graphic technology.  In its current form Fraps performs many tasks and can best be described as:\n\nBenchmarking Software - Show how many Frames Per Second (FPS) you are getting in a corner of your screen.  Perform custom benchmarks and measure the frame rate between any two points.  Save the statistics out to disk and use them for your own reviews and applications.\n\nScreen Capture Software - Take a screenshot with the press of a key!  There's no need to paste into a paint program every time you want a new shot.  Your screen captures are automatically named and timestamped.\n\nRealtime Video Capture Software - Have you ever wanted to record video while playing your favourite game?  Come join the Machinima revolution!  Throw away the VCR, forget about using a DV cam, game recording has never been this easy!  Fraps can capture audio and video up to 2560x1600 with custom frame rates from 10 to 100 frames per second!\n\nThere is no virus or something bad in this torrent, here is the prove :\nhttp://www.virustotal.com/en/analisis/bf6218edc6260ef2dd3641fbc3a4b976cd9b243e03eeb594cc822fba4054fe62-1252375490\n\nInstallation : Run the fo-fr299.exe to do the installation and Have FUN = :D  ;D  :D  ;)  :) \n\nIf you have any problems put a comment (sorry about the english) i'll try to help you  ;D \n \nI have a ploblem with the seed if anyone can help me send me an e-mail =D\n","torrent":{"xt":"urn:btih:26ee8dca687e38d1e3b61d03db4111e32e67843e","amp;dn":"FRAPS+2.9.9+FULL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26ee8dca687e38d1e3b61d03db4111e32e67843e","infoHashBuffer":{"type":"Buffer","data":[38,238,141,202,104,126,56,209,227,182,29,3,219,65,17,227,46,103,132,62]},"announce":[],"urlList":[]}}