{"title":"Tita Tovenaar deel 8.DVDr.NLT-Release (DIVx)","uid":5118493,"size":485755911,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2738c1e2c0ea7e53bbf8ca1f46266cc592ca3c42&amp;dn=Tita+Tovenaar+deel+8.DVDr.NLT-Release+%28DIVx%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"diddle783","files":4,"time":1255190604,"description":"Tika woont samen met haar vader in een luchtkasteel. Haar vader is een grote, verstrooide tovenaar met maar een beperking: hij kan geen aardbeien in kamelen veranderen. Samen beleven ze veel avonturen. De meeste worden veroorzaakt door Titi, die met zijn apenstreken de mensen op aarde de stuipen op het lijf jaagt. Vooral het keurige heertje moet het vaak ontgelden. Op deze DVD staan de volgende 2 afleveringen:\n\nGrobelia Wil Toverpappa's Toverkracht:\nWanneer Grobelia voor het eerst op het kasteel van Tita Tovenaar komt denkt ze dat de toverkracht van Tita Tovenaar in de toverfluit van Tika zit. Ze stuurt Kroel op Tika af om de fluit te pikken. Dat lukt Kroel en hij brengt de fluit naar Grobelia maar die kan helemaal niet met de fluit overweg en zorgt alleen maar voor veel overlast. Natuurlijk wil Tika de fluit terug maar toverpappa wil niet helpen omdat hij dan bang is dat hij geen aardbeien meer krijgt van Grobelia. Tika en Kwark moeten het dus zelf oplossen.\n\nHet Geheim Van Toverpappa:\nVoor een van zijn experimenten heeft toverpappa een poeder nodig dat prikkelend en scherp is. Kwark weet meteen dat dit peper is en dat het bij de kruidenier in het dorp gehaald kan worden. Grobelia hoort dat en denkt dat de kruidenier de leverancier is van de tovertuin van toverpapa en ze rooft de hele winkel leeg. Bovendien stapt het heertje ook op het verdwijnpunt van Grobelia's toverlantaarn en verdwaalt in het Grobbedal. Tita tovenaar moet er weer aan te pas komen om alles recht te zetten.\n\nbron dvd\njaar uitzending 1972/1974\nverschijning dvd 2009\n\nDeze torrent wordt je aangeboden door NLT.ons-Forum \n\nHet forum met de nieuwste films en muziek en de meest uitgebreide\nCollectie DviX torrents.\n\nAl onze Film torrents hebben Nederlandse subs of zijn Nederlands Geproken\n\nTot ziens op het NLT.\n\nWe zijn te vinden op:  &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt;\t\t","torrent":{"xt":"urn:btih:2738c1e2c0ea7e53bbf8ca1f46266cc592ca3c42","amp;dn":"Tita+Tovenaar+deel+8.DVDr.NLT-Release+%28DIVx%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2738c1e2c0ea7e53bbf8ca1f46266cc592ca3c42","infoHashBuffer":{"type":"Buffer","data":[39,56,193,226,192,234,126,83,187,248,202,31,70,38,108,197,146,202,60,66]},"announce":[],"urlList":[]}}