{"title":"Angelique Collection (5 van 5)(MULTI SUBS 10) 2Lions-Team","uid":5668884,"size":4566601759,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:274e0de68c3b5baaf6285f4e83da30b6f9051979&amp;dn=Angelique+Collection+%285+van+5%29%28MULTI+SUBS+10%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pioen","files":-1,"time":1278254568,"description":"Angelique Collection Deel 5 van 5 \n\n \n\n\nDVD 5 And the Sultan\n\nDe aangrijpende avonturen van de beeldschone AngÃƒÂ©lique (MichÃƒÂ¨le Mercier) en haar aanvaringen met het noodlot, netjes verpakt in een box met vijf films. Haar liefde voor de rijke graaf van Toulouse, Joffrey de Peyrac (Robert Hossein), strookt niet altijd met de plannen van andere machtige mannen. Romantiek en passie ten tijde van Louis XIV - de Zonnekoningmet die heerlijke Franse zweem uit de jaren '60...\n\nDit keer wordt AngÃƒÂ©lique als slavin verkocht aan een nare Algerijnse sultan. Die valt haar flink lastig, maar haar echtgenoot redt haar door de gulzige sultan om te kopen. Angelique wordt dan eindelijk herenigd met haar man.\n\nFilms: AngÃƒÂ©lique, AngÃƒÂ©lique The Road To Verseilles, AngÃƒÂ©lique and The King, Untamable AngÃƒÂ©lique en AngÃƒÂ©lique and the Sultan\n\n\nEnglish\n\n\nBased on the best-selling French novels by Anne and Serge Golon that captured hearts worldwide, the Angelique films chronicle the life of an adventurous heroine in the Louis XIV era. Five classic film adaptations star the beautiful Michele Mercier and the dashing Robert Hossein as her husband and true love. A swashbuckling blend of action, intrigue and passion, the Angelique films seamlessly capture the amazing life of a French country girl whose quest for love and happiness leads her from the gutters of Paris to the Palaces Versailles.\n\n\n\nThe potential for turning the AngÃƒÂ©lique books into movies was first realised in the 1960s when five French language films based were released. \n\nThey starred MichÃƒÂ¨le Mercier, a young but experienced actress from Nice, as AngÃƒÂ©lique, and Robert Hossein as Joffrey de Peyrac. \n\nIt is believed that Mike Todd, who was famous for producing Around the World in 80 Days and perhaps more famous for one time being married to Elizabeth Taylor, had been interested in producing the films, but he died in a plane crash before he could undertake the project. \n\nInstead, they were directed by Frenchman Bernard Borderie. All five were produced by Francis Cosne - the final two in partnership with Francois Chavane. \n\nToday the films are still shown regularly on TV in French-speaking countries as well as in Italy, Japan and Russia, so were certainly a commercial success.\n\n\n\n\n\n\n\n\n\n &lt;a href=&quot;\nhttp://www.dvdbeaver.com/film2/DVDReviews37/angelique_collection.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dvdbeaver.com/film2/DVDReviews37/angelique_collection.htm&lt;/a&gt;\n\nSpotinformatie \nAudio : Frans \nSubs: Danish, Spanish, Finnish, Hungarian, Dutch, Norwegian, Portuguese, Swedish, Czech, Polish\nMenu : Yes\nCover : Yes\n\nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail pal\n\n\n\nGenre : Avontuur\nRomantiek\n\nWeblink : http://www.moviemeter.nl/film/7757\n\nWeblink : http://www.imdb.com/title/tt0061357\n\n\n\n*****************************************\n\nBrought to you by \n\n\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n\n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!","torrent":{"xt":"urn:btih:274e0de68c3b5baaf6285f4e83da30b6f9051979","amp;dn":"Angelique+Collection+%285+van+5%29%28MULTI+SUBS+10%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"274e0de68c3b5baaf6285f4e83da30b6f9051979","infoHashBuffer":{"type":"Buffer","data":[39,78,13,230,140,59,91,170,246,40,95,78,131,218,48,182,249,5,25,121]},"announce":[],"urlList":[]}}