{"title":"Metro Station - Kelsey","uid":5064820,"size":131391492,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:27fa40c81178e12da586d9438afc3c706f5bc2df&amp;dn=Metro+Station+-+Kelsey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1250899380,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Kelsey&quot; is a song by pop rock group Metro Station released as the first single from their self-titled debut album. It was re-released after the success of &quot;Shake It&quot; and &quot;Seventeen Forever&quot; on March 17, 2009.\n\nThe music video features all the band members playing the song in split-screen. The band will shoot a new video for the UK release of the single.\n\nMetro Station is the self-titled debut album by pop group Metro Station. The album was released on September 18, 2007, via Columbia/Red Ink. As of September 2008, four singles have been released. So far, &quot;Shake It&quot; and &quot;Seventeen Forever&quot; have  charted on Billboard charts. The album debuted at #189 on the U.S. Billboard 200, but reached a peak of #39 in June of 2008. The song &quot;Shake It&quot;, has been certified Platinum. Since its release, Metro Station has sold approximately 400,000 copies in the United States.\n\nHMV.co.uk confirmed that the album will officially be released in the UK 30 March 2009 and will contain 2 exclusive UK bonus tracks including a brand new track &quot;After The Fall&quot;. The first UK single was &quot;Shake It&quot; which was released a week before, on 23 March 2009.\n\nMetro Station performed at the 18th Annual Kissmas Bash at HSBC Arena in Buffalo NY on December 9, 2008, a yearly radio event (WKSE KISS 98.5).\n\nMetro Station is an American pop band, formed in 2006 in Los Angeles, California. In late 2006, the band signed a recording contract with Columbia/Red Ink. They are best known for their Top 10 Billboard hit single &quot;Shake It&quot; from their self-titled debut album. Popularized mainly by their co-frontman Trace Cyrus, older brother of Hannah Montana star Miley Cyrus, and Mason Musso, older brother of Mitchel Musso from Hannah Montana, the band has experienced a recent boom in their record sales.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:27fa40c81178e12da586d9438afc3c706f5bc2df","amp;dn":"Metro+Station+-+Kelsey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27fa40c81178e12da586d9438afc3c706f5bc2df","infoHashBuffer":{"type":"Buffer","data":[39,250,64,200,17,120,225,45,165,134,217,67,138,252,60,112,111,91,194,223]},"announce":[],"urlList":[]}}