{"title":"Transformers.Revenge.Of.The.Fallen-Xvid-Gozita","uid":5063805,"size":1466673209,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2816ac4b505bd95946685194339dbf7124e8d077&amp;dn=Transformers.Revenge.Of.The.Fallen-Xvid-Gozita&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Gozita","files":2,"time":1250837753,"description":"Transformers: la venganza de los caÃƒÂ­dos (titulada Transformers: Revenge of the Fallen en su versiÃƒÂ³n original en inglÃƒÂ©s) es una pelÃƒÂ­cula de ciencia ficciÃƒÂ³n, secuela de Transformers y basadas ambas en la serie de televisiÃƒÂ³n homÃƒÂ³nina. Su fecha de estreno fue el 24 de junio de 2009.\n\nLa direcciÃƒÂ³n se encuentra nuevamente a cargo de Michael Bay ,asÃƒÂ­ como la producciÃƒÂ³n de Steven Spielberg. Shia LaBeouf repite el papel de protagonista interpretando a Sam Witwicky, el humano que queda en medio de una guerra entre dos razas de robots alienÃƒÂ­genas conocidas como Autobots y Decepticons. En esta entrega el nÃƒÂºmero de Transformers aumenta significativamente; ademÃƒÂ¡s el escenario de desarrollo del filme se muda a Egipto, aunque tambiÃƒÂ©n hay escenas en otros lugares. El desarrollo se iniciÃƒÂ³ poco antes de la huelga de guionistas de Estados Unidos de 2007, lo cual retrasÃƒÂ³ en cierta medida la pelÃƒÂ­cula. El rodaje se iniciÃƒÂ³ en mayo de 2008 en Estados Unidos, donde se rodaron la mayor parte de las escenas, aunque hay algunas que se desarrollan en otros paÃƒÂ­ses.\n\nAutobots  \nOptimus Prime: El lÃƒÂ­der de los Autobots. MantendrÃƒÂ¡ su modo alterno de un Peterbilt 379.\nBumblebee: Es el protector de Sam y Mikaela. Su nuevo modo alterno es un Chevrolet Camaro modificado igual que en la primera pelicula.\nIronhide: El especialista en armas. Mantiene su modo alterno de un GMC Topkick Pick-Up.\nRatchet: El medico del grupo. Su modo alterno sigue siendo una camioneta Hummer H2.\nSideswipe: Su modo alterno es un Chevrolet Corvette StinGray Concept. Su modo robot llevan dos neumÃƒÂ¡ticos en los pies que utiliza como patines, ademas de contar con un par de cuchillas en cada mano. Asesina a Sideways, Cortandolo en dos con sus cuchillas.\nMudflap y Skids: Ellos son dos nuevos Autobots gemelos. Sus modos alternos son en un principio un CamiÃƒÂ³n de Helados combinÃƒÂ¡ndose cuando se transforman y luego se separan para convertirse en un Chevrolet Trax naranja y un Chevrolet Beat verde. Se la pasan discutiendo, cuando uno esta de acuerdo con algo, el otro no lo esta. TambiÃƒÂ©n se los puede ser vistos peleÃƒÂ¡ndose constantemente, juntos daÃƒÂ±an seriamente a Devastator cuando este se traga a Mudflap.\nArcee su modo alterno es una Ducati 848 rosa, Arcee es la unica de las tres hermanas con una conciencia propia, ademÃƒÂ¡s de ser la lider del trÃƒÂ­o, su papel a lo largo del filme es muy menor junto con el de sus hermanas, ella es mortalmente herida cuando los decepticon la atacan, se desconoce si sobrevive\nChromia se transforma en una Suzuki B-King 2008 azul, es la hermana de Arcee y de Flareup, al igual que Flareup comparte la misma conciencia que Arcee. Es la ÃƒÂºnica que no es atacada por los decepticons al evitarlos.\nFlareup: se transforma en una MV Agusta F4 purpura. Ella es atacada por los decepticons por sorpresa, se desconoce si sobrevive. su nombre nunca se supo hasta que hasbro confirmÃƒÂ³ que ella es Flareup en la SDCC.\nJolt: Su modo alterno es un Chevrolet Volt electrico de color azul. Ayuda a Ratchet a combinar a Optimus Prime y Jetfire.\nJetfire: Un antiguo Decepticon que se une a los Autobots. Su modo alterno es un SR-71 Blackbird. Cuando Optimus Prime necesita reconstruirse y no puede porque The Fallen se lo impidio, el a punto de morir por el daÃƒÂ±o que le causa Scorponok se sacrifica para darle sus piezas, y asi tener un poder inimaginable a Optimus transformandolo en Powered up Optimus Prime* Wheelie: Es otro nuevo Autobot que se transforma en una camioneta monster truck azul de radio control. Wheelie al principio es del bando de los Decepticons pero cuando Mikaela lo atrapa en el taller donde trabaja con su padre intentando conseguir el trozo de chispa vital que a Sam se le quedo pegada en la sudadera, esta le quema un ojo con un soplete y para que no le quemara el otro ojo decide ayudar a Mikaela. Wheelie se siente atraÃƒÂ­do por Mikaela, por lo que, se pasa al bando Autobot.\nlos siete primes:son vistos al principio del filme detras de &quot;the fallen&quot;.Tambien se les ve cuando encuentran la matriz en su tumba se ven sus cuerpos muertos.Tambien aparecen en una visiÃƒÂ³n que sam tuvo,mientras estaba insconciente cuando megatron le disparÃƒÂ³,en la que le decian que volviera con optimus y lo reviviera porque ese era su destino.\n\n Decepticons  \nThe Fallen: Uno de los primeros transformers creados. Existe desde hace miles de aÃƒÂ±os. Traiciono a sus hermanos Prime. The Fallen intentarÃƒÂ¡ poner en marcha una mÃƒÂ¡quina que estÃƒÂ¡ enterrada en una pirÃƒÂ¡mide, la cual destruiria el sol y conseguiria energon. Pero antes de poner la mÃƒÂ¡quina en marcha es derrotado por Optimus Prime combinado con las piezas de Jetfire.\nMegatron: El lÃƒÂ­der de los Decepticons. Long haul, Mixmaster, Rampage, Scrapper, Scalpel y Ravage lo reviven de su tumba en el abismo. Su nuevo modo alterno es el de un Tanque pero aun mantiene su habilidad para volar. Es reconstruido con las piezas de Scalpel, quien es sacrificado (le quitan partes) por sus compaÃƒÂ±eros por ser el mÃƒÂ¡s pequeÃƒÂ±o. Megatron intenta tomar venganza de quienes lo pusieron en el mar, para lo cual recurre a la ayuda de un antiguo demonio de Cybertron: The Fallen. Finalmente es derrotado por Optimus Prime quien asesina a The Fallen y destruye el Cosechador, al final es Starscream quien lo convence de escapar.\nStarscream: Uno de los tres sobrevivientes de la derrota de los Decepticons en la Tierra. Autoproclamado lider de los decepticon hasta que revivieron a Megatron. Mantiene su modo alterno de un F-22 Raptor solo que con &quot;tatuajes&quot; Cybertronianos. El a lo largo de la pelÃƒÂ­cula ha sido tratado de una manera muy violenta por Megatron, demostrando mas debilidad e intimidaciÃƒÂ³n por este, esta actitud mas cobarde de Starscream a molestado a muchos fans de el asi que es posible que en una probable trecuela de la pelicula, este se rebele. Al final el escapa de la tierra con Megatron.\nSoundwave: Su modo alterno es un SatÃƒÂ©lite Cybertroniano. Consigue datos para los decepticons; nunca se le ve la forma robot y no baja a la tierra a pelear por lo que estÃƒÂ¡ intacto.\nScorponok: Tiene la forma de un escorpion metalico. En la primer entrega fue herido en su cola pero la regenera. Pelea contra Jetfire, pero este lo derrota, no sin antes terminar muy mal herido.\nGrindor: Un clon de Blackout creado por The Fallen (por ende su modo alterno es el mismo que el de Blackout: un helicÃƒÂ³ptero Mh-53 pave low), que se diferencia del original por su color blanco (Blackout era azul verdoso). Se desconose por completo como fue creado y con que, es posible que halla quedado algun rastro de su armadura en megatron ya que fueron tirados juntos al mar en la 1Ã‚Âª pelicula. Lo mata Optimus Prime partiendole la cabeza en dos con sus garfios.\nRavage: Es un Decepticon simbiÃƒÂ³tico con Soundwave, al igual que Blackout y Scorponok de la primera, su modo alterno es un misil cibertroniano que se trasnsforma en un Jaguar mecÃƒÂ¡nico de un ojo. Muere destruido por Bumblebee\nSideways: Se transforma en un Audi R8. Es derrotado por Sideswipe al cortarlo en dos con sus cuchillas cuando intentaba escapar.\nScalpel: Es el mÃƒÂ©dico del ejercito Decepticon. Se transforma en un Microscopio. Todos sus conocimientos los usa para torturar a Sam y conseguir la informaciÃƒÂ³n que buscaban los Decepticons, pero termina siendo destruido por Optimus Prime.\nAlice: Ella es una pretender, una Decepticon con apariencia humana que ira tras los pasos de Sam. Mikaela la atropella con un coche dejandola herida de muerte.\nDemolishor: Se transforma en un Terex O&amp;K RH 400 Hydraulic Mining Excavator rojo y blanco. Tiene un gran tamaÃƒÂ±o. Es quien advierte a Optimus de la venganza de The Fallen y mas tarde es asesinado por Optimus Prime y Ironhide.\nLong Haul: Se transforma en un Caterpillar 773B Dump Truck en verde. Es uno de los que ayudan a revivir a Megatron.Durante la batalla en el cairo le alcanzo un misil de un bombardeo.Perdio una rueda pero a sobrevivido.\nScrapper: Se transforma en un Caterpillar 992G scoop loader amarillo. Tiene una maza giratoria.\nRampage: Se transforma en un Caterpillar D9 bulldozer rojo. Rampage utiliza las ruedas de su modo vehÃƒÂ­culo como lÃƒÂ¡tigos. Sus piernas forman un taladro. Es derrotado por Bumblebee\nMixmaster: Se transforma en un Mack concrete Mixer negro y gris. Es derrotado por Jetfire.\n\n Constructicons  Devastator: La uniÃƒÂ³n de 7 Constructicons, 5 de ellos similares a los Constructicons ya nombrados, algunos en diferente color. No pueden transformarse en robots, solo en las partes que forman a Devastator. Solo puede andar a cuatro patas (a modo de un gorila).En las extremidades izquierdas se combinan 2 Constructicons para formar los ejes de movilidad y asi no desequilibrarse(En la extremidad superior izquierda HighTower se monta sobre Rampage el cual tiene la forma de un cangrejo y la extremidad inferior izquierda LongHaul se monta sobre Rampage ambos de color amarillo los cuales aparecen desde un monticulo para iniciar la transformacion). Es capaz de succionar cosas dentro de su boca. Tiene un tamaÃƒÂ±o de 36 metros, algo asi como 8 autobuses de dos pisos puestos unos encima de otros. Absorbe a Mudflap pero este consigue salir. Mudflap y Skids lo consiguen daÃƒÂ±ar. y es destruido por un misil de un buque de guerra.\nA/9.5 V/9.5","torrent":{"xt":"urn:btih:2816ac4b505bd95946685194339dbf7124e8d077","amp;dn":"Transformers.Revenge.Of.The.Fallen-Xvid-Gozita","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2816ac4b505bd95946685194339dbf7124e8d077","infoHashBuffer":{"type":"Buffer","data":[40,22,172,75,80,91,217,89,70,104,81,148,51,157,191,113,36,232,208,119]},"announce":[],"urlList":[]}}