{"title":"[Kung Fu Comedy] On His Majesty's Secret Service 2009 BRRip X","uid":5112029,"size":945232452,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2818f6376e95dea2800cd7f2bbdd52e7615b5c35&amp;dn=%5BKung+Fu+Comedy%5D+On+His+Majesty%5C%27s+Secret+Service+2009+BRRip+X&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"sailo","files":5,"time":1254864004,"description":" &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1475330/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1475330/&lt;/a&gt;\n4.6/10 63 votes\n\nTrailer :\n\nHong Kong's master of silliness Wong Jing harks back to nineties cinema with the hilarious nonsensical period comedy On His Majesty's Secret Service! Setting its plentiful gags in the royal palace, this throwback laughfest embraces all the gems of the genre - wordplay, physical comedy, chop-sock action, wacky props, questionable special effects, and A-list stars mugging for laughs. Louis Koo and Barbie Hsu team up again after Connected to play a goofy feuding couple, while comedy queen Sandra Ng hams it up as the scheming Empress who's also a ninja! Additional comedic support is provided by genre regulars Lam Tze Chung, Kingdom Yuen, Leung Ka Yan, and Law Kar Ying plus Mainland stars Tong Dawei (Red Cliff II), Song Jia (Curiosity Killed the Cat), and Liu Yang (Bullet &amp; Brain). Martial artist Fan Siu Wong (Ip Man) also brings some credible action to the mix in an over-the-top turn as a villainous eunuch.\n\nIntrepid inventor Royal Dog (Louis Koo) is part of the elite imperial bodyguard team tasked with protecting the inept Emperor (Liu Yiwei) and Empress (Sandra Ng). Unlike his brother Royal Tiger (Tong Dawei), however, Royal Dog can't fight if his life depended on it. What he lacks in kung-fu prowess though, he makes up with wacky (untested) weaponry concocted in his workshop. When the Emperor decides to hold a competition to choose suitor for Princess Rainbow (Song Jia), Royal Dog becomes an unexpected top contender, much to the displeasure of his sassy girlfriend Faithful (Barbie Hsu). There's nary time for romance though when there are so many people out to kill him and the Emperor, including a cross-dressing female assassin (Liu Yang), head eunuch Lord Unicorn (Fan Siu Wong), and even the Empress herself!\n\n\nFormat : AVI\nFile size : 886 MiB\nDuration : 1h 37mn\n\nVideo\nCodec ID : XVID\nDuration : 1h 37mn\nBit rate : 1 121 Kbps\nWidth : 672 pixels\nHeight : 288 pixels\nDisplay aspect ratio : 2.35:1\nFrame rate : 24.000 fps\n\nAudio\nCodec ID/Hint : MP3\nBit rate mode : Constant\nBit rate : 32.0 Kbps\nChannel(s) : 2 channels\nSampling rate : 48.0 KHz\n\nSubtitles : English srt","torrent":{"xt":"urn:btih:2818f6376e95dea2800cd7f2bbdd52e7615b5c35","amp;dn":"%5BKung+Fu+Comedy%5D+On+His+Majesty%5C%27s+Secret+Service+2009+BRRip+X","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2818f6376e95dea2800cd7f2bbdd52e7615b5c35","infoHashBuffer":{"type":"Buffer","data":[40,24,246,55,110,149,222,162,128,12,215,242,187,221,82,231,97,91,92,53]},"announce":[],"urlList":[]}}