{"title":"Coast to Coast AM - Oct 05 2009 - Ghosts &amp; Haunted Places","uid":5111739,"size":55778036,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:28dfa04eaf77f3c3bd46554c80f0bc96ace18168&amp;dn=Coast+to+Coast+AM+-+Oct+05+2009+-+Ghosts+%26+Haunted+Places&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1254855287,"description":"Ghosts &amp; Haunted Places\n\nDate: 10-05-09\nHost: George Noory\nGuests: Jeff Belanger\n\nJournalist and ghosthunter Jeff Belanger discussed his work compiling ghost stories, and described some of the most haunted locations around the world. He also shared his analysis of ghostly activities, and other forms of the supernatural/paranormal. Different types of phenomena such as ghosts, aliens, and 'Old Hag' could actually be linked, he suggested-- they might be identified as one or the other, depending on the interpretation or perception of the witness.\n\n&quot;Legend tripping,&quot; in which people visit known haunted places or sighting hot spots has become increasingly popular, and is how some paranormal researchers are getting their start, he said. The paranormal in general has grown in public interest, with a plethora of TV shows, &quot;paranormal cruises,&quot; and haunted tours-- Chicago alone has five competing ghost tour companies, he pointed out.\n\nBelanger detailed some of the most classic haunted locations and shared some of his personal experiences at them:\n\n- Waverly Hills Sanatorium, Louisville, KY-- People regularly report seeing shadowy figures at the facility that used to house tuberculosis patients. In fact, Belanger said he and multiple witnesses saw such a Shadow Person during one of his visits there.\n\n- America's Stonehenge, New Hampshire-- A mysterious archeological site with large rocks and stone structures, some believe it dates back 4,000 years, and may have been the scene of human sacrifices. Glowing spots and orbs have been seen there, and it's one of the most haunted spots in New England, he said.\n\n- Old Idaho Penitentiary, Boise-- Closed in 1973, it was the site of many hangings and executions. People have reported being invisibly pushed, touched, and scratched near where the gallows were located. The fact that the building is surrounded by stone may contribute to the haunting environment.\n\n- Paris Catacombs-- To make room for the expanding city, Paris moved some six million bodies out of cemeteries and placed their bones inside a one-mile long chamber that runs underneath the city. Many of the bones are exhibited in beautiful and macabre patterns such as a valentine. Belanger said he saw the shadow of a man move from left to right down one of the narrow passageways, but there was no one there.\n\nCheck out Jeff's weekly Internet TV talk show, 30 Odd Minutes, which plays live on Thursdays at 5pm PT/8pm ET.\n\nThe last hour of C2C featured Open Lines.\n\nWebsite(s):\nghostvillage.com\njeffbelanger.com\n\nBook(s):\nEncyclopedia of Haunted Places\nCommunicating With The Dead: Reach Beyond The Grave\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224","torrent":{"xt":"urn:btih:28dfa04eaf77f3c3bd46554c80f0bc96ace18168","amp;dn":"Coast+to+Coast+AM+-+Oct+05+2009+-+Ghosts+%26+Haunted+Places","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28dfa04eaf77f3c3bd46554c80f0bc96ace18168","infoHashBuffer":{"type":"Buffer","data":[40,223,160,78,175,119,243,195,189,70,85,76,128,240,188,150,172,225,129,104]},"announce":[],"urlList":[]}}