{"title":"America In Peril (Nutjob Press)","uid":5496346,"size":10987304,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:291a4b3f7e21c17800a222ec6ec74d19fac96d27&amp;dn=America+In+Peril+%28Nutjob+Press%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"artpepper","files":-1,"time":1271291695,"description":"America in peril: A Call To Arms by M. W. Jefferson (nutcase)\n\nPublisher: Freedom &amp; Liberty Foundation (nutcases) | 1995 | ASIN B0006R2AG4 | PDF | 117 pages | 10.5 MB\n\n\n\n\n\n&quot;This is M. W. Jefferson's explosive book America in Peril - A Call to Arms (2001) which is a fast-paced overview of how America's leaders are allowing the stationing of Russian, Chinese, and other enemy foreign troops and their military equipment (tanks, trucks, missiles, etc.) into the United States. Many Americans have noticed strange troops and equipment moving freely across the country and fenced camps being set up. (because they're on drugs)\n\nThe government denies any charges that these will be used to detain Americans but you should know better. Is this not treason ? (no)\n\nRead the facts, look at the photographs and then decide. With America in Peril it's time to get involved in the battle for America's survival unless you'd rather live and die as a slave under an iron-fisted New World Order dictatorship. \n\n120 pages, some pictures. A must read for everyone (nutcases).&quot;\n\n\n\n\n\nA DISCLAIMER: I Am Not A Nut-Job (despite appearances and rumours to the contrary and the fact that I may have been sexually molested by aliens)\n\n@artpepper says: Now, you're probably wondering what a sane, fair-minded man like myself is doing uploading this deranged claptrap? \n\nWell, I thought it would be a good idea for rational people to know what they're up against. These loony-tunes actually believe all this horse-shit and they're not (unfortunately) a figment of my imagination. \n\nKnow your enemy, guys...and crazy people (and these ARE seriously, bat-shit crazy people) are our enemies. The best weapon against this sort of crap is mockery. \n\nMock away, folks.....","torrent":{"xt":"urn:btih:291a4b3f7e21c17800a222ec6ec74d19fac96d27","amp;dn":"America+In+Peril+%28Nutjob+Press%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"291a4b3f7e21c17800a222ec6ec74d19fac96d27","infoHashBuffer":{"type":"Buffer","data":[41,26,75,63,126,33,193,120,0,162,34,236,110,199,77,25,250,201,109,39]},"announce":[],"urlList":[]}}