{"title":"The Killers - Bones","uid":5059515,"size":131592196,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2951241e871cf4208dd7720feb1465d0f6f38ae2&amp;dn=The+Killers+-+Bones&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1250594297,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nThis video has no logos or titles. \n\n\n&quot;Bones&quot; is a song by Las Vegas-based rock band The Killers, and was written by lead vocalist Brandon Flowers, bassist Mark Stoermer and drummer Ronnie Vannucci. It is the eighth track on their second album Sam's Town, released in October 2006. It was originally titled &quot;It's Only Natural&quot; in its early stages. Eventually, the song was released as the second single from Sam's Town in late November 2006. The single did not match the success of its predecessor and new center-piece track, &quot;When You Were Young&quot;, only registering on Billboard's Modern Rock Tracks chart in the United States at #21. The single fared slightly better in the United Kingdom, peaking at #15 in the UK Singles Chart.\n\nThe music video for the song is notable for being the first, and so far only, music video directed by filmmaker Tim Burton, featuring model/actress Devon Aoki.\n\nThe music video for &quot;Bones&quot; marks the music video directing debut of movie director, Tim Burton. Clips of the band were shot August 17-18, 2006, and were edited together along with CGI backgrounds and characters, including a (fitting) Burton staple: skeletons. Michael Steger and Devon Aoki star in the video.\n\nScenes from the films Lolita, Creature from the Black Lagoon, and Jason and the Argonauts, more specifically the scenes with Ray Harryhausen's skeleton-men, are shown behind the band. There is a sequence where Flowers' hand is replaced with that of a skeleton. The beach scenes from From Here to Eternity and 10 are recreated with skeleton figures. The leading couple are seen driving onto the beach where the girl removes her hair to reveal her skull and the man pulls off his shirt to reveal his skeleton. The two leading skeletons are later seen running across the beach to embrace only for them to crash into one another and shatter to pieces. Then on the beach a wave comes over to reveal the two skeletons kissing. At the end of the video, the entire band are skeletons, and they all fall apart at the song's final note.\n\nThe drive-in depicted unofficially is that of the West Wind Las Vegas Drive-In Theatre located in North Las Vegas, NV.\n\nAt the 2007 Shockwaves NME Awards it won the award for Best Video.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:2951241e871cf4208dd7720feb1465d0f6f38ae2","amp;dn":"The+Killers+-+Bones","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2951241e871cf4208dd7720feb1465d0f6f38ae2","infoHashBuffer":{"type":"Buffer","data":[41,81,36,30,135,28,244,32,141,215,114,15,235,20,101,208,246,243,138,226]},"announce":[],"urlList":[]}}