{"title":"Godsmack - What If [.mp3] - NEW SONG HQ@VBR","uid":5510898,"size":9942030,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:29ae7c4522aad37da119d5774cffe7ac4922ac1b&amp;dn=Godsmack+-+What+If+%5B.mp3%5D+-+NEW+SONG+HQ%40VBR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MP3Nova","files":1,"time":1272046683,"description":"Godsmack is an American heavy metal band from Lawrence, Massachusetts, formed in 1995. The band comprises founder, frontman and songwriter Sully Erna, guitarist Tony Rombola, bassist Robbie Merrill, and drummer Shannon Larkin. Since its formation, Godsmack has released four studio albums, one EP, four DVDs, and one greatest hits collection.\n\nThe band has had two consecutive #1 albums (Faceless and IV) on the Billboard 200, and currently working on their fifth studio album which is expected be released in the first quarter of 2010.\n\nThe band also has parked a ratified 14 songs in the Top Five, more than bands such as Linkin Park and Metallica. Godsmack are one of the most popular heavy metal acts of the last decade in the United States, selling over 19 million records worldwide.\n\nSince its inception, Godsmack has toured on Ozzfest on more than one occasion, and have toured with many other large tours and festivals, including supporting its albums with its own arena tours. The band was also a part of Crue Fest 2. Godsmack was voted as the best act of Crue Fest, which sparked a feud between Godsmack and Motley Crue which led to Sully and crew writing their single, Cryin' Like Bitch.","torrent":{"xt":"urn:btih:29ae7c4522aad37da119d5774cffe7ac4922ac1b","amp;dn":"Godsmack+-+What+If+%5B.mp3%5D+-+NEW+SONG+HQ%40VBR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29ae7c4522aad37da119d5774cffe7ac4922ac1b","infoHashBuffer":{"type":"Buffer","data":[41,174,124,69,34,170,211,125,161,25,213,119,76,255,231,172,73,34,172,27]},"announce":[],"urlList":[]}}