{"title":"Whitney Houston [2009] I Look At You [Fast Seed]","uid":5095497,"size":71170499,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:29c0048071dd0719f9b4477e2e703c1918a27c00&amp;dn=Whitney+Houston+%5B2009%5D+I+Look+At+You+%5BFast+Seed%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":19,"time":1253532880,"description":"The album will be a mixture of R&amp;B, big ballads, and dance music. According to Davis, the album is aiming not to simply follow current music marketing trends, but instead, stay true to who Houston is and the impact she has made on the music industry. The roster of producers and writers include Swizz Beatz, Johnta Austin, Alicia Keys, R. Kelly, Harvey Mason, Jr., and Akon, who is the only guest vocalist on the album. Houston's performance on Good Morning America's 'Fall Concerts' series on the American television broadcast network ABC aired on September 02, 2009. She performed songs from this album, including single &quot;Million Dollar Bill&quot; and title song &quot;I Look to You&quot;, as well as previous hits &quot;I'm Every Woman&quot; and &quot;My Love Is Your Love&quot;. 1. &quot;Million Dollar Bill&quot; Alicia Keys, Kasseem Dean, Norman Harris Kaseem &quot;Swizz Beatz&quot; Dean, Alicia Keys 3:24 2. &quot;Nothin' But Love&quot; Franne Golde, Fernando Garibay, Kasia Livingston, Nathaniel Hills Nathaniel &quot;Danja&quot; Hills, Fernando Garibay 3:35 3. &quot;Call You Tonight&quot; Tor Erik Hermansen, Mikkel S. Eriksen, JohntÃƒÂ¡ Austin StarGate 4:08 4. &quot;I Look to You&quot; Robert Kelly Harvey Mason, Jr., Emanuel Kiriakou, Christopher &quot;Tricky&quot; Stewart 4:25 5. &quot;Like I Never Left&quot; (featuring Akon) Whitney Houston, Aliaune Thiam, Giorgio Tuinfort, Claude Kelly Aliaune &quot;Akon&quot; Thiam 3:49 6. &quot;A Song for You&quot; Leon Russell StarGate 4:11 7. &quot;I Didn't Know My Own Strength&quot; Diane Warren David Foster 3:40 8. &quot;Worth It&quot; Eric Hudson, J. Austin Eric Hudson 4:39 9. &quot;For the Lovers&quot; Marcella Araica, C. Kelly, N. Hills Danja 4:14 10. &quot;I Got You&quot; Whitney Houston, Aliaune Thiam, Giorgio Tuinfort, Claude Kelly Akon, Giorgio Tuinfort 4:12 11. &quot;Salute&quot; R. Kelly R. Kelly 4:10\n","torrent":{"xt":"urn:btih:29c0048071dd0719f9b4477e2e703c1918a27c00","amp;dn":"Whitney+Houston+%5B2009%5D+I+Look+At+You+%5BFast+Seed%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29c0048071dd0719f9b4477e2e703c1918a27c00","infoHashBuffer":{"type":"Buffer","data":[41,192,4,128,113,221,7,25,249,180,71,126,46,112,60,25,24,162,124,0]},"announce":[],"urlList":[]}}