{"title":"Gran Torino avi DivX","uid":5037311,"size":943903874,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:29cf1694b3600b1b13b6b6ad69e22b774cf4c24b&amp;dn=Gran+Torino+avi+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Doc.torr","files":1,"time":1249185063,"description":"Walt Kowalski is a widower who holds onto his prejudices despite the changes in his Michigan neighborhood and the world around him. Kowalski is a grumpy, tough-minded, unhappy an old man, who can't get along with either his kids or his neighbors, a Korean War veteran whose prize possession is a 1972 Gran Torino he keeps in mint condition. When his neighbor Thao, a young Hmong teenager under pressure from his gang member cousin, tries to steal his Gran Torino, Kowalski sets out to reform the youth. Drawn against his will into the life of Thao's family, Kowalski is soon taking steps to protect them from the gangs that infest their neighborhood. Written by alfiehitchie\n\nIn Michigan, the grumpy widower Walt Kowalski is a Korean War veteran full of prejudice that has just lost his beloved wife Dorothy. He is one of the last Caucasian Americans in his neighborhood and does not have good relationship with his sons and their families; therefore he is a lonely man. When his teenager neighbor Thao Vang Lor is pressed by his cousin Smokie to join his Hmong gang, he is assigned to steal the Gran Torino of Walt as part of his initiation in the gang. However he is surprised by the old man and his traditional family feels ashamed with the incident. Later Walt saves Thao first and his sister Sue Lor from gangs and he has the gratitude of his next door neighbors and the neighborhood. On the day of his birthday, Walt is invited by Sue to join her family reunion and he begins a relationship with his neighbors, helping Thao to get a job. However he realizes that the Hmong gang disturbs the neighborhood and after a coward attack of the gangster, Walt decides to take an ultimate attitude. Written by Claudio Carvalho, Rio de Janeiro, Brazil","torrent":{"xt":"urn:btih:29cf1694b3600b1b13b6b6ad69e22b774cf4c24b","amp;dn":"Gran+Torino+avi+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29cf1694b3600b1b13b6b6ad69e22b774cf4c24b","infoHashBuffer":{"type":"Buffer","data":[41,207,22,148,179,96,11,27,19,182,182,173,105,226,43,119,76,244,194,75]},"announce":[],"urlList":[]}}