{"title":"FEMA concentration camps, Underground camps, Kill Internet etc.","uid":5072608,"size":4479582208,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2a48b18b09f4953e259fb98978d47d63ed171452&amp;dn=FEMA+concentration+camps%2C+Underground+camps%2C+Kill+Internet+etc.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thisisthat33","files":1,"time":1251547076,"description":"NEW UPDATE! 12-11-09\n\nFolks, a major city will be attacked in a very short time. It is delayed because people know. The new information talk about something before christmas. My warning will be here but if we have succeeded stopping the attack even after late 2009 i have no more time to give. \n\nTIME TO WAKE UP! The hour is near. I beg on you get on your knees and take Jesus Christ as your saver.\n\nThis year 2009 or the next years ahead will be hard and the people in New York City, Manhattan area will feel a big scary happening and that will be the start for a new global money system effecting all people all over the world because the elite have a plan for the next 3 years ahead and they are scared only for one thing: The people!\nLEAVE the area New York, Manhattan, New Jersey, Washington and the places around it RIGHT NOW! If this fails the warning will still be here because the timeline can be changed.\n\nWatch this movie and you will look into the future with concentration camps and hell on the earth. Also the big dollar collaps BUT something catastrophical will happen BEFORE that. Can you now understand what i mean? \nLEAVE the area New York, Manhattan, New Jersey, Washington and the places around it RIGHT NOW! \nBehold a pale horse by William Cooper is a good book. Search for it and you will learn not only about New York but also that Los Angeles will be hit by a 9.0 Earthquake! \n\nThe CIA has a database which they can use to track down if certain words or group of words are being used anywhere online. If they happened to find out that their &quot;secret&quot; plan has been exposed on the exact date or time frame, then they simply can not go further with the plan so therefore: Combined disasters...Just look at the illuminati card game people!!! It is going to happen and don't think it gonna happen now. Obama and Rockefeller ? Obama must get through with his sick reform first and Rockefeller with his Internet stop. just wait...OR take action to stop this! a clue...the church on the card &quot;Combined Disasters&quot; what time is it? Hmmm. maybe CIA read this. in this case. Congratulations we have just figured out your illuminati plan. We know what you are doing.\n\nPeople here call me Christofascist LOL! This information comes from non christians and some are christians too but i would like you to think like this: All of us is going to die! If not by a world war 3 you will get older and die! You have a chance to use your spiritual power in order to get through things like this. I am not interested in movies like Jesus Camp and things like that. All i am doing is telling the truth. Bilderberg groups, Elite people, Skull and bones etc reading the bible and try their best to follow the script so the good people not understand what is going on but they have satan as their God NOT Jesus Christ. \n\n\nPLEASE it is time to understand that this is not going to be better! You can not do anything. All this has to be done even if we stop this from happen this year and you better wake up now when we still have time to do something for our lives.\n\nJust a little about the swineflu shot and microship. The flu is not the thing. Its gonna be hell on the earth and the ship is on the agenda around the year of 2014. \n\nRemember that Serge Monast was expecting this to happen around 2000 but until now it hasn't happen and i think it is because the people woke up and we still have time to stop it this time too. I don't believe the year 2012 will be the big &quot;Starwars&quot; show in London Olympic game i think they either us the hologram false Jesus picture telling us into our mind from computers in Sovjet and satellites in space before that date or after 2012. People like me and others simply tell what is going to happen the date and year and they can't do it. Ha! Now, let us stop them from doing this this time too!!!\n\nGod bless you.","torrent":{"xt":"urn:btih:2a48b18b09f4953e259fb98978d47d63ed171452","amp;dn":"FEMA+concentration+camps%2C+Underground+camps%2C+Kill+Internet+etc.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a48b18b09f4953e259fb98978d47d63ed171452","infoHashBuffer":{"type":"Buffer","data":[42,72,177,139,9,244,149,62,37,159,185,137,120,212,125,99,237,23,20,82]},"announce":[],"urlList":[]}}