{"title":"Rambo.DVD_R.Collection","uid":5110651,"size":17816231936,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:2ba9d8c58bafd29ca8a70d4130d08caa914db128&amp;dn=Rambo.DVD_R.Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiagofavi2612","files":136,"time":1254707835,"description":"Sinopse \n Sinopse\n\nUm herÃƒÂ³i da Guerra do VietnÃƒÂ£ ÃƒÂ© tratado como se fosse um vagabundo pelas autoridades de uma pequena cidade do interior dos Estados Unidos. AtÃƒÂ© que sua agressividade vem ÃƒÂ  tona quando ele ÃƒÂ© preso e torturado por policiais. Com Sylvester Stallone e Brian Dennehy. Veterano (Sylvester Stallone) da Guerra do VietnÃƒÂ£ ÃƒÂ© preso injustamente por xerife (Brian Dennehy), mas consegue fugir e promove uma guerra nÃƒÂ£o sÃƒÂ³ contra o policial mas contra toda uma cidade, causando pÃƒÂ¢nico e destruiÃƒÂ§ÃƒÂ£o, que ÃƒÂ© o que ele sabe fazer de melhor\n\n\n\nRambo 2\n\nRambo ÃƒÂ© designado para uma missÃƒÂ£o secreta nas selvas do VietnÃƒÂ£, onde precisarÃƒÂ¡ resgatar prisioneiros norte-americanos e enfrentar um poderoso exÃƒÂ©rcito. Com Sylvester Stallone. Recebeu uma indicaÃƒÂ§ÃƒÂ£o ao Oscar. John Rambo (Sylvester Stallone) estÃƒÂ¡ cumprindo pena em uma penitenciÃƒÂ¡ria federal quando recebe uma proposta: se participar de uma missÃƒÂ£o suicida (que consiste em localizar prisioneiros americanos) no sudeste asiÃƒÂ¡tico serÃƒÂ¡ perdoado e reintegrado ao exÃƒÂ©rcito. Ele concorda mas nÃƒÂ£o imaginava que seria traÃƒÂ­do pelos compatriotas, que nÃƒÂ£o querem de fato nenhuma prova de prisioneiros, pois isto acarretaria gastos de 2 bilhÃƒÂµes de dÃƒÂ³lares para libertÃƒÂ¡-los. Com isso, Rambo acaba sendo abandonado pelos americanos em territÃƒÂ³rio inimigo.\n\n\nRambo 3\n\nConvocado para uma nova e arriscada missÃƒÂ£o no AfeganistÃƒÂ£o, Rambo a recusa, cansado de tanto lutar. AtÃƒÂ© que um velho amigo ÃƒÂ© capturado pelas tropas inimigas, o que faz com que ele mude de idÃƒÂ©ia. Com Sylvester Stallone. Veterano (Sylvester Stallone) da Guerra do VietnÃƒÂ£ refugia-se em mosteiro budista, em busca de paz espiritual. O retiro ÃƒÂ© interrompido quando ele decide libertar seu mentor, que caiu nas mÃƒÂ£os dos soviÃƒÂ©ticos, durante a ocupaÃƒÂ§ÃƒÂ£o do AfeganistÃƒÂ£o.\n\n\nRambo 4\n\nAgora vivendo no norte da TailÃƒÂ¢ndia, John Rambo se envolve com um grupo de mercenÃƒÂ¡rios contratados para resgatar dois missionÃƒÂ¡rios. Dirigido e estrelado por Sylvester Stallone (Rocky Balboa) e com Ken Howard no elenco.Uma guerra civil acontece hÃƒÂ¡ quase 60 anos na fronteira com a BirmÃƒÂ¢nia, envolvendo os birmaneses e a tribo karen. John Rambo (Sylvester Stallone) vive no norte da TailÃƒÂ¢ndia, onde pilota um barco no rio Salween. Cansado de lutar, Rambo leva uma vida simples e solitÃƒÂ¡ria, apenas acompanhando o fluxo de rebeldes e refugiados. AtÃƒÂ© que surgem Sarah Miller (Julie Benz) e Michael Burnett (Paul Schulze), dois missionÃƒÂ¡rios que desejam levar alimentos e remÃƒÂ©dios ÃƒÂ s pessoas afetadas pela guerra. Inicialmente relutante, Rambo aceita a proposta de levÃƒÂ¡-los pelo rio. Mas 10 dias depois o pastor Artur Marsh (Ken Howard) o procura, dizendo que os missionÃƒÂ¡rios foram capturados e que havia recolhido dinheiro para contratar mercenÃƒÂ¡rios para resgatÃƒÂ¡-los. O pastor agora quer que Rambo leve os mercenÃƒÂ¡rios atÃƒÂ© o local onde ele deixou os missionÃƒÂ¡rios, mas ele decide tambÃƒÂ©m participar da operaÃƒÂ§ÃƒÂ£o de resgate.\n\n \n","torrent":{"xt":"urn:btih:2ba9d8c58bafd29ca8a70d4130d08caa914db128","amp;dn":"Rambo.DVD_R.Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ba9d8c58bafd29ca8a70d4130d08caa914db128","infoHashBuffer":{"type":"Buffer","data":[43,169,216,197,139,175,210,156,168,167,13,65,48,208,140,170,145,77,177,40]},"announce":[],"urlList":[]}}