{"title":"Monkey Island 2 LeChucks Revenge Special Edition [PC-DVD][Multi5","uid":5679334,"size":1451999822,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:2bcea83faea897b66cbf83db152233e6ffdadac9&amp;dn=Monkey+Island+2+LeChucks+Revenge+Special+Edition+%5BPC-DVD%5D%5BMulti5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"YampeadoR","files":7,"time":1278722037,"description":"Following the release of a Special Edition of the first Monkey Island game in 2009, a Special Edition of Monkey Island 2 was released for the PS3 on July 6, 2010. However, the iPhone, iPod Touch, Windows, and Xbox 360 platforms got it a day later on July 7th, 2010.[15]  The Mac OS X version has not yet been released. The special edition includes updated graphics, a new musical score, new voice-overs, an art gallery, and an in-game hint system. Players can opt to switch from the updated version into the older, pixelated graphics and music of the original game at any time, though an option allows players to retain the voice-overs of the remake.[16]  Players can opt to use the original point-and-click control scheme, or can directly control the movements of Guybrush using a control pad or similar device.[17]\n\nThe remake was announced by LucasArts during their annual Game Developers Conference on March 10, 2010, with the previous creators of the adventures, Ron Gilbert, Tim Schafer and Dave Grossman, in attendance.[18] The trio of game designers have recorded a commentary track for the Special Edition that can be brought up at any time, using silhouettes in the fashion of Mystery Science Theater 3000 overlayed on the graphics.[19][17][20]\n\nCraig Derrick announced in an interview information on a new interface that was in the vein of The Curse of Monkey Island's and a return of the original voice cast, including Dominic Armato as Guybrush, Alexandra Boyd as Elaine, Earl Boen as LeChuck, and even Neil Ross as Wally. Phil LaMarr was also confirmed as Dread.","torrent":{"xt":"urn:btih:2bcea83faea897b66cbf83db152233e6ffdadac9","amp;dn":"Monkey+Island+2+LeChucks+Revenge+Special+Edition+%5BPC-DVD%5D%5BMulti5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bcea83faea897b66cbf83db152233e6ffdadac9","infoHashBuffer":{"type":"Buffer","data":[43,206,168,63,174,168,151,182,108,191,131,219,21,34,51,230,255,218,218,201]},"announce":[],"urlList":[]}}