{"title":"Joyeux Calvaire (1996)","uid":5023451,"size":411406702,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2c776d71aa46b98483c08abc8baa08241c3e0d76&amp;dn=Joyeux+Calvaire+%281996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1248580213,"description":"An Unsentimental View of Homelessness,\n\nA kind of 'Waiting for Godot' in mirror-reflection--peripatetic, ambulatory, not hopeless.\n\nTwo homeless men walk from place to place in Montreal, one a good talker, one a good listener. We see the routine, the expectations and treatment of homeless people in this city. Nothing much happens to the main characters; rather, we see their connections to the people they once were via flashback and the connections they have now lost to society; we also see other homeless people who are in far worse shape.\n\nDenys Arcand's directorial style is unsentimental and certainly unprepossessing. The camera generally follows them around not looking for pseudo-poetic moments; instead, it regards them. Many, if not all, of the characters really are homeless people, but this is done without an overt intention to re-dramatize as it is simply to hear stories told or see what people offer of themselves in a short space of time.\n\nThis is not a message movie but one that holds a mirror up to the way these two people and the people they meet live and talk. That, in itself, is enough. I suppose you could consider this as part of a genre of 'walking' movies, if you wanted to include Richard Linklater's work, and Gus van Sant's 'Gerry', but the tone here is neither philosophical nor introspective. It is simply put a day in the lives of these two men, with more pointed flashbacks.\n\nArcand's reputation took a bit of a hit with this film, in the sense that it was something to do between major fiction projects, and in the sense of 'so what', 'we know this already', but it is enough for me for this film to have captured a time and place and the people in it. One thing for sure, Montreal in '95, '96 was at the bottom of its economic cycle. The city is much improved since then, mercifully.","torrent":{"xt":"urn:btih:2c776d71aa46b98483c08abc8baa08241c3e0d76","amp;dn":"Joyeux+Calvaire+%281996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c776d71aa46b98483c08abc8baa08241c3e0d76","infoHashBuffer":{"type":"Buffer","data":[44,119,109,113,170,70,185,132,131,192,138,188,139,170,8,36,28,62,13,118]},"announce":[],"urlList":[]}}