{"title":"FreeISOBurner [PirateLoaded]","uid":5512694,"size":853290,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2c998e515d5b7dde52dca8adbec8e45b18bf41fb&amp;dn=FreeISOBurner+%5BPirateLoaded%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PirateLoaded","files":3,"time":1272126215,"description":"[PirateLoaded]\n\nAbout ISO image\n\nAn ISO image is an archive file (a.k.a. disk image) of an optical disc using a conventional ISO (International Organization for Standardization) format that is supported by many software vendors. ISO image is an unattached file format (like RAR and ZIP): it merges a series of files into one single file according to a definite format. ISO image files typically have a file extension of .ISO but Mac OS X ISO images often have the extension .CDR.\n\nThe name &quot;ISO&quot; is taken from the ISO 9660 file system used with CD-ROM media. ISO 9660 is a standard published by the International Organization for Standardization (ISO), defines a file system for CD-ROM media. It aims at supporting different computer operating systems such as Windows, classic Mac OS, and Unix-like systems, so that data may be exchanged.\nFree ISO burning software - Free ISO Burner\nFree ISO Burner can directly burn your ISO and CD/DVD image file to CD-R,CD-RW, DVD-R, DVD-RW, DVD+R, DVD+RW,HD DVD and Blu-ray Disc, no need mount any &quot;virtual drives&quot; which emulate physical CDs or DVDs, it write any data directly.\n\nFree ISO Burner hide all complex settings, let this program be very simple and easy to use. Click [Open] button to choice one ISO image file (*.iso), insert a blank CD in your CD-RW drive, then click [Burn] to start the disk burning. Users can select the drivers, set the disk volume, select burn speed and change the burn cache size, during the burning user can click [Abort] to abort the burning progress. Free ISO Burner can support bootable CD to image file. User can select [Finalize Disc] in main interface to finalize a disc on which data and music have already been written.\n\nFree ISO Burner is one &quot;100% free&quot; software, it is completely free for personal and non-commercial use, no adware and no spyware, you can use, copy, email, install and uninstall as you want. This program can work with Windows XP, Windows Vista 32-bit and 64-bit Editions. This program is very small, no need installation, one standalone program can do everything about burn one ISO image for you (if you want to uninstall, just delete the program file); it is portable software, and can run directly from one USB driver. \n\n[PirateLoaded]\nThis is 100% Clean And Working...\n\nFast Download Torrent!","torrent":{"xt":"urn:btih:2c998e515d5b7dde52dca8adbec8e45b18bf41fb","amp;dn":"FreeISOBurner+%5BPirateLoaded%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c998e515d5b7dde52dca8adbec8e45b18bf41fb","infoHashBuffer":{"type":"Buffer","data":[44,153,142,81,93,91,125,222,82,220,168,173,190,200,228,91,24,191,65,251]},"announce":[],"urlList":[]}}