{"title":"Tears For Fears - Mothers Talk","uid":5078238,"size":168372228,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2e10de3c06d6f38b589dde255ec75fbfd714e818&amp;dn=Tears+For+Fears+-+Mothers+Talk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1252056214,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Mothers Talk&quot; is a song by the British band Tears for Fears. Written by Roland Orzabal and Ian Stanley and sung by Orzabal, it was the band's seventh single release (the first taken from their second LP Songs from the Big Chair (1985)) and fifth UK Top 40 chart hit. The song was released well in advance of the LP and showcased the band's edgier sound, as compared to their debut LP The Hurting (1983).\n\nWhile America saw &quot;Everybody Wants to Rule the World&quot; as the first single release from the Songs from the Big Chair LP, &quot;Mothers Talk&quot; was eventually released there as the fourth and final single from the album in April of 1986, peaking at #27 on the Billboard Hot 100. This version of the song was completely re-recorded by the band after their Big Chair tour wrapped up and was mixed by award-winning producer Bob Clearmountain. In addition to a different picture sleeve, the single featured a cover of Robert Wyatt's &quot;Sea Song&quot; as the B-side.\n\nThree separate promotional clips were filmed for the song in total. The original version, a performance clip set in a blue toned room and interspersed with shots of a young girl being studied by scientists, was disliked by the band and quickly disowned. A replacement video (directed by Nigel Dick) was then filmed on a shoestring budget in Curt Smith's backyard. Both clips were released to UK and European markets\nin mid-1984. The third and final video was made for the &quot;US Remix&quot; of the song in early 1986 and portrayed a family preparing a bomb shelter for nuclear fallout, in keeping with the theme of Raymond Briggs' graphic novel When the Wind Blows. An extended mix of the song, featuring an extra verse at the beginning, is exclusive to this version.\n\nThis video is the &quot;US Remix&quot; version.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:2e10de3c06d6f38b589dde255ec75fbfd714e818","amp;dn":"Tears+For+Fears+-+Mothers+Talk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e10de3c06d6f38b589dde255ec75fbfd714e818","infoHashBuffer":{"type":"Buffer","data":[46,16,222,60,6,214,243,139,88,157,222,37,94,199,95,191,215,20,232,24]},"announce":[],"urlList":[]}}