{"title":"Iron Maiden - Can I Play With Madness","uid":5086331,"size":134625284,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2e4e69f3997c4a506d0c39b96b57e63d1027460e&amp;dn=Iron+Maiden+-+Can+I+Play+With+Madness&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1252748013,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Can I Play with Madness&quot; was the sixteenth single released by Iron Maiden. Released in 1988, it is the first single from the Seventh Son of a Seventh Son album and hit number 3 in the UK charts. The song is about a young man who wants to learn the future from an old prophet with a crystal ball. The young man thinks he is going mad and seeks the old prophet to help him cope with his visions/nightmares. The prophet's advice is ignored by the young man and they become angry with each other. The song was originally a ballad named &quot;On the Wings of Eagles&quot;, written by Adrian Smith.\n\nThe video of the song was set at Tintern Abbey and features Graham Chapman; this would be one of his last appearances on television before his death in October 1989 of cancer. In the video, Chapman plays an irritable art instructor who criticizes a young student for drawing Iron Maiden mascot Eddie rather than sketching the abbey ruins. The teacher discovers an underground lab and finally encounters an animated version of Eddie, who leers and reaches out to him from inside a refrigerator. The band appears on a TV screen showing live footage of a concert. Adrian Smith is shown playing left-handed, suggesting a reversed image.\n\nA young man seeks answers to the supernatural and goes to the prophet. The prophet looks at his crystal ball, but the young man sees nothing there (&quot;... there's no vision there at all!&quot;). The prophet looks at the young man and laughs, because the young man is &quot;too blind to see&quot; the vision. But more importantly, he's too blind to see what's really going on - in that he's being cheated and there really is no vision there.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:2e4e69f3997c4a506d0c39b96b57e63d1027460e","amp;dn":"Iron+Maiden+-+Can+I+Play+With+Madness","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e4e69f3997c4a506d0c39b96b57e63d1027460e","infoHashBuffer":{"type":"Buffer","data":[46,78,105,243,153,124,74,80,109,12,57,185,107,87,230,61,16,39,70,14]},"announce":[],"urlList":[]}}