{"title":"La Reina de los Condenados.DVDRip.","uid":5085151,"size":734156800,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2ec2d4efefc5005bc2be1d3cf20f1def1df7a54f&amp;dn=La+Reina+de+los+Condenados.DVDRip.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"zurera","files":1,"time":1252661654,"description":"Aaliyah, Stuart Townsend, Marguerite Moreau, Vincent Perez, Paul McGann, Lena Olin, Christian Manon, Claudia Black, Bruce Spence, Matthew Newton, Tiriel Mora, Megan Dorman, Johnathan Devoy, Robert Farnham, Conrad Standish\n\nCalificaciÃƒÂ³n moral: No recomendada para menores de 13 aÃƒÂ±os\nProduce: Warner Bros. Pictures, Village Roadshow Pictures, NPV Entertainment, Material, WV Films LLC\nDistribuye en EspaÃƒÂ±a: Warner Home Video\n\t\t\n  Sinopsis\nEl vampiro legendario Lestat (Stuart Townsend) se ha levantado tras un largo sueÃƒÂ±o de dÃƒÂ©cadas decidido a caminar hacia la luz. No contento de haber sido desterrado a las tinieblas y moviÃƒÂ©ndose entre los mortales, Lestat se ha reencarnado en la cosa mÃƒÂ¡s cercana a un dios en la tierra: una estrella de rock. El reclamo de su mÃƒÂºsica ha serpenteado alrededor de la tierra encontrando en ÃƒÂºltima instancia el oÃƒÂ­do de la antigua reina Akasha (Aaliyah). La madre de los vampiros, Akasha, ha estado reposando por siglos y esperando la ÃƒÂ©poca perfecta para levantarse otra vez y alcanzar el dominio sobre el mundo. La mÃƒÂºsica de Lestat es la revelaciÃƒÂ³n que ha estado esperando, y ella desea que ÃƒÂ©l gobierne a su lado. Ã‚Â¿Pero podrÃƒÂ¡ Akasha ser parada? Su energÃƒÂ­a malÃƒÂ©vola es demasiado grande incluso para los mÃƒÂ¡s antiguos vampiros inmortales. DespuÃƒÂ©s de todo, Akasha estÃƒÂ¡ acostumbrada a conseguir todo lo que ella desea... y lo ÃƒÂºnico que desea es el infierno en la tierra.","torrent":{"xt":"urn:btih:2ec2d4efefc5005bc2be1d3cf20f1def1df7a54f","amp;dn":"La+Reina+de+los+Condenados.DVDRip.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ec2d4efefc5005bc2be1d3cf20f1def1df7a54f","infoHashBuffer":{"type":"Buffer","data":[46,194,212,239,239,197,0,91,194,190,29,60,242,15,29,239,29,247,165,79]},"announce":[],"urlList":[]}}