{"title":"Coast to Coast AM - Sep 20 2009 - UFO Cases in China &amp; Australia","uid":5100193,"size":56495387,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:30827ed3c2259f1eb231706fe6a0b81304f65c42&amp;dn=Coast+to+Coast+AM+-+Sep+20+2009+-+UFO+Cases+in+China+%26+Australia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"0vercast","files":4,"time":1253909285,"description":"UFO Cases in China &amp; Australia\n\nDate: 09-20-09\nHost: George Knapp\nGuests: Bill Chalker, Thornton Barnes\n\nAustralian UFO investigator Bill Chalker discussed UFO cases in China, as well as his continued investigations into alien abductions in Australia. He's conducted extensive research into Chinese sightings, and made trips there in 2002, 2005, and 2006. The recent UFO sighting by Chinese scientists at the Purple Mountain Observatory that occurred during the solar eclipse in July has been somewhat of a &quot;lost in translation&quot; episode in terms of press coverage, he noted. The scientists witnessed an unexplained object in the corona of the eclipse-- it wasn't necessarily a craft, but probably more like an astronomical body, he explained. \n\nHe spoke about several ET encounter cases in China. In one, a man was taken inside a UFO, and made to take part in a healing exercise for a young woman, which involved a solid beam of light. Interestingly, the woman was later tracked down and found to have unusual marks on her body, he reported. Chalker said he's particularly fascinated by cases such as this that involve &quot;solid lights,&quot; beams of light that are sometimes used to transport or heal.\n\nHe reviewed the 1992 Australian alien abduction case (featured in his book Hair of the Alien), in which a man named Peter Khoury received a strange visitation from two naked women, and recovered a strand of blonde hair after the encounter. This hair underwent DNA analysis and was found to have unusual hybrid qualities-- the shaft was a rare Asian mongoloid sequence, while the root had a rare Gaelic profile, he detailed. Chalker outlined alien connections to various isolated cultures and tribes, which suggests to him that alien interactions have been going for a lot longer than is typically thought, and there may eventually be DNA evidence to demonstrate this.\n\nGroom Lake Missions\n\nFirst hour guest, T.D. Barnes, talked about his work on classified/top secret projects at the Groom Lake facility (Area 51) in Nevada. Serving organizations such as the CIA and the National Defense Agency, he worked on missions that included the Soviet MiG exploitation project, and the development of stealth technology. During his years at the base, he did not see any recovered UFOs or ET craft, but he did admit there is technology there that is well beyond what people have seen. Barnes will be speaking at a panel discussion moderated by George Knapp on October 8 at the Atomic Testing Museum in Las Vegas.\n\nWebsite(s):\ntheozfiles.com\nnvahof.org/barnes_nvahof.html\n\nBook(s):\nThe Oz Files\nHair of the Alien: DNA and Other Forensic Evidence of Alien Abductions\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224\t","torrent":{"xt":"urn:btih:30827ed3c2259f1eb231706fe6a0b81304f65c42","amp;dn":"Coast+to+Coast+AM+-+Sep+20+2009+-+UFO+Cases+in+China+%26+Australia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30827ed3c2259f1eb231706fe6a0b81304f65c42","infoHashBuffer":{"type":"Buffer","data":[48,130,126,211,194,37,159,30,178,49,112,111,230,160,184,19,4,246,92,66]},"announce":[],"urlList":[]}}