{"title":"Super Utilities 9.6.25 cracked.exe-rev [29 powerful utilities to","uid":5100095,"size":5856774,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:30ac49945be938fb2a0d3f3a01bd0cd93c0cd35f&amp;dn=Super+Utilities+9.6.25+cracked.exe-rev+%5B29+powerful+utilities+to&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"marcco","files":-1,"time":1253904868,"description":"\nSuper Utilities 9.6.25 cracked.exe-rev [29 powerful utilities to make your PC run faster]\n\n\n\n\n\n29 powerful utilities to make your PC run faster, safer, with greater privacy and security\n\nMakes your computer run faster, safer, with greater privacy and security\nSuper Utilities is a collection of applications that will fix, speed up, maintain and protect your PC.\nComprising four focus modules designed to do everything from cleaning your Registry to removing spyware infestations. Super Utilities is a megamart of system-maintenance tools designed to keep your computer running smoothly.\n\nSuper Utilities's integrated suite of programs can get your system running at peak performance levels in few minutes.\n\nfeatures\nÃ‚Â· Disk Cleaner: Find and remove debris that has been left behind on your system by untidy programs, system freezes and sudden system restarts.\nÃ‚Â· Registry Cleaner: Clean and fix your registry to improve your PC's performance.\nÃ‚Â· Uninstaller Plus: Uninstall a program,remove invalid uninstaller information left on your computer and hide special uninstall entries to avoid other users from uninstalling programs .\nÃ‚Â· StartUp Manager: Add, remove, disable, and enable all of the programs that should start with each Windows session.\nÃ‚Â· Memmory Turbo: No matter how much RAM you have, this smart memory management program will keep your computer running better, faster, and longer.\nÃ‚Â· Folder Guard: Hide your private files and folders from other users of your computer, to restrict access to important system files and protect them from damage.\nÃ‚Â· Tracks Washer: Cleans up all your tracks left by Windows, browser and many other programs. Protect your privac,save storage space and improve performance of your computer.\nÃ‚Â· Windows Manager: Manange all windows. You can close, topmost, show or hide them and use hotkey for special functions.\nÃ‚Â· Process Manager: Find out the the detailed information about the running processes,kill processes and forbit special programs to run.\nÃ‚Â· IE Protecrot: Protect Internet Explorer while you surf, preventing Web sites from running malicious code or changing your browser settings behind your back.\nÃ‚Â· AutoShutdown: An award-winning system shutdown/restart/logoff manager with many powerful capabilities.\nÃ‚Â· FolderSize: Find out which folders are the largest on your drives and recover megabytes on it.\nÃ‚Â· Driver Backup: Designed to backup driver of your system in case of system crash or reinstallation of Windows.\nÃ‚Â· Super Shell: A unique suite of context-menu shell extensions for Windows 98/Me/2000/XP.","torrent":{"xt":"urn:btih:30ac49945be938fb2a0d3f3a01bd0cd93c0cd35f","amp;dn":"Super+Utilities+9.6.25+cracked.exe-rev+%5B29+powerful+utilities+to","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30ac49945be938fb2a0d3f3a01bd0cd93c0cd35f","infoHashBuffer":{"type":"Buffer","data":[48,172,73,148,91,233,56,251,42,13,63,58,1,189,12,217,60,12,211,95]},"announce":[],"urlList":[]}}