{"title":"WinRar v3.90 Final","uid":5071516,"size":2108563,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:317cfbaae0545f30f7367881572b123b86b91d33&amp;dn=WinRar+v3.90+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"spotted_jackal","files":-1,"time":1251449465,"description":"\n\n\n\nWinRAR v3.90 Final\n\nDescription\n\nWinRAR is a 32-bit Windows version of RAR Archiver, an archiver and archive manager. RAR files can usually compress \ncontent by 8 percent to 15 percent more than ZIP files can. WinRAR's main features include strong general and \nmultimedia compression, the ability to process non-RAR archive formats, ZIP compression and decompression,\nsupport for long filenames, programmable self-extracting archives (SFX), repair of damaged archives, authenticity \nverification, embedded file comments, and encryption. Unicode is supported in archive filenames, allowing non-English \nfilenames to be handled painlessly. You can manipulate the parameters of many archives at once and view a volume \nsequence as a single archive. WinRAR can convert other archive formats to RAR and search for specified text and files \nin archives.\n    \nVersion 3.90 adds decompression support for AES-encrypted ZIP files, improved display information, more context-menu \noptions, and a more secure method of deleting temporary files.\n    \n    \n    # WinRAR is a powerful compression tool with many integrated \n    additional functions to help you organize your compressed \n    archives.\n    \n    # WinRAR puts you ahead of the crowd when it comes to \n    compression. By consistently creating smaller archives, WinRAR \n    is often faster than the competition. This will save you disc space, \n    transmission costs AND valuable working time as well.\n    \n    # WinRAR supports all popular compression formats (RAR, ZIP, \n    CAB, ARJ, LZH, ACE, TAR, GZip, UUE, ISO, BZIP2, Z and 7-Zip).\n    \n    # WinRAR is ideal for multimedia files. WinRAR automatically \n    recognizes and selects the best compression method. The special \n    compression algorithm compresses multimedia files, executables \n    and object libraries particularly well.\n    \n    # WinRAR allows you to split archives into separate volumes \n    easily, making it possible to save them on several disks for \n    example.\n    \n    # WinRAR is also ideal, if you are sending data through the web. \n    Its 128 bit password encryption and its authenticated signature \n    technology will give you the peace of mind you have been looking \n    for.\n    \n    # WinRAR licenses are valid for all available language and \n    platform versions. If you have purchased several licenses, you \n    can even mix versions to meet your own personal needs.\n\n\nWinRAR benefits\n\n   * Using WinRAR puts you ahead of the crowd when it comes to compression by consistently making smaller archives than the competition, saving disk space and transmission costs.\n   * WinRAR provides complete support for RAR and ZIP archives and is able to unpack CAB, ARJ, LZH, TAR, GZ, ACE, UUE, BZ2, JAR, ISO, 7Z, Z archives.\n   * WinRAR offers a graphic interactive interface utilizing mouse and menus as well as the command line interface.\n   * When you purchase WinRAR license you are buying a license to the complete technology, no need to purchase add-ons to create self-extracting files, it's all included. One price, one payment, once.\n   * You also receive the benefit of a life-time use of the WinRAR archiver. No upgrade fee to pay. When a new release is made, simply download and install, your license is valid for life.\n   * WinRAR is easier to use than many other archivers with the inclusion of a special &quot;Wizard&quot; mode which allows instant access to the basic archiving functions through a simple question and answer procedure. This avoids confusion in the early stages of use.\n   * WinRAR offers you the benefit of industry strength archive encryption using AES (Advanced Encryption Standard) with a key of 128 bits.\n   * WinRAR supports files and archives up to 8,589 billion gigabytes in size. The number of archived files is, for all practical purposes, unlimited.\n   * WinRAR offers the ability to create selfextracting and multivolume archives.\n   * Recovery record and recovery volumes allow to reconstruct even physically damaged archives.\n   * WinRAR features are constantly being developed to keep WinRAR ahead of the pack. \n\nInstall\n\nUnpack with any archiver \nRun setup exe to install program\ncopy files from crack folder to program DIR \nusually c:programsprogram name and replace files \nThen apply reg file\n\n","torrent":{"xt":"urn:btih:317cfbaae0545f30f7367881572b123b86b91d33","amp;dn":"WinRar+v3.90+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"317cfbaae0545f30f7367881572b123b86b91d33","infoHashBuffer":{"type":"Buffer","data":[49,124,251,170,224,84,95,48,247,54,120,129,87,43,18,59,134,185,29,51]},"announce":[],"urlList":[]}}