{"title":"The Spherical Minds Discography (France)","uid":5670731,"size":155199890,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:31fc2bdd431e09deeb509a6b0c3711378f50d97d&amp;dn=The+Spherical+Minds+Discography+%28France%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_WarriorS","files":-1,"time":1278337791,"description":"THE SPHERICAL MINDS is a French band born from the gathering of musicians with various influences and experiences. In fact, they all played in bands coming from different horizons (Classical music, heavy-metal, rock, jazz...). &quot;De Ira&quot; (2003) was recorded and mixed in AndromÃƒÂ¨de studios (Lyon) with the help of Ludovic TOURNIER (THIRD EYED MACHINE, KOAN, ELEVEN SIDES, CRYSTALIUM...). You can also notice the presence of two guests: singer Rose VIGNAT (Ex-DYING TEARS) and cellist Marie MERTZWEILLER. The influences of THE SPHERICAL MINDS go from dark-metal (OPETH, KATATIONIA, MY DYING BRIDE, MOONSPELL...), contemporary music (Philip GLASS, Steve REICH, Terry RILEY...), rock (Jeff BUCKLEY, RADIOHEAD, PINK FLOYD, Tom McRAE, MOGWAI, PORCUPINE TREE...), electronic music (APHEX TWIN, EZEKIEL, HIGH TONE...), jazz (Miles DAVIS, Jaco PASTORIUS, Oliver NELSON...) to classical music (Franz LISZT, Sergei RACHMANINOV...). The band aims at expressing dark and deep feelings such as melancholy, passion, hate, sorrow, despair or loneliness. To do so, it bases its music on acoustic instruments such as piano, acoustic guitar and cello. The introduction of an authentic Hammond organ and vintage guitar riffs could remind Seventies rock bands. To express properly the various moods, THE SPHERICAL MINDS decided to sing in several languages, which is very interesting. German has been chosen for its roughness, and also to pay a tribute XVIIIth Century to German poetry. French was elected for its beauty, sweetness and vocabulary. Latin was the obvious choice for the sorrow and religious atmospheres. And eventually, English stands for its easiness of pronunciation. When revolution meets revelation !\n\nAfter 'De ira' first album, released in 2003 on Thundering Records, the band has recorded 'Fern', his second album, the first on 'Carte Postale Records'. Daniel Cavanagh (Anathema) did the band the honour of singing on the album... Today the band is searching new ways to promote his music, by the way of concerts, studio projects...","torrent":{"xt":"urn:btih:31fc2bdd431e09deeb509a6b0c3711378f50d97d","amp;dn":"The+Spherical+Minds+Discography+%28France%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31fc2bdd431e09deeb509a6b0c3711378f50d97d","infoHashBuffer":{"type":"Buffer","data":[49,252,43,221,67,30,9,222,235,80,154,107,12,55,17,55,143,80,217,125]},"announce":[],"urlList":[]}}