{"title":"Feersum Ennjin","uid":5041447,"size":52336948,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:32c511bdcf793588ad1ea2a9944b6f9c280996b1&amp;dn=Feersum+Ennjin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nigeldpablo","files":-1,"time":1249392653,"description":"Paul D'Amour (born May 12, 1967 in Spokane, Washington) was the original bass guitarist for Tool. His bass sound was recognized by the aggressive picked tone he developed with his Rickenbacker 4001CS, which can clearly be heard on Tool's first full length album, Undertow.\n\nOriginally a guitar player, D'Amour became Tool's bassist after being introduced to the band by guitarist Adam Jones. Like Jones, D'Amour was in Los Angeles because of his wish to enter the film industry. [1]\n\nD'Amour left Tool in 1995. After his departure from the band, he formed the psychedelic pop band Lusk with Brad Laner, Chris Pitman, now of Guns N' Roses, and ex-Failure member Greg Edwards, now of Autolux. In 1997, they released their only album to date, entitled Free Mars.\n\nSoon after his departure from Tool, D'Amour played guitar in a group named Replicants, a cover band that included Ken Andrews and Greg Edwards from Failure, as well as Chris Pitman. They released one self-titled album in 1995, with a guest appearance from former Tool band-mate, Maynard James Keenan [2].\n\nAs of early 2005, D'Amour has been writing and performing under the name Feersum Ennjin. The name is inspired by the science fiction novel Feersum Endjinn by Iain Banks, an author whose novel The Wasp Factory was conceptual inspiration for Lusk as well. The project has one self-titled EP released on Silent Uproar Records.","torrent":{"xt":"urn:btih:32c511bdcf793588ad1ea2a9944b6f9c280996b1","amp;dn":"Feersum+Ennjin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32c511bdcf793588ad1ea2a9944b6f9c280996b1","infoHashBuffer":{"type":"Buffer","data":[50,197,17,189,207,121,53,136,173,30,162,169,148,75,111,156,40,9,150,177]},"announce":[],"urlList":[]}}