{"title":"Ben 10: Alien Force - Volume 1 (2008) DVDRip Eng Xvid AC3 AVI [B","uid":5123679,"size":1183365814,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:331e61fe7ce091422622790f44a8fb385be613ab&amp;dn=Ben+10%3A+Alien+Force+-+Volume+1+%282008%29+DVDRip+Eng+Xvid+AC3+AVI+%5BB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Bigjazz.h33t","files":7,"time":1255491433,"description":"-------------------------------------------------------------------\n-------------------------------------------------------------------\n\nBen 10: Alien Force - Volume 1 [2008] DVDRip Eng Xvid AC3 AVI\n\nTitle:\t\tBen 10: Alien Force\nRelease:\t2008\nSeason:\t\tVolume 1, Season 1, Episodes 1-5\nRuntime:\tEach Episode ~22mins\n\nEncoding\n\nVideo;\nResolution:\t576x432\nBitrate:\t~1224kbps @ 25fps\nCodec:\t\tXvid, v1.2.2\nFormat:\t\tAudio Video Interleave (.avi)\n\nAudio;\nTrack 1:\t2.0 Channel AC3 @ 224kbps, English\n\nFile Size:\t~225MB\n\nSubtitles:\tNone\n\nSource:\t\tPAL DVD, Region 4\n\nCast:\nYuri Lowenthal ...  Ben Tennyson\nGreg Cipes ...  Kevin Levin \nAshley Johnson ...  Gwen Tennyson\nDee Bradley Baker ...  Chromastone\n\nBen 10: Alien Force - Volume 1\n\n101 - Ben 10 Returns - Part 1\nAfter Grandpa Max disappears, Ben and Gwen decide to finish his last job while searching for him. Magister Labrid, Max's alien partner, guides them to an arms trade between the Forever Knights and the DNAliens, brokered by Kevin Levin. Kevin is captured, but the Forever Knights escape with one of the weapons crates. Kevin, having not been paid, leads them to the Forever Knights' hideout, where they encounter a robotic dragon.\n\n102 - Ben 10 Returns - Part 2\nFleeing from the dragon, the group runs into an army of Forever Knights. In the ensuing confrontation, Magister Labrid is killed when he saves Kevin's life, and Kevin joins Ben and Gwen on their search for Max to repay that debt. After Ben, Gwen and Kevin track the weapons to a secret underground base, they discover an army of aliens, led by the Highbreed commander. Annoyed at being discovered, the Highbreed commander orders the termination of all life within a five-mile radius to eliminate any witnesses. In Ben's successful efforts to stop the commander, he learns that any damage he receives while transformed is inflicted upon his human form as well.\n\n103 - Everybody Talks About the Weather\nThe authorities arrest a half-human, half-Pyronite boy named Alan for arson and criminal damage. Alan is wearing a Plumber's badge, which the local sheriff triggers when he confiscates it. The badge signals Kevin's badge, which leads Ben, Kevin and Gwen to Alan. After a battle with Alan, Ben discovers that the DNAliens are responsible for the damage, having built a weather machine in the field. With Alan's help, Ben destroys the machine, and afterwards Ben offers Alan to come with him, Gwen and Kevin. Alan decides to stay, but offers to aid them whenever they need it.\n\n104 - Kevin's Big Score\nJust when Ben and Gwen start to trust Kevin, he runs off with Max's RV, the Rustbucket, in hopes of trading it for alien technology. However, he is double-crossed by one of his old contacts and the Rustbucket is stolen. Before he can get it back, it is stripped for parts. Having been told that Vulkanus -- who he had double-crossed years ago -- is in possession of the alien device he seeks, Kevin tries to make a deal. Still bitter, Vulkanus has Kevin absorb a rare alien crystal, planning to use him as a living gem mine. He is rescued by Ben and Gwen and afterward reveals that the item he sought is a holo-viewer with another message from Grandpa Max, telling Ben that he will need to recruit a team.\n\n105 - All That Glitters\nBen, Gwen, and Kevin set out to locate the other Plumbers to recruit new members, and the first one on their list is a boy named Mike Morningstar. While Ben and Gwen are quick to trust him, Kevin remains suspicious (partly because of Gwen's liking to Mike Morningstar) particularly after they are attacked by a group of zombified school girls at the local power plant. Kevin's suspicions turn out to be valid, as it is Mike who is making the zombies, draining them of their lifeforce then commanding them to collect more power for him. When he does this to Gwen, he becomes nearly unstoppable, but Gwen is able to fight back and drains Mike's power in return, leaving him withered and powerless.\n\n-------------------------------------------------------------------\nPlease share....Don't hit and run...Seed it back at least once.\n\nOf course, if you want to seed it back more than once, that would be ok too :)\n-------------------------------------------------------------------","torrent":{"xt":"urn:btih:331e61fe7ce091422622790f44a8fb385be613ab","amp;dn":"Ben+10%3A+Alien+Force+-+Volume+1+%282008%29+DVDRip+Eng+Xvid+AC3+AVI+%5BB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"331e61fe7ce091422622790f44a8fb385be613ab","infoHashBuffer":{"type":"Buffer","data":[51,30,97,254,124,224,145,66,38,34,121,15,68,168,251,56,91,230,19,171]},"announce":[],"urlList":[]}}