{"title":"Richard Marx - Don't Mean Nothing  (2nafish)","uid":5566367,"size":163485700,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:33717e12dfed89633b3caab7a77f2454046ef3ca&amp;dn=Richard+Marx+-+Don%5C%27t+Mean+Nothing++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1273998060,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Don't Mean Nothing&quot; is the debut single by Richard Marx from his 1987 eponymous album. With the chart success of this and subsequent singles from his debut album, Marx became the first male artist to reach the top three of the Billboard Hot 100 pop chart with four singles from a debut album.\n\nIn 1988, Marx was nominated for a Grammy Award for &quot;Best Rock Vocal Performance - Male&quot; for this song.\n\nAccording to Richard Marx's personal commentary about the song's origin, his manager at the time asked Joe Walsh to play slide guitar on the song and he agreed. As a fan of the Eagles, Marx felt that musically the song could have belonged on the The Long Run album. Two other Eagles members, Randy Meisner and Timothy B. Schmit sang background vocals on the song. Marx wrote the lyrics himself and co-wrote the music for this song with Bruce Gaitsch at Marx's first house in the Los Feliz  area of Hollywood.\n\nAs the lead single from Richard Marx, the song saw success on both the Billboard  Hot 100 singles and Album Rock Tracks charts. The single entered the Hot 100 chart upon release at number 78 and, 12 weeks later, reached its peak of number 3. The song also became a number-one hit on the Album Rock Tracks chart. In the UK, the song reached a high of number 78.\n\nFive singles were released from the album, each of them doing well on the charts. Marx's future wife, Cynthia Rhodes, G.W. Bailey, and Fee Waybill appeared in the video for the lead single &quot;Don't Mean Nothing&quot;. The album went to number eight on the Billboard  charts and spent 86 weeks on that chart. The album was certified triple platinum. In the United Kingdom, the album entered the charts on April 9, 1988 where it stayed for two weeks peaking at number 68.\n\nThe album received praise from music critic Stephen Thomas Erlewine of the online music database website Allmusic, who stated that &quot;Richard Marx's self-titled debut album was a finely crafted record of mainstream pop/rock&quot; and that the album was &quot;Filled with carefully constructed radio-ready tracks, it was no surprise that the album became a huge hit.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:33717e12dfed89633b3caab7a77f2454046ef3ca","amp;dn":"Richard+Marx+-+Don%5C%27t+Mean+Nothing++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33717e12dfed89633b3caab7a77f2454046ef3ca","infoHashBuffer":{"type":"Buffer","data":[51,113,126,18,223,237,137,99,59,60,170,183,167,127,36,84,4,110,243,202]},"announce":[],"urlList":[]}}