{"title":"Coast To Coast Am - 12-27-2008 - The Nature People","uid":5659582,"size":56061919,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:33742e1fb44caa40c9263d46244fe36cc6f90851&amp;dn=Coast+To+Coast+Am+-+12-27-2008+-+The+Nature+People&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lyrian","files":5,"time":1277923387,"description":"The Nature People\n\nPsychic mediums Christopher Valentine and Dr. Christian von Lahr talked about Nature People such as Gnomes, Elves, Fairies and Leprechauns and also discussed how they have established direct communication with them. &quot;They're wisdom is so incredible ... I never even conceived that they could be this smart,&quot; marveled Valentine about the lessons the pair have learned from the Nature People. \n\nDetailing a veritable roll call of Nature People, von Lahr illuminated the differences between these purported races of creatures. Gnomes, he said, &quot;look very human-like, except they are shorter or smaller than most people.&quot; Elves &quot;tend to be thinner&quot; and gravitate towards &quot;areas where the forest and mountains meet the water.&quot; Fairies, meanwhile, &quot;have a very bright inner glow&quot; and travel in groups of ten. Despite the contrasts in types of Nature People, von Lahr said that they all have a unified purpose: to serve as &quot;builders of the universe and, more lately, maintenance people of the universe.&quot; \n\nThe duo detailed how Nature People exist throughout the human world in a variety of roles and shared one method of establishing contact with the Nature People which utilizes simple strings of Christmas lights. &quot;Place them in your bushes if you'd like to see gnomes and elves and up in the trees if you want to see fairies,&quot; Valentine said. He explained that this is because &quot;the Nature People all resonate to different frequencies&quot; and would &quot;use the energy from those lights and well as the background twigs and leaves to come in more clearly for you to see them.&quot; Valentine suggested a means of assuring you are actually seeing the Nature People, &quot;ask them to move ... sometimes when you turn away and look back again, they have completely changed their pose.&quot; \n","torrent":{"xt":"urn:btih:33742e1fb44caa40c9263d46244fe36cc6f90851","amp;dn":"Coast+To+Coast+Am+-+12-27-2008+-+The+Nature+People","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33742e1fb44caa40c9263d46244fe36cc6f90851","infoHashBuffer":{"type":"Buffer","data":[51,116,46,31,180,76,170,64,201,38,61,70,36,79,227,108,198,249,8,81]},"announce":[],"urlList":[]}}