{"title":"FoxitReader30.","uid":5111568,"size":3600609,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:33d3b862cc008bfbd9ca2fcbd26671ded7fd3526&amp;dn=FoxitReader30.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zurera","files":1,"time":1254846161,"description":"FoxitReader30\n\nUna Alternativa que pisa fuerte el campo de Adobe\n\nÃ‚Â¿Harto de Adobe Reader? Normal, porque para ser un lector de PDF, esta aplicaciÃƒÂ³n requiere una cantidad de recursos, tanto de RAM como de disco duro, que no es demasiado normal. Menos mal que existen alternativas que, en muchas ocasiones, superan al original.\n\nFoxit Reader 3.0 es la ÃƒÂºltima versiÃƒÂ³n aparecida de este lector de PDFs, mucho mÃƒÂ¡s ligero que Adobe Reader y que incluye caracterÃƒÂ­sticas que no estÃƒÂ¡n en ese. Esta versiÃƒÂ³n mejora algunas de las funcionalidades ya existentes e incorpora unas cuantas de nuevas, que ofrecen mayor control sobre los documentos.\nSe incorporan tres paneles a la aplicaciÃƒÂ³n. El primero nos permite visualizar ficheros adjuntos al documento, permitiendo cambiarlos, borrarlos o aÃƒÂ±adir de nuevos. El segundo muestra miniaturas de cada una de las pÃƒÂ¡ginas del PDF, mientras que el ÃƒÂºltimo nos muestra capas del documento, pudiendo controlar la visualizaciÃƒÂ³n de estas.\nEn Foxit Reader 3.0 se incorpora soporte para unidades mÃƒÂ©tricas y para hacer auto-scroll con el botÃƒÂ³n central del ratÃƒÂ³n, ademÃƒÂ¡s de un Plugin para Firefox que permite leer ficheros PDF desde dentrodel propio navegador.\nSu uso es gratuito, aunque ofrecen una versiÃƒÂ³n profesional con mÃƒÂ¡s opciones como la posibilidad de hacer anotaciones, rellenar formularios,...\nEstas son las mejoras y nuevas caracterÃƒÂ­sticas introducidas en Foxit Reader 3.0:\n* Reproductor de archivos multimedia con un editor integrado.\nPanel de archivos adjuntos que permite administrarlos de forma mÃƒÂ¡s eficaz .\n* Miniaturas de las pÃƒÂ¡ginas para una navegaciÃƒÂ³n por pÃƒÂ¡ginas mÃƒÂ¡s ÃƒÂ¡gil.\n* Panel de capas con el que puedes controlar la visualizaciÃƒÂ³n de las capas de algunas zonas especÃƒÂ­ficas en los archivos PDF.\n* Soporte para el sistema mÃƒÂ©trico. El sistema imperial sigue estando disponible.\n* Soporte para el desplazamiento vertical y horizontal mediante el botÃƒÂ³n central del ratÃƒÂ³n, sin necesidad de usar la rueda.\n* Soporte para Firefox. Ya es posible ver los documentos PDF desde este navegador web usando Foxit Reader gracias a un nuevo plugin.\n* Foxit OnDemand Content Management. Se trata de la integraciÃƒÂ³n de un nuevo servicio de suscripciÃƒÂ³n aÃƒÂºn no disponible para almacenar, revisar y compartir documentos en lÃƒÂ­nea.\n* Soporte completo para imprimir grupos de pÃƒÂ¡ginas, ya bien estÃƒÂ©n separadas o se trate de rangos no consecutivos.\n* Mejoras en las herramientas de selecciÃƒÂ³n de texto, anotaciones y en los atajos de teclado.","torrent":{"xt":"urn:btih:33d3b862cc008bfbd9ca2fcbd26671ded7fd3526","amp;dn":"FoxitReader30.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33d3b862cc008bfbd9ca2fcbd26671ded7fd3526","infoHashBuffer":{"type":"Buffer","data":[51,211,184,98,204,0,139,251,217,202,47,203,210,102,113,222,215,253,53,38]},"announce":[],"urlList":[]}}