{"title":"Coast to Coast AM - Oct 13 2009 - Preserving America's Sovere","uid":5124588,"size":55227049,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:343e7a3cd8d5a3f14487fb9a53e8bee645ca52db&amp;dn=Coast+to+Coast+AM+-+Oct+13+2009+-+Preserving+America%5C%27s+Sovere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1255544323,"description":"Preserving America's Sovereignty\n\nDate: 10-13-09\nHost: George Noory\nGuests: Jerome Corsi, Christopher Balzano\n\nJerome Corsi, an expert on political violence and terrorism, discussed how both the left and the right are promoting policies which are detrimental to the future independence of the United States. As outlined in his new book, America for Sale, he believes there's a globalist agenda to install a one-world order or currency. These globalists, some of whom are investment bankers, don't cherish the freedom and values we have in our free enterprise system, and have deliberately manipulated the economic collapse, he said. He named Robert Mundell, the &quot;father of world currency,&quot; as one of the globalists, and said he masterminded a plan to destroy the dollar.\n\nAmerica's sovereignty is being lost incrementally through the North American Free Trade Agreement, and the Security and Prosperity Partnership, said Corsi, who added that decisions are made by a shadow government without congressional oversight. The United States is now bankrupt if you consider that there's a total of $65 trillion in debt from future obligations and social welfare, he claimed. That's why people are speaking out at town hall meetings and Tea Parties to protest the massive debt that will be handed down to their children and grandchildren, he noted.\n\nAmericans can &quot;say no to a global new deal,&quot; and the ability citizens have to be heard shouldn't be underestimated, Corsi stated. He also suggested (as advocated by Ron Paul) that we close down or audit the Federal Reserve, as well as shut down the IRS, and create a structure that doesn't tax income, like the Fair Tax.\n\nBridgewater Triangle\n\nLast hour guest, paranormal investigator Christopher Balzano talked about strange activity in the Bridgewater Triangle area of southeastern Massachusetts. The 200 square mile zone has a large preponderance of paranormal reports, including ghosts, UFOs, and cyrptids, as well as unexplained crimes and disappearances, he detailed. The area saw particularly violent conflicts between settlers and Indians, which may have set the stage for negative energies or portals in the location, he theorized.\n\nInterestingly, Pukwudgies, troll-like demonic creatures, were said to torment Native Americans in the area, long before the settlers arrived. Christopher will be speaking at the upcoming Mass Mystery Weekend in Watertown, MA.\n\nDuring the last half-hour, George played his reading of Edgar Allan Poe's 'Tell Tale Heart' in honor of the author's recent 'second funeral.'\n\nWebsite(s):\nredalert.wnd.com\nmasscrossroads.com\nmassmystery.com\n\nBook(s):\nAmerica for Sale\nThe Late Great U.S.A.: The Coming Merger With Mexico and Canada\nMinutemen: The Battle to Secure America's Borders\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224","torrent":{"xt":"urn:btih:343e7a3cd8d5a3f14487fb9a53e8bee645ca52db","amp;dn":"Coast+to+Coast+AM+-+Oct+13+2009+-+Preserving+America%5C%27s+Sovere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"343e7a3cd8d5a3f14487fb9a53e8bee645ca52db","infoHashBuffer":{"type":"Buffer","data":[52,62,122,60,216,213,163,241,68,135,251,154,83,232,190,230,69,202,82,219]},"announce":[],"urlList":[]}}