{"title":"Mushroom - Early One Morning (Irish Heavy Progressive Rock1973)","uid":5567126,"size":86220318,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:348bf904e3fa77b4bbedf212196424be0321cecc&amp;dn=Mushroom+-+Early+One+Morning+%28Irish+Heavy+Progressive+Rock1973%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Iron_Horse","files":19,"time":1274019518,"description":"Mushroom - Early One Morning (Irish Heavy Progressive Rock1973)\nCD (2004) To MP3 256 kbit/s.\nIncluded CD Covers &amp; Info.\n\nOriginally released in 1973 on the Hawk label. It is a real one off, combining brilliant heavy progressive rock and psychedelic irish folk, with blazing guitar leads battling with fiddle attacks. The results are awesome.\n\nBiography\tby Richie Unterberger  allmusic.com\nThis Dublin group's sole and rare album, 1973's Early One Morning...., provided an interesting indie-type spin on the British Isles folk-rock style of the early '70s. Though heavily indebted in some ways to the rock-up-traditional-Celtic-folk approach pioneered by Fairport Convention and Steeleye Span, it added more psychedelic, progressive, and pop influences than groups of the sort customarily used. The violin, tin whistle, harpsichord, recorder, and bodhran supplied some of the more traditional elements, yet the arrangements were eclectic enough to also encompass organ, electric mandolin, and even some Moog. While there was a certain naÃƒÂ¯vete to both the material and the production, the songs were fairly strong, balancing some hard-charging rocked-up folk with wistful, quieter ballads. Mushroom released a few other tracks on singles around this period, but otherwise never recorded again, the album becoming a highly sought-after collectible selling for as much as several hundred pounds. \n\nReview\tby Richie Unterberger\nThis rare album by this obscure early-'70s Irish folk-rock outfit is in some ways quite similar to the brand of British folk-rock pioneered by Fairport Convention in the late '60s and early '70s. Traditional Celtic folk-flavored melodies are given both delicate and hard-rocking treatments, the standard rock instruments given a British Isles folk tinge with embellishments of violin, electric mandolin, harpsichord, tin whistle, wind chimes, recorder, and bodhran. The similarity isn't extreme, however, as to start with, the production is far funkier and more homespun -- not a bad thing at all, but a trait that needs to be noted in case you're expecting something on the order of Fairport's Full House. Just as crucially, there are definitely more influences from pop, psychedelia, and progressive rock in Mushroom's particular spin on the British Isles folk-rock genre. While at times this is very much in the rapid-fire, lickety-split, ferociously rocked-up reels'n'jigs style that Fairport and such often used in the early '70s, there are also some nearly exquisite passages of melancholy Celtic folk balladry with a mild contemporary rock slant, such as &quot;Tenpenny Piece&quot; and the title track. Then there's the psychedelic guitar sustain and wah-wah weaving around the violin in &quot;Crying,&quot; which otherwise would be a rather standard British late-'60s pop/rock song. And there's also the almost berserk keyboards of &quot;Johnny the Jumper,&quot; where Fairport-style folk-rock meets the distorted roller rink sounds of early-'60s Joe Meek productions. It's far more naÃƒÂ¯ve a record than Fairport Convention or Steeleye Span ever made, and less vocally and instrumentally accomplished, not to say more rudimentarily produced. Yet for those very reasons, it's a fairly nifty relic in the genre, if only because it's not just an emulation of obvious influences, but a somewhat odd and original twist on the format. \n\nJoe O'Donnell was a member of the band until he left to join East Of Eden in 1973. His replacement was Pat Collins who is listed in the lineup on the album though Joe plays on it and the singles. More Info om:  &lt;a href=&quot; http://irishrock.org/ir6070/bands/mushroom.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://irishrock.org/ir6070/bands/mushroom.html&lt;/a&gt;\n\nTracklist:\n01. Early One Morning\n02. The Liathdan\n03. Crying\n04. Unborn Child\n05. Johnny The Jumper\n06. Potter's Wheel\n07. Standing Alone\n08. Devil Among The Tailors\n09. Tenpenny Piece\n10. Drowsey Maggie\n11. King Of Alba\n\nLineup:\nAonghus McAnally - Guitar, Recorder, Tin Whistle, Vocals\nColm Lynch  - Percussion, Wind and Wood Chimes, Vocals\nAlan Brown - Bass, 12-string Guitar, Vocals\nMichael Power - Organ, Harpsichord, Moog, Vocals\nPat Collins - Violin, Electric Mandolin, Vocals\nJoe O'Donnell - Violin","torrent":{"xt":"urn:btih:348bf904e3fa77b4bbedf212196424be0321cecc","amp;dn":"Mushroom+-+Early+One+Morning+%28Irish+Heavy+Progressive+Rock1973%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"348bf904e3fa77b4bbedf212196424be0321cecc","infoHashBuffer":{"type":"Buffer","data":[52,139,249,4,227,250,119,180,187,237,242,18,25,100,36,190,3,33,206,204]},"announce":[],"urlList":[]}}