{"title":"Red Giant Trapcode Particular v2.0 AE plugin - raze1392","uid":5673132,"size":14597615,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:34d8076a9dcdd09a2bfeab0285bffecdfea7c9dc&amp;dn=Red+Giant+Trapcode+Particular+v2.0+AE+plugin+-+raze1392&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"dordz","files":513,"time":1278429711,"description":"Overview of Particular Interface\n\nFollowing is an overview of many of main control groups in Particular 2.0.\n\nThe Preset Gallery has premade particle animations, called presets, that are an easy way to get started with Particular. Check out the Using Presets page for info about how presets work.\n\nThe Emitter group generates the particles. This section controls the shape of the emitter, its initial direction, the velocity of the particles, and moving and rotating the Emitter.\n\nThe Particle group controls the properties of the particles, such as size, opacity and color. This section also controls how the properties vary over the particles' lifespan.\n\nThe Particle group contains an important popup called Particle Type which sets the base shape of the particles. The Streaklet group controls an interesting new Particle Type is a long exposure, light painting effect.\n\nThe Shading group gives the particle scene some special effects shading. This includes the new Shadowlet Setting group, which creates a shadow off the main light for soft, self-shadowing. \n\nOnce emitted, the particles obey certain real world physical rules, as defined in the Physics group. Here are properties such as gravity and turbulence, and controls for making particles bounce on other layers in the composition.\n\nThe Aux System group is a particle system within the particle system. Cool, huh? Aux particles are emitted from the particles in the main system. They can be emitted continoulsy or when the particles collide with bounce layers.\n\nThe new World Transform group lets you move around and rotate the whole particle system independently of the After Effects camera. \n\nThe Visibility group gives control over where particles are visible. For example, particles far away can be set to fade out. Here are also all obscuration settings, so that layers in the composition can be used to obscure particles.\n\nThe newly streamlined Options panel contains two settings for the particle system. These name and activate the Light Emitters and Shadowlets. \n\nThe Rendering group controls how the particles look when they render. The Motion Blur feature gives fast-moving particles a smooth look, like a real camera does.\n\n","torrent":{"xt":"urn:btih:34d8076a9dcdd09a2bfeab0285bffecdfea7c9dc","amp;dn":"Red+Giant+Trapcode+Particular+v2.0+AE+plugin+-+raze1392","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34d8076a9dcdd09a2bfeab0285bffecdfea7c9dc","infoHashBuffer":{"type":"Buffer","data":[52,216,7,106,157,205,208,154,43,254,171,2,133,191,254,205,254,167,201,220]},"announce":[],"urlList":[]}}