{"title":"The Mass of the Antichrist v 2.0","uid":5067525,"size":75505906,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:34fb3877ca9554d3e42271d65e4cd8a749dad2aa&amp;dn=The+Mass+of+the+Antichrist+v+2.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"madziar","files":18,"time":1251084213,"description":"**This is the &quot;Mass of the Antichrist&quot; torrent with the addition of a very interesting .pdf that's described at the end of this****\n\nWhat this is is a sort of real attempt at a black mass with real magick involved. It's a combination of Thelemic material about the New Aeon and material from the Book of Revelations. It's intended to help bring about the New Aeon of Crowley, which is identified here with the destruction of Christianity by the Beast of the Book of Revelations and the Anti-Christ, who is identified as Horus. It's an invocation of the Antichrist and contains a section about doing ritual work for asking things, i.e. doing operative magick as well as celebrating the demise of Christianity. \n\nThe author and speaker is S. Jason Black, who is a New Falcon (and Original Falcon) Press author who wrote &quot;Pacts with the Devil&quot; and &quot;Urban Voodoo&quot;. From a website:\n\n&quot;A spoken and musical performance for meditation, visualization and instruction in Goetic Magia, accompanied by an interview with the author who is one of the foremost authorities on Psychic Phenomena and Black Magick. \n\nThe Liturgy has been performed by Mr. Black both in solitude and group settings for more than eight years---it is drawn primarily from traditional sources: the exit of the Latin Mass, the Book of Revelation, the Enochiana of Dr. John Dee, the Grimoire of Honorius, etc. \n\nThis is a unique production that belongs in the collection of all serious magicians. \n\nIntroduction (with music by Zehm Aloim)\nConjurations of the Kings\nThe 7th Key of John Dee\nBabalon\nKey of the 30 Aethys (John Dee)\nOffering\nClosing (with music by Zehm Aloim)&quot;\n\nThe interview isn't included, as although interesting it doesn't directly deal with the ritual. \n\n*now in the new and improved version is included the PDF &quot;O.'.A.'.I.'. Material&quot;, which is a compendium of documents from a magickal group called the Ordo Antichristianus Illuminati, that S. Jason Black very likely had contact with in the course of formulating his ritual.\n\nThis is a file containing the original documents relating to a group named the Ordo Antichristianus Illuminati, which is either no longer in existence or in deep sleep. The OAI was started by a Thelemic magician named David Cherubim, who was also a founder of the Thelemic Golden Dawn. The meaning of &quot;Antichrist&quot; in it follows on Jack Parson's use of the term, and S. Jason Black's, which in turn derive from Crowley's idea on Babalon and the Beast. \n\n\nOf particular interest are the &quot;Revelations of the Antichrist&quot;, which are books that were received by David Cherubim during workings relating to the OAI\n\nIn 2003, almost twenty years since the first workings that the later OAI was based on, the second in command, Joshua Seraphim, became increasingly erratic and autocratic, was called to resign by Cherubim, then kicked out, then because Seraphim continued to operate the website (albeit now with all his own materials) and wouldn't stop Cherubim put the order to sleep and disassociated himself with anything that Seraphim did. \n\nIncluded also are some of Seraphim's post-getting kicked out documents. \n\nContents:\n\n \nEpistle of the OAI \nLiber Antichristus \nProphecy of the Seven Seals \nThe Three Grades of the OAI \nDiary of the Anti-Christ \na)Manifesto of the Anti-Christ \nb)Introduction \nc)Liber Antichristus \nd)Diary of the Anti-Christ \nThe Book of the Seven Seals: The Revelations of the Anti-Christ \na)The Book of the Antichrist  b)The Book of the Elder Kings  c)The Book of \nthe Palace of the Stars  d)The Book of Quartus Kerub  e)The Book of the Battle of \nConquest  f)The Book of The Hour of Silence  g)The Book of Alkhemi                   \nManifesto of the Anti-Christ                                                                              \nThe archetype of the Anti-Christ                                                                          \nReading List \nLater Seraphim material:  \nBook of Baphomet :                                                                                     \nLitany of enchantment,Canticle of Baphomet, Blasphemy of Baphomet 666 \nChristianity and the Devil  \nThe New World Order Antiquity of the Illuminati  \nTHE EPISTLE OF MALEDICTION  \nNumber of the Beast 666  \nThe Rite of Lilith  \nThe Scarlet Woman and Antichristendom \n                                         \n","torrent":{"xt":"urn:btih:34fb3877ca9554d3e42271d65e4cd8a749dad2aa","amp;dn":"The+Mass+of+the+Antichrist+v+2.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34fb3877ca9554d3e42271d65e4cd8a749dad2aa","infoHashBuffer":{"type":"Buffer","data":[52,251,56,119,202,149,84,211,228,34,113,214,94,76,216,167,73,218,210,170]},"announce":[],"urlList":[]}}