{"title":"Train - If It's Love (Xvid-2nafish) 1080p","uid":5670729,"size":213639222,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:36beb405964dafc76e1ea9467677d20e7fa39fcc&amp;dn=Train+-+If+It%5C%27s+Love+%28Xvid-2nafish%29+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1278337719,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:04:23\n\n[Video]\nResolution : 1920x1080\nCodec : XviD MPEG-4 codec\nFPS : 24.00\nBitRate : 6177 Kbps\nQuality Factor : 0.13 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;If It's Love&quot; is the second single from Train's fifth studio album, Save Me San Francisco. It debuted at #31 on Billboards Hot Adult Top 40 Tracks chart. A music video has been shot for the song, which debuted on VH1.com on May 11, 2010.\n\nSave Me, San Francisco is the fifth album from California rock band Train and was released on October 27, 2009, through Columbia Records. \n\nThe album's first single, &quot;Hey, Soul Sister&quot;, which marked a return to the group's root-rock roots, was released to digital retailers on August 11, 2009. The music video for &quot;Hey, Soul Sister&quot; debuted on VH1's Top 20 Countdown show on October 10th. The single has since become Train's fourth-career Top 40 hit on the Billboard Hot 100 and second career top 10 hit, reaching number three twenty six weeks after it was released. It is also the band's highest-peaking single to date in their native United States, as well as Canada, Australia, the Netherlands and New Zealand.\n\nTo date, two other tracks have been released for airplay. The second mainstream single, &quot;If It's Love&quot;, has since charted the lower reaches of the Adult Top 40, while the title track has been released to the Triple A format, where it has since made the Top Thirty.\n\nTrain is an American rock  band from San Francisco, California, formed in 1994. The band currently comprises a core trio of Patrick Monahan (lead vocalist), Jimmy Stafford (guitar) and Scott Underwood (drummer).\n\nTrain achieved mainstream success with their debut album, Train, which was released in 1998. Their second album, Drops of Jupiter (2001) brought the band massive popularity. The lead single from the album, &quot;Drops of Jupiter (Tell Me)&quot;, was an international hit and won two Grammy Awards in 2002. The album was certified double platinum in the United States and Canada and remains the band's best-selling album to date.\n\nTheir third studio album, My Private Nation, released in 2003, continued the band's success, and was certified platinum in the United States. The band released their fourth album, For Me, It's You in 2006. Despite a generally positive reception from critics, the album was commercially unsuccessful. Train then went on a three-year hiatus.\n\nTrain re-united and released their latest album, Save Me San Francisco in 2009. The first single from the album, &quot;Hey, Soul Sister&quot; became the band's most successful single in their career, charting in the top three on the Billboard Hot 100 and reaching the top ten in several other countries.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:36beb405964dafc76e1ea9467677d20e7fa39fcc","amp;dn":"Train+-+If+It%5C%27s+Love+%28Xvid-2nafish%29+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36beb405964dafc76e1ea9467677d20e7fa39fcc","infoHashBuffer":{"type":"Buffer","data":[54,190,180,5,150,77,175,199,110,30,169,70,118,119,210,14,127,163,159,204]},"announce":[],"urlList":[]}}