{"title":"Lanfear.-.Another.Golden.Rage.2005.Xing-190kbps","uid":5496605,"size":72149433,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:36eeb8f40648cae4e8a080e9a3a0d29f7fb81bbd&amp;dn=Lanfear.-.Another.Golden.Rage.2005.Xing-190kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"novamdm","files":-1,"time":1271306753,"description":"Back in the late Nineties, Lanfear's Zero Poems obtained the status of having been the best German self-released prog metal album ever. Not much later, they signed to Massacre Records, got a new vocalist and recorded their new CD The Art Effect, which was a solid piece of power metal but nonetheless alienated some of their older fans who sorely missed the progressive parts of the past.\n\nAnother Golden Rage is already Lanfear's second album for Massacre, and if you still hoped that they would return to their roots, you will be disappointed. Already the opener, which is also the title track, shows that Lanfear continue relentlessly their way of melodic speed power metal, and proving again that they absolutely don't have to hide behind more established bands. Again, the songs are mostly very concise, unlike their more epic compositions of olden days, and their roots only shine through on the excellent, more atmospheric What... For. This song is only followed by the long album closer Outliving The Ages, also one of the rare progressive moments, giving me somehow the impression as if Lanfear want to apologise to their longtime fans with some more brainy stuff at the end of the album.\n\nYou can perceive Another Golden Rage from two different angles. Either you say it's neither power metal nor prog, and therefore will have a hard time aiming at a steady fan base, or you can claim that it's perfect consensus material, having to please fans of bands like Metal Church, Fates Warning and everything in between. Although I belong to the category of people who mourn Lanfear's progressive days, objectivity forces me to adhere to the latter proposition, recommending this basically really good album to every fan of intelligent heavy metal music.\n\n01. Another Golden Rage\n02. The Unrestrained\n03. Dispraise\n04. Transmigration\n05. Eclipse\n06. Shades Of Black\n07. The Voice Within\n08. In Silence\n09. Eternally\n10. What...For\n11. Outliving The Ages\n\nAll albums have been tagged, MP3 GAINed, and optimized with MP3packer. &lt;a href=&quot;\nhttp://www.lanfear.eu/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.lanfear.eu/&lt;/a&gt;\nhttp://www.my...space.com/thelanfear\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:fxfixqysldhe\nhttp://en.wikipedia.org/wiki/Lanfear_%28band%29","torrent":{"xt":"urn:btih:36eeb8f40648cae4e8a080e9a3a0d29f7fb81bbd","amp;dn":"Lanfear.-.Another.Golden.Rage.2005.Xing-190kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36eeb8f40648cae4e8a080e9a3a0d29f7fb81bbd","infoHashBuffer":{"type":"Buffer","data":[54,238,184,244,6,72,202,228,232,160,128,233,163,160,210,159,127,184,27,189]},"announce":[],"urlList":[]}}