{"title":"Airline- The Complete First Season-DVDRip","uid":5088260,"size":3754387371,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:36f0a05b761839a0fcab13f4335332f6beffadd7&amp;dn=Airline-+The+Complete+First+Season-DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FrodooBagginz","files":19,"time":1252897369,"description":"Airline is an American television reality show that showcases the daily happenings of passengers, ground workers and on-board staff members of Southwest Airlines.\n\n\n\nI usually rip the entire video files using DVDFab to the HDD and use AutoGK to convert them to avi. But I found out that DVDFab can convert to avi directly from the dvd bypassing the need to copy the entire video files to the HDD in their full quality.\n\nThe only problem is it is a little bit more advanced. AutoGK did all the work for me before but this time I had to set a resolution. I did a test of one episode and, while the quality isn't mind blowing, it almost matches that of AutoGK....except DVDFab encoded A LOT faster than AutoGK. I It used to be 1+ hour per episode to encode and now only around maybe 20-30 minutes an episode and the quality is almost the same so it was worth it.\n\nThe only main issues I see are at the very top of the videos but nothing that will harm the enjoyment of the show. \n\n\nEpisode 1- The Delicate Art Of Saying No\n\nGate agents confront a drunken passenger and another who smells too bad to travel; meanwhile, the weather won't cooperate in Chicago.\n\nEpisode 2- Consider Yourself One Of The Family\n\nEmployees discuss the finer points of underwear with rap star Sisqo, while a family fumes about having to buy a ticket for their toddler.\n\nEpisode 3- Beyond Our Control\n\nForty-eight hours of massive delays, cancellations, stranded passengers, and endless queues following the largest blackout in U.S. history.\n\nEpisodpe 4- Times Change\n\nAfter 30 years as a Southwest pilot, Captain Steve Palmason takes off for the last time, while supervisor Mike Carr takes customer service to another level.\n\nEpisode 5- Kids...Who'd have them?\n\nA rowdy group of bikers has passengers pushing for compensation, while a mother and her kids try everyone's patience.\n\nEpisode 6- Winners And Losers\n\nSupervisor Mike Carr realizes a missing ticket is a scam and another passenger gets to play &quot;The Price Is Right.&quot;\n\nEpisode 7- Terminal Beauty\n\nA women changes clothes in the middle of a busy terminal. Elsewhere, Randy Travis is spotted!\n\n\nEpisode 8- Luv Is In The Air\n\nA flight attendant gets a surprise from her boyfriend, and a student goes to New York to save his relationship.\n\n\nEpisode 9- High Spirits\n\nSupervisors Mike and Yolanda reveal their wild sides at the Southwest Spirit party, and Gospel singers perform in-flight.\n\nEpisode 10- A Team Effort\n\nSome lost luggage isn't so lost after all and a swarm of bees and a Prince from Ghana make guest appearances.\n\nEpisode 11- You Must Be Kidding?\n\nA drunken passenger needs a police escort and two overweight customers take the armrest test.\n\nEpisode 12- Relative Values\n\nA father who embarrasses his daughter, a grandmother who wants to travel with oxygen canisters, and a newly adopted baby make for a grand family affair!\n\nEpisode 13- For Better Or Worse\n\nA drunken passenger (who needs to get to her wedding) is denied boarding; meanwhile, two piilots elope.\n\nEpisode 14- It Ain't Over 'Til It's Over\n\nA blizzard hits Chicago and newlyweds can't get to Tahiti. And, is a 73 year old passenger sick or drunk?\n\nEpisode 15- Don't Take No For An Answer\n\nA passenger misses his flight when he takes a smoking break- and now he may miss his son's operation in Houston.\n\nEpisode 16- All Creatures Great And Small\n\nPenguins get star treatment and a man dressed as a tiger causes a ruckus in Chicago.\n\nEpisode 17- There's Real Time... Then There's Airline Time\n\nLate passengers take their frustrations out on the staff.\n\nEpisode 18- Oh, What A Performance\n\nA passenger loses his paper ticket and refuses to buy another and the first-ever staff holiday cabaret performs for passengers.","torrent":{"xt":"urn:btih:36f0a05b761839a0fcab13f4335332f6beffadd7","amp;dn":"Airline-+The+Complete+First+Season-DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36f0a05b761839a0fcab13f4335332f6beffadd7","infoHashBuffer":{"type":"Buffer","data":[54,240,160,91,118,24,57,160,252,171,19,244,51,83,50,246,190,255,173,215]},"announce":[],"urlList":[]}}