{"title":"Wild Gardens - Complete Series","uid":5066854,"size":1410235308,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:37477051c23ce305aad45e53b4f9dcd3c190f817&amp;dn=Wild+Gardens+-+Complete+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"eddie1969","files":14,"time":1251055215,"description":"TV : Documentary : TV quality : English\n\n\n\nWild Gardens\n\n\n6 episodes - Aug/Sept 2008 - ITV1\n\n\n\nMike Dilger travels around the countryside in the South West of England looking for inspiration and revealing how to turn even the smallest garden into a haven for local wildlife.\n\n\n\n\n\n\n\nEpisode 1. Wetland\n\nMike goes otter spotting on the Somerset Levels, and explains how to create a wetland area in a back garden.\n\n\nEpisode 2. Coast\n\nMike investigates how coastal plants in Cornwall manage to survive in extreme conditions, and visits a garden full of exotic plants which was created on granite boulders.\n\n\nEpisode 3. Urban\n\nMike reveals how those of us living in cities can still do our bit for local wildlife. He takes a look at some foxes in Bristol, makes fat cakes for garden birds, and finds out how to make a city garden hedgehog-friendly.\n\n\nEpisode 4. Moorland\n\nMike visits Dartmoor, celebrating the wildlife, landscape and gardens of one of Britain's most-visited wild places, and puts heathers, an iconic moorland plant which has gone out of fashion in the gardening world, back on the map. He visits wild ponies and Buckfast Abbey's bees, finds a rare beetle and stays at night to witness Britain's rarest bat, the Greater Horsehoe, coming out to feed.\n\n\nEpisode 5. Woodland\n\nBluebells spotted during a walk in the Forest of Dean at springtime inspire the creation of a woodland garden in Gloucester.\n\n\nEpisode 6. Downland\n\nMike explores the history, beauty and inspiration of Wiltshire's increasingly-rare chalk downland, which is dotted with wildflowers, rare orchids and butterflies. He then reveals how gardeners can recreate the feel of wildflower meadows, and investigates how the insects that thrive on downland are aiding the growth of the Great Bustard population 150 years after they were almost hunted to extinction.\n\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:37477051c23ce305aad45e53b4f9dcd3c190f817","amp;dn":"Wild+Gardens+-+Complete+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37477051c23ce305aad45e53b4f9dcd3c190f817","infoHashBuffer":{"type":"Buffer","data":[55,71,112,81,194,60,227,5,170,212,94,83,180,249,220,211,193,144,248,23]},"announce":[],"urlList":[]}}