{"title":"Coast to Coast AM August 2nd 2009 - Facing the Future","uid":5040350,"size":55677728,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3778c7958d505b1f1c93cb5f6ef1a658be7fd0ff&amp;dn=Coast+to+Coast+AM+August+2nd+2009+-+Facing+the+Future&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jeffchil","files":6,"time":1249341093,"description":"Facing the Future\n\nDate:\n08-02-09\n\nHost:\nGeorge Noory\n\nGuests:\nMichael Bennett, Catherine Austin Fitts\n\nAppearing during the middle two hours of the show, scientist, radio host, and social critic, Dr. Michael Bennett aka Dr. Future, talked about the coming problems humanity faces, as well as his inventions, and Biblical interpretations. By 2020, we could be dealing with serious food and fuel shortages, as the population outstrips available resources, he said. In his opinion, one of the most frightening elements of the future is the transhumanism movement and the possibilities of genetic revolution and mutations.\n\n'Dr. Future' offered his interpretation of the Four Horseman, a reference that appears in the Book of Revelation. They are prophetic elements regarding wickedness and sin that have actually been occurring for some time, he said. The first horse represents ecumenical religions-- conquering on their own strength; the second horse represents the bloody wars that followed in the path of the religions-- and the building of nation states; the third horse is the supranational economic powers, the bankers of the world-- a power separate from the churches and the nation states; and the fourth horse is Death &amp; Hades, which mops up all the suffering brought on by the first three.\n\nIn the forthcoming book, How to Overcome the Most Frightening Issues You WILL Face This Century, a variety of authors including Bennett, Thomas Horn, Stanley Monteith, Michael Heiser, and Patrick Heron share their specialized knowledge on what you can expect in the coming days.\n\nEconomic Commentary\n\nFirst hour guest, investment advisor Catherine Austin Fitts shared an update on the economy. The middle class is going to be hit by indirect taxes coming from many different directions, including the raising of state and local fees, she warned. Further, we're seeing a kind of &quot;economic warfare,&quot; she declared, in which small businesses are being shut down, and capital from Main St. (local communities) is diverted away to Wall St. ","torrent":{"xt":"urn:btih:3778c7958d505b1f1c93cb5f6ef1a658be7fd0ff","amp;dn":"Coast+to+Coast+AM+August+2nd+2009+-+Facing+the+Future","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3778c7958d505b1f1c93cb5f6ef1a658be7fd0ff","infoHashBuffer":{"type":"Buffer","data":[55,120,199,149,141,80,91,31,28,147,203,95,110,241,166,88,190,127,208,255]},"announce":[],"urlList":[]}}