{"title":"Vinnie Vincent Invasion - Boyz Are Gonna Rock","uid":5120654,"size":182056964,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3978962727f9ddeea79962d4e4e5537e21e9af49&amp;dn=Vinnie+Vincent+Invasion+-+Boyz+Are+Gonna+Rock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1255329887,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nVinnie Vincent Invasion is a 1986 album by Vinnie Vincent Invasion.\n\n&quot;Back on the Streets&quot; was covered by former Europe guitarist John Norum for his 1987 debut album Total Control.\n\nThe album peaked at No. 63 on the Billboard Pop Album Charts and sold about 400,000 copies. Two singles were released: &quot;Boyz Are Gonna Rock&quot; and &quot;Back on The Streets&quot; but a music video was only made for &quot;Boyz Are Gonna Rock&quot;. The song &quot;Animal&quot; appeared on the soundtrack for the movie Summer School. The band opened for Alice Cooper in 1987 to support the record.\n\nIn the video for &quot;Boyz Are Gonna Rock,&quot; the singer in the video is Mark Slaughter rather than the actual singer, Robert Fleischman. Apparently, Fleischman had left the band prior to filming the video and Mark Slaughter ended up lip synching to Fleischman's vocals.\n\nThe song &quot;Invasion&quot; (for the CD and audio cassette versions) contained about three full minutes of looping guitar feedback at the end of the song. The record version had this same feedback at the end, but the difference was that it never ended until you picked up the needle! This was because the sound went all the way to the end of the vinyl, causing the needle to loop it over and over again.\n\nThe songs &quot;Boyz Are Gonna Rock&quot; and &quot;Back on the Streets&quot; are 2 of 4 Vinnie Vincent Invasion songs featured on the 2008 tribute album &quot;KISS MY ANKH: A Tribute To Vinnie Vincent.&quot; &quot;Boyz Are Gonna Rock&quot; features drums by Andre LaBelle, who had previously drummed on Vinnie's third (and unreleased) album &quot;Guitars from Hell.&quot;\n\nVinnie Vincent Invasion was an American heavy metal/glam metal band formed in 1984 by former KISS guitarist Vinnie Vincent.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:3978962727f9ddeea79962d4e4e5537e21e9af49","amp;dn":"Vinnie+Vincent+Invasion+-+Boyz+Are+Gonna+Rock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3978962727f9ddeea79962d4e4e5537e21e9af49","infoHashBuffer":{"type":"Buffer","data":[57,120,150,39,39,249,221,238,167,153,98,212,228,229,83,126,33,233,175,73]},"announce":[],"urlList":[]}}