{"title":"The Rape Of Europe [2002] XviD","uid":5025137,"size":1435450354,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3aba474a10d9837e00aa271765e7c4964370e24a&amp;dn=The+Rape+Of+Europe+%5B2002%5D+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"verifire","files":-1,"time":1248650911,"description":"Hi there..\n\nThen it finally happened. TPB's trackers are down. But I've been anticipating something like this for a while. So for those who'll want to download torrents I've made and will make in the future, I'm moving nearly all of them to another torrent-site, maybe two. I guess it'll be at least: &lt;a href=&quot;\nhttp://www.torrentbox.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentbox.com&lt;/a&gt;\n\nJust browse for the torrents on that site, and all uploads will come up, just give me some days.. :-)\n\nAnd you can still start your download from this site!! Just add these trackers to the torrent, and we'll find each other again.\n &lt;a href=&quot;\nhttp://tracker.publicbt.com:80/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.publicbt.com:80/announce&lt;/a&gt;\n &lt;a href=&quot;\nhttp://tracker.torrentbox.com:2710/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.torrentbox.com:2710/announce&lt;/a&gt;\n \nNow don't click on the &quot;links&quot; above, that won't work. Copy and paste them to add them to your trackers in the torrent-file.\n\nAnd be sure to enable DHT. It tracks too..\n  \nAnyway, they should also all be available by search on my alias, verifire, on for instance: &lt;a href=&quot;\nhttp://www.isoHunt.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.isoHunt.com&lt;/a&gt;\n \n- because they search the contents and comments on the upload for tags as well as the title of the torrent.. Just give me some time..\n\nSee you later, when things are settled and (maybe) there's a working tracker on the site again, and I'll miss it terribly, but I hope for, and guess this isn't the last word on the matter. I'll upload stuff here anyway, as well as on the other sites...\n\nTPB WILL ALWAYS RULE!! THANK YOU, GUYS. YOU'VE BEEN A PLEASURE TO BE SHIPWRECKED WITH. IT'S AN HONOUR...\n\nVerifire.\n____________________________________________________________________________\n\n\nI'm at the moment being constantly monitored and hindered in sharing Christian material. For instance uTorrent shows that there's three(!) seeders on every torrent I upload when they've been published for a few minutes, and I have shared maybe 1% of the file. How's that possible? A month ago it showed &quot;only&quot; two..\n\nThe people who hate what I do block my listening port and slows down my bandwidth to an extreme low, and I'm being bombarded in comments on uploads and mails. The only thing I can do, is to appeal to you who are Christians, to help me seed these torrents, because I don't know how much longer I'm able to do this. Not for long, I fear. And I live in Norway, a so called &quot;free Nation&quot; of the western world..\nAnd then I'm accused of being a &quot;conspiracy-theorist&quot;.. :-)\n\nI've decided to upload this movie about Europe and what she stands for.\nWhat, or rather who, is Europa? You can see her riding Zeus in the form of a bull as a statue in Torremolinos, Spain just above this introduction. I took the picture myself in May, 2008.\n\nThe narrator, David Hathaway, takes us through a terrifying, but sadly true, history.\nHe explains how:\n\n1: Babylon's tower is rebuilt in the EU, and how the Biblical prophecy of Daniel through the interpretation of a dream king Nebuchadnezzar had, refers to Rome, which has been risen again to form the EU, the feet of part iron, part clay.\n\n2: Who is the woman riding the Beast in Revelation 17, and who is the beast she's riding?\n\n3: The shocking truth about how Satan has been governing Europe since &quot;the throne of Satan&quot; from Pergamon (Rev. 2:13: &quot;I know your works, and where you dwell, where Satan's throne is.&quot;), literally was rebuilt in Berlin.\n\nNow when it comes down to the ten horns of the beast in revelations 17, I personally think they refer to the very last days of this age, when the Global government plans to divide the whole world into ten (!) economic zones, but that's just me trying to see a bit further than this movie takes us. Time will tell.\n   \nAnyway: This movie is for most people totally new information, and should leave you with a new perspective and an opened door to new ways to perceive the world and its &quot;god&quot; and even more so Him who Really Is God..\n\nCertified and recommended for those who want to be awake enough to make the right choice when that choice is Life or death..\n\nThe movie is in English, but Norwegian subs will follow in another upload of this movie a little later. I'll have to translate first.. But it's coming, and I will then make a separate upload of the sub-files, timed and precise, so that people can benefit from that if they want to translate themselves..\n\nOh, and PLEASE help me seed this, because my machine and bandwidth is pushed to the limit, and I'd rather not abandon things people want or need.. So please..?\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;fc8a998e959a958e99919d9590bc9b919d9590d29f9391&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:3aba474a10d9837e00aa271765e7c4964370e24a","amp;dn":"The+Rape+Of+Europe+%5B2002%5D+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3aba474a10d9837e00aa271765e7c4964370e24a","infoHashBuffer":{"type":"Buffer","data":[58,186,71,74,16,217,131,126,0,170,39,23,101,231,196,150,67,112,226,74]},"announce":[],"urlList":[]}}