{"title":"ZygorGuides-2.0.1189-Horde-Alliance+Dailies+Midsummer Guide","uid":5651489,"size":2767603,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3adc8e267d9ed26a7d8725c092c6bafe2619f3b6&amp;dn=ZygorGuides-2.0.1189-Horde-Alliance%2BDailies%2BMidsummer+Guide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"teseus","files":5,"time":1277652122,"description":"Here is the June 23rd, 2010 ( 2.0.1189) release of Zygor's Guide. Included are the horde and the alliance leveling guide and the new dailies guide for both horde &amp; alliance.  It includes both the viewer and the updated guides.\nAlso a guide for the midsummer festival is included\n(it was found on the demonoid tracker)\n\n_____________________________________________________________________________\n\nCHANGELOG (from 1049)\n\nVersion: 2.0.1052 May 2nd, 2010\n\nAlliance Guides Change Log:\nDailies Guide:\n* Fixed many Children's Week Guide errors\n\nHorde Guides Change Log:\nDailies Guide:\n* Fixed many Children's Week Guide errors\n\nGuides Viewer Change Log:\nViewer:\n* Loading no longer delayed until window is displayed\n* Waypointing reworked; removed waypointer autodetection for more stability\n* New option: hiding guide arrow together with the guide window\n* Improved tracking of failed quests (not mixed up with complete anymore)\n\nVersion: 2.0.1054 May 3rd, 2010\n\nAlliance Guides Change Log:\nLeveling Guide:\n* Alliance 35-40 Step 136 - Daggerspine Raiders and Sorcereses are killed in steps 137-141 so put this step at the end since by then you'll have already killed some of these.\n\nVersion: 2.0.1058 May 5th, 2010\n\nAlliance Guides Change Log:\nAlliance Dailies:\n* split descriptions over multiple lines. These need to be kept manually split, as the tooltip doesn't use automatic text wrapping in this case.\n* Added more information to the Netherdrake guide to let players know that in order to complete the section they must have Artisan flying.\n\nHorde Guides Change Log:\nHorde Dailies:\n* split descriptions over multiple lines. These need to be kept manually split, as the tooltip doesn't use automatic text wrapping in this case.\n\nGuides Viewer Change Log:\n* fixed display of guide description tooltips\n* fixed map dots disappearing from the large world map\n* fixed Carbonite waypoints appearing with a delay\n* hopefully fixed viewer not detecting arriving at a flight destination\n\nVersion: 2.0.1189 June 23rd, 2010\n\nAlliance Guides Change Log:\n* 13-20 Step 33 - Merged several travel steps into one. Now utilizes the Hearthstone to Sentinel Hill instead.\n* Death Knight 55-60 - Step 18 - The quest &quot;The Power Of Blood, Frost And Unholy&quot; has been made into an instant quest and now properly completes.\n* Death Knight 55-60 - Step 28 - The quest &quot;Abandoned Mail&quot; has been made into an instant quest and now properly completes.\n* Added collection of Large Gjalerbron Cage Keys (72-74, step 233)\n* Fixed detection of Frozen Spore (72-74, step 266)\n\nHorde Guides Change Log:\n* Horde 20-25 Step 88 - Get 7 Deepmoss Eggs changed to 15\n* 35-40 Step 70 - Fixed coordinate for Grom'Gol Base Camp Zeppelin\n* Death Knight 55-60 - Step 18 - The quest &quot;The Power Of Blood, Frost And Unholy&quot; has been made into an instant quest and now properly completes.\n* Death Knight 55-60 - Step 28 - The quest &quot;Abandoned Mail&quot; has been made into an instant quest and now properly completes.\n* Tauren 1-13 Step 9 - Step now points to the correct NPC when turning in the Warrior quest &quot;Simple Note&quot;.\n* Undead 1-13 - The quest &quot;Tainted Scroll&quot; is now correctly accepted from Novice Elreth instead of Shadow Priest Sarvis.\n* 40-42 Step 124 - Captured Totem quest now instructs hunters to put their pet on passive.\n* 70-72 Step 31: Step now recommends killing Warsong Aberrations as well to get the Scourge Cage Keys.\n\n\nGuides Viewer Change Log:\n* Added / Edited NPCs\n* Added: step frame opacity setting, separate from the static 50% used so far.\n* Fixed: changing &quot;hide window border&quot; from off to on could cause flickering.\n* Fixed: &quot;log&quot; and &quot;event&quot; type quest objectives were displayed as 0/1 even when complete\n* Adjusted &quot;window moving boundaries&quot; to allow for moving the window close to screen edge in both top-down and bottom-up modes.\n* Fixed a bug that could cause waypoints set from a different continent to never appear even after travelling to the proper continent.\n* Removed background texture, replacing with plain colour - Blizzard broke texture resizing in 3.3.3 and there's no working around that\n* New internal pointer convenience feature: audio cues. If you leave your character flying unattended for more than 5 seconds, two sound signals are enabled: a 'boat bell' sound if you reach your destination, or a 'zap' sound if you're not flying towards the correct destination anymore. With these, you can start flying towards the destination and Alt-Tab out or go take a break or something - the sounds will attract your attention so that you don't fly off the map.\n* Bug Report now includes key ring items\n* New internal pointer feature: corpse arrow! Together with not-so-funny descriptions.\n* Fixed: error when trying to create a waypoint in a nonexistent zone\n* Tweaked ETA calculation to behave better in high-load map marker situations\n* Fixed bug with travel steps at the end of a guide chain\n* enUS: Added proper singular plurals for &quot;down&quot;, &quot;prey&quot; and &quot;vrykul&quot;\n* Fix: removed the &quot;legacy&quot; db.profile.GuideName that apparently caused problems to some\n* New experimental convenience feature: Manual Waypoints. Click anywhere on the worldmap and an arrow pointing there will be set. Right-click that spot (or advance the guide) to remove. Useful for easy long-distance travel (especially with &quot;audio cues&quot; on).\n* LibCamera is no longer supported under patch 3.3.5. Removing support for &quot;camera-aligned&quot; waypoint arrow. Sorry!\n\nOther changes:\nAlliance Dailies Guide:\n* Icecrown Full Zone Quest Path - Step 253 - Corrected the quest goal, was missing objective number\n* Icecrown Full Zone Quest Path - Step 319 - Corrected the quest goal, was missing objective number\n* Netherdrake Friendly Pre-Quests - Step 16 - Correct the quest goal, was a incorrect objective number\n* Storm Peaks step 79 - Deleted repeated step that had you turnin Facing the Storm too early\n* Dalaran Fishing Step 1, 8, 11 - &quot;Quest Monsterbelly Appetite&quot; was changed to &quot;Disarmed!&quot; and it's objective was corrected to reflect changes made in 3.3.\n* Icecrown Full Path - Step 128 moved to 245 - Quest &quot;Shoot 'Em Up&quot; moved so that all pre-reqs would be done in time to unlock it.\n* Added Midsummer Fire Festival Guide\n\n\nHorde Dailies Guide:\n* Childrens Week Shattrath Step 25 - Changed step so that the player uses the portal to Blasted Lands in Silvermoon. Removed unneeded steps.\n* Stormpeaks Full Zone Step 165 - Ravaged Cavedweller Worgs changed to just Cavedweller Worgs\n* Stormpeaks Full Zone Step 165 - Fixed coordinates for Prospector Khrona's Notes\n* Stormpeaks Full Zone Step 173 - Step is now correctly tied to the quest objective to kill Tracker Thulin\n* Home Cities step 509, 519 - Adjusted the coordinates for NPC Rhinag.\n* Fixed locations where daily quest &quot;What Do You Feed a Yeti, Anyway?&quot; is completed.\n* Dalaran Fishing Step 1, 8, 11 - Quest &quot;Monsterbelly Appetite&quot; was changed to &quot;Disarmed!&quot; and it's objective was corrected to reflect changes made in 3.3.\n* Added Midsummer Fire Festival Guide\n","torrent":{"xt":"urn:btih:3adc8e267d9ed26a7d8725c092c6bafe2619f3b6","amp;dn":"ZygorGuides-2.0.1189-Horde-Alliance%2BDailies%2BMidsummer+Guide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3adc8e267d9ed26a7d8725c092c6bafe2619f3b6","infoHashBuffer":{"type":"Buffer","data":[58,220,142,38,125,158,210,106,125,135,37,192,146,198,186,254,38,25,243,182]},"announce":[],"urlList":[]}}