{"title":"Nero Wolfe-Veleno in Sartoria-Seconda Puntata[DVDR-Ita-Menu]gial","uid":5122552,"size":4080222208,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3d6db7488409d1a506b0b6fc51656d830a1c01a0&amp;dn=Nero+Wolfe-Veleno+in+Sartoria-Seconda+Puntata%5BDVDR-Ita-Menu%5Dgial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Duracell72","files":21,"time":1255392324,"description":"[IMG]http://img504.imageshack.us/img504/7251/tinobuazzelli.jpg[/IMG]\n\nLe grandi inchieste di Nero Wolfe\n\n:::-&gt;Presentazione&lt;-:::\n\nNero Wolfe ÃƒÂ¨ un personaggio di fantasia nato dalla penna dello scrittore statunitense Rex Stout.\nImpersona un investigatore privato, dall'enorme mole ed amante delle orchidee e del buon cibo, protagonista di numerosi \n\nromanzi e racconti brevi scritti a partire dagli anni trenta.\nNella finzione Nero Wolfe nasce nel 1893, il 17 aprile ed ÃƒÂ¨ di origine montenegrina. Nei primi romanzi il luogo di nascita ÃƒÂ¨ \n\nTrenton (New Jersey), in seguito Stout decise di farlo diventare montenegrino a tutti gli effetti e in The black mountain \n\n(&quot;Nero Wolfe fa la spia&quot;) vediamo Wolfe tornare al suo villaggio natale nel Montenegro.\nL'io narrante dei romanzi di Nero Wolfe ÃƒÂ¨ il suo assistente e tuttofare Archie Goodwin, ormai abituato al suo eccentrico \n\ndatore di lavoro che definisce &quot;mio signore e donno\n\nNero Wolfe pesa intorno ai 150 kg (&quot;un settimo di tonnellata&quot;), ÃƒÂ¨ un raffinato buongustaio, assai pignolo, e considera il \n\nlavoro alla stregua di un indispensabile fastidio che gli consente di tenere un alto tenore di vita; ÃƒÂ¨ moderatamente iroso, \n\nnon parla di lavoro a tavola e, pur avendo una vasta clientela femminile, ÃƒÂ¨ fortemente misogino; coltiva rare orchidee nel \n\ngiardino pensile della sua casa (un elegante palazzo in arenaria) situata al numero 918 della 35a strada ovest di New York. \n\nConduce orari di lavoro rigidissimi (non dedica infatti a tale attivitÃƒÂ  un minuto in piÃƒÂ¹ del previsto, cosa che sottrarrebbe \n\ntempo alle altre attivitÃƒÂ , la coltivazione delle orchidee e il mangiare).\n\nÃƒË† specializzato nella risoluzione di intricati casi di omicidio che scioglie stando comodamente seduto a rimuginare \n\nsull'ampia poltrona del suo studio o beatamente affaccendato a curare le proprie piantine. Infatti l'investigatore non lascia \n\nquasi mai la propria abitazione (se non in pochissimi casi e mai per lavoro), abituato com'ÃƒÂ¨ a spostarsi tra tre vani ben \n\ndistinti: la cucina, lo studio, ed esclusivamente tra le 9 e le 11 e tra le 16 e le 18, la serra privata (all'ultimo piano \n\ndell'abitazione). La disposizione dei vani, cosÃƒÂ¬ come degli arredi e suppellettili, sono rigorosamente descritti da Stout, ed \n\ninsieme alle inviolabili e immutabili abitudini, orari e regole di casa Wolfe, sono nel loro insieme una caratteristica \n\nfondamentale e comune di tutti i romanzi di Nero Wolfe.\n\nÃƒË† quindi Archie Goodwin a recarsi sui luoghi del delitto, a interrogare testimoni o parenti della vittima (salvo i casi in cui \n\nquesti siano disponibili a recarsi alla casa di Nero Wolfe per essere sentiti da lui direttamente), tenere sotto controllo e \n\npedinare sospetti, e molto altro svolgendo quindi le funzioni di &quot;gambe&quot; e &quot;occhi&quot; del suo principale.\n\n:::-&gt;Gli sceneggiati RAI (1969-1971) &lt;-:::\n\nMiniserie televisiva prodotta dalla RAI per Raiuno e trasmessa fra il 1969 ed il 1971 quasi completamente girata in studio, \n\nera articolata in dieci telefilm di circa due ore. Ad interpretarla furono chiamati noti attori. Nei ruoli dei principali \n\npersonaggi: Tino Buazzelli, nei panni dell'investigatore di origine montenegrina, Paolo Ferrari, in quelli dell'assistente \n\nArchie Goodwin e Pupo De Luca, come Fritz Brenner, cuoco di casa Wolfe.In ogni puntata - girata in bianco e nero - la \n\ndistribuzione del cast era completata da uno o piÃƒÂ¹ attori ospiti (per lo piÃƒÂ¹ interpreti di teatro) che impersonavano i \n\npersonaggi al centro della vicenda. La regia dei telefilm - che ebbero un successo di critica e di pubblico - era di Giuliana \n\nBerlinguer (autrice anche di un paio delle riduzioni dai romanzi gialli di Stout portate sul piccolo schermo), mentre diversi \n\nautori furono chiamati ad elaborare la sceneggiatura delle diverse puntate. \n\nInterpreti principali e personaggi \n\nTino Buazzelli, Nero Wolfe \nPaolo Ferrari, Archie Goodwin \nPupo De Luca, Fritz Brenner \n\nTrama: In una pausa di un'affollata sfilata di moda, una giovane indossatrice muore avvelenata per aver ingerito un candito \n\nripieno di cianuro. Preoccupato per la sorte della cugina Helen, anch'essa modella nella medesima sartoria, Lew Frost \n\nincarica Nero Wolfe di indagare sulla vicenda. Ma dopo un solo giorno cambia idea e decide di togliergli l'incarico. Troppo \n\ntardi! Il celebre investigatore ÃƒÂ¨ giÃƒÂ  sulle tracce dell'assassino e basteranno le poche frasi pronunciate dal titolare \n\ndell'atelier, Boyden McNair, prima di morire anch'egli avvelenato, il suo eccezionale intuito e una misteriosa scatola rossa \n\nper permettergli di risolvere il caso. \n\n:::-&gt;Caratteristiche del DVD&lt;-::: \n\nDurata: 56 min. circa\nLingue: Italiano\nSottotitoli: non presenti\nMenu: si\nFormato Video: 4:3 (1.33:1)\nCompressione: nessuna","torrent":{"xt":"urn:btih:3d6db7488409d1a506b0b6fc51656d830a1c01a0","amp;dn":"Nero+Wolfe-Veleno+in+Sartoria-Seconda+Puntata%5BDVDR-Ita-Menu%5Dgial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d6db7488409d1a506b0b6fc51656d830a1c01a0","infoHashBuffer":{"type":"Buffer","data":[61,109,183,72,132,9,209,165,6,176,182,252,81,101,109,131,10,28,1,160]},"announce":[],"urlList":[]}}