{"title":"Get free stuff from FreeBieJeebies","uid":5584203,"size":129,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:3dc4c6ed577b100338ae77c070de8e92a7c79ec5&amp;dn=Get+free+stuff+from+FreeBieJeebies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1274648311,"description":"Please note there are no catches with this offer.\n\nYou don't even have to go for the listed offer, there are loads of different items to choose from but only if you follow the instructions below fully.\n\n\nGo to website you have just downloaded and register your details (There are no credit cards or bank details needed)\n\nonce registered follow the the instructions you will be given. you will be required to sign up for 1 offer but this won't cost anything if you follow the top tip below.\n\n\nTOP TIP: Sign up to the love-film offer; you don't have to pay a thing and it still gets counted. :)\n\n BE SURE TO SIGN UP TO AT LEAST ONE OFFER-LOVE FILM,GAMING OFFER ETC..GO FOR IT! Please give it a go-you wont regret it! Be sure to complete ONE OFFER correctly for it to be registered!\n\n\nPLEASE NOTE: THAT WHEN YOU SIGN UP FOR THE LOVE FILM OFFER, BE SURE TO RENT ONE FREE DVD AT THE LEAST IN ORDER FOR YOUR OFFER TO BE ACCEPTED TO START THE PROCESS FOR YOUR FREE OFFER,  A LOT OF PEOPLE ARE LOSING OUT BECAUSE OF THIS,\n\nSO YOU WILL GET A FREE 2 WEEK TRIAL WHEN YOU SIGN UP, AND ALL YOU NEED TO DO IS CANCEL LOVE-FILM BEFORE THE 2 WEEK TRIAL HAS ENDED.\n\nMAKE SURE YOU ORDER ONE DVD (THIS WILL NOT COST A THING BECAUSE OF YOUR FREE TRIAL) AND THEN SEND THE DVD BACK TO THEM (FOR FREE TOO) AND YOUR OFFER WILL BE COMPLETE.\n\n \n\nIF YOU SIGN UP TO 1 OF THE OTHER OFFERS WHICH ARE AVAILABLE YOU CAN COMPLETE YOUR OFFER WITHIN 24HRS SOME OFFERS IT WILL BE COMPLETE WITHIN AN HOUR .\n\n\nThanks","torrent":{"xt":"urn:btih:3dc4c6ed577b100338ae77c070de8e92a7c79ec5","amp;dn":"Get+free+stuff+from+FreeBieJeebies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dc4c6ed577b100338ae77c070de8e92a7c79ec5","infoHashBuffer":{"type":"Buffer","data":[61,196,198,237,87,123,16,3,56,174,119,192,112,222,142,146,167,199,158,197]},"announce":[],"urlList":[]}}