{"title":"Secrets of the Dragon Wheel-by ozgurd","uid":5673363,"size":235412725,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:3de6b0a1cfb63dcf5a7cb79d1690c903839bea85&amp;dn=Secrets+of+the+Dragon+Wheel-by+ozgurd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1278438026,"description":"Secrets of the Dragon Wheel- New Hog-by ozgurd\n\n\njust install play full game\n\n\nEpiphany O'Day has been laughed out of her University. Her superiors think her wild theories on\nthe ancient and mysterious Dragon Wheel artifact are pure fantasy. But her mentor, Professor Lunn\nhas used her careful research to unlock dark forces and he begs her to help him before its too\nlate. But powerful, evil people have taken notice of her work and now a trail of blood and\nancient torment are forcing our beautiful young sleuth to tangle with more than academia.\n\nShe must sneak on to the Imperial Majestic, a luxurious and very dangerous royal train destined\nfor an epic journey from Europe into the darkest reaches of the Far East. She must use every\nounce of her wits, bravery and deep knowledge of the Dragon Wheel to stop the murder and mayhem\nin its tracks.\n\n   * Loads of hidden objects, intriguing puzzles and dastardly tricks\n   * Fantastic mystery tale, unfolding through stunningly beautiful and exotic scenes from Paris\n\nto the Far East\n   * Match wits with dark characters. Who is on your side as you try to stop murder and mayhem?\n   * Figure out how to assemble and use the power of the scroll of songs and the Dragon Wheel\n\n    enjoy","torrent":{"xt":"urn:btih:3de6b0a1cfb63dcf5a7cb79d1690c903839bea85","amp;dn":"Secrets+of+the+Dragon+Wheel-by+ozgurd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3de6b0a1cfb63dcf5a7cb79d1690c903839bea85","infoHashBuffer":{"type":"Buffer","data":[61,230,176,161,207,182,61,207,90,124,183,157,22,144,201,3,131,155,234,133]},"announce":[],"urlList":[]}}