{"title":"Big Boss 3 Episode 7 - 10 Oct 09 Aakhri Salam - MaDdY[TLrG]{}.wm","uid":5122703,"size":192974252,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3e0cae1fc0e2be6f3bd05726166206a0b0b263a4&amp;dn=Big+Boss+3+Episode+7+-+10+Oct+09+Aakhri+Salam+-+MaDdY%5BTLrG%5D%7B%7D.wm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bindass","files":1,"time":1255443520,"description":"Still people taking about food.. O goss....\n\nVindu and Ismail taking about food and also about Kamaal's behavior..and Vindu challenged Ismail that he( Kamaal ) will have food and acting that he is in love ...Vindu talking to kamaal and making him understand Claudia too feeks for him and guiding him how to behave in front of Claudia...\n\nKamaal he is doing such a stupidity and singing like hell ... Yeah ! Kamaal's English.. Hahahahah..Seriously Funny Man..\n\nVindu and Raju wishing AmitTabh Bachchan...\n\nRaju taking a bath under the tab and rhyming mantra's and Vindu, Kamaal , Ismail making Fun of him and Sherlyn helping him in bath.. hahahahha ...Rohit giving Raju a New Hairstyle and wearing a Tshirt Quoted &quot; no body knows I m a lesbian&quot; and in the night acted again of Rakhi's Mother.\n\nMan Rakhi really going Kill him once he out.. Man O Man.. everyone enjoying the act of Rakhi's Mom mimicry by Raju.\n\nat 1.45.. Ismail making him understand But Kamaal saying just wait for 2-3 days more.. kamaal sang many song for Claudia.. dont know she understands or not.. Yes she didn't.\n\nClaudia says she is feeling bad.. But Kamaal acting something rubbish...\n\nIsmail shared his experience with other members about his &quot;Tadap Tadap k &quot; song except Kamaal .. he was not with them...\n\nSherlyn also made him understand not behave like Rubbish and told him  behave like gentalman. later ...Sherlyn went to the girls team and told about Kamaal's behaviour....\n\nIsmail , Kamaal, Raju having fun and Vindu trying to teach Raju and taking his confidence and asking him to do as he doing...\n\nRohit giving training to Shamita Wink  Really the expression and The hand Movement of Rohit is Really good Man..\n\nBig Boss gave house Members some Raw material to prepare Cake and Card to Wish Mr. Big B...\n\nBaktyaar too teaching Kamaal about his behaviour hand took ,.,. Kamaal really dont wanted to understand Man he is Syco I feel... Kamaal is being so confident as he will make Claudia to say I love u to him...\n\nRaju called Claudia to teach him hindi and Claudia speaking in German and Raju making fun with her ....Man...its not fair... They are too Much.. Poor Cluadia...\n\nVindu making Claudia to understand to do as she want.. as she very tense because of his ( Kamaal) behaviour... and she got frustrated and its really not fair.. Kamaal Should not do such things...\n\nmember Prepared a yummy chocolate cake for Big B which he cant cut and eat and made a beautiful painted Card to wish him and sang many songs to wish him..\n\n Big Boss took the Card and the Cake made by members and gave them another cake and played Music of Big B's Movie to enjoy ..everyone enjoyed and  danced together .. really rocling man.. Shamita looking most sweet and cuties amound them.. Raju tho great hai...Dacing like Rockstar .. hahahha\n\n7th day al late night .. You know what Kamaal gone to kitchen and having food.. and this has een watched by Vindu.. Vindu was laughing... and Big Boss played alarm as Kamaal stolen the food from kitchen... hahahhahahhahah\n\nFinally Big Boss seing everything.. and Big Boss alarm showed The True love of Kamaal... Ha Ha Ha Ha .. ","torrent":{"xt":"urn:btih:3e0cae1fc0e2be6f3bd05726166206a0b0b263a4","amp;dn":"Big+Boss+3+Episode+7+-+10+Oct+09+Aakhri+Salam+-+MaDdY%5BTLrG%5D%7B%7D.wm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e0cae1fc0e2be6f3bd05726166206a0b0b263a4","infoHashBuffer":{"type":"Buffer","data":[62,12,174,31,192,226,190,111,59,208,87,38,22,98,6,160,176,178,99,164]},"announce":[],"urlList":[]}}