{"title":"Halestorm - I Get Off  (Xvid-2nafish)","uid":5065937,"size":65376416,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3e1d57123cdd0454dabfc477bc03867af4f884c4&amp;dn=Halestorm+-+I+Get+Off++%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1251013464,"description":"Source: TV\n\nFile Info:\n\nValid : Yes [AVI]\nDuration : 00:03:04\n\n[Video]\nResolution : 640x480\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 1306 Kbps\nQuality Factor : 0.15 b/px\n\n[Audio]\nCodec : Microsoft PCM Format\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 1536 Kbps\n\n\nHalestorm is an American hard rock band from York, Pennsylvania. The group is currently signed with Atlantic Records and released their self-titled, major label debut album in April 2009.\n\nHalestorm is the debut album from the hard rock band Halestorm. Howard Benson, who has also worked with Daughtry, My Chemical Romance, and Flyleaf, produced the album. It peaked at #40 on the Billboard 200. The first single off of the album, &quot;I Get Off&quot; has gotten considerable play time. The song reached #17 on Billboard's Rock list.\n\nHalestorm has been consistently active, writing and performing original music since 1998 (when the band members were ranging in ages from 10 to 13 years old) and becoming increasingly successful. When the band first started, Lzzy and Arejay's father played the bass until Josh Smith joined the band. They have achieved international airplay, having been featured on the Lord Litter show in Germany. Halestorm has been the featured artist, appearing on tha covers of Origivation Magazine (October 2006) and Pennsylvania Musician magazine three times (August 1999, March 2000, and February 2003).\n\nThe group signed a recording contract with Atlantic Records on June 28, 2005. They toured nationally across the United States from January to March 2006 on the Winterfresh Sno-Core Tour with Seether, Shinedown, and Flyleaf. There were about 23 shows in that tour. After that tour the band hit the road again, this time on the Equinox Tour with Shinedown, Trapt, Evans Blue, and Mercy Fall. This lasted until mid-July 2006. Lzzy Hale also lent her vocals to a reworked version of the Shinedown song &quot;Shed Some Light&quot;, from their album Us and Them, although this version was never officially released and only saw sparse play on a few radio stations based in the band's home state of Pennsylvania.\n\nOn September 5, 2007, Halestorm appeared on The Tonight Show with Jay Leno as part of the Jaywalking segment.\n\nTheir debut album was released on April 28, 2009. James Michael co-wrote a song on it called &quot;What Were You Expecting.&quot; The song &quot;I Get Off&quot; serves as the album's lead single and has gained heavy radio play.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt; ","torrent":{"xt":"urn:btih:3e1d57123cdd0454dabfc477bc03867af4f884c4","amp;dn":"Halestorm+-+I+Get+Off++%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e1d57123cdd0454dabfc477bc03867af4f884c4","infoHashBuffer":{"type":"Buffer","data":[62,29,87,18,60,221,4,84,218,191,196,119,188,3,134,122,244,248,132,196]},"announce":[],"urlList":[]}}