{"title":"TweakNow PowerPack 2010 v2.1.000 Portable","uid":5579197,"size":14166669,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3e39166e540efaf27213bb557e49862131d7dccf&amp;dn=TweakNow+PowerPack+2010+v2.1.000+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoExcuses","files":3,"time":1274478208,"description":"TweakNow PowerPack 2010 v2.1.0000 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup is included. The program is free and can also be downloaded from the original site. See link below.\n\nTweakNow PowerPack is a fully-integrated suite of utilities that let you fine-tune every aspect of your computer's operating system and Web browser. The Registry Cleaner module provides you with a safe and simple way to clean Windows Registry. To keep your computer always at top performance, we recommend to clean your registry at least once a month. For Windows tweaking lovers, the suite provides more than 100 hidden Windows settings in the Windows Secret section. Using modules included in this section, you can easily customize your Windows like geeks do. The Virtual Desktop module lets you run as many as four custom-designed desktop configurations simultaneously, allowing you to tailor your computer screen to your mood and your work requirements.  Last but not least, the suite also gives you a complete picture of all aspects of your computer's hardware, including detailed information about your motherboard, processor, video card, memory, hard disk and network.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.tweaknow.com/powerPack.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tweaknow.com/powerPack.php&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. It's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:3e39166e540efaf27213bb557e49862131d7dccf","amp;dn":"TweakNow+PowerPack+2010+v2.1.000+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e39166e540efaf27213bb557e49862131d7dccf","infoHashBuffer":{"type":"Buffer","data":[62,57,22,110,84,14,250,242,114,19,187,85,126,73,134,33,49,215,220,207]},"announce":[],"urlList":[]}}