{"title":"Librivox M4B Audiobook - Treasure Island by Robert Louis Stevens","uid":5518125,"size":218208931,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3ece690ff9cf0715d26adda07108fbb995f6783f&amp;dn=Librivox+M4B+Audiobook+-+Treasure+Island+by+Robert+Louis+Stevens&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"VoxRatio","files":-1,"time":1272345867,"description":"An M4B file is an audio file which can be bookmarked. This is the audio-book file type. These files can have chapter markers which can be skipped through as you would skip through files on a play list. They can have built in cover art and chapter images. They will remember where you left off each time you stop the file and come back to it . And variable speed settings on Ipods and a growing number of other mp3 players can be utilized by this file type. The ability to bookmark allows for as little as one large file instead of many small ones without the burden of fast forwarding to find your spot every time you resume listening or the fear of otherwise losing your place. The reduced number of files also makes browsing through your files to find your book and your place in it much less effort.\n\n\nA mysterious map, pirates, and pieces of eight! When young Jim Hawkins finds a map to pirates' gold he starts on an adventure that takes him from his English village to a desert island with the murderous Black Dog, half-mad Ben Gunn, and (of course) Long John Silver. Arr Jim lad! R.L. Stevenson (1850-1894) was born in Scotland and travelled extensively in California and the south Pacific. (Summary by Adrian Praetzellis)\n","torrent":{"xt":"urn:btih:3ece690ff9cf0715d26adda07108fbb995f6783f","amp;dn":"Librivox+M4B+Audiobook+-+Treasure+Island+by+Robert+Louis+Stevens","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ece690ff9cf0715d26adda07108fbb995f6783f","infoHashBuffer":{"type":"Buffer","data":[62,206,105,15,249,207,7,21,210,106,221,160,113,8,251,185,149,246,120,63]},"announce":[],"urlList":[]}}