{"title":"Britney Spears - My Prerogative","uid":5078113,"size":132034564,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3ee7279f8bdb6cf659f3ad306ed7cc1c787b43f2&amp;dn=Britney+Spears+-+My+Prerogative&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1252042937,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;My Prerogative&quot; is a 1988 single by R&amp;B singer Bobby Brown. The second single from Brown's second solo album Don't Be Cruel, &quot;My Prerogative&quot; was a number-one hit on the Billboard Hot 100 in the United States and reached number six on the UK Top 40. It is among Brown's most successful recordings. The song is considered a New Jack Swing anthem and has been covered by many artists - none of which have repeated the success of the original version.\n\n&quot;My Prerogative&quot; was covered by pop artist Britney Spears for her Greatest Hits: My Prerogative album. The music video was directed by Jake Nava and depicts a wedding reception party for Spears and her real-life husband at the time Kevin Federline. Her music video was chosen by Rolling Stone magazine as the best music video of 2004, whereas MuchMusic's Fromage chose it as the worst music video of 2004.\n\nBritney Spears's cover was not successful in the United States, failing to chart in the Billboard Hot 100, managing only to peak at number one on the Bubbling Under Hot 100 Singles. However, her version did peak at number two on the Hot Digital Tracks, and within the top ten in several countries.\n\nIn the UK it was released competitively against other acts including Usher and Alicia Keys' &quot;My Boo&quot; (No. 5), Christina Aguilera and Missy Elliott's cover of &quot;Car Wash&quot; (No. 4), Destiny's Child's &quot;Lose My Breath&quot; (No. 2), and Eminem's controversial &quot;Just Lose It&quot; at No. 1. It gained considerable attention as it was the second instance where all top 5 positions were new entries (after October 1998), but the first time it was all American artists. It has sold 180,000 copies in that country. Worldwide, the single has sold 1.1 million copies.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:3ee7279f8bdb6cf659f3ad306ed7cc1c787b43f2","amp;dn":"Britney+Spears+-+My+Prerogative","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ee7279f8bdb6cf659f3ad306ed7cc1c787b43f2","infoHashBuffer":{"type":"Buffer","data":[62,231,39,159,139,219,108,246,89,243,173,48,110,215,204,28,120,123,67,242]},"announce":[],"urlList":[]}}