{"title":"Amerrika DVDRip Spanish 2009","uid":5500220,"size":819134200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3f0a14ee70c80a0d585770829c26973f04005f1c&amp;dn=Amerrika+DVDRip+Spanish+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":1,"time":1271499131,"description":"Drama protagonizado por una inmigrante palestina y su hijo adolescente en una pequeÃƒÂ±a ciudad de Illinois. La vida de Muna transcurre entre la pesadez diaria de los puntos de control de Cisjordania y la sombra de un matrimonio fracasado, pero todo cambia cuando obtiene un permiso de trabajo y residencia para los Estados Unidos. Sabiendo que es la ÃƒÂºnica manera de conseguir un futuro mejor, Muna y su hijo adolescente, Fadi, dejan Palestina en busca de una nueva vida en una pequeÃƒÂ±a ciudad de Illinois. La hermana de Muna, su marido y sus tres hijas, instalan a los reciÃƒÂ©n llegados en su casa. AllÃƒÂ­ tendrÃƒÂ¡n que esforzarse por encajar en una nueva cultura sin perder la propia, enfrentÃƒÂ¡ndose a un entorno que, tras la invasiÃƒÂ³n de Irak, mira con desconfianza a todo Oriente Medio. Mientras Fadi congenia con su prima rebelde y se mete en lÃƒÂ­os en el instituto, la indomable Muna no pierde la esperanza y, a pesar de tener que llevar una doble vida en la hamburgueserÃƒÂ­a local, afronta con optimismo esta nueva etapa, enseÃƒÂ±ÃƒÂ¡ndole a su hijo una lecciÃƒÂ³n que nunca olvidarÃƒÂ¡.","torrent":{"xt":"urn:btih:3f0a14ee70c80a0d585770829c26973f04005f1c","amp;dn":"Amerrika+DVDRip+Spanish+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f0a14ee70c80a0d585770829c26973f04005f1c","infoHashBuffer":{"type":"Buffer","data":[63,10,20,238,112,200,10,13,88,87,112,130,156,38,151,63,4,0,95,28]},"announce":[],"urlList":[]}}