{"title":"Torchwood Seizoen 2 Dvd 1 2Lions-Team","uid":5044310,"size":4504182740,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3f7aa69ab007883698325cbf50734cf9414f585b&amp;dn=Torchwood+Seizoen+2+Dvd+1+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"calke74","files":-1,"time":1249551829,"description":"Het tweede seizoen van de succesvolle BBC sciencefictionserie.\n\nTorchwood valt nog het best te omschrijven als een mix van Star Trek, CSI en 24. De serie was een kijkcijferhit in Groot-BrittaniÃƒÂ«. \nDe eerste afleveringen van de 13-delige serie zijn de best bekeken programma's aller tijden op de zender BBC 3. \nIn Engeland is de serie inmiddels aan zijn derde seizoen toe, die in de loop van dit jaar op BBC 1 uitgezonden zal worden.\n\n\nTorchwood speelt zich af in het hedendaagse Cardiff en volgt de belevenissen van de Welshe tak van het Torchwood Institute, dat de aarde moet beschermen tegen buitenaardse \n\nwezens. \nHet Torchwoodteam staat onder leiding van de iet wat raadselachtige figuur Captain Jack Harkness (John Barrowman). \nHij wordt bijgestaan door een vijfkoppig team, onder andere bestaande uit de computergeek Toshiko Sato, de briljante maar onaangepaste dokter Owen Harper en de intelligente \n\nreceptionist Ianto Jones.\n\nHet team bindt vanuit een ondergronds hoofdkwartier de strijd aan met de meest vreemde aliens door ze op CSI-achtige wijze met buitenaardse technieken te bestrijden. \nIn het eerste seizoen krijgen Captain Jack en zijn team onder andere te maken met een seksverslaafde alien die het nachtleven van Cardiff onveilig maakt en een spoor van \n\ngruwelijke moorden achterlaat. \nIn een andere aflevering landt er een vliegtuig uit het jaar 1953 op het vliegveld van Cardiff , waarvan de inzittenden niet meer naar hun eigen tijd terug kunnen. \nEn dan zijn er nog de Weevils, buitenaardse wezens waarvan er, zo ontdekt het Torchwoodteam, enkele honderden in het rioolstelsel van Cardiff dwalen.\n\nDe serie is een spin-off van de sciencefictionklassieker Doctor Who. Die serie werd in 2005 met succes nieuw leven in geblazen. \nMaar meer nog dan naar de avonturen van de brave Doctor Who hebben de makers van Torchwood gekeken naar populaire Amerikaanse sciencefictionseries als Buffy the Vampire \n\nSlayer en Angel. \nNet als Torchwood spelen die series zich niet af in de toekomst maar in het heden. Toch onderscheidt Torchwood zich wel degelijk van deze Amerikaanse series. \nHet is in alles overduidelijk een Britse productie. Captain Jack en zijn team lopen niet rond in indrukwekkende ruimteschepen en op onbekende planeten maar in een typisch \n\nBrits decor: \nde regenachtige straten van het hedendaagse Cardiff. De personages zijn alledaags in hun verschijning, maken grappen, \nhouden er een seksleven op na en vloeken er aardig op los als er iets misgaat. Uiteraard met een onvervalst Engels accent.\n\n\n\n\n\n\n\n\n\nTorchWood Seizoen 2 Dvd 1/3 *HDTV NL Subs*  \n\nAfleveringen:\n\nS02E01 Kiss Kiss, Bang Bang\nS02E02 Sleeper\nS02E03 To The Last Man\nS02E04 Meat\n\n\nBron: HDTV \nCategorie : Beeld \nFormaat : DVD5 \nBron : TV\nAudio ; Dolby Digital 2.0\nOndertitels : Nederlands (instelbaar)\nmenu : Ja\n\nMM.......: http://www.bbc.co.uk/torchwood/\nIMDB......: http://www.imdb.com/title/tt0485301/\n\n\n** Na het downloaden blijven seeden A.U.B \n** After downloading seed please\n\n******************************************\n\nBrought to you by \n2Lions-Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n    &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n******************************************\n","torrent":{"xt":"urn:btih:3f7aa69ab007883698325cbf50734cf9414f585b","amp;dn":"Torchwood+Seizoen+2+Dvd+1+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f7aa69ab007883698325cbf50734cf9414f585b","infoHashBuffer":{"type":"Buffer","data":[63,122,166,154,176,7,136,54,152,50,92,191,80,115,76,249,65,79,88,91]},"announce":[],"urlList":[]}}