{"title":"Luminous Shadows, The Artists of Eastern Cuba","uid":5668055,"size":557888176,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:40dea39e40ab58faa69ac7d508c867100dbcb0b8&amp;dn=Luminous+Shadows%2C+The+Artists+of+Eastern+Cuba&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rubusdemonoid","files":-1,"time":1278218885,"description":"Please help to seed this torrent when you are completed as my ISP has a monthly limit that I always max out on since I have over 50 torrents that I seed for you all. My ISP is going to terminate my service if I max out my monthly limit, so I just can't continue to seed all by myself so often. PLEASE help to seed. Thank you.  :)\n\n\n\nThe artists represented in this documentary are all full-time professional artists living and working in eastern Cuba. Documentary Synopsis: Luminous Shadows , The Artists of Eastern Cuba. 43minutes. Brilliantly shot, with an exciting soundtrack featuring traditional Cuban SON, this film is breaking new ground in the world of Cuban Art. This is the first documentary to focus exclusively on the art, and artists, from the easternmost region of Cuba, Oriente. This documentary takes the viewer on an insightful journey through Oriente, Cuba where you will become acquainted with the most highly acclaimed artists of this culturally rich region. This will be accomplished through studio visits and interviews in city and countryside locations. Santiago de Cuba and Baracoa, (each a former capitol city), as well as HolguÃƒÂ­n, Manzanillo, and Bayamo provide the exotic backdrop featuring the Sierra Maestra mountain range, 17th Century architecture, and splendid harbor vistas. The award-winning musical group, La Familia Valera Miranda, supplies an original and exciting soundtrack indigenous to the region. The documentary is in Spanish with English subtitles so the viewer may truly feel the emotion and spirit of each individual interviewed. Especially compelling is the presence of Antonio Ferrer Cabello, a third generation artist. The 93 year old Maestro, and former director of the BacardÃƒÂ­ Museum, speaks about the city he loves and its luminous shadows . The total truth that flows from these dialogs and encounters with the artists is quite compelling.\n\n\n\n\n\nMore of my music &amp; movie downloads that you may find of interest are located here: &lt;a href=&quot; http://thepiratebay.se/user/rubusdemonoid/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/rubusdemonoid/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:40dea39e40ab58faa69ac7d508c867100dbcb0b8","amp;dn":"Luminous+Shadows%2C+The+Artists+of+Eastern+Cuba","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40dea39e40ab58faa69ac7d508c867100dbcb0b8","infoHashBuffer":{"type":"Buffer","data":[64,222,163,158,64,171,88,250,166,154,199,213,8,200,103,16,13,188,176,184]},"announce":[],"urlList":[]}}