{"title":"Sandboxie v3.36 incl keys[He33T][bigup16]","uid":5110618,"size":565103,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:41621569c3b6fc2fd4267fce95b52d1aadd3f076&amp;dn=Sandboxie+v3.36+incl+keys%5BHe33T%5D%5Bbigup16%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thegrimreaper123","files":4,"time":1254704594,"description":"xxxxxxxxxxx\nx N A M E x\nxxxxxxxxxxx\n\nSandboxie v3.36\n\nxxxxxxxxxxxxxxxxxxxxxxxxx\nx D E S C R I P T I O N x\nxxxxxxxxxxxxxxxxxxxxxxxxx\n\nLets you browse the Web securely while keeping all your browser's functionality for active content\n\nSandboxie requires neither the disabling nor blocking of functions available to Web sites through the browser. Instead, Sandboxie isolates and quarantines the outcome of whatever the Web site may do to your computer, including the installation of unsolicited software.\n\nThere is no trade-off of functionality for security: the Web site can use the full range of active content tools, and if it uses these tools maliciously to install software or otherwise make changes in your computer, then these changes can be easily undone.\n\nSandboxie has originally been designed to increase the security of browsing with Internet Explorer, however it is just as effective with any other browser, and in fact, any other program. Sandboxie wraps a protection layer around the programs it supervises. It is this layer that intercepts and isolates any changes the programs make to the computer. And this layer is impartial to the specific program it wraps.\n\nSandboxie was designed as an application that will allow you isolates and quarantines website.\n\nWhen you browse the web, changes occur to your computer system. Most of the time these changes are harmless, like recording the addresses of web sites you have visited (and when), so the browser can help you complete a web address that you type in. Whether these changes are harmless or harmful, they do in fact happen to your computer system.\n\nWhen you use Sandboxie to protect your browsing session, it catches all these changes just as the browser is about to apply them into your computer system. Sandboxie does record these changes on behalf of the browser, but it records them in a special isolated folder, called the sandbox.\n\nThe benefit of having a sandbox is that it ensures your ability to get rid of all changes done by the browser, simply by deleting the sandbox folder.\n\nAnother useful feature of Sandboxie is the ability to terminate all sandboxed programs at once. As some web sites tend to pop up three new browser windows for each one you close, you can have Sandboxie close all of them with a click of a button.\n\nWhat's new in Sandboxie 3.36:\nTranslations:\nÃ‚Â· Albanian translation contributed by Besmir Godole.\nÃ‚Â· Chinese (Traditional) translation contributed by tenhon.\nÃ‚Â· Czech translation contributed by Virec Jaroslav.\nÃ‚Â· Russian translation contributed by Sergey Burkun.\nNew Features:\nÃ‚Â· New application configuration system makes it easy to activate configurations and resolve conflicts with third-party software.\nÃ‚Â· Intercept AutoPlay notifications for better protection of CD/DVD and USB drives which are protected (forced) by Sandboxie.\nFixes:\nÃ‚Â· Sandboxie Control does not abort if the tray icon cannot be installed.\nÃ‚Â· Border around sandboxed windows uses less CPU resources and does not appear around full screen Web video windows.\nFixes related to Windows Vista:\nÃ‚Â· Support &quot;Run As&quot; UAC elevation requests for sandboxed programs.\nÃ‚Â· Fixed a problem with Internet Explorer 8 when User Account Controls (UAC) is enabled.\nÃ‚Â· Fixed a problem that prevented a clean start of Windows Installer.\nÃ‚Â· Fixed a problem with starting Windows Live Messenger.\nÃ‚Â· Fixed a problem with use of some plug-and-play hardware such as webcams and joysticks.\nFixes to Quick Recovery and Immediate Recovery:\nÃ‚Â· Correctly recover files that have a long name or a long path.\nÃ‚Â· Suspend Immediate Recovery notifications until the file is no longer in use by the application that created it.\nÃ‚Â· Improved support for Immediate Recovery with Google Chrome and Microsoft Office products.\nÃ‚Â· Many more fixes under a hood for a smoother Sandboxie experience.\nThird-party software:\nÃ‚Â· Resolved conflict with eEye Blink (version 4.3.0 or later)\nÃ‚Â· Resolved conflict with Outpost Firewall during installation.","torrent":{"xt":"urn:btih:41621569c3b6fc2fd4267fce95b52d1aadd3f076","amp;dn":"Sandboxie+v3.36+incl+keys%5BHe33T%5D%5Bbigup16%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41621569c3b6fc2fd4267fce95b52d1aadd3f076","infoHashBuffer":{"type":"Buffer","data":[65,98,21,105,195,182,252,47,212,38,127,206,149,181,45,26,173,211,240,118]},"announce":[],"urlList":[]}}