{"title":"Attrition - Ephemera - 1995 - MP3","uid":5136619,"size":73131957,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:41879f1a9b21b6a278a5be990cfa2b77e5a35df7&amp;dn=Attrition+-+Ephemera+-+1995+-+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"m4lvolio","files":5,"time":1256540785,"description":"Recorded in 1993, this is more of a Martin Bowes solo album than a true Attrition release; it combines dark ambience and bracing percussion work.\n\n\n1. The Long Wait - 9:48\n2. A Great Desire - 9:57\n3. The Big Lie - 10:02\n4. Wetenscap - 9:48\n5. Lang Zal Jij Leven - 9:52\n\n\n\nAttrition are an electronic music band, formed in Coventry, England in 1980 by Martin Bowes and Julia Niblock. Influenced by punk's do-it-yourself aesthetic, Attrition appeared on compilation cassettes featuring contemporaries such as Portion Control, Konstruktivits, Chris and Cosey, Legendary Pink Dots, Nurse With Wound, Metamorphosis et al.\n\nTheir early post-punk stylings soon gave way to a distinctive electro-acoustic sound.[citation needed] This was based on Martin's deep growl, Julia's fretless bass work and breathy sub-operatic vocals, and a backline of electronic instrumentation, comprising analogue synthesizers (including a Korg Mono/Poly and Korg MS20), sequencer (Roland MC-202), drum machine (Roland TR-808), and various effects units.\n\n&quot;At first, there wasn't the same sort of scene and we were in more of an 'industrial' thing. There was nothing like the clubs you get now, it was actually quite difficult to play anywhere that would appreciate you. It's a lot easier now, it's not just Goth, it's a mix - Darkwave or whatever. That's gotten stronger, so that has helped, but really, we were there before it was built.&quot;\t\n\nPreview: http://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:axfuxq9hld6e","torrent":{"xt":"urn:btih:41879f1a9b21b6a278a5be990cfa2b77e5a35df7","amp;dn":"Attrition+-+Ephemera+-+1995+-+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41879f1a9b21b6a278a5be990cfa2b77e5a35df7","infoHashBuffer":{"type":"Buffer","data":[65,135,159,26,155,33,182,162,120,165,190,153,12,250,43,119,229,163,93,247]},"announce":[],"urlList":[]}}