{"title":"Selena Gomez &amp; The Scene - Falling Down","uid":5125237,"size":112756740,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4194f40928108db76842890a33273fe68b97451a&amp;dn=Selena+Gomez+%26+The+Scene+-+Falling+Down&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1255575854,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Falling Down&quot; is a pop song performed by American band Selena Gomez &amp; the Scene. The song was released as the lead single from their debut album, Kiss &amp; Tell. The song was released to Radio Disney on August 21, 2009 and later available for digital download on August 25. The song was written by Ted Bruner, Trey Vittetoe and Gina Schock, who've written for other Disney acts in the past. The upbeat song has prominent pop rock characteristics and lyrically is a ridicule of Hollywood and the famous life, according to Gomez.\n\nThe music video to &quot;Falling Down&quot;, directed by Chris Dooley, was first seen on Disney Channel, succeeding Wizards of Waverly Place: The Movie on August 28, 2009.  It became available for purchase the next day.\n\nThe music video commences with shots of Gomez singing the first lines, &quot;whoa, whoa,&quot; and bright lights shining upon her; she is wearing a gray shirt, black tights and boots. Then, the band, composed of four male members, is seen as Gomez dances and nods her head. The background in the music video is a large projection of patterned geometrical figures that constantly alter to divergent colors. Gomez is then seen in a &quot;photo shoot-like&quot; set wearing a white shirt and a zebra-patterned skirt. As the video progresses Gomez and her band are seen singing, dancing, playing instruments and using props. Gomez holds a mirror and plastic roses, which she then throws away, in conjunction to the song's lines. The video ends with Gomez taking a quick bow while still holding her microphone.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:4194f40928108db76842890a33273fe68b97451a","amp;dn":"Selena+Gomez+%26+The+Scene+-+Falling+Down","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4194f40928108db76842890a33273fe68b97451a","infoHashBuffer":{"type":"Buffer","data":[65,148,244,9,40,16,141,183,104,66,137,10,51,39,63,230,139,151,69,26]},"announce":[],"urlList":[]}}