{"title":"Magic Music Editor v8.5.1.2200 Incl serial","uid":5096141,"size":19815038,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:41dd4d375a108ed6b74a711c468a65939b62074f&amp;dn=Magic+Music+Editor+v8.5.1.2200+Incl+serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ProDvDRipper","files":2,"time":1253585125,"description":"record your own music, voice or other sounds, import and export lots of audio files\nYou can use Magic Music Editor to record your own music, voice or other sounds, import and export lots of audio files formats, including Windows PCM (WAV), MP3, Ogg Vorbis, WMA 9 and AIFF, play it, mix it, edit audio files visually using Cut, Copy, Paste and applying more than 20 effects and filters, including: Cut, Paste, Move, Delete, Fadein/Out, Crossfade, Vibrato, Delay, Normalize, Fade, Flanger, Amplify, Invert, Insert Silence, and more.\n\nThis new editor not only can help you display a waveform image of an audio file, filter, apply various audio effects, format conversion but also can help you synthesize speech, extract CD track, do batch converter and burn new CD. For newbie, more humanistic settings are set up, and then newbie can deal with the multifunctional editor in few steps.\n\nThe following audio formats are supported:\n* Uncompressed WAV (PCM);\n* Compressed WAV (ADPCM, A-LAW, U-LAW, DSP, GSM and others);\n* MP3 (MPEG Layer-3), MP2(MPEG Layer-2);\n* Ogg (Ogg Vorbis);\n* WMA (Windows Media Audio);\n* CDA (Audio CD Tracks);\n* AVI (Audio Stream);\n* AIFF (Apple);\n* AU (UNIX);\n* G.721, G.723, G.726;\n* VOX (Dialogic ADPCM);\n* RAW;\n* MPC (MusicPack).\n\nOpen, create, and save audio files in any of the supported formats (can also save any portion of a loaded file to disk as a new file);\n* Display audio data waveform (Zoom Full, Zoom In, Zoom Out, Zoom Vertical);\n* Record audio data from a microphone or any other available input device (You can record audio from DVD / VCD / CD Player, Tapes\n* and LP's, MP3 Player, RealPlayer, Windows Media Player, Web Page, Internet Conversation, Internet News, Internet Radio Station and more);\n* Edit audio files visually (Cut, Copy, Delete Selection, Delete Silence, Paste, Paste From File, Mix, Mix From File);\n* Apply various effects (Amplify, Compressor, Delay, Equalize, Fade In and Fade Out, Flanger, Invert, Normalize, Phaser, Reverb, Reverse, Silence, Shrink, Stretch, Vibrato, etc.);\n* Apply different filters to any selected portion of audio files (BandPass Filter, FFT Filter, HighPass Filter, HighShelf Filter,LowPass Filter, LowShelf Filter, Notch Filter);\n* Convert an audio file from one format to another;\n* Use marker to locate the selected part or special part of the audio data;\n* Add and edit extra information to your audio files (Album, Artist, Comments, Copyright, Genre, Title, Year).\n\n* Processor type: Pentium\n* Processor speed: 233 MHz\n* Memory (Cache): 64 MB RAM Minimum\n* Hard disk: IDE\n* Graphics: 256 colors @ 800 x 600\n* Soundcard: MME-compatible Soundcard\n\n\n\nUnpack with any archiver\nInstall setup.exe\nRun the application and go to  -&gt;Enter Licence Code...\nUse one of serials provided","torrent":{"xt":"urn:btih:41dd4d375a108ed6b74a711c468a65939b62074f","amp;dn":"Magic+Music+Editor+v8.5.1.2200+Incl+serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41dd4d375a108ed6b74a711c468a65939b62074f","infoHashBuffer":{"type":"Buffer","data":[65,221,77,55,90,16,142,214,183,74,113,28,70,138,101,147,155,98,7,79]},"announce":[],"urlList":[]}}