{"title":"Hacksaw - Rise and Disobey (EP) (2009)","uid":5064654,"size":39222522,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4207d711df516c35e1ff87b9bd8c755c6b116bb7&amp;dn=Hacksaw+-+Rise+and+Disobey+%28EP%29+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Baphom3t","files":6,"time":1250867130,"description":"Born in GuimarÃƒÂ£es (Portugal), Hacksaw was formed late 2005. Driven by their huge passion for bands like Cannibal Corpse, Vader, Decapitated, Suffocation, Behemoth, and more, it's shape was the result of the union between LuÃƒÂ­s Lisboa (Vocals. Ex-Winter Cry, ex-Amorak, ex-Bloody Tears, Stuprum Dei, ex-Black Tyrant, Infernal Kingdom), LuÃƒÂ­s Barroso (Drums. ex-Bloody Tears, Daemogorgon, Koltum, Infernal Kingdom) and Toni (Guitars). After a short search seeking to fill the bass spot, Susana (ex-Viingrid, Final Mercy, D.M.G, Unfleshed) entered and the quartet was complete. \n\nOne year later, the band officialized it's activity by home-recording their first track, &quot;B.T.K.&quot;, as an X-Mas Promotrack (available through MySpace download). In 2007, they participated in the first &quot;Vimaranes Metallvm&quot; compilation, and also, on the 10th of November of the same year, and after almost two years of intense work, the band had it's live debut at the first Vimaranes Metallvm Fest. The machine was then fully operational. In January 2008, Hacksaw entered Grave Studios and recorded their debut EP, named &quot;Rise and Disobey&quot;, and is now looking for a label for a possible american/european release, and booking several gigs through the country and outside!\n\n\nCurrent line-up \nLuis Lisboa - Vocals (Black Tyrant, Stuprum Dei, Bloody Tears (Prt), Amorak, Seraphitus, Winter Cry, Nox Obscura, Infernal Kingdom (Prt))\nToni - Guitar\nSusana - Bass (Viingrid) \nBarroso - Drums (Daemogorgon, Bloody Tears (Prt), Koltum) \n\nReview:\nIf you like some proper old school death metal yet with a disturbing edge of Horror, Hacksaw is definitely the thing you should get hold of. It's riveting and breathtaking....and profoundly....DEATH METAL! Just taste such songs as &quot;Bloodswap&quot; which has some rhythms that could remind you some good old Asphyx....but with Kam Lee on vocals instead...proper pounding, hammering rhythmics, crushing guitar riffs and well-inspired lyrics. &quot;BTK&quot; is standing for a classic about Serial Killers....and it means &quot;Bind, Torture, Kill&quot;....when you hear it, there's no escape! &quot;Meat To Grind&quot; will ravish all the good old fans of Autopsy and Cannibal Corpse with a real &quot;festin&quot; as you can see the vultures circling around from miles away....and finally &quot;In Corpus&quot; is the corollary of te &quot;Rise and Disobey&quot; concept. All i can tell you, i saw this band live this year at SWR Barroselas Metal fest and...i got blown away. Make sure to get hold of this album...and if you are on vacations in Portugal....\n\nReviewed by Christophe Szpajdel\n\nGenre = Death Metal\nFormat = Mp3\nBit Rate = Vbr\n\nTrack Listing\n1. Rise and Disobey (Intro) \n2. B.T.K.  \n3. Blood Swap \n4. Meat to Grind   \n5. In Corpus","torrent":{"xt":"urn:btih:4207d711df516c35e1ff87b9bd8c755c6b116bb7","amp;dn":"Hacksaw+-+Rise+and+Disobey+%28EP%29+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4207d711df516c35e1ff87b9bd8c755c6b116bb7","infoHashBuffer":{"type":"Buffer","data":[66,7,215,17,223,81,108,53,225,255,135,185,189,140,117,92,107,17,107,183]},"announce":[],"urlList":[]}}