{"title":"(PSP DEMO)Dissidia: Final Fantasy [ResourceRG Games by KloWn]","uid":5022721,"size":130641050,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:427bc909c136628848bfd4b8b749715e886be1b9&amp;dn=%28PSP+DEMO%29Dissidia%3A+Final+Fantasy+%5BResourceRG+Games+by+KloWn%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"toxicjuggalo","files":2,"time":1248546489,"description":"Demo Release Date: 07/23/09\nFull Game Release Date:08/25/09\n\nDISSIDIA - FINAL FANTASY(DEMO):\n\nCosmos, the goddess of harmony. Chaos, the god of discord. Reigning from distant realms, the two gods had gathered warriors from all lands to lead them in savage war. Cosmos and Chaos were of equal strength. It was believed the conflict would last forever. However, the balance is now broken. Those who answered Chaos's call created an inexhaustible force. And under vicious attack without relent, the warriors fighting for Cosmos started to fall one by one. The conflict that has continued for eons is now about to end in Chaos's favor. The world has been torn asunder, sinking into a vortex of disorder. As for the few surviving warriors. their fates have yet to be determined.\n\nCelebrating 20 years of the renowned franchise, Dissidia Final Fantasy brings together the largest collection of Final Fantasy characters ever in a fighting-styled game where players can choose their allegiance between good and evil.\n\nHave you been looking for that classic PSX game but just can't seem to find it anywhere? How about those &quot;rare&quot; titles that were only released in certain regions? Better yet, would you like to be able to have those games playable on your PSP so you can play them anywhere you want? Want to get those conversions directly from the source instead of through &quot;unsafe&quot; torrent browsers? Come and request them at\n\n                         www.reputation-resource.com.\n    \n","torrent":{"xt":"urn:btih:427bc909c136628848bfd4b8b749715e886be1b9","amp;dn":"%28PSP+DEMO%29Dissidia%3A+Final+Fantasy+%5BResourceRG+Games+by+KloWn%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"427bc909c136628848bfd4b8b749715e886be1b9","infoHashBuffer":{"type":"Buffer","data":[66,123,201,9,193,54,98,136,72,191,212,184,183,73,113,94,136,107,225,185]},"announce":[],"urlList":[]}}