{"title":"Gloriana - The Way It Goes","uid":5097354,"size":119816196,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:42d97ff0a8ce77877baf9a862815732d3ff38108&amp;dn=Gloriana+-+The+Way+It+Goes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1253690595,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nGloriana is the self-titled debut album of the American country music group Gloriana. It was released on August 4, 2009 via Emblem Music Group, with Warner Bros. Records serving as distributor. The album debuted at position number 3 on US Billboard 200, and number 2 on Billboard Country Albums. The lead-off single, &quot;Wild at Heart&quot;, is a Top 20 hit on the U.S. Billboard Hot Country Songs chart. &quot;How Far Do You Wanna Go?&quot; will be released as the album's second single.\n\nSeveral of the album's tracks were co-written by Emblem Music Group owner Matt Serletic, who also produced the album. Among his credits are the album's first two singles, &quot;Wild at Heart&quot; and &quot;How Far Do You Wanna Go?&quot;. He co-wrote the former with Josh Kear and former Epic Records artist Stephanie Bentley, and the latter with Jeffrey Steele and former Western Flyer member Danny Myrick.\n\nGloriana is an American country music group founded in 2008. It is composed of brothers Tom Gossin and Mike Gossin (vocals, guitar), as well as Rachel Reinert (vocals, tambourine) and Cheyenne Kimball (vocals, mandolin). Before the band's foundation, Kimball was the 2002 winner of the competition America's Most Talented Kid and a solo artist on Epic Records. Gloriana released its debut single &quot;Wild at Heart&quot; in February 2009, which has become a Top 20 hit on the U.S. Billboard Hot Country Songs chart. The group's self titled debut album, Gloriana, was released on August 4th, 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:42d97ff0a8ce77877baf9a862815732d3ff38108","amp;dn":"Gloriana+-+The+Way+It+Goes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42d97ff0a8ce77877baf9a862815732d3ff38108","infoHashBuffer":{"type":"Buffer","data":[66,217,127,240,168,206,119,135,123,175,154,134,40,21,115,45,63,243,129,8]},"announce":[],"urlList":[]}}