{"title":"Insofta 3D Text Commander 2.5s","uid":5095394,"size":13577093,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:43841e3f7fdc303cebaea849769404d1b961f133&amp;dn=Insofta+3D+Text+Commander+2.5s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zurera","files":1,"time":1253520218,"description":"Insofta 3DText Commander 2.5 convierte cualquier mensaje de texto sin formato en un texto 3D cautivante, que le permite crear sus propios logotipos de texto en 3D, banners, mensajes y guardarlos en tu computadora para usarlo en sus pÃƒÂ¡ginas web, documentos y presentaciones.\n\nDÃƒÂ©le a su texto en 3D una apariencia perfecta. Usted puede elegir entre una variedad de plantillas profesionales y aÃƒÂ±adir sus propias imÃƒÂ¡genes y texto. Elija un tipo de letra (todas las fuentes del sistema se puede utilizar), colores que, el tamaÃƒÂ±o, agregar transparencia.\n\nTambien puedes darle movimiento al texto 3D y grabar la animaciÃƒÂ³n extensiones SWF, GIF y AVI. Con esto consigues mayores alcances de mejorar tu trabajo.\n\nInsofta 3DText Commander 2.5 te permite ver cÃƒÂ³mo va quedando el proyecto ya que cuenta con un visor de vista previa el cual te permite ver en tiempo real cÃƒÂ³mo esta quedando el proyecto.\n\n* Captar la atenciÃƒÂ³n del lector con un banner animado en 3D.\n* Disfruta de la biblioteca de la textura de cortesÃƒÂ­a.\n* Forma de su texto a su gusto: introduce el texto de cualquier tamaÃƒÂ±o en uno, dos o mÃƒÂ¡s lÃƒÂ­neas, y el centro o alinear por la izquierda o hacia la margen derecha, elija el tipo de letra, tamaÃƒÂ±o y estilo.\n* Disfruta de la sencillez y la confianza: todas las operaciones se realizan en una sola pantalla, y el asistente con plantillas pre-hechas de peluche y texturas de la biblioteca no le dejarÃƒÂ¡ salirse del camino y se pierde en las profundidades de la aplicaciÃƒÂ³n.\n* Vista previa del final de texto en 3D en la ventana de tiempo real una vista previa, a su vez de ninguna otra manera alrededor simplemente arrastrando con el ratÃƒÂ³n.\n* Decora tu texto en 3D con sombras realistas en 3D y la reflexiÃƒÂ³n - moviendo la luz y jugando con su intensidad.\n* Tome su final contra la resoluciÃƒÂ³n-alias 3D-banner de texto de hasta 4000 por 4000 pixeles directamente a la editorial; saltar un sin nÃƒÂºmero de operaciones de conversiÃƒÂ³n, y guardarlo en el formato que necesite directamente.","torrent":{"xt":"urn:btih:43841e3f7fdc303cebaea849769404d1b961f133","amp;dn":"Insofta+3D+Text+Commander+2.5s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43841e3f7fdc303cebaea849769404d1b961f133","infoHashBuffer":{"type":"Buffer","data":[67,132,30,63,127,220,48,60,235,174,168,73,118,148,4,209,185,97,241,51]},"announce":[],"urlList":[]}}