{"title":"Lecture on Water Splitting Theory by Andrija Puharich","uid":5675909,"size":193308025,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:43a438541b565a32929c547ed050c9204962ac74&amp;dn=Lecture+on+Water+Splitting+Theory+by+Andrija+Puharich&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":null,"files":10,"time":1278521912,"description":"Lecture on Water Splitting Theory by Andrija Puharich\n(Free Energy: Running Your Car on Water)\n\n\n\n\nproudly brought to you by\n\n                      oooo                  ooooooooooo ooooooooooo ooooooooooo \noo oooooo  oooo   oooo 888ooooo     ooooooo 888    888  888    888  888    888  \n 888    888 888   888  888    888   ooooo888      888         888         888   \n 888         888 888   888    888 888    888     888         888         888    \no888o          8888   o888ooo88    88ooo88 8o   888         888         888     \n            o8o888                                                              \n\n\n\nVideos:\n\nIt is hardly necessary to weigh the value of the world energy bank account for any sophisticated person, these days. It is grim. The oil reserves will dwindle away in a score of years or so, and the coal reserves will be gone in some twelve score years. This is not to say that the outlook is hopeless. There is an abundance of alternative energy sources, but the economics of development and exploitation present an enormous short term strain on the world political and banking resources. Visionary scientists tell us that the ideal fuel in the future will be as cheap as water, that it will be non toxic both in its short term, and in its long term, effects, that it will be renewable in that it can be used over and over again, that it will be safe to handle, and present minimal storage and transportation problems and costs. And finally that it will be universally available anywhere on earth. What is this magical fuel, and why is it not being used? The fuel is water. It can be used in its fresh water form. It can be used in its salt water form. It can be used in its brackish form. It can be used in its snow and ice form. When such water is decomposed by electrolytic fission into hydrogen and oxygen gases, it becomes a high energy fuel with three times the energy output which is available from an equivalent weight of high grade gasoline.\n\nIn this lecture Puharich describes his (patented) method for splitting water into hydrogen and oxygen - note the circuit from the secondary side of the transformer is identical to Meyer's. Indicating Meyer may have used Puharich's research as a jumping off point. Both are great men and both stand in their own right. In the beginning this lecture seems quite boring but don't be fooled, it's getting more interesting after a while. Puharich, a mixture between Nikola Tesla and Albert Einstein, is one of the world's great geniuses. He may not be a great lecturer though. There is a peculiar black-out in part 3.\n\n\n5 mp4 files\nAAC, Stereo (L R), 44.100 kHz\nH.264, 480 x 360, Millions\n569.54 kbits/s\napprox. 46 min\n\n\nText Files:\n\nDr. Andrija Puharich reportedly drove his motor home for hundreds of thousands of miles around North America in the 1970s using only water as fuel. At a mountain pass in Mexico, he collected snow for water. Here is the only article he wrote on the subject, plus his patent: Cutting The Gordian Knot of the Great Energy Bind by Andrija Puharich.\n\n\n1 lecture paper plus patent\n2 Puharich patents\n1 Meyer patent\n4 pdf files\n","torrent":{"xt":"urn:btih:43a438541b565a32929c547ed050c9204962ac74","amp;dn":"Lecture+on+Water+Splitting+Theory+by+Andrija+Puharich","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43a438541b565a32929c547ed050c9204962ac74","infoHashBuffer":{"type":"Buffer","data":[67,164,56,84,27,86,90,50,146,156,84,126,208,80,201,32,73,98,172,116]},"announce":[],"urlList":[]}}