{"title":"Bob Wiseman -Six Albums-(.mp3.version).Bark_Meow","uid":5066800,"size":291991767,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4433672d9c321ea76534306062ddfe714519a93f&amp;dn=Bob+Wiseman+-Six+Albums-%28.mp3.version%29.Bark_Meow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Bark_Meow","files":123,"time":1251052174,"description":"Bob Wiseman -- producer, folk songwriter, guitar-pop singer, and improvisational jazz pianist -- is as difficult to pin down as he is prolific. Having played keyboards for Canadian country blues-tinged rock band Blue Rodeo, Wiseman has dallied in everything from avant-garde to political pop since he left for a solo career. Wiseman's first solo release, Hits of the 60's and 70's, (independent) is a spirited showcase for &quot;prepared piano&quot; (a term referring to altering the piano's sound by slipping paper, coins or vegetables between the strings). His subsequent record, Bob Wiseman Sings Wrench Tuttle: In Her Dreams (1989, Risque Disque/ Atlantic) is a more accessible work, featuring mostly simple blues/ pop melodies sparsely laid down by piano or guitar, and accompanied by Wiseman's trademark yowl.\n\nWhich showcased his growing interest in sound manipulation during production (ie. loops, layering electronic sounds) and an emphasis on discordant, guitar-based rock. His latest record, More Work Songs from the Planet of the Apes (1997, GFC) is a continuation of his work on Accidentally Acquired Beliefs, yet more distorted (on vocals and backing music) and simple (in terms of melody). Bob Wiseman is a gifted piano player and a highly individualistic singer-songwriter. His contributions to the world of folk, improvisational piano and pop are boundless, and his work is always liable to provoke and inspire.","torrent":{"xt":"urn:btih:4433672d9c321ea76534306062ddfe714519a93f","amp;dn":"Bob+Wiseman+-Six+Albums-%28.mp3.version%29.Bark_Meow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4433672d9c321ea76534306062ddfe714519a93f","infoHashBuffer":{"type":"Buffer","data":[68,51,103,45,156,50,30,167,101,52,48,96,98,221,254,113,69,25,169,63]},"announce":[],"urlList":[]}}