{"title":"Torrent Search 2.2.0.9","uid":5095358,"size":3030126,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:450f8a039a0c7939932d2fd7570c94d8cf19b0f2&amp;dn=Torrent+Search+2.2.0.9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"AdamWesttie","files":5,"time":1253514426,"description":"Torrent Search 2.2.0.9 byis a torrent search toolbar for Firefox, Internet Explorer and Mac Safari, which enables users to search over 180 top torrent sites and trackers from their Firefox browser the same way they used to search usingform. It allows users to search a single site, search all sites on one page, or open the sites in Firefox tabs.A lot of accessible tools have been added to the Toolbar to make it easy to find your torrent like 'keyword highlighter', 'select toggle' to toggle between search engines by category, and 'toggle by first letter' to easily find the search engine you need.\n\n* Resize search area for to save more space.\n* Holding CRTL key searches the remembered last searched single site.\n* More Options including search in tabs or frames, load all or one by one and the number of pages to show every search.\n* Search history for all searched keywords with optional auto-completion.\n* Highlight searched terms on the page button.\n* Search words button to find single word on the result page.\n* Context menu search option for the selected text on the page.\n* Languages available : English, Arabic, German, Spanish, Estonian, Finnish, French, Croatian, Italian, Dutch, Polish, Portuguese, Slovak, Chinese.\n\n*********Installation********\n\nDouble click PlentyofTorrents.exe to install for Internet Explorer\n\nTo install for firefox drag plentyoftorrents.xpi into any open Firefox window and follow the instructions.\n\nIf you have Safari on a Mac you can use PlentyofTorrents.zip\n\nTo switch between different torrent sites click the logo in the search form and a drop down list of torrent\n\nsites will appear.","torrent":{"xt":"urn:btih:450f8a039a0c7939932d2fd7570c94d8cf19b0f2","amp;dn":"Torrent+Search+2.2.0.9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"450f8a039a0c7939932d2fd7570c94d8cf19b0f2","infoHashBuffer":{"type":"Buffer","data":[69,15,138,3,154,12,121,57,147,45,47,215,87,12,148,216,207,25,176,242]},"announce":[],"urlList":[]}}