{"title":"28 weeks later 2007 english optional dutch subs XVID -DTXP-","uid":5113346,"size":735189049,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:45d28a373e81abf06071f5e3aa815c9f8950ec19&amp;dn=28+weeks+later+2007+english+optional+dutch+subs+XVID+-DTXP-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DTXP","files":2,"time":1254932400,"description":"Enjoy! spoken language is english and optional there are dutch subtitles in srt file format.\n\nIn the country nearby London, Don, his wife Alice and a few survivors live hidden in a farmhouse. When infected people break in the house, Dan panics and does not help his wife to escape, running away and leaving Alice trapped inside the room. Twenty eight weeks after the outbreak that annihilated the population of Great Britain, London is considered safe and the British survivors return under the coordination of the American Army, that keeps the city under permanent surveillance. The teenager Tammy and her younger brother Andy travel back from Spain to live with their father Don in London. They miss their mother and decide to escape to their old house to retrieve pictures and some other personal belongings. However, they find Alice surprisingly alive and the Army brings her to the base. After some blood test, the biologist Scarlet discovers that Alice is a carrier of the lethal virus and somehow has immunity to it. Meanwhile, Don sneaks through the facility to say how sorry he is to Alice, who forgives him. When he kisses her, he is immediately contaminated, spreading a new epidemic.  Written by Claudio Carvalho, Rio de Janeiro, Brazil\n\n28 Weeks Later picks up six months after the Rage Virus has decimated the city of London. The US Army has resorted order and is repopulating the quarantined city, when a carrier of the Rage Virus enters London and unknowingly re-ignites the spread of the deadly infection and the nightmare begins... again. Written by Anonymous\n\nThe film starts six months after the Rage virus has spread throughout the city of London. The United States Army has restored order and is repopulating the quarantined city, when a carrier of the Rage virus enters London and unknowingly re-ignites the spread of the deadly infection, wreaking havoc on the entire population. Written by thegiantcookie\n\nSeven months after the rage virus has annihilated Great Britiain, the US army declares that the war against infection has been won, and that the reconstruction of the country can begin. In the first wave of returning refugees, a family is reunited--but one of them unwillingly carries a terrible secret. The virus is not yet dead, and this time, it is more dangerous than ever Written by fear of sleep ","torrent":{"xt":"urn:btih:45d28a373e81abf06071f5e3aa815c9f8950ec19","amp;dn":"28+weeks+later+2007+english+optional+dutch+subs+XVID+-DTXP-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45d28a373e81abf06071f5e3aa815c9f8950ec19","infoHashBuffer":{"type":"Buffer","data":[69,210,138,55,62,129,171,240,96,113,245,227,170,129,92,159,137,80,236,25]},"announce":[],"urlList":[]}}