{"title":"Jason DeRulo - Whatcha Say [HQ] [balleron24z]","uid":5126490,"size":104622080,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:46a8fb0480f66f429a3f9f2935bddb569623e519&amp;dn=Jason+DeRulo+-+Whatcha+Say+%5BHQ%5D+%5Bballeron24z%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"balleron24z","files":-1,"time":1255651108,"description":"Hello again.  So yea, first let me start by saying that you assholes aren't nice enough to just say thanks for the upload or appreciate your work.  Instead you go and bitch about me having a watermark on my video....or rather a logo. A fucking logo, whoopteedoo.  MTV DOES THAT SHIT TOO YOU GONNA SUE EM?  NOPE  Go suck a fucking dick seriously.  Its a video.  Want a better version?  GO GET IT YOUR DAMN SELF!!!!\n\nThis is the HQ version of Jason DeRulo's &quot;Whatcha Say&quot; video, just released today.  It aired on MTV today as a World Premier.  They had it on their site as well, so I snatched it for your viewing pleasure.  This is a really simple video, but thats doesn't make it bad at all.  Jason did a very good job with playing his part in the video, showing emotion of the song, and a little dancing.  He is gonna blow up big if he can produce songs like this one. \n\nCodec for video is DivX @ 3589kbps Reso: 692x388 and codec for audio is MP3 @ 192kbps 48000khz.  I initially captured the video with no audio (stupid Vista stereo mix lol) but that was good because it uses more cpu to capture audio in the process, resulting in jittery video capture.  I then used VirtualDubMod to add the MP3 stream to the file of the audio from the actual album, and saved the AVI.  I re-processed the video with VirtualDubMod to reduce the framerate to 29.97fps, as when I captured, I recorded at 200fps so if there was a frameskip, it would be able to capture the lost frame.  Hope you enjoy the video.  If you like this release, please leave comments and some positive feedback. \n\nThumbnails of actual video: http://bayimg.com/iaEeDAacI    So you can see what you are downloading lol.","torrent":{"xt":"urn:btih:46a8fb0480f66f429a3f9f2935bddb569623e519","amp;dn":"Jason+DeRulo+-+Whatcha+Say+%5BHQ%5D+%5Bballeron24z%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46a8fb0480f66f429a3f9f2935bddb569623e519","infoHashBuffer":{"type":"Buffer","data":[70,168,251,4,128,246,111,66,154,63,159,41,53,189,219,86,150,35,229,25]},"announce":[],"urlList":[]}}