{"title":"The Bonfire of the Vanities Dvdrip H264 Bookerdog.mp4","uid":5028437,"size":978326759,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:46adae3b7e6aba4a0d77c1dc3c3676f7dac74467&amp;dn=The+Bonfire+of+the+Vanities+Dvdrip+H264+Bookerdog.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bookerdog","files":-1,"time":1248803909,"description":"Category\tComedies, Dramas, Race Relations, Injustice, Law/Lawyers\nStarring\tTom Hanks, Morgan Freeman, Bruce Willis, F. Murray Abraham, Melanie Griffith, Saul Rubinek, Kim Cattrall, Clifton James, Kirsten Dunst, Kevin Dunn, Donald Moffat, Kurt Fuller, Alan King, Louis Giambalvo, Marjorie Monaghan, Barton Heyman, Adam LeFevre, Emmanuel Xuereb\nDirector\tBrian De Palma\nComposer\tDave Grusin\nCostume Designer\tAnn Roth\nDirector of Photography\tVilmos Zsigmond\nProducer\tBrian De Palma\nProduction Designer\tRichard Sylbert\nList all 25 stars\nStandard Screen; Soundtrack English; Soundtrack French; English Subtitles\nA super-successful Wall Street type and his mistress are involved in a hit-and-run accident. A cast of colorful characters, particularly a down-on-his-luck journalist, sees this couple's misfortune as a meal ticket in this rather savagely underrated film loosely based on Tom Wolf's best-seller.\n\nBrian De Palma (SCARFACE) directed this lavish adaptation of Tom Wolfe's best-selling satirical novel, featuring Tom Hanks, Melanie Griffith, and Bruce Willis. Hanks stars as Sherman McCoy, a distinctly 1980s brand of wealthy Wall Street wizard who takes a mighty fall from his glitzy lifestyle after he and his mistress (Griffith) put a Bronx youth into a coma via a hit-and-run accident. Alcoholic reporter Peter Fallow (Willis) sees the crime as an opportunity for big headlines, and soon Sherman is the target of every political and media group in the city, including an Al Sharpton-style black leader named Rev. Bacon (John Hancock) and a sleazy D.A. (F. Murray Abraham). SEX IN THE CITY babe Kim Catrall costars as Sherman's long-suffering wife, and Morgan Freeman is the judge who tries to reign in this three-ring media circus of a case. Like the decade it parodies, this film is proudly over the top in its lavishness. It's also filled to overflowing with inspired casting, wildly inventive comedy, and the sort of artistically ambitious tracking shots for which its director is renowned.","torrent":{"xt":"urn:btih:46adae3b7e6aba4a0d77c1dc3c3676f7dac74467","amp;dn":"The+Bonfire+of+the+Vanities+Dvdrip+H264+Bookerdog.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46adae3b7e6aba4a0d77c1dc3c3676f7dac74467","infoHashBuffer":{"type":"Buffer","data":[70,173,174,59,126,106,186,74,13,119,193,220,60,54,118,247,218,199,68,103]},"announce":[],"urlList":[]}}