{"title":"nine inch nails thepiratebay .torrent archive (zip)","uid":5043659,"size":16196656,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:46ddcd66d51743014d55e3e32c6013ee3f61104a&amp;dn=nine+inch+nails+thepiratebay+.torrent+archive+%28zip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nympholept","files":4,"time":1249512194,"description":"&quot;discography&quot; means a LIST of recordings, not a collection. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Discography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Discography&lt;/a&gt;\n\nFind more NIN downloads here:\nhttp ://bit . ly / ETSDownloads\nhttp ://media fire . com / nympholept\n\n(remove the spaces)\n-----------------\n\nThankyou c-174-48-43-94.hsd1.fl.comcast.net for still seeding!\n\n\nI'm sorry i had to torrent these as a zip file - I tried uploading a torrent of .torrents, but I couldn't.   (There is no password required for this zip file!)\n\nIf you're seeding ANY nin torrents from thepiratebay, mine or otherwise - please download these and add the new trackers to your torrent clients.  \n\n\nDue to the pending sale of thepiratebay, I've made a backup of all .torrent files found through a search for &quot;NIN&quot; and &quot;nine inch nails&quot;\nThis is an automatically generated archive of all &quot;nine inch nails&quot; .torrent files hosted on thepiratebay as of August 1st.\n\nI have added several public trackers to the .torrents to ensure they will continue to be tracked indefinitely.  Although a number of them are inactive already, and will become inactive in the future due to lack of seeders.\n\nI did not upload all of these torrents and did not download most of them, so i will be unable to seed them if the go dead.  Repeat: I downloaded only the .torrent files, NOT the data.  I'm concerned with making sure these are tracked so others can provide the data.\n\nThe titles are just the titles from thepiratebay, and the text file is the description from the torrent pages.  If the originally uploader didn't provide a meaningful description, then I don't know what it is either.\n\nI have sorted some of the torrents into folders - but I do not have time to check all of these torrents for useful content.  There's probably a lot of crap in here.\nIf someone would like to further sort these and trim the crap, feel free.  Please distribute these .torrent files far and wide - upload them to mininova/demonoid/whereever.\nLet's keep these torrents alive for as long as possible!\n\nsee http://www.echoingthesound.org/phpbbx/viewtopic.php?t=48198 for a bunch of legal NIN downloads and fan creations.","torrent":{"xt":"urn:btih:46ddcd66d51743014d55e3e32c6013ee3f61104a","amp;dn":"nine+inch+nails+thepiratebay+.torrent+archive+%28zip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46ddcd66d51743014d55e3e32c6013ee3f61104a","infoHashBuffer":{"type":"Buffer","data":[70,221,205,102,213,23,67,1,77,85,227,227,44,96,19,238,63,97,16,74]},"announce":[],"urlList":[]}}