{"title":"Black Mesa Source Trailer HD","uid":5087668,"size":46549308,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:48b144eaef39fd1fe12bef18cdf677835a605229&amp;dn=Black+Mesa+Source+Trailer+HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BigDaddyV1","files":1,"time":1252853771,"description":"Black Mesa Source Trailer HD\n\n\nthe game will release at later 2009 !!!\n\n\nAbout\n\n\nBlack Mesa (formerly Black Mesa: Source) is a Half-Life 2 total conversion remaking VALVe Software's award-winning PC game, Half-Life. Utilizing the Source engine, Black Mesa will reintroduce the player as Doctor Gordon Freeman, along with the original cast of memorable characters and environments seen in Half-Life. Black Mesa was built and founded on the basis that Half-Life: Source was inadequate as the Source engine port of Half-Life, regardless of the intentions of VALVe Software. As such, Black Mesa was founded to fully reconstruct the Half-Life universe utilizing Source to its fullest potential in terms of art detail, level sizes and code features. This total conversion will not require Half-Life: Source to play - only a copy of any Source Engine game installed on Steam.\n\n\nThe Environment\n\n\nBlack Mesa is set in and around the Black Mesa Research Facility as depicted in the original Half-Life game. The research facility is a former Cold War missile complex based in New Mexico, and features a diverse array of locations ranging from abandoned rocket testing silos to modern administrative offices, from underground physics laboratories to a full-scale hydroelectric dam. The game continues beyond, into an inter-dimensional border world known as Xen. What will set Black Mesa apart from other Source engine modifications in development is the attention to environment detail. Levels will be faithful to the original Half-Life concept and built from scratch, yet will feature higher-resolution textures, detailed world models, and a higher quality of audio ambience courtesy of the Source engines soundscape system. The end goal of such attention to detail is an immersive single-player environment, which will engross the player in a story that is yet to be matched by any other first-person shooter.\n\n\nFeatures\n\n\nBlack Mesa has many features, several of which are still in planning or being tested. Below are a few of the larger and more distinctive features of Black Mesa:\n\n\nDetailed and interactive environments based on the original Half-Life game, including reconstructed multiplayer maps;\nSingle-player, co-operative and deathmatch modes planned;\nOriginal music score by Joel Nielsen;\nArtificial intelligence that will dynamically think, react and interact with and about their environment;\nNormal, specular and parallax mapping utilized on world surfaces and models where applicable;\nA priority on gameplay and immersion factors such as ambience, logical functionality and interactivity.\n\nGame Modes\n\n\nBlack Mesa will feature three game modes designed to provide a high replayability factor.\n\nSingle-player\n\nAssuming the role of Dr. Gordon Freeman you will experience an immersive, story-driven mode of play. A world where around every corner a new threat or situation presents itself, provoking thought and interaction between you and your world. Relying on more than just combat to survive, your wits and intelligence will become strong allies in your fight for survival. Environments will be interactive, rich with detail, fully ambient and NPC characters will react to these environments and your actions therein. A world driven by story, locations conquered by wit, enemies matched with firepower. Welcome to Black Mesa. Run, think, shoot, live, Source.\n\n\nCo-operative\n\nBlack Mesa co-op will allow players to not only recruit the assistance of security guards and scientists, but also that of your friends! Share the single-player experience by battling through Black Mesa together. Players will be able to wage battles, travel corridors and emerge victorious over the enemies and escape the confines of the Black Mesa Research Facility.\n\n\nDeathmatch\n\nThe adrenaline pumping, bullet dodging, rockets-flying, big-red-button riddled deathmatch is back in classic Half-Life style, featuring graphically enhanced multiplayer maps and the full lineup of weapons. You'll find yourself having more fun blowing away your friends than, well, anything.\n\n\nmore news at www.blackmesasource.com !!!!\n","torrent":{"xt":"urn:btih:48b144eaef39fd1fe12bef18cdf677835a605229","amp;dn":"Black+Mesa+Source+Trailer+HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48b144eaef39fd1fe12bef18cdf677835a605229","infoHashBuffer":{"type":"Buffer","data":[72,177,68,234,239,57,253,31,225,43,239,24,205,246,119,131,90,96,82,41]},"announce":[],"urlList":[]}}