{"title":"Millionaires - Just Got Paid, Let's Get Laid","uid":5082832,"size":117043204,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:48b780bf705221a0f107476beb7a996358f42b49&amp;dn=Millionaires+-+Just+Got+Paid%2C+Let%5C%27s+Get+Laid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1252479388,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nSome lyrics are censored in this video.\n\nMillionaires is a pop-electronic group consisting three girls from Los Angeles, California. The group gained huge popularity on MySpace and climbed the charts early on in their career. The group consists of sisters, Melissa Marie and Allison Green, and their best friend, Dani Artaud.The girls performed the theme songs for Teen Cribs and A Double Shot at Love on MTV.\n\nMillionaires started in August 2007, when Melissa Marie and Allison made a song on their new laptop with GarageBand. They named the song &quot;I Like Money&quot;, and decided they needed a name for themselves to make a MySpace profile for the song. Melissa Marie and Allison decided on Millionaires, to go with the name of the song. Soon after, Dani came in the mix, and they made their second song, &quot;Hoe Down.&quot;\nAfter a few months, they began to perform shows locally and traveled only small distances for shows. They got spots in music festivals such as Bamboozle Left 2008 and Audio Overload 2008. By July 2008, they were ready to tour and they went out on their first tour co-headlining with Breathe Carolina across the West coast. Later in July, they headlined the GET F$CKED UP tour.In July 2008, they performed on MTV's TRL as part of On The Radar, a segment where popular unsigned bands perform.The girls returned in January and February 2009 on their Just Got Paid, Let's Get Laid tour, which sold out every date.They made a short song titled &quot;Ooh Uh Huh&quot;, which became the theme song for MTV's reality show &quot;A Double Shot At Love&quot; with the Ikki Twins. Their song &quot;Hey Rich Boy&quot; was also used as the theme for MTV's Teen Cribs.\nTheir song Alcohol was also featured on the soundtrack for the third series of Skins.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:48b780bf705221a0f107476beb7a996358f42b49","amp;dn":"Millionaires+-+Just+Got+Paid%2C+Let%5C%27s+Get+Laid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48b780bf705221a0f107476beb7a996358f42b49","infoHashBuffer":{"type":"Buffer","data":[72,183,128,191,112,82,33,160,241,7,71,107,235,122,153,99,88,244,43,73]},"announce":[],"urlList":[]}}