{"title":"Jackass - The Lost Tapes for PSP","uid":5137155,"size":502191323,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:48ce7d500a8eef506675d7bf67a2c54be656c15b&amp;dn=Jackass+-+The+Lost+Tapes+for+PSP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BurnProcess","files":2,"time":1256581628,"description":"      Many things have gone missing in this world: Amelia Earhart, D.B. Cooper, the Olmec civilization, Jeff Tremaine's waistline, even the whole continent of Atlantis. Most important and culturally relevant, though, is a big mess of Jackass segments that had apparently slipped through a crack in Mianus and never found a home on any of the DVD releases for the classic MTV television series.\n\n      The &quot;Self Defense Test,&quot; &quot;Stun Collar,&quot; &quot;Unicycle Poo Barf,&quot; &quot;Fast Food Football,&quot; &quot;Roller Jump,&quot; and &quot;Satan vs. God&quot; (in its original long ass-kicking form!) are just some of the absurd gold that what was once lost but now is found, not to mention all the original show opens, credit montages, and a bunch of other bonus footage that was never shown on television - or wasn't allowed to be shown - featuring Johnny Knoxville, Bam Margera, Steve-O, Chris Pontius, Ryan Dunn, Preston Lacy, Wee-Man, Danger Ehren, and Dave England in their earliest years of basic cable fame and notoriety.\n\nMTV and Paramount Home Video have scrounged up loads of lost footage, and are preparing to bring you the October 13th DVD release of Jackass - The Lost Tapes. Besides the missing stunts and tricks, you'll also get such extras as the &quot;Hi, I'm Johnny Knoxville&quot; Commentary, Credit Montages and a JackassWorld featurette.","torrent":{"xt":"urn:btih:48ce7d500a8eef506675d7bf67a2c54be656c15b","amp;dn":"Jackass+-+The+Lost+Tapes+for+PSP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48ce7d500a8eef506675d7bf67a2c54be656c15b","infoHashBuffer":{"type":"Buffer","data":[72,206,125,80,10,142,239,80,102,117,215,191,103,162,197,75,230,86,193,91]},"announce":[],"urlList":[]}}