{"title":"Rockband.2.DLC.Hack.Wii.rar","uid":5559291,"size":225997,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:49f09d6c984036d97a1c7c30aca52ed978d21f21&amp;dn=Rockband.2.DLC.Hack.Wii.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"steviekeyz","files":1,"time":1273778089,"description":"This is the ROCK BAND 2 DLC hacks/cracks by Harry Ballsagna for the Wii. I take no credit and no responsibility for this if you brick your wii, I'm just sharing it as I know it works for myself and a lot of other people. \n\nSD card support works with this. Also if you use RawkSD with this, whenever you download/install a new song you will have to reinstall your custom songs.\n\nInstructions:\n\nWhen installing these wad files they are listed as \n\nsZxE.wad, where x is the generation of rockband DLC listing from A-D.\n\nas of 5/13/2010 it seems D is still the latest generation of DLC so all songs from that point still work fine and are downloable.\n\nNOTE:\n\nWhen installing these wads install them starting with A, then B, C, and D.\n\n1.) note the error you get when INSTALLING the WAD file for the first time!!!!!!!!!!!!!!\n2.) after you get that error UNINSTALL the WAD file. \n3.) then INSTALL it again, you should see a different Ret = ERROR.\n\nI believe -1 or -1024, -1022 something like that is the error you want to see... its been a while since I installed it so I'm not postive. But that 2nd error (which is different from the first ret error) means it installed correctly.\n\nAlso, one last note you need a fake signed IOS 37!!!! or else you will the see it all says PURCHASED like its working but it will not download and give you an error in rockband 2.\n\nIf you dont know how to do this:\ninstall DOP Mii and start with the first option and install the fake signed IOS 37 through that program. Now you should be able to download EVERY rockband 2 DLC song (provided that you have the space). \n\nand one last tidbit I do this on a real rockband 2 disc, So I dont know if theres anything special you have to do if you use uloader, neogamma, usbloader etc...\n\nAlso the cIOSx disc channel hack should work fine with this as well, although I suggest you not install any type of cIOSx disc channel hacks without BootMii and a proper backup done. and NEVER install/uninstall cIOSx custom IOS's while these IOS's are install, download a proper cIOS uninstaller you can find it with google.\n\nI'm not sure if this is on pirate bay already but I wanted to share this anyway.\nIf I left out any other instructions please do note it in the comments, THX!","torrent":{"xt":"urn:btih:49f09d6c984036d97a1c7c30aca52ed978d21f21","amp;dn":"Rockband.2.DLC.Hack.Wii.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49f09d6c984036d97a1c7c30aca52ed978d21f21","infoHashBuffer":{"type":"Buffer","data":[73,240,157,108,152,64,54,217,122,28,124,48,172,165,46,217,120,210,31,33]},"announce":[],"urlList":[]}}