{"title":"Alieni.In.Soffitta.2009.iTALiAN.LD.R5.XviD-SiLENT[UltimaFrontier","uid":5081208,"size":735619072,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4a074f2211007be410cc991187b4727e4df194e0&amp;dn=Alieni.In.Soffitta.2009.iTALiAN.LD.R5.XviD-SiLENT%5BUltimaFrontier&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"confe90","files":1,"time":1252318236,"description":"\n[center] \n\n[size=24pt][b][color=#ffff00]Aliens in the Attic[/color][/b][/size]\n\n\n\n[img]http://img156.imageshack.us/img156/3959/alieni1.jpg[/img]\n\n\n[b]Titolo originale: Aliens in the Attic\nNazione: U.S.A.\nAnno: 2009\nGenere: Avventura, Fantastico\nDurata: 92\nRegia: John Schultz\nProduzione: Josephson Entertainment, New Upstairs Productions, Twentieth Century-Fox Film Corporation, Upstairs Canada Productions[/b]\n\n\n\n[b][color=#00FF00]Ashley Tisdale, Robert Hoffman, Doris Roberts, Kevin Nealon, Tim Meadows, Andy Richter, Gillian Vigman, Austin Robert Butler, Ashley Boettcher[/color][/b]\n\n\n[b][font=Verdana][color=orange][b]Il mondo ÃƒÂ© minacciato dall'invasione di una razza aliena, che, con le loro armi che gli permettono di controllare la mente, hanno intenzione di controllare tutto il mondo. I piccoli Tom e Jake, insieme ad altri loro amici, scoprono che queste armi non hanno alcun effetto sui giovani come loro, ma solo sugli adulti. Capiranno, allora, che la salvezza del mondo e della specie umana sta tutta nelle loro mani, e si daranno da fare...[/b][/color][/font]\n\n\n[font=Verdana][color=Beige][b] Il cinema per ragazzi riprende in genere in maniera molto fedele un presupposto che affonda le proprie radici nella fiaba. La separazione, cioÃƒÂ¨, a comparti stagni fra adulti e ragazzi; in genere solo questi ultimi sono in grado di riconoscere alcune minacce che risultano del tutto invisibili alle loro controparti troppo cresciute. Questa premessa ÃƒÂ¨ fondamentale per ogni tipo di narrazione destinata agli adolescenti, perchÃƒÂ© rende i piccoli protagonisti gli unici in grado di combattere ogni pericolo, sia soprannaturale che ultraterrestre.\n\nIn Alieni in soffitta, come del resto suggerisce il titolo, la minaccia viene dallo spazio, sotto forma di una piccola (in tutti i sensi) squadra di ricognizione proveniente da un'altro pianeta. Lo scopo di questa unitÃƒÂ  di soli quattro elementi ÃƒÂ¨, come di consueto, la conquista della nostra buona vecchia Terra tramite un'avanzata tecnologia che include strumenti di controllo mentale che, curiosamente, non ha effetto sugli adolescenti. Terreno di scontro ÃƒÂ¨ una villa in prossimitÃƒÂ  di un lago in cui si sono riunite due famiglie per rinsaldare i legami generazionali e di parentela. A questi si unisce un intruso: un belloccio che fa la corte alla piÃƒÂ¹ grandicella della famiglia, anche se non ÃƒÂ¨ cosÃƒÂ¬ giovane come dichiara di essere.\n\nAlieni in soffitta ÃƒÂ¨ un film fresco e divertente come raramente capita di vedere nel filone adolescenziale, spesso ricco di stereotipi o di incomprensibili &quot;chicche per cinefili&quot; destinate a non si sa bene chi. Dietro a una storia semplice, viene organizzata una specie di battaglia per la Terra in miniatura giocata interamente tra le pareti di una villa di campagna. Le scene d'azione si susseguono in maniera incalzante lasciando molto spazio all'umorismo (le sequenze in cui Ricky viene controllato mentalmente sono impagabili nella loro semplice comicitÃƒÂ  puramente fisica). Gli alieni sono di volta in volta teneri, imbranati, pericolosi e terribili, e questi cambiamenti permettono al film di esplorare registri linguistici differenti, fino all'inevitabile lieto fine (forse lievemente iperzuccherino). Le armi a disposizione dei giovani &quot;eroi&quot; attingono alla tradizione del videogioco, citato in maniera esplicita dal &quot;controller&quot; mentale e alla cultura pop di derivazione internettiana: le mentos nella cola usate come arma di distruzione ne sono un esempio fin troppo evidente. Quindi una pellicola che divertirÃƒÂ  i piÃƒÂ¹ giovani ma anche in grado di regalare momenti di schietto umorismo ai &quot;matusa&quot;.\n\nLa frase: &quot;Gli adulti hanno un cablaggio diverso: hanno il cervello vecchio e fritto da pessima musica anni '80!&quot;.\nMauro Corso\n\n","torrent":{"xt":"urn:btih:4a074f2211007be410cc991187b4727e4df194e0","amp;dn":"Alieni.In.Soffitta.2009.iTALiAN.LD.R5.XviD-SiLENT%5BUltimaFrontier","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a074f2211007be410cc991187b4727e4df194e0","infoHashBuffer":{"type":"Buffer","data":[74,7,79,34,17,0,123,228,16,204,153,17,135,180,114,126,77,241,148,224]},"announce":[],"urlList":[]}}