{"title":"BBC De ruimte - Space (2009) (Retail)  4 x DVD5","uid":5581717,"size":8942662970,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4a1d0ebd3e3cbad5242bfedab3e89bb0473355e8&amp;dn=BBC+De+ruimte+-+Space+%282009%29+%28Retail%29++4+x+DVD5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NLUPPER","files":-1,"time":1274563584,"description":"\nBBC De ruimte - Space (2009) (Retail) 4 x DVD\n\n\nGoogle translate\n\nDescription\n\nIf you look at the night sky, you see millions of light. You look at the entire universe.\nBut what does this universe, anyway? Let yourself be carried away on an ultimate travel in deep space, beyond the limits of your imagination.\n\nThis DVD contains six episodes:\n\n- Beginning of life: An investigation into the origins of life on earth. We are all aliens?\n\n- Danger from Space: Embark on a journey through space in search of cosmic killers, asteroids and comets that might threaten all life on earth.\n\n- Black holes: We investigate the most ominous and mysterious horrors of space that constantly reappear: the black holes.\nWhere are they and are they a threat to the earth?\n\n- Is there life beyond Earth?: Is there anyone else?\nWe will search for extraterrestrial life on distant planets, cosmic ocean diving in to answer to the question whether we are the only living beings in the universe.\n\n- New worlds: Take a peek into the future when humanity must flee to other worlds by the impending demise of our Sun\n\n- Travel to the stars: Will we miraculous phenomena in space ever with their own eyes?\nWe explore the technologies that one day could cause our children to travel the stars.\n\n\n\nBeschrijving\n\nAls je naar de nachtelijke hemel kijkt, zie je miljoenen lichtpuntjes. Je kijkt naar het hele universum. \nMaar waar bestaat dit universum eigenlijk uit? Laat je meevoeren op een ultieme reis diep in de ruimte, voorbij de grenzen van je eigen voorstellingsvermogen.\n\nDeze dvd bevat de volgende zes afleveringen:\n\n- Begin van het leven: Een onderzoek naar de oorsprong van het leven op aarde. Zijn we allemaal aliens?\n\n- Gevaren uit de ruimte: Ga mee op een reis door de ruimte op zoek naar kosmische killers, asteroÃƒÂ¯den en kometen, die een gevaar kunnen vormen voor al het leven op aarde.\n\n- Zwarte gaten: We onderzoeken de meest onheilspellende en raadselachtige verschrikkingen van de ruimte die telkens weer opnieuw opduiken: de zwarte gaten. \nWaar zijn ze en vormen ze een bedreiging voor de aarde?\n\n- Is er leven buiten de aarde?: Is er niemand anders? \nWe gaan op zoek naar buitenaards leven op verre planeten, duiken in kosmische oceanen om antwoord te krijgen op de vraag of wij de enige levende wezens zijn in het universum.\n\n- Nieuwe werelden: Neem een kijkje in de toekomst als de mensheid naar andere werelden moet vluchten door de naderende ondergang van onze zon.\n\n- Reis naar de sterren: Zullen wij de wonderbaarlijke verschijnselen in de ruimte ooit met eigen ogen aanschouwen? \nWe onderzoeken de technologieÃƒÂ«n die op een dag ervoor kunnen zorgen dat onze kinderen naar de sterren reizen. \n\n\nDVD INFO\n\nSource Retail\nFormat: dvd5, 4 disks, Playtime 190:00 min\nCovers: Yes 4xDVD 1, 2, 3, 4\nVideo: \t16:9\nExtra's: Yes\nAudio: \tEnglish 2.0, Dolby Stereo\nMenu: Yes\nSubs: Dutch (select)\nRelease date: 1 mei 2009 \n\nKan geen MovieMeter of IMDB link vinden.\nWil je toch wat meer info Google vind het wel voor je.\n","torrent":{"xt":"urn:btih:4a1d0ebd3e3cbad5242bfedab3e89bb0473355e8","amp;dn":"BBC+De+ruimte+-+Space+%282009%29+%28Retail%29++4+x+DVD5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a1d0ebd3e3cbad5242bfedab3e89bb0473355e8","infoHashBuffer":{"type":"Buffer","data":[74,29,14,189,62,60,186,213,36,43,254,218,179,232,155,176,71,51,85,232]},"announce":[],"urlList":[]}}