{"title":"gladiador","uid":5024663,"size":657329848,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4a4988b98dcff8db0d7f19585b52420db88dfabb&amp;dn=gladiador&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"soiiluis","files":1,"time":1248634625,"description":" &lt;a href=&quot;http://img411.imageshack.us/img411/2963/img00293.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img411.imageshack.us/img411/2963/img00293.jpg&lt;/a&gt;\n\nTÃƒÂ­tulo original:Gladiator\nAÃƒÂ±o:2000\nDuraciÃƒÂ³n:154 min.\nNacionalidad:EE.UU.\nGÃƒÂ©nero:HistÃƒÂ³rica COLOR\n\n  \nReparto:\nRussell Crowe\n\tMaximus\nJoaquin Phoenix\n\tCommodus\nRichard Harris\n\tMarcus Aurelius\nDjimon Hounsou\n\tJuba\nDerek Jocobi\n\tGracchus\nOliver Reed\n\tProximo\nConnie Nielsen\n\tLucilla\n\nSinÃƒÂ³psis:\n\nEn el campo de batalla, el general romano Maximus (Russell Crowe) es el hombre de confianza del emperador Marcus Aurelius (Richard Harris). Pero su reinado acaba cuando su hijo CÃƒÂ³modus (Joaquin Phoenix) lo mata para subir al trono.\n\nEl joven e inestable emperador decide acabar tambiÃƒÂ©n con la vida de Maximus y de toda su familia porque les considera una amenaza para mantenerse en el trono de Roma. Pero sÃƒÂ³lo consigue acabar con su mujer y su hija. Vendido como esclavo, Maximus solo tiene una salida: convertirse en gladiador.\n\nDesde la arena del circo se alza como hÃƒÂ©roe del pueblo romano y ve mÃƒÂ¡s cercana la posibilidad de ejecutar su venganza contra CÃƒÂ³modus.\n\nComentario:\n\nEl director Ridley Scott vuelve a traernos las gloriosas batallas en la arena de los circos de la antigua Roma en una apasionante historia de coraje y venganza. Un gladiador romano se planta en el centro del gran Colosseum y alza su mirada hacia el Emperador, esperando su decisiÃƒÂ³n. El monarca, que tiene el poder de la vida o la muerte en su mano, extiende el pulgar con una expresiÃƒÂ³n implacable. Parece dispuesto a seÃƒÂ±alar al gladiador que mate a su derrotado rival. Esta escena, captada en el cuadro &quot;Pollice verso&quot; (&quot;Pulgares hacia abajo&quot;) por el pintor del siglo XIX Jean-Leon Gerome, fue la que disparÃƒÂ³ la imaginaciÃƒÂ³n del director Ridley Scott y le impulsÃƒÂ³ a dirigir el drama ÃƒÂ©pico &quot;Gladiador&quot;.\n\nLos productores Walter Parkes y Douglas Pick le ensenaron el cuadro a Scott aun antes de entregarle el guiÃƒÂ³n de la pelÃƒÂ­cula . Dice Scott: &quot;Walter puso una reproducciÃƒÂ³n del cuadro sobre mi mesa. Era una imagen que describÃƒÂ­a el imperio romano en toda su gloria y depravaciÃƒÂ³n. Fue en ese momento cuando me sentÃƒÂ­&quot; enganchado al proyecto&quot;.\n\nPese a su entusiasmo por el proyecto, Scott era consciente de que iba a aventurarse en un gÃƒÂ©nero cuya popularidad llevaba mucho tiempo sin ponerse a prueba. &quot;Hace ya 40 aÃƒÂ±os de Espartaco. Y Ben-Hur es mÃƒÂ¡s antigua todavÃƒÂ­a. Esas pelÃƒÂ­culas forman parte de mis recuerdos de infancia. Pero el alba de un nuevo milenio me parecÃƒÂ­a un buen momento para revisar lo que puede ser el perÃƒÂ­odo histÃƒÂ³rico mÃƒÂ¡s importante de los ÃƒÂºltimos dos mil aÃƒÂ±os: la cima y el comienzo de la decadencia del poder polÃƒÂ­tico y militar mÃƒÂ¡s grande que ha conocido el mundo&quot;.\n\nEra esencial encontrar al actor adecuado para encarnar a Maximus, el general degradado a gladiador cuya popularidad amenaza el poder del emperador. Todos pensaron en Russell Crowe. El director dice: &quot;Russell ha pasado de ser un hombre de mediana edad y barrigudo en &quot;El dilema&quot; a convertirse en todo un gladiador aquÃƒÂ­: no estÃƒÂ¡ nada mal. Eso quiere decir que es un verdadero actor. Tiene una habilidad asombrosa para interiorizar sus papeles y ademÃƒÂ¡s tiene una gran presencia fÃƒÂ­sica, lo que le convertÃƒÂ­a en el candidato ideal para el papel&quot;.","torrent":{"xt":"urn:btih:4a4988b98dcff8db0d7f19585b52420db88dfabb","amp;dn":"gladiador","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a4988b98dcff8db0d7f19585b52420db88dfabb","infoHashBuffer":{"type":"Buffer","data":[74,73,136,185,141,207,248,219,13,127,25,88,91,82,66,13,184,141,250,187]},"announce":[],"urlList":[]}}