{"title":"Beat This The Hits Of Rhythm King(mp3 320kbs) ICM369","uid":5135503,"size":177281143,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:4a8b94b7b44c91b65d8b13b4ba0dadbb9acc755a&amp;dn=Beat+This+The+Hits+Of+Rhythm+King%28mp3+320kbs%29+ICM369&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ICM369","files":25,"time":1256447788,"description":"Beat This The Hits Of Rhythm King(mp3 320kbs)ICM369\n\nCompilation of early releases on the Rhythm King label.  \n\n\nThe UK dance sounds of the late 1980s featured some great moments such as Baby Ford, \nTaffy and others all in this disc. Not extended version.\n\nCountry:UK\n\nReleased:1989\n\nGenre:Electronic, Hip Hop\n \nStyle:House, Hip Hop \n___________________________________________________________________________________\n\nRhythm King Records Ltd was an independent record label founded in the mid 1980's by Martin Heath, DJ Jay Strongman, and James Horrocks. Starting out as an offshoot of Daniel Miller 's critically acclaimed Mute Records Rhythm King's initial focus was dance music - specifically house music, acid house, acid jazz, sampling culture and hip hop/rap. Strongman's rap/funk off-shoot, Flame Records, signed proto-gangsta rapper Schoolly D and Chuck Brown &amp; The Soul Searchers amongst other.\nThe breakthrough was the single Rok Da House by The Beatmasters featuring The Cookie Crew. \n\nInitially reaching #78 when first released in July 1987 the single was re-released in January 1988 and reached #5 UK singles chart in February 1988 and is acknowledged as the first record to merge hip-hop and house into a style known as hip house. \n\nThis was followed up by Beat Dis by Bomb The Bass. The identity of Bomb The Bass was shrouded in mystery until it was revealed that it had been produced by a DJ at London's Wag Club Tim Simenon.\n \nSimenon used his DJ experience, record collection and techniques gained from a music production course to create a cut and paste style which successfully merged sounds andsamples from various genres within dance music - in particular old school hip hop, house, electro and funk with samples from film and TV - most notably The Good, the Bad and the Ugly and Thunderbirds. \n\nThe record reputedly cost Ã‚Â£500 to make and had a big impact on the UK singles chart debuting at #5 in the UK singles chart in February 1988 - what was then the highest debut position for an unknown artist. \n\nIt eventually reached #2 for two weeks and was kept of the top spot by Kylie Minogue's debut single I Should Be So Lucky.\n\nRhythm King didn't have too long for its first UK Singles Chart #1. S-Express was the brainchild of London DJ Mark Moore who - along with many of the well known faces involved in London's club scene at the time, put together the single Theme from S'Express.\n \nThis mixed many of the contemporary dance music sounds of the time with a sample from Rose Royce's 1970's disco anthem Is It Love You're After to great success. \nThe single shot to #1 in April/May 1988 and 1988 to 1991 would be a golden period for Rhythm King with its artists - in particular Baby Ford, The Beatmasters, Betty Boo, Bomb The Bass, Merlin and S-Express doing fairly well in the UK album and singles charts.\n___________________________________________________________________________________\n\n\nSome tracks are edited.\n\n\n01. Beatmasters Featuring P.P. Arnold - Burn It Up\n\n02. S' Express - Superfly Guy\n\n03. Bomb The Bass Featuring Lauraine - Don't Make Me Wait\n\n04. Taffy - I Love My Radio\n\n05. Merlin - Born Free\n\n06. Chuck Brown &amp; The Soul Searchers - We Need Some Money\n\n07. Viola Wills - These Things Happen\n\n08. Shawnie 'G' - Mission Impossible\n\n09. Baby Ford - Chikki Chikki Ahh Ahh\n\n10. Bomb The Bass Featuring Maureen - Say A Little Prayer\n\n11. S' Express - Theme From S' Express\n\n12. Beatmasters Featuring Cookie Crew - Rok Da House\n\n13. King Sun-D Moet - Hey Love\n\n14. Schooly D - Put Your Fila's On\n\n15. 3 Wize Men - Cruising For A Bruising\n\n16. Jay Strongman - East West\n\n17. Bailey &amp; Bridges - Come And Get It\n\n18. Gwen McCrae - Funky Sensation\n\n19. Hotline - Rock This House\n\n20. Bomb The Bass - Beat Dis\n\n21. Bomb The Bass - 10 Seconds To Terminate\n\n22. Bomb The Bass - Mega Mix\n___________________________________________________________\n\n\nMp3\n\nRipped:320kbs\n\nEnjoy.","torrent":{"xt":"urn:btih:4a8b94b7b44c91b65d8b13b4ba0dadbb9acc755a","amp;dn":"Beat+This+The+Hits+Of+Rhythm+King%28mp3+320kbs%29+ICM369","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a8b94b7b44c91b65d8b13b4ba0dadbb9acc755a","infoHashBuffer":{"type":"Buffer","data":[74,139,148,183,180,76,145,182,93,139,19,180,186,13,173,187,154,204,117,90]},"announce":[],"urlList":[]}}