{"title":"Lost Secrets of the Ancients(Jonathan Gray)(2005)","uid":5067139,"size":517668272,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4a8ca8849dbbd7a3097dc5923f19bde333a1f8f5&amp;dn=Lost+Secrets+of+the+Ancients%28Jonathan+Gray%29%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"red_gonzo","files":1,"time":1251066655,"description":"This is Jonathan Gray's mindblowing video documentary Lost Secrets of the Ancients (2005) which vividly demonstrates that before us there was a highly advanced civilization on this planet that built all those monuments and was even capable of assembling machines for navigation and flight. Jonathan Gray, noted explorer, archeologist and author, sets on a journey to prove whether there is any substance to the biblical story of a planetary flood and the afterwards rapidly appearing civilizations that came out of nowhere already fully developed with advanced technologies. What he found out was simply astounding: fantastic secrets of ancient cities, mysterious underground tunnel systems, world survey accurately mapped 4,000 years ago and much more. Who really were the first to fly? Were there nuclear battles with devastating results and highly radioactive skeleton remains to tell the tale? Lost Secrets of the Ancients lets you look at the amazing facts and photographs of technology surrounding the highly civilized ancient world that existed thousands of years ago. One can only wonder if these people were really so primitive as the official history would let us believe. If so then we must be even more. 40 min. long. A must see for everyone.\n\nVideo specs:\nVideo codec: xvid, 720x480, 1500 kbps\nAudio codec: mp3, 48kHz, Stereo\n","torrent":{"xt":"urn:btih:4a8ca8849dbbd7a3097dc5923f19bde333a1f8f5","amp;dn":"Lost+Secrets+of+the+Ancients%28Jonathan+Gray%29%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a8ca8849dbbd7a3097dc5923f19bde333a1f8f5","infoHashBuffer":{"type":"Buffer","data":[74,140,168,132,157,187,215,163,9,125,197,146,63,25,189,227,51,161,248,245]},"announce":[],"urlList":[]}}