{"title":"Green Day - Warning  (2nafish)","uid":5666574,"size":141443076,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4ab40d85cc4bd3b53a796e14a8b914f58075c879&amp;dn=Green+Day+-+Warning++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1278166047,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Warning&quot; is a single from, and the title track of, Green Day's 2000 album Warning.\n\nBillie Joe Armstrong has said that the original concept was to create a song whose lyrics were made up of all signs and labels, and the idea grew from there.\n\nThe single was a number three modern rock hit in the US and &quot;bubbled under&quot; the Billboard Hot 100. The single also made it into the Top 40 of the UK Singles Chart in the UK.\n\nIt bares strong resemblance to the song &quot;Picture Book&quot; by The Kinks.\n\nThe music video for Warning premiered on MTV on January, 2001. It was directed by Francis Lawrence and shows the life of a man who does trivial but dangerous things during his day.\n\nWarning is the sixth full-length album by Green Day, released in 2000. Building upon its predecessor, Nimrod, Warning eschewed their trademark punk rock sound and incorporated acoustic elements. Warning was also the first Green Day album that was not produced by Rob Cavallo since Kerplunk, although he did have a hand in its production and was credited as executive producer.\n\nWarning reached number four on the Billboard charts and went gold. Despite its high critical response, it represented the lowest commercial slump in the band's career since their first album. It is also the only Green Day album, apart from the debut, not to go platinum in America. The album has sold over 1.3 million units worldwide as of 2008.\n\nWarning was reissued on vinyl on July 14, 2009. Warning and Minority are featured on the new game by Harmonix, Green Day: Rock Band.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\t","torrent":{"xt":"urn:btih:4ab40d85cc4bd3b53a796e14a8b914f58075c879","amp;dn":"Green+Day+-+Warning++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ab40d85cc4bd3b53a796e14a8b914f58075c879","infoHashBuffer":{"type":"Buffer","data":[74,180,13,133,204,75,211,181,58,121,110,20,168,185,20,245,128,117,200,121]},"announce":[],"urlList":[]}}