{"title":"[2008] Band From TV - Hoggin' All The Covers","uid":5054354,"size":150121164,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4adb4cd1ffb7f2224bb206fe3830373929163f43&amp;dn=%5B2008%5D+Band+From+TV+-+Hoggin%5C%27+All+The+Covers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"andisa","files":13,"time":1250331596,"description":"Band From TV - Hoggin' All The Covers [2008]\n\n\nInfo\n\nWhat started out as a love for music and simply having fun jamming with buddies has led Greg Grunberg and his friends to an unusual place: packed venues playing rock and roll for charitable causes!\n\nThe Band From TV lineup includes a powerhouse of well-known and acclaimed actors including:\n\nGreg Grunberg (drums), a veteran of shows such as Alias and Felicity and currently starring in the NBC hit HEROES\n\nHugh Laurie (Keyboards, Vocals) currently starring in the FOX hit HOUSE\n\nTeri Hatcher (vocals) currently starring in the ABC hit DESPERATE HOUSEWIVES\n\nJames Denton (guitar), currently starring in the ABC hit DESPERATE HOUSEWIVES\n\nBob Guiney (vocals), who appeared on THE BACHELOR and is currently seen on TLC's DATE MY HOUSE\n\nBonnie Somerville (vocals) from ABC's 2008 series CASHMERE MAFIA\n\nJesse Spencer (violin) currently starring in the FOX hit HOUSE\n\nAdrian Pasdar (Guitar) currently starring in the NBC hit HEROES\n\nand rounding out the band are accomplished musicians Chris Kelley, Barry Sarna, Jon Sarna, Chris Mostert and child-star turned bass player Brad Savage.\n\nA few years back, Grunberg was asked to play a gig at the House of Blues with a couple of celebrities. With the overwhelming interest this performance generated, he decided to form a celebrity band that could also serve as a platform for another passion - raising money for charitable causes. After a guest stint on House, he met Laurie. And, following that he performed at another charity event where he jammed with James Denton and Bob Guiney. Soon after, Bonnie Somerville joined the group and &quot;Band From TV&quot; was formed. All the celebrities have a charity they support. &quot;Band From TV&quot; is all about giving, with the majority of the money raised from gigs and the band's upcoming DVD being donated back to help the charities in their endeavors.\n\n&quot;My oldest son has epilepsy and I saw this band as a wonderful vehicle to help raise money for the National Epilepsy Foundation,&quot; comments Grunberg. &quot;Having band mates who also happen to be in some of the most popular shows on television creates an amazing opportunity to really reach out to our fans to help support these wonderful causes,&quot; adds Grunberg. Teri Hatcher supports the Starlight Starbright Children's Foundation, James Denton works with The Conservation Fund, Bob Guiney supports The Art of Elysium. Bonnie Somerville supports the Child Abuse Prevention Program and the National Coalition Against Domestic Violence and Jesse Spencer supports The Indiana University-Kenya Partnership. Support for additional charitable organizations are in the works.\nWall talented actors, the band is truly about celebrating music, living the rock and roll fantasy and having fun while bringing classic rock and roll music to life. \n\nwebsite: http://www.bandfromtv.org/\n\n\n\nTracklist\n\n01. Piece Of My Heart (4:56)\n02. You Really Got Me (2:50)\n03. Will It Go 'Round In Circles (3:30)\n04. Feelin' Alright (5:18 )\n05. Pink Cadillac (5:03)\n06. Lean On Me (4:06)\n07. Hard To Handle (3:28 )\n08. Mustang Sally (5:27)\n09. The Letter (4:51)\n10. Viva Las Vegas (2:33)\n11. Goodnight Irene (4:27)\n12. Papa Loved Mama (3:10)\n13. Shake Your Tail Feather (12:48 ) ","torrent":{"xt":"urn:btih:4adb4cd1ffb7f2224bb206fe3830373929163f43","amp;dn":"%5B2008%5D+Band+From+TV+-+Hoggin%5C%27+All+The+Covers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4adb4cd1ffb7f2224bb206fe3830373929163f43","infoHashBuffer":{"type":"Buffer","data":[74,219,76,209,255,183,242,34,75,178,6,254,56,48,55,57,41,22,63,67]},"announce":[],"urlList":[]}}