{"title":"Saw 1-5 PAL DVD9","uid":5057868,"size":38921857873,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4ae11787b087581b253a8e44a705af2eff98328d&amp;dn=Saw+1-5+PAL+DVD9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ubehage","files":-1,"time":1250519285,"description":"Saw 1-5\n-------\n\nAudio on all: English (DD5.1) (DTS5.1 on some)\nSubs on all: Danish, Swedish, Norwegian, Finnish\n\n\nSAW (2004)\n----------\n&quot;How much blood would you shed to stay alive?&quot;\n\nIMDB:  &lt;a href=&quot;\nhttp://imdb.com/title/tt0387564/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0387564/&lt;/a&gt;\n\nAudio: English (DD5.1, DTS5.1)\n\nSubs: Danish, Swedish, Norwegian, Finnish\n\nExtra Materials:\n- none.\n\n\nPlot outline:\nTwo men wake up at opposite sides of a dirty, disused bathroom, chained by their ankles to pipes. Between them lies a dead man loosely clutching a hand-held tape player and a handgun. Each finds a tape the perfect fit for the player in their back pocket. They play the tapes. One is threatened, the other isn't. But they have a task: One must kill the other by 6:00, or his wife and daughter will die. They find hacksaws in a toilet, and try to cut the chains, but it doesn't work. They are the two newest victims of the Jigsaw Killer. In a flashback, we learn of Amanda, a girl who falls victim to the Jigsaw Killer. On her head is a mask, which is hooked into her lower jaw. There is a timer on it. Only one key will unlock it, and that key is in the digestive tract of her cell mate who lies paralyzed on the opposite side of the room. If she doesn't unlock the mask in time, her lower jaw will be ripped wide open. She survives, but her cell mate doesn't. Through a series of flashbacks, we learn of more victims, and of the nearly-successful capture of the Jigsaw Killer, who doesn't actually kill his victims. Instead, he finds ways to make them kill either themselves, or each other, and he thinks the entire 'game' out perfectly, with no other ways out. Or so it would seem.\n\n\n\nSAW II (2005)\n-------------\n&quot;Oh, yes. There will be blood.&quot;\n\nIMDB:  &lt;a href=&quot;\nhttp://imdb.com/title/tt0432348/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0432348/&lt;/a&gt;\n\nAudio: English (DD5.1, DTS5.1)\n\nSubs: Danish, Swedish, Norwegian, Finnish\n\nExtra Materials:\n- none.\n\n\nPlot outline:\nWhen detective Eric Matthews (Donnie Wahlberg) is called to a crime scene of a victim of Jigsaw (Tobin Bell), he finds a lead to the place where he is hidden. Once there, he realizes that Jigsaw trapped his son Daniel Matthews (Erik Knudsen) with three women and four men in a shelter, and they are inhaling a lethal nerve gas. If they do not use an antidote within two hours, they will die. Eric follows with increasing desperation the death of each member of the group in monitors, while trying to convince Jigsaw to release his son.\n\n\n\nSAW III (2006)\n--------------\n&quot;Sometimes Rules Are Meant To Be Broken...&quot;\n\nIMDB:  &lt;a href=&quot;\nhttp://imdb.com/title/tt0489270/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0489270/&lt;/a&gt;\n\nAudio: English (DD5.1)\n\nSubs: Danish, Swedish, Norwegian, Finnish\n\nExtra Materials:\n- none.\n\n\nPlot outline:\nJeff is an anguished man, who grieves and misses his young son that was killed by a driver in a car accident. He has become obsessed for revenge against the man and reckless with his wife and daughter. When Dr. Lynn Denlon, who has troubles with her marriage, is abducted by the deranged Jigsaw's apprentice Amanda, she is brought to a gruesome warehouse to keep John Kramer alive in spite of having a terminal brain tumor. Amanda puts a necklace gadget full of explosives around Dr. Lynn's neck connected to John Kramer's life support system, and tells her that if he dies the device will explode. Meanwhile, Jeff is submitted to a sick game of forgiveness with surprising dark consequences.\n\n\n\nSAW IV (2007) Directors Cut\n---------------------------\n&quot;It's a Trap&quot;\n\nIMDB:   &lt;a href=&quot;\nhttp://imdb.com/title/tt0890870/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0890870/&lt;/a&gt;\n\nAudio: English (DTS5.1, DD5.1)\n\nSubs: Danish, Swedish, Norwegian, Finnish\n\nExtra Materials:\n- Theatrical Trailer.\n- Sneak Preview.\n- Darrens Video Diary.\n- The Traps of Saw IV.\n- The Props of Saw IV.\n- Saw IV Music Video by &quot;X-Japan&quot;.\n- Deleted Scenes.\n\n\nPlot outline:\nJigsaw and his apprentice Amanda are dead. Now, upon the news of Detective Kerry's murder, two seasoned FBI profilers, Agent Strahm and Agent Perez, arrive in the terrified community to assist the veteran Detective Hoffman in sifting through Jigsaw's latest grisly remains and piecing together the puzzle. However, when SWAT Commander Rigg is abducted and thrust into a game, the last officer untouched by Jigsaw has but ninety minutes to overcome a series of demented traps and save an old friend or face the deadly consequences.\n\n\n\nSaw V (2008) Directors Cut\n--------------------------\n&quot;You won't believe how it ends.&quot;\n\nIMDB:  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1132626/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1132626/&lt;/a&gt;\n\nAudio: English (DD2.0, DD5.1, DTS5.1)\n\nSubs: Danish, Swedish, Norwegian, Finnish, Icelandic\n\nExtra Materials:\n- Theatrical Trailer.\n- Sneak Preview.\n- Featurettes:\n  - The Coffin Trap.\n  - The Pendulum Trap.\n  - The Cube Trap.\n  - The Fatal Five.\n  - Slicing the Cube: Editing the Cube Trap.\n- Audio Commentaries:\n  - Producers Commentary.\n  - Directors Commentary.\n\n\nPlot outline:\nFollowing Jigsaw's grisly demise, Mark Hoffman, the final apprentice to the serial killer is deigned a hero. Meanwhile, Agent Strahm is tested and puts the pieces together. While Strahm realizes that Hoffman is helping Jigsaw, five seemingly unconnected people face a horrible lesson about teamwork.","torrent":{"xt":"urn:btih:4ae11787b087581b253a8e44a705af2eff98328d","amp;dn":"Saw+1-5+PAL+DVD9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ae11787b087581b253a8e44a705af2eff98328d","infoHashBuffer":{"type":"Buffer","data":[74,225,23,135,176,135,88,27,37,58,142,68,167,5,175,46,255,152,50,141]},"announce":[],"urlList":[]}}