{"title":"Coast to Coast AM - Aug 24 2009 - Intent, Healing, &amp; Remote View","uid":5068923,"size":56233323,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:4b58558db33ff4dc7bcee56c61230cc1e87ad5f6&amp;dn=Coast+to+Coast+AM+-+Aug+24+2009+-+Intent%2C+Healing%2C+%26+Remote+View&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1251233521,"description":"Researcher in non-local consciousness and futurist Stephan Schwartz discussed his studies of intent, healing, and remote viewing. He also shared the results of his latest study, which looked at the effectiveness of applied kinesiology, a muscle-testing system that purports to reveal which foods or supplements are healthy or unhealthy for a person. His double-blind experiment found that kinesiology testing on subjects wasn't accurate, and he couldn't recommend the use of it in making decisions about one's health. However, he conceded that certain kinesiologists can be highly accurate.\n\nThe power of intent taps into the non-local domain, &quot;that part of us which is outside of space-time, and is everywhere...think of it as the cosmic Internet,&quot; he explained. When a large group of people share a common and clear intention, they have the ability to make social change-- even one person's intent can bring about change, he said. He cited the reduction in smoking rates as an example of successful group intent, and added that as a next group intention, &quot;we've got to get clear about the transition out of petroleum,&quot; in order to combat climate change, and world instability.\n\nHe talked about his 2050 Project, begun in the 1970s, in which subjects remote viewed the future. Many of the things they predicted have taken place, Schwartz noted. He touched on Sam Sumner's Lost Colony Project, in which archeological remote viewer George McMullen provided information on locations on Roanoke Island that were confirmed by subsequent excavations.\n\nSchwartz also discussed studies conducted on healers that showed naive healers were effective, though not as much as experienced healers. Healing is a universal capacity that we all have to some degree, he added.\n\nSwine Flu &amp; Vaccinations\nFirst hour guest, Dr. Len Horowitz commented on the Swine Flu, which a White House panel has warned could kill as many as 90, 000 Americans. He believes the greater danger stems from &quot;toxic&quot; vaccinations that will be foisted upon the public. For more, see his website FluScam.com.\n\n[This information has been shared to spread knowledge to those who otherwise would not have access to it.  If you can afford it please support www.coasttocoast.com]","torrent":{"xt":"urn:btih:4b58558db33ff4dc7bcee56c61230cc1e87ad5f6","amp;dn":"Coast+to+Coast+AM+-+Aug+24+2009+-+Intent%2C+Healing%2C+%26+Remote+View","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b58558db33ff4dc7bcee56c61230cc1e87ad5f6","infoHashBuffer":{"type":"Buffer","data":[75,88,85,141,179,63,244,220,123,206,229,108,97,35,12,193,232,122,213,246]},"announce":[],"urlList":[]}}