{"title":"Medium S06E22 720p HDTV X264-DIMENSION","uid":5580314,"size":1172905637,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:4b6390b1f55c907cf27d6eef4ddb690833df0b9d&amp;dn=Medium+S06E22+720p+HDTV+X264-DIMENSION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"CHD242522","files":-1,"time":1274519408,"description":"Medium is an American supernatural and dramatic television series which premiered on NBC on January 3, 2005. Its focus is Allison DuBois (Patricia Arquette), who acts as a research medium for the Phoenix, Arizona district attorney's office. The lead character is a wife to loving husband, Joe, and the mother of three daughters who all inherited her gift, apparently passed from generation to generation. The show is based on experiences from self-proclaimed spiritual medium Allison DuBois, who claims to have worked with law enforcement agencies across the country in criminal investigations. Medium was created by Glenn Gordon Caron and is produced by Picturemaker Productions and Grammnet Productions in association with CBS Television Studios, originally known as Paramount Television and CBS Paramount Television. After five seasons, NBC dropped the show in 2009, but it was quickly picked up by CBS, whose production division produces the show. Allison DuBois (Patricia Arquette) is a strong-willed mother of three, a devoted wife and law student who has had the gift of being able to talk to dead people, as well as foresee events, and witness past events in her dreams. ","torrent":{"xt":"urn:btih:4b6390b1f55c907cf27d6eef4ddb690833df0b9d","amp;dn":"Medium+S06E22+720p+HDTV+X264-DIMENSION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b6390b1f55c907cf27d6eef4ddb690833df0b9d","infoHashBuffer":{"type":"Buffer","data":[75,99,144,177,245,92,144,124,242,125,110,239,77,219,105,8,51,223,11,157]},"announce":[],"urlList":[]}}