{"title":"HBO HUNG S01E01 PILOT - AAADICTEDONE HD 720P MP4 PS3","uid":5048163,"size":1099557096,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:4c3dd063e6e93a9fc207171fecfe3fda8e1ecc57&amp;dn=HBO+HUNG+S01E01+PILOT+-+AAADICTEDONE+HD+720P+MP4+PS3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"aaadicted","files":1,"time":1249753331,"description":"| a | a | a | d | i | c | t | e | d | o | n | e |==| H | D |==| M | P | 4 |\n\n\n-=- HBO -=-\n\nHUNG\n\nSeason 1\n\nEpisode 1\n\n&quot;Pilot&quot;\n\n\n| a | a | a | d | i | c | t | e | d | o | n | e |==| H | D |==| M | P | 4 |\n\nAfter a slightly inappropriate pep talk to the West Lakefield High Wolves, head basketball coach Ray Drecker fakes a kidney stone attack, leaving assistant coach Mike to take the helm during a losing streak. On his way to meet his first client for his new moonlighting gig, Ray thinks back on the bad year(s) that brought him here. His wife left him for her dermatologist. His house caught fire and remains unfixed. Their twins, Darby and Damon moved in with Jessica and her new husband Ronnie. Meanwhile, Ray's new neighbor Howard Koontz is on him to clean up his property, calling the police on Ray every chance he gets. Swallowing his pride, Ray goes to Jessica for a loan, but she uses it as an opportunity to rub his failures in his face - reminding Ray of why she left.\n\nDesperate for a solution, Ray signs up for an entrepreneurship seminar. The leader, Floyd Gerber, urges everyone to identify their winning tool in order to come up with a million-dollar business. Tanya Skagle, who Ray had a previous fling with after her &quot;Poet in the Schools&quot; visit to his history class, shows up to the seminar, and they reunite over tea and a second encounter at her place. Despite Ray's impressive endowment, the chemistry between them is lacking, and when things go south, she insults him: &quot;Go market your dick!&quot; Intrigued by Tanya's suggestion, Ray ends up placing an ad in the paper for his services as &quot;Big Donnie.&quot;\n\nWhen Big Donnie's first client rejects him, Ray's back to square one. Tanya finds Ray in his tent later that night and brings him a sample of her new product: &quot;Lyric Bread.&quot; When he confides to her about Big Donnie, Tanya rips apart his ad and suggests a partnership: She'll help him market himself, for a percentage.\n\n| a | a | a | d | i | c | t | e | d | o | n | e |==| H | D |==| M | P | 4 |\n\n\nStats - http://bayimg.com/LADKmAAcC\n\nScreenshot - http://bayimg.com/mAdkFAacc\n\n\n| a | a | a | d | i | c | t | e | d | o | n | e |==| H | D |==| M | P | 4 |\n","torrent":{"xt":"urn:btih:4c3dd063e6e93a9fc207171fecfe3fda8e1ecc57","amp;dn":"HBO+HUNG+S01E01+PILOT+-+AAADICTEDONE+HD+720P+MP4+PS3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c3dd063e6e93a9fc207171fecfe3fda8e1ecc57","infoHashBuffer":{"type":"Buffer","data":[76,61,208,99,230,233,58,159,194,7,23,31,236,254,63,218,142,30,204,87]},"announce":[],"urlList":[]}}