{"title":"The Edge Of Love 2008 (NL SUBS)- 2Lions-Team","uid":5076155,"size":4682980550,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4c6583196eb53c2c51d9eadb7c65567756be935e&amp;dn=The+Edge+Of+Love+2008+%28NL+SUBS%29-+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pioen","files":-1,"time":1251853724,"description":"The Edge Of Love 2008 Limited PAL       \n \n \n\nVerenigd Koninkrijk\nDrama / Romantiek\n110 minuten\n\ngeregisseerd door John Maybury\nmet Keira Knightley, Cillian Murphy en Sienna Miller\n\nVera (Keira Knightley) en Caitlin (Sienna Miller) hebben veel overeenkomstige eigenschappen en interesses, maar de meest opvallende is de man waarvan ze houden: Dylan Thomas. Ware het niet dat Dylan met Cailtin getrouwd is, en dat Vera ook een echtgenoot heeft. Er ontstaat een complexe relatie waarin menig vriendschap op het spel komt te staan.\n\n\nEnglish\n\nTwo feisty, free-spirited women are connected by the brilliant, charismatic poet who loves them both. The passion and pathos of legendary poet Dylan Thomas is told through the lives of two extraordinary women. Vera Phillips and Dylan were teenage loves; fast forward ten years and the two reconnect in London. She's working as a singer whilst he's churning out scripts for government propaganda films and living off the last in a long line of infatuated women. The two former lovers feel the thunderbolt once more, but Thomas is now married to the adventurous Caitlin. Despite their love-rival status, the women form a surprising friendship. Caitlin indulges in her own infidelities, and recognises a similar adventurous spirit in her husband. But she knows his connection with Vera is something different, not to mention dangerous. Romantic turmoil continues in Vera's life. She marries her devoted admirer William Killick, but she can't deny the chemistry between herself and Dylan, nor does she want to - even if this means betraying Caitlin. When William is posted abroad, and a pregnant Vera returns to Wales with her married friends, the battle between her heart and head becomes more intense. William returns a changed man, but neither is Vera the carefree cabaret girl he married. Neighbourhood gossip fuels her husband's jealousy towards his rival. Enraged, William stages a violent attack on Dylan - an attack that forces Vera to choose between the men in her life and the friend that she loves. Desire and guilt are complicated by love and friendship in this real-life tale set in beautiful London and the majestic Welsh countryside.\n\n\nType.................: Movie \nPart Size............: 50,000,000 bytes \nNumber of Parts......: 94 \nCompression Format...: RAR \nImage Format.........: .iso \nImage Created with...: Utra iso \nSource...............: Retail dvd9 \nOriginal Format......: Pal \nMovie Information.....imdb.com/title/tt0819714/ \nGerne................: Drama \n\nAudio: 5.1 DD Eng \nBeeld: untouched \nSubs: NL \nMenu: yes \n\nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Drama\nRomantiek\nOorlog\n \nWeblink : http://www.moviemeter.nl/film/43100 \nWeblink : http://www.imdb.com/title/tt0819714\n\n*****************************************\n\nBrought to you by\nPioen\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum\n         &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n\n******************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.\t\n\n \n \n \n","torrent":{"xt":"urn:btih:4c6583196eb53c2c51d9eadb7c65567756be935e","amp;dn":"The+Edge+Of+Love+2008+%28NL+SUBS%29-+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c6583196eb53c2c51d9eadb7c65567756be935e","infoHashBuffer":{"type":"Buffer","data":[76,101,131,25,110,181,60,44,81,217,234,219,124,101,86,119,86,190,147,94]},"announce":[],"urlList":[]}}