{"title":"[XBOX-360] Operation Flashpoint Dragon Rising PAL-[ESPACONSOLAS]","uid":5112170,"size":6780256234,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:4c930e84dd6dad455c6bcb4ae330b05e978b1e95&amp;dn=%5BXBOX-360%5D+Operation+Flashpoint+Dragon+Rising+PAL-%5BESPACONSOLAS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ESPACONSOLAS","files":75,"time":1254866855,"description":"ESPACONSOLAS\n\n\nOperation Flashpoint Dragon Rising PAL XBOX360 Title.............: Operation Flashpoint: Dragon Rising Date..............: 10/06/09 Platform..........: XBOX360 Region............: PAL Genre.............: Shooter http://xboxmovies.teamxbox.com/xbox-360/10190/Operation-Flashpoint-2-Dragon-Rising-Coop-Video/ %u201CThere%u2019s no better FPS experience than playing together with mates in a fire team and four-player co-op is the sweet spot; I%u2019d say it%u2019s the ultimate Operation Flashpoint: Dragon Rising experience,%u201D said Sion Lenton, Executive Producer for Operation Flashpoint: Dragon Rising. %u201CThe nature and freedom of the game lends itself perfectly to the spirit of co-op play %u2013 especially as human players explore avenues that the AI won%u2019t always,%u201D During a co-op game, the host assumes the role of fire team leader and the remaining players choose their role, including medic, rifleman, engineer or anti-tank specialist, via the load out screen. The fire team leader is responsible for issuing specific commands, such as directing suppressing fire, setting way points and instigating flanking manoeuvres. Similarly, if players take control of a vehicle during a mission, roles specific to that vehicle become available, such as driver, commander, gunner or co-pilot in a helicopter. %u201CGood communication between fire team members is hugely important, especially when mission objectives can be handled in multiple ways. The successful co-op team will learn authentic USMC tactics via the command radial and gameplay encourages the discussion of those tactics; that%u2019s the key to winning the battle and ultimately the war,%u201D continued Lenton. %u201CIt%u2019s a thoroughly immersive co-op experience; the tense atmosphere becomes especially apparent in the spec ops missions, where players will find themselves whispering commands to each other as they become gripped by the fear of being discovered by the enemy.%u201D In addition to the campaign, the game%u2019s individual single missions, once completed, can be set up as self contained co-op games. This enables players to jump straight to their favourite missions have up to 3 players to join as part of their unit. Co-op play also offers re-spawn points at checkpoints gameplay that encourages the fire team to stick together. Muster your fire team in readiness for Operation Flashpoint: Dragon Rising when it arrives October 6th (US) / 8th (PAL) / 9th (UK) for the Xbox 360Ã‚Â® video game and entertainment system from MicrosoftÃ‚Â®, PlayStationÃ‚Â®3 computer entertainment system and PC. Preview co-op gameplay in the new video, now available online at www.flashpointgame.com. Gamers can also receive the latest updates as they happen by signing up to Facebook -or follow developments straight from the studio on Twitter - twitter.com/flashpointgame.\nOperation Flashpoint Dragon Rising Pal Xbox360 \n\n &lt;a href=&quot;\nhttp://www.EspaDivx.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.EspaDivx.com&lt;/a&gt;","torrent":{"xt":"urn:btih:4c930e84dd6dad455c6bcb4ae330b05e978b1e95","amp;dn":"%5BXBOX-360%5D+Operation+Flashpoint+Dragon+Rising+PAL-%5BESPACONSOLAS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c930e84dd6dad455c6bcb4ae330b05e978b1e95","infoHashBuffer":{"type":"Buffer","data":[76,147,14,132,221,109,173,69,92,107,203,74,227,48,176,94,151,139,30,149]},"announce":[],"urlList":[]}}