{"title":"Verlockende Falle - Entrapment [GERMAN][TVRip][Xvid]","uid":5134985,"size":591015094,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4cb852aab1bb3c3c1cda586a9d32d6ce42764dd7&amp;dn=Verlockende+Falle+-+Entrapment+%5BGERMAN%5D%5BTVRip%5D%5BXvid%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"khunrah","files":4,"time":1256409584,"description":"VERLOCKENDE FALLE\n\n# Original Titel: Entrapment\n# Drehbuch: Christopher Young\n# Darsteller: Sir Sean Connery, Catherine Zeta-Jones, Ving Rhames\n# Regisseur: Jon Amiel\n# Format: Dolby, PAL, Surround Sound, Widescreen\n# Sprache: Deutsch\n# Region: Region 2\n# Bildseitenformat: 16:9\n# FSK: Freigegeben ab 12 Jahren\n# Studio: Twentieth Century Fox\n# Erscheinungstermin: 1999\n# Spieldauer: ca. 105 Minuten\n\nDen Diebstahl eines Rembrandts nutzt die attraktive Versicherungsagentin Gin\n(Catherine Zeta-Jones), um ihren Chef Hector Cruz (Will Patton) davon zu ÃƒÂ¼berzeugen,\nsie auf den Superdieb MacDougal (Sean Connery) anzusetzen. Doch schon bald stellt\nsich heraus, das Gin mehr im Schilde fÃƒÂ¼hrt, als Mac nur zu ÃƒÂ¼berfÃƒÂ¼hren. Und auch mit\nVerfÃƒÂ¼hren allein ist es nicht getan: Sie braucht Mac und sein KÃƒÂ¶nnen fÃƒÂ¼r den\nabsoluten Millenium-Super-Coup.\n\n&lt;img src=&quot;http://www.djfl.de/entertainment/djfl/1100/bilder/110422bp.jpg&quot; /&gt;\n\nSean Connery spielt einen Meisterdieb, der angeblich schon lange im Ruhestand ist,\nund Catherine Zeta-Jones ist seine Gegenspielerin, eine Super-Versicherungsdetektivin,\ndie seinen Fall bearbeiten soll. Sie haben beide ein kleines Geheimnis voreinander zu\nverbergen, bis sich herausstellt, dass Zeta-Jones selbst eine professionelle Kunst-\ndiebin ist und ein doppeltes Spiel spielt. ZunÃƒÂ¤chst beÃƒÂ¤ugen sich die beiden gegen-\nseitig voller Misstrauen, dann tun sie sich fÃƒÂ¼r einen Coup zusammen, der reibungslos\nklappt. Ihre unterkÃƒÂ¼hlte Beziehung beginnt nun natÃƒÂ¼rlich etwas aufzutauen, und\nsie verlieben sich ineinander, wÃƒÂ¤hrend sie den riesigen Bankraub mit Hilfe des\nJahr-2000-Problems planen, der den HÃƒÂ¶hepunkt des Films darstellt (welcher ÃƒÂ¼brigens\nmit fortsetzungstauglichem Ende geliefert wird).\n\nVerlockende Falle ist so etwas wie ein Einbrecher-Film der 70er Jahre, der fÃƒÂ¼r die Hightech-Schnickschnack-verliebten 90er aufbereitet wurde. Die Handlung enthÃƒÂ¤lt ein\npaar zu gewollte Wendungen, und die Anziehungskraft zwischen den beiden Hauptfiguren\nist kaum erkennbar, obwohl beide sich in ihren Rolle gut behaupten. Andererseits gibt\nes in vielen Szenen, in denen die Diebe mit innovativen Einbruchsinstrumenten ihrem\nGeschÃƒÂ¤ft nachgehen, echte Spannung. Zeta-Jones ist natÃƒÂ¼rlich zum Umfallen schÃƒÂ¶n und\nConnery ist, wie ÃƒÂ¼blich, zuverlÃƒÂ¤ssig gut in seiner Rolle. Das ziemlich flache Ende\nund die Regie ziehen den Film etwas herunter, aber Fans von Einbrecher-Filmen,\nHightech-Thrillern und von den beiden Hauptdarstellern sollte einiges an dem Film\ngefallen. --Jerry Renshaw &lt;a href=&quot;\nhttp://www.djfl.de/entertainment/djfl/1100/bilder/110422b7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.djfl.de/entertainment/djfl/1100/bilder/110422b7.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://www.djfl.de/entertainment/djfl/1100/bilder/110422b5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.djfl.de/entertainment/djfl/1100/bilder/110422b5.jpg&lt;/a&gt;\n\nRezensent: Martin Doering (Berlin):\n \nEigentlich habe ich diesen Film nur wegen Sean Connery gekauft, der hier einen mit\nallen Wassern gewaschenen Profidieb spielt. Catherine Zeta-Jones, eine Versicherungs-\nangestellte, wird auf ihn angesetzt, um ihn endlich zu stellen. Sie meint, ihm eine\nFalle gestellt zu haben, aber dann zeigt er ihr, was lÃƒÂ¤uft, bis schlieÃƒÅ¸lich\nherauskommt, dass alles doch viel komplizierter und verworrener ist...\n\nEine tolle Story, spannend von der ersten bis zur letzten Minute, die man erst nach\nmehrmaligem Sehen vÃƒÂ¶llig durchschaut, mit High-Tec-Equipment, mit Super-Schauspielern,\ndie in ihrer Rolle jeweils alles geben und trotz Spannung dem Ganzen den nÃƒÂ¶tigen\nCharme, feinen Witz und &quot;Pep&quot; geben - all das macht diesen Film absolut sehenswert.\n\nNatÃƒÂ¼rlich gibt es auch eine Love-Story, bei der Gin (Catherine Zeta-Jones) alle\nihre - durchaus beachtlichen - Reize und ihren Charme einsetzt, um ihn zu kÃƒÂ¶dern\n(wie sollte sie ihn sonst dazu kriegen, in ihre Falle zu tappen?), bis sie, was sie\nnicht vermutet hatte - SEINEM Charme zu erliegen scheint..., aber es wird keine platte\nLiebesgeschichte, sondern notwendiger Bestandteil der Handlung und rundet diese ab.\n\nEiner der besten Krimis der Geschichte - diese DVD muss man einfach haben! &lt;a href=&quot;\nhttp://www.djfl.de/entertainment/djfl/1100/bilder/110422b3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.djfl.de/entertainment/djfl/1100/bilder/110422b3.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://www.djfl.de/entertainment/djfl/1100/bilder/110422b2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.djfl.de/entertainment/djfl/1100/bilder/110422b2.jpg&lt;/a&gt;\n\nKritik\n\t\nRegisseur Jon Amiel ist versucht, seine Inszenierung zwischen zwei Schwerpunkten\nauszubalancieren. Da ist zum Ersten natÃƒÂ¼rlich die unausweichliche Frage, wie zwei\nerotisierende, nur durch erhebliche Altersdifferenz getrennte, Stars miteinander\numzugehen haben. An Connerys Sexappeal kann selbst nicht das Alter nagen und man\nerwartet, dass entweder Catherine-Zeta Jones dem &quot;Bondappeal&quot; verfÃƒÂ¤llt oder\nGentlemaneinbrecher MacDougal dem heiÃƒÅ¸blÃƒÂ¼tigen Charme der &quot;verlockenden Falle&quot;.\nAber nein, richtig knisternde Erotik wird durch MacDougals &quot;ProfessionalitÃƒÂ¤t&quot; im\nKeim erstickt, wodurch die Dialoge auf dieser Ebene uninspiriert vor sich hindÃƒÂ¼mpeln.\nSoll die &quot;verlockende Falle&quot; als doppelte Metapher, auch mit sexueller Konnotation,\ngesehen werden, kann sie hier nicht zuschnappen. Dann der zweite Schwerpunkt, der\nnicht nur unter der Halbherzigkeit des Erotischen leidet: der &quot;kleptomanische&quot; Aspekt.\nDie Szenen, in denen Masken, Vasen und die Kleinigkeit von 8 Milliarden Dollar geklaut\nwerden wollen, wirken zu absehbar, zu routiniert. DÃƒÂ¤mlich anmaÃƒÅ¸end wirkt es, wenn\ndas Stehlen zum GrÃƒÂ¶ÃƒÅ¸enwahn wird. Richtige Spannung baut sich nie auf, allein von den\nvielen Intrigen der Geschichte zeigt man sich ÃƒÂ¼berrascht und verwirrt. Die Leistung\nConnerys kÃƒÂ¶nnte man als souverÃƒÂ¤n-unbeteiligt bezeichnen, Catherine-Zeta Jones wird\nsicher noch von sich hÃƒÂ¶ren und sehen lassen. Der Film kann weder sehenswerte Erotik,\nnoch den Anspruch eines temporeichen Thrillers einlÃƒÂ¶sen und bleibt halbherziges\nKonglomerat.\n\nFlemming Schock\n","torrent":{"xt":"urn:btih:4cb852aab1bb3c3c1cda586a9d32d6ce42764dd7","amp;dn":"Verlockende+Falle+-+Entrapment+%5BGERMAN%5D%5BTVRip%5D%5BXvid%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cb852aab1bb3c3c1cda586a9d32d6ce42764dd7","infoHashBuffer":{"type":"Buffer","data":[76,184,82,170,177,187,60,60,28,218,88,106,157,50,214,206,66,118,77,215]},"announce":[],"urlList":[]}}