{"title":"Garry's Mod Gcfs","uid":5660362,"size":4108480240,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4dcd62c6f64babcee38ca46fde3f976e7100ac75&amp;dn=Garry%5C%27s+Mod+Gcfs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"snickerpuz","files":8,"time":1277950839,"description":"What is it?\n\nGarry's Mod is a sandbox mod for the Source Engine. Unlike normal games there aren't any predefined aims or goals. Players are given tools and are left to entertain themselves. \n\nThe player is in a world where objects can be created and destroyed on demand. Where people can be created and destroyed with the click of a mouse. A world made for him. A world he made. \n\n\nSo what do you do?\n\nThere are a lot of things you can do with Garry's Mod, but here's a few of the more common uses. \n\n\nConstruction\n\nGarry's Mod provides tools to constrain objects together in various ways. Using these tools the player can create working contraptions. \n\nThe simplest example is a car. The player spawns an object to be used for the car's body then adds wheels by firing the tool gun at the object. Wheels are then controllable using the numpad on your keyboard. \n\nYou don't have to make moving contraptions though - want to build a fort out of wooden crates then set it on fire? Go for it! Want to build a house using fridges for the walls and mattresses for the ceiling then drive a jeep into it all? Go for it! \n\n\nPosing and Comics\n\nOne of the universal appeals of Garry's Mod has been the ability to place and pose ragdolls. This allows you to create your own comic books and share them online. One major comic spawned from this is HLComic - the story of Gordon Frohman's journey in City 17. \n\nGarry's Mod gives you the ability to place ragdolls, manipulate their facial expressions and aim their eyes. \n\n\nGamemodes\n\nGarry's Mod gives the ability to program your own gamemodes (Don't worry - you don't need to be a programmer to play them). This allows the community to make new, often wacky, gamemodes such as melon racing, build to the top and so on. \n\nIt's often worth taking a look in the server list to see if any of the games grab your attention - there's often something weird there to try out. \n\nGarry's Mod benefits greatly from a thriving community which is constantly churning out new ideas, maps, models, gamemodes, weapons, Lua scripts and skins.","torrent":{"xt":"urn:btih:4dcd62c6f64babcee38ca46fde3f976e7100ac75","amp;dn":"Garry%5C%27s+Mod+Gcfs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dcd62c6f64babcee38ca46fde3f976e7100ac75","infoHashBuffer":{"type":"Buffer","data":[77,205,98,198,246,75,171,206,227,140,164,111,222,63,151,110,113,0,172,117]},"announce":[],"urlList":[]}}