{"title":"(magic) Anthony Owen - Ultimate OIl And Water","uid":5655014,"size":16634576,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4df8f5912e24bdfd7abdf185f9fbe3500e76271b&amp;dn=%28magic%29+Anthony+Owen+-+Ultimate+OIl+And+Water&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"terrenmcc","files":1,"time":1277764848,"description":"The Effect\nFINALLY ON DVD WITH NEW PREVIOUSLY UNREVEALED HANDLINGS AND IMPROVEMENTS AND COMPLETE WITH EVERYTHING YOU NEED TO PERFORM IT TOO.\n\nThis is Anthony's acclaimed Oil and Water  #   routine in which red and black cards are repeatedly mixed and magically separate. Finally the magic happens even with the cards face-up!\n\nDavid Regal said: &quot;about as lovely a sequence as one can imagine, one that creates a deep sensation of magic...I'm kicking myself for not thinking of it first.&quot;\n\nLuke Dancy  Criss Angel Mindfreak consultant  said: &quot;If you haven't checked out any of Anthony's material before you should be jumping on it. This creative mofo is the force behind most of the magic that airs on the &quot;telly&quot; in the UK. This Oil and Water is the perfect example of what he is capable of.&quot;\n\nDerren Brown said &quot;Anthony's Oil and Water is the cleanest you'll ever see.&quot;\n\nAldo Colombini said &quot;I love Oil and Water routines. Anthony showed his routine to me and I can honestly say that it is direct to the point, magical and entertaining. Few Oil and Water routines can live on that!&quot;\n\nDaryl said &quot;Looks terrific - like real magic!&quot;\n\nDaniel Madison: &quot;This is what all magic should look like... beautiful&quot;\n\nDavid Berglas said &quot;The best Oil and Water routine I've ever seen.&quot;\n\nMarc De Souza said &quot;One of the cleanest, most magical looking handlings for the classic effect I've seen. An entertaining presentation  #  , with an instant reset and no difficult sleights.&quot;\n\nNicholas Einhorn - who performed it in his routine at The Magic Circle Centenary Close-up Show and in his award winning act at FISM in Holland - said &quot;Anthony's Oil and Water routine is one of the fairest looking, most baffling versions I have ever seen or used. It consistently fools and enthrals all who see it whilst building theatrically at every phase. The final revelation is so amazing people go WILD. Frankly I'd prefer it if Anthony kept this one quiet!&quot;\n\nThis routine is one of the hits of Anthony's acclaimed convention lecture. For the first time on DVD Anthony goes into the full details of his routine PLUS gives you several suggestions, improvements and additional handlings, including some which have never appeared in print or on film before! The DVD comes complete with the special cards necessary for you to master this right away and Anthony even explains how you can make up the cards yourself in the future.\n\nCONTENTS include:\n\n    * Anthony's Ultimate Oil and Water routine and full explanation.\n    * Sebastien Clergue's handling for the final phase.\n    * Anthony's improved handling for the second phase NEVER BEFORE REVEALED!\n    * Anthony's stand up handling NEVER BEFORE REVEALED IN PRINT OR ON FILM! \n\n\n\nPS::\nPls Support ,,,,its our responsibility as a member to share anything that the community does not have....\nWe are not here only to Receive but we also have to give sometimes....\n\nThanks","torrent":{"xt":"urn:btih:4df8f5912e24bdfd7abdf185f9fbe3500e76271b","amp;dn":"%28magic%29+Anthony+Owen+-+Ultimate+OIl+And+Water","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4df8f5912e24bdfd7abdf185f9fbe3500e76271b","infoHashBuffer":{"type":"Buffer","data":[77,248,245,145,46,36,189,253,122,189,241,133,249,251,227,80,14,118,39,27]},"announce":[],"urlList":[]}}