{"title":"Documentary ~ Enemies of Happines  [theArchit3kt]","uid":5578350,"size":721414144,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4e85fa78e850855fca5b329f8713883343a13ce2&amp;dn=Documentary+%7E+Enemies+of+Happines++%5BtheArchit3kt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"theArchit3kt","files":-1,"time":1274449928,"description":"Documentary: Enemies of Happines\n\nThe true Story about a young woman fighting for change in Afghanistan.\n\n\nRunning Time: 1h 3min 19sec\nDate: 2006\nFile Format: AVI\nVideo Codec: MPEC-4, 640:464 (4:3), 1518kbps, 29 fps\nAudio Codec: mp3, stero, 128 kbps\n\nIn September 2005, Afghanistan held its first parliamentary elections in 35 years. Among the candidates for 249 assembly seats was Malalai Joya, a courageous, controversial 27-year-old woman who... In September 2005, Afghanistan held its first parliamentary elections in 35 years. Among the candidates for 249 assembly seats was Malalai Joya, a courageous, controversial 27-year-old woman who had ignited outrage among hard-liners when she spoke out against corrupt warlords at the Grand Council of tribal elders in 2003. Enemies of Happiness is a revelatory portrait of this extraordinary freedom fighter and the way she won the hearts of voters, as well as a snapshot of life and politics in war-torn Afghanistan. Amidst vivid, poetic images of Joya's dusty Farah Province, the film tracks the final weeks of her campaign, when death threats restrict her movements. But the parade of trusting constituents arriving on her doorstep leaves no doubt that Joya is a popular hero. Among her visitors is a 100-year-old woman who treks two hours to offer loyalty and herbal medicine. King Solomon-style, Joya acts as folk mediator and advocate, adjudicating between a wife and her violent, drug-addicted husband and counseling a family forced to marry off their adolescent daughter to a much older man. Protected by armed guards, Joya heads to poor rural areas to address crowds of women, pledging to be their voice and &quot;expose the enemies of peace, women, and democracy.&quot; In the presence of her fierce tenacity, we can imagine the future of an enlightened nation.\n\n________________________________________________________\n\n\nYou find all my torrents and a lot of other stuff on:\n &lt;a href=&quot;\nhttp://thearchit3kt.blogspot.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thearchit3kt.blogspot.com/&lt;/a&gt;\n\n\n\n..I wish you all the best and thanks a lot to everybody who helps seeding..\n..theArchit3kt..\n\n\n!! keep torr3nts alive !!","torrent":{"xt":"urn:btih:4e85fa78e850855fca5b329f8713883343a13ce2","amp;dn":"Documentary+%7E+Enemies+of+Happines++%5BtheArchit3kt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e85fa78e850855fca5b329f8713883343a13ce2","infoHashBuffer":{"type":"Buffer","data":[78,133,250,120,232,80,133,95,202,91,50,159,135,19,136,51,67,161,60,226]},"announce":[],"urlList":[]}}