{"title":"Enemigo a las PuertasDVDRIP.(spanish).","uid":5136693,"size":696543232,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4f42050fc43b894aa6f16ddd36eae08f27099b3d&amp;dn=Enemigo+a+las+PuertasDVDRIP.%28spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":1,"time":1256546493,"description":" AÃƒÂ±o de producciÃƒÂ³n: 2001\nDirecciÃƒÂ³n: Jean-Jacques Annaud\nIntÃƒÂ©rpretes: Jude Law, Joseph Fiennes, Ed Harris, Rachel Weisz, Bob Hoskins, Ron Perlman\nGuiÃƒÂ³n: Jean-Jacques Annaud, Alain Godard\nMÃƒÂºsica: James Horner\nFotografÃƒÂ­a: Robert Fraisse\nDistribuye en DVD: Tri Pictures\nDuraciÃƒÂ³n: 131 min.\nPÃƒÂºblico apropiado: JÃƒÂ³venes\nGÃƒÂ©nero: BÃƒÂ©lico\n\nDuelo de titanes\n\nEstamos en 1942, en el cruento marco de la batalla de Estalingrado. Los alemanes estÃƒÂ¡n a punto de conseguir la ciudad a orillas del Volga, lo que supondrÃƒÂ­a la victoria definitiva en el frente del Este. Sin embargo, entre los aullidos de los obuses, va a surgir la figura de Vassili Zaitsev (Jude Law), un humilde pastor de los Urales que destacarÃƒÂ¡ por su increÃƒÂ­ble destreza para abatir a cuanto enemigo se le pone a tiro. El camarada Danilov (Joseph Fiennes), encargado de la propaganda y sabedor de lo importante que es tener a un hÃƒÂ©roe para levantar a las desmoralizadas tropas soviÃƒÂ©ticas, no dudarÃƒÂ¡ en encumbrarlo. Al mismo tiempo que surge la amistad entre ellos, tambiÃƒÂ©n aparecen las diferencias por el amor de una joven soldado (Rachel Weisz). Del otro lado, el contraataque nazi se centrarÃƒÂ¡ ahora en acabar con el hÃƒÂ©roe ruso. El mayor Koenig (Ed Harris) asumirÃƒÂ¡ la misiÃƒÂ³n, un astuto y peligroso rival que se enfrentarÃƒÂ¡ a Vassili en un duelo de francotiradores de proporciones ÃƒÂ©picas.\n\n \n\nEl director Jean Jacques Annaud relata con pericia una historia intimista dentro del fragor de la batalla, sin desaprovechar los elementos del gÃƒÂ©nero bÃƒÂ©lico, que nos hacen disfrutar de un grandioso espectÃƒÂ¡culo. Lo hace partiendo de un duelo como eje central, del enfrentamiento entre dos hombres en una guerra silenciosa que saca a la luz contrastes y extremos de aquello que representan sus respectivos bandos. Todo con un sabor agradabilÃƒÂ­simo a western clÃƒÂ¡sico. Con inteligencia y maniqueÃƒÂ­smo asumido se pone la mira telescÃƒÂ³pica sobre lo bueno y lo malo, lo justificable y lo atroz. No hay equÃƒÂ­vocos a la hora de seÃƒÂ±alar lo absurdo de cualquier guerra o los espurios fines de cualquier signo de propaganda. Desde los polos contrarios de los francotiradores, Annaud tensa la acciÃƒÂ³n dramÃƒÂ¡tica e introduce magistralmente, en el continuo acecho, en cada trampa, un suspense que lleva a contener el aire y, mÃƒÂ¡s tarde, a respirar a tumba abierta. La emociÃƒÂ³n impregna todo el film y de ella se revisten el acontecimiento histÃƒÂ³rico y las vidas entrecruzadas de sus personajes: &quot;Hemos cogido un acontecimiento histÃƒÂ³rico e intentado comprender lo que ocurriÃƒÂ³ en el corazÃƒÂ³n de las personas que lo vivieron&quot;, afirma el director francÃƒÂ©s. Un terreno propicio donde sacar a flote valores como la amistad y el amor, ÃƒÂ©ste un poco con calzador. Luego estÃƒÂ¡ la fabulosa aportaciÃƒÂ³n tÃƒÂ©cnica y artÃƒÂ­stica, el equilibrio en el ritmo del film, los planos sobrecogedores y sugerentes (Ã‚Â¡quÃƒÂ© maravillosos ojos!) y un casting extraordinario en el que Jude Law estÃƒÂ¡ a la altura de las circunstancias y Ed Harris, impagable.\n","torrent":{"xt":"urn:btih:4f42050fc43b894aa6f16ddd36eae08f27099b3d","amp;dn":"Enemigo+a+las+PuertasDVDRIP.%28spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f42050fc43b894aa6f16ddd36eae08f27099b3d","infoHashBuffer":{"type":"Buffer","data":[79,66,5,15,196,59,137,74,166,241,109,221,54,234,224,143,39,9,155,61]},"announce":[],"urlList":[]}}