{"title":"diskeeper timebomb info.txt","uid":5058458,"size":2452,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4fd9113124b1bddf7d7fa00a2b886fcb809e9121&amp;dn=diskeeper+timebomb+info.txt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"david323","files":-1,"time":1250546417,"description":"hey guys, just wanted to let everyone know how this Diskeeper trial-bomb works. I read a lot on different forums people getting very frustrated...\n\nthis information applies to Diskeeper Home 2009, as of August, 2009. And I don't know how many prior versions... but I think other current versions too.\n\nthere are two things that Diskeeper uses to track your usage of the program:\n\n1) this is the actual &quot;time-bomb&quot;...\nThe time counter data is kept in a binary value in a key named MiscStatus under [HKEY_CLASSES_ROOTCLSID{8FF8D6D4-BAAF-6C58-C4AA-0F6844C4749D}MiscStatus]\n8FF8D6D4-BAAF-6C58-C4AA-0F6844C4749D is the unique Class ID of Diskeeper, which could be considered the 128-bit numeric name or &quot;social security number&quot; of the program. You must delete the Data binary value in order to reset Diskeeper. But that's not all...\n\n2) they also track you via internet connection, using your unique MachineGUID:\nHKEY_LOCAL_MACHINESOFTWAREMicrosoftCryptography\nYour unique MachineGUID is a string-value under Cryptography.\nYou must delete this; don't worry, another different one will be automatically created. Don't worry, this is not the same as your computer SID (security identifier) or user SID.\n\nIf you are so inclined and network/firewall savvy, you can figure out how to block Diskeeper from communicating over the internet and reading your MachineGUID.\n\nI do not believe this is currently being used, but one last thing you might check if the above two things do not work, (but I'm pretty sure they will), is some hidden folders named cryptneturlcache, buried deep and hidden under c:users%USERNAME%AppData...\nGo to the root in a cmd window and do a &quot;dir /s /a cryptneturlcache&quot; and delete all of them with their Content and MetaData sub-folders. But hopefully, the first two steps will work.\n\nThese are the three things that always work for me. Take advantage too of using your Favorites feature in RegEdit (Favorites, Add to Favorites). It makes navigation nearly instantaneous. Drilling down the CLSID branch is a bitch! You only want to do it once!\n\nAlways use sysinternals Process Monitor, launched through the system account using psexec, when time-bomb hunting. And hunting at 2:30 in the morning seems to help too.\n\npsexec -i -s c:...procmon.exe (you gotta use the absolute path or it won't find the file) i switch means interactive, s switch launches the program under the system account.\n\ngood luck.\n","torrent":{"xt":"urn:btih:4fd9113124b1bddf7d7fa00a2b886fcb809e9121","amp;dn":"diskeeper+timebomb+info.txt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fd9113124b1bddf7d7fa00a2b886fcb809e9121","infoHashBuffer":{"type":"Buffer","data":[79,217,17,49,36,177,189,223,125,127,160,10,43,136,111,203,128,158,145,33]},"announce":[],"urlList":[]}}