{"title":"Lady GaGa - Poker Face (Live)","uid":5073673,"size":143263748,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:50faa794b357131a26ee1eb8f505ca3dd45fad63&amp;dn=Lady+GaGa+-+Poker+Face+%28Live%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1251629683,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nA live performance by Lady GaGa - Poker Face from the Jonathan Ross Show.\n\n\n&quot;Poker Face&quot; is an electropop song by American pop singer-songwriter Lady Gaga from her debut album, The Fame. Produced by RedOne, it was released as the album's second single in late 2008 for some markets and in early 2009 for the rest of the world. The song is an uptempo dance song following the footsteps of her previous single &quot;Just Dance&quot; but has a darker musical tone. The main idea behind the song is bisexuality and was a tribute by Gaga to her rock n' roll boyfriends. Lyrically &quot;Poker Face&quot; is about sex and gambling.\n\n&quot;Poker Face&quot; has been well-received by the critics most of whom have praised the robotic hook and the chorus. The song has attained worldwide success, topping the charts in more than seventeen countries including the United States, United Kingdom, Australia, New Zealand, Canada and many European countries. The accompanying music video for the song portrays Gaga singing it in various costumes and playing strip poker in a mansion.\n\nGaga performed the song for the eighth season of American Idol and her first headlining Fame Ball tour. The live performances included an electronic version performed as the last song of the tour, and a version in which she played the piano while wearing a dress made of plastic bubbles.\n\nIn the United States, the single entered the Billboard Hot 100 at ninety-two and reached number six for the issue dated March 7, 2009. The next week the song climbed another three places to reach a peak of three and stayed for two additional weeks. After that, the song further reached a new peak of two being the week's greatest airplay gainer and topped the chart the following week. &quot;Poker Face&quot; became Gaga's second consecutive number one on the Hot 100, marking the first time an artist has had their first two charting singles hit number one on the Hot 100 since Christina Aguilera did so with &quot;Genie In a Bottle&quot; and &quot;What a Girl Wants&quot; in 1999-2000. The song debuted on the Pop 100 at number sixty-one and ultimately topped the chart. The song also peaked on both the Hot Dance Airplay and Hot Dance Club Play charts. &quot;Poker Face&quot; became the first single since Madonna's 2006 single &quot;Sorry&quot;, to top all the three dance charts in a single week including the Hot Dance Singles Sales chart. It also appeared on the Hot Latin Tracks chart at twenty-four. The song has sold 3.8 million paid digital downloads according to Nielsen Soundscan.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:50faa794b357131a26ee1eb8f505ca3dd45fad63","amp;dn":"Lady+GaGa+-+Poker+Face+%28Live%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50faa794b357131a26ee1eb8f505ca3dd45fad63","infoHashBuffer":{"type":"Buffer","data":[80,250,167,148,179,87,19,26,38,238,30,184,245,5,202,61,212,95,173,99]},"announce":[],"urlList":[]}}