{"title":"A Cruel Picture--(UNCUT)[DVDRip][KooKoo][REQ]","uid":5592345,"size":917813693,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:512fb9a9ab5a32ac600c113b8e7ccc3dd353a6fa&amp;dn=A+Cruel+Picture--%28UNCUT%29%5BDVDRip%5D%5BKooKoo%5D%5BREQ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thelad53","files":-1,"time":1274909582,"description":"ENGLISH SUBS INCLUDED\n\n*****\nTitle:\n*****\n\n&quot;Thriller - en grym film (1974)&quot; \n\n\nGenre: Exploitation\n*****  \n\nSynopsis:\n*********\n\nThe Movie That Has No Limits Of Evil!\n\nWarning: This film contains explicit scenes of graphic sexuality.\n\nGrowing up mute after a childhood sexual assault, a young girl (played by beautiful cult \nstarlet Christina Lindberg) spends years working on a remote farm. After missing the \nbus one day, she is picked up by a suave young man who takes her out to dinner, drugs \nher and forces her into a life of drug addiction and prostitution. Torn away from home,\nshe rebels against her captor only to have one of her eyes gouged out as punishment\n(in a scene rumored to have been filmed with an actual corpse). After learning of the\ndeath of her parents and fed up with the cards life has dealt, she trains herself in the fine arts of \nfighting, killing and revenge. Transformed into a one woman killing machine (and armed with a \nsawed-off shotgun) she uses her new skills to enact bloody revenge on those who have done her wrong.\n\nSynapse Films has painstakingly restored THRILLER - A CRUEL PICTURE from original vault \nmaterials to bring you the totally uncensored version of the ultimate revenge-exploitation movie! Originally \nreleased in the U.S. in a heavily truncated form as THEY CALL HER ONE EYE, THRILLER is presented here\nwith all the graphic sex, violence and action intact.  Over 20 minutes of additional footage has been restored!\nThis is the film that Quentin Tarantino (Director: KILL BILL VOL. 1 &amp; 2, PULP FICTION, RESERVOIR DOGS) called \n&quot;the roughest revenge movie ever made!&quot; THRILLER - A CRUEL PICTURE  is only available in a 25,000 \nunit Limited Edition production run. This cult gem won't be around forever. \nPick this up now or you could miss out on THE exploitation DVD release of 2004!\n\n\nIMDB URL: http://www.imdb.com/title/tt0072285/\n********","torrent":{"xt":"urn:btih:512fb9a9ab5a32ac600c113b8e7ccc3dd353a6fa","amp;dn":"A+Cruel+Picture--%28UNCUT%29%5BDVDRip%5D%5BKooKoo%5D%5BREQ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"512fb9a9ab5a32ac600c113b8e7ccc3dd353a6fa","infoHashBuffer":{"type":"Buffer","data":[81,47,185,169,171,90,50,172,96,12,17,59,142,124,204,61,211,83,166,250]},"announce":[],"urlList":[]}}