{"title":"Ballistic Ecks vs Sever DVDRip Spanish","uid":5062237,"size":734213286,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5131695fe4475ebbef8c526049b71d4118e7953b&amp;dn=Ballistic+Ecks+vs+Sever+DVDRip+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":2,"time":1250761604,"description":"En el peligroso mundo del espionaje internacional, agentes de elite anÃƒÂ³nimos libran batallas secretas por el poder, la informaciÃƒÂ³n y la seguridad nacional. Las agendas no suelen ser lo que parecen. En las filas de este exclusivo reducto del espionaje se rumorea que se ha inventado una nueva e ingeniosa arma letal. Es microscÃƒÂ³pica, inyectable y permanece latente en el interior del cuerpo de su vÃƒÂ­ctima hasta que se activa y mata a su anfitriÃƒÂ³n, de forma instantÃƒÂ¡nea y sin dejar huella. Se desata una lucha frenÃƒÂ©tica para conseguir este arma, pero sÃƒÂ³lo dos personas, enemigos acÃƒÂ©rrimos, tienen la habilidad, el talento y la tenacidad para llegar hasta el final. Una es la agente secreto conocida por el nombre en clave de Sever (Lucy Liu). La han entrenado para ser un arma perfecta y no cometer ni un solo error. AsÃƒÂ­ que cuando tiene un objetivo, es absolutamente precisa e implacable. El otro es el cazador de hombres Jeremiah Ecks (Antonio Banderas), un inteligente y decidido ex-agente del FBI. Ecks era uno de los mejores agentes del cuerpo, pero su mujer muriÃƒÂ³ en una explosiÃƒÂ³n, lo que le produjo un gran sentimiento de culpa que le llevÃƒÂ³ a encerrarse en sÃƒÂ­ mismo y a renunciar a su cargo en la agencia. Pero su antiguo mentor le ha obligado a volver al servicio para llevar a cabo la misiÃƒÂ³n mÃƒÂ¡s arriesgada de su carrera y Ecks se prepara para enfrentarse a la agente Sever, su peor enemigo. SÃƒÂ³lo uno de los dos puede salir victorioso de esta feroz competiciÃƒÂ³n por el mortal premio. Pero las reglas del juego cambian y estos dos obstinados adversarios se dan cuenta de que la persona a la que estÃƒÂ¡n intentando derrotar podrÃƒÂ­a ser la ÃƒÂºnica en la que pueden confiar.","torrent":{"xt":"urn:btih:5131695fe4475ebbef8c526049b71d4118e7953b","amp;dn":"Ballistic+Ecks+vs+Sever+DVDRip+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5131695fe4475ebbef8c526049b71d4118e7953b","infoHashBuffer":{"type":"Buffer","data":[81,49,105,95,228,71,94,187,239,140,82,96,73,183,29,65,24,231,149,59]},"announce":[],"urlList":[]}}