{"title":"Coast to Coast AM - Sep 23 2009 - Crop Circles &amp; Anomalies","uid":5100818,"size":55249236,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:528ca99b1ad988829a51ce4860558646bd42afb8&amp;dn=Coast+to+Coast+AM+-+Sep+23+2009+-+Crop+Circles+%26+Anomalies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"0vercast","files":4,"time":1253926255,"description":"Crop Circles &amp; Anomalies\n\nDate: 09-23-09\nHost: George Noory\nGuests: Simeon Hein, Erich vonDaniken, Lynne McTaggart\n\nAppearing during the middle two hours, crop circle expert Simeon Hein discussed anomalous energies and haywire equipment he experienced during trips to crop formations (see images below). There are many sources for crop circles-- balls of light, UFO/ETs, as well as humans, he outlined. Hein has tagged along on some of the man-made overnight missions and saw a complete design created in a barley field in 4-5 hours. Curiously, anomalous phenomena such as camera batteries inexplicably conking out, have occurred at the man-made sites. This led him to conclude that something about the crop formations/patterns, even though man-made, is causing energetic interactions.\n\nCrop circles are telling us about the &quot;language of resonance,&quot; and could be thought of like musical instruments for modulating energy, he said. The human circlemakers are creating a kind of natural magic, and their patterns have grown increasingly complex over the years, Hein commented. Formations associated with balls of light (seen by many witnesses) tend to feature small circles, and uncomplicated designs, he added. One theory posits that these plasma balls are a natural phenomenon coming from the upper atmosphere. He also detailed associations between UFOs and crop circles-- sometimes UFOs leave formations and circular landing traces; other times craft may be attracted to formations already there.\nIntention &amp; The Lost Symbol\n\nIn the first hour, writer Lynne McTaggart talked about some of the science behind Dan Brown's new bestseller The Lost Symbol. Her book The Intention Experiment and web-based mind-over-matter experiment are featured in his novel, she noted, adding that Brown has drawn from a &quot;crazy quilt of influences,&quot; --including other real consciousness experiments and research such as done by the PEAR program (Princeton Engineering Anomalies Research), and Dean Radin/Instit. of Noetic Sciences.\n\n\nErich von DÃƒÂ¤niken: New Work\n\nLast hour guest, renowned author Erich von DÃƒÂ¤niken spoke about the theories behind his seminal book Chariots of the Gods, and his new work, History is Wrong. The Nazca Lines in Peru may have been created by natives mimicking ETs who earlier used the desert area as landing strips for their craft, he explained. In his new book, he takes a look at ancient texts like the Book of Enoch, and ties them in with South American artifacts.\n\nWebsite(s):\nnewcrystalmind.com\nOpeningMinds.info\ntheintentionexperiment.com\ndaniken.com\n\nBook(s):\nOpening Minds: A Journey of Extraordinary Encounters, Crop Circles, and Resonance\nPlanetary Intelligence: 101 Easy Steps to Energy, Well-Being, and Natural Insight\nThe Intention Experiment\nHistory is Wrong\nChariots of the Gods\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224\t","torrent":{"xt":"urn:btih:528ca99b1ad988829a51ce4860558646bd42afb8","amp;dn":"Coast+to+Coast+AM+-+Sep+23+2009+-+Crop+Circles+%26+Anomalies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"528ca99b1ad988829a51ce4860558646bd42afb8","infoHashBuffer":{"type":"Buffer","data":[82,140,169,155,26,217,136,130,154,81,206,72,96,85,134,70,189,66,175,184]},"announce":[],"urlList":[]}}