{"title":"Rang Birangi DvDRip starring Amol Palekar.avi","uid":5047206,"size":725307896,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:52f0f48bcde0b23068a4829457a9c38c5da15a80&amp;dn=Rang+Birangi+DvDRip+starring+Amol+Palekar.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"chaibhat","files":2,"time":1249697468,"description":"Superb Comedy Starring Amol Palekar:\n\nPlot:Sparkling comedy about a meddling friend whose attempt to rekindle the spark in his friend's relationship with his wife of seven years leads to complications to their lives, and to the lives of his secretary and her boyfriend he has not 'scripted' ... Splendid performances by Amol Palekar, Deepti Naval, Parveen Babi and Farooq Shaikh, a perfectly pitched script, witty dialogue and a plethora of aptly placed film references make this a film one can watch over and over and never fail to laugh out loud\n\n       Ajay and Nirmala Sharma have been married for years. Nirmala now feels that Ajay is not attracted to her anymore, and in despair, confides about this matter with her brother. Her brother concocts a tale which results in Ajay having an affair with his Secretary, Anita Sood. Due to this affair Nirmala notices that Ajay has become more romantic and attentive with her. Her brother then concocts another romance, this time with Nirmala and Anita's boyfriend, Prof. Jeet Saxena. When Ajay finds out, he confronts Nirmala, and Nirmala admits to this, but shrugs it off as a mere friendship. Nirmala's brother concocts another plot whereby Jeet is to impersonate a private detective with a fictitious name of Dhurendra Bhatavdekar, and blackmail Ajay. Things get complicated when the real Bhatavdekar, a Police Inspector, and a uncle of Nirmala, gets involved, resulting in utter comical chaos\n\n\nIMDB Rating:8.1/10   Goog Quality...\n\n\nNOTE:: Seeding Time 2.00am-8.00am IST\n\n\nI have downloaded it fromand reuploaded it here.I can't seed at faster speed as my speed is limited.So pls have some patience.\n\n                                                            Thank You.","torrent":{"xt":"urn:btih:52f0f48bcde0b23068a4829457a9c38c5da15a80","amp;dn":"Rang+Birangi+DvDRip+starring+Amol+Palekar.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52f0f48bcde0b23068a4829457a9c38c5da15a80","infoHashBuffer":{"type":"Buffer","data":[82,240,244,139,205,224,178,48,104,164,130,148,87,169,195,140,93,161,90,128]},"announce":[],"urlList":[]}}