{"title":"Keriver Image v4.1","uid":5098517,"size":72398352,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:534b8a081e9f3a66fb2cb060069a86dd1de8314d&amp;dn=Keriver+Image+v4.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoExcuses","files":3,"time":1253782203,"description":"Keriver Image v4.1 Build 2694403030.\n\nThis is just the GiveAwayOfTheDay.com program of a few days ago. The license works also with the Setup downloaded from the original Internet Site.\n\n\n    Keriver Image is a cloning or imaging utility to protect you from important data losses. It provides the ability to back up the entire contents of a hard disk or partition. The contents are saved as an image file that can be restored later to a disk or partition.\n\n    As a backup program for disaster recovery, Keriver Image is simple and efficient. If your disk or partition is no longer accessible due to corruption of the disk's file system or operating system, and you previously created a disk image or partition image file, you can use that image file to restore the entire disk or partition. If the disk is physically damaged, you can use the image file to restore the entire disk or any backed-up partition to a working hard disk.\n\n    As a backup program for file recovery, Keriver Image is quick and to the point. If you lose a file which does not have a backup, your previously-created disk or partition image can be used with Keriver Image Explorer to extract just the file you need from within the image file.\n\n    You can use Keriver Image to clone a computer's operating system, programs, and data files to a new computer or to a new hard disk. While you are restoring a whole disk from an image file to a new hard disk, you can use Keriver Image to move or resize the target partition's location or size, see the picture above.\n\n    Features:\n\n        * Supports Windows 2000/XP/2003/Vista(32/64 bits)/Win7(32/64 bits)\n        * Backs up in Windows or from Keriver Image recovery media.\n        * Provides the ability to back up the entire contents of hard disks or partitions; The contents are saved as a disk-image file that can later be restored to the hard disk or partition.\n        * Supports different user-defined compression levels.\n        * Does not back up page files and hibernation files,decreasing back-up time and reducing the size of your image files.\n        * Supports incremental back-up and differential back-up, allowing users to backup only the newly-added data in your hard disk.\n        * Supports scheduled back-up tasks, be available in making real-time full or incremental backups to keep the integrity of your data.\n        * Verifies back-up image files to ensure the accuracy of your data.\n        * Allows users to make a bootable recovery CD/DVD or bootable recovery USB Flash Drive which can boot a computer with a corrupted operating system for restoration of the operating system or data.\n        * Picks up specified point-in-time files from previously-created Image files in Windows.\n        * Backs up and restores from USB Flash Drive.\n        * Backs up and restores from Windows Network Places.\n        * Restores from CDROM Disk.\n        * Can restore partitions or hard disks to a specified point-in-time.\n        * Moves or resizes partition while restoring a disk.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.keriver.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.keriver.com/&lt;/a&gt;\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:534b8a081e9f3a66fb2cb060069a86dd1de8314d","amp;dn":"Keriver+Image+v4.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"534b8a081e9f3a66fb2cb060069a86dd1de8314d","infoHashBuffer":{"type":"Buffer","data":[83,75,138,8,30,159,58,102,251,44,176,96,6,154,134,221,29,232,49,77]},"announce":[],"urlList":[]}}