{"title":"1987 &amp; 1988 Hits (For VJ Use playing back on a PC or MAC [Video","uid":5502087,"size":4192089551,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:53b2705db3a56436eca8a44d6224db4f7930d033&amp;dn=1987+%26+1988+Hits+%28For+VJ+Use+playing+back+on+a+PC+or+MAC+%5BVideo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"towerelect","files":23,"time":1271605918,"description":"A word or two about video downloads,  Loads of stuff here on the Pirate Bay but before you waste your Bandwidth, ask yourself is the video file length under 100Mb?  If it is, or is AVI Xvid MP4 or other highly compressed file types and does that loss in quality matter to you.   If you want to play files on a mobile device or just for home use then that is fine.   Xvid can produce very good results but often to import them into professional Video Discotheque software you must change format to MPEG2 and that is not loss free.\n\nThough my uploads are large, I hope you find the quality a little bit better than those who will tell you they are the best quality.   Use your Brain, you get nothing for nothing in physics,  you compress and reduce the download size, sure but always at a cost to quality.   I do not alter the original video files in any way other than spitting them into tracks for VJ use and tagging them so they index correctly.\n\nI have spent a fair bit of cash increasong my seed bandwith.   If you are NOT getting a download speed of 100 Kilo Bytes per second or more the enclosed text files my help you.  Please take the time to read and understand them.   Thank you. \n\nSee Torrent files for Track Listings:\n\nMy Thanks to the original seeder over on Demonoid for the ISO Disc image from which this was made.   Logo Free for Video Discotheque use these VOB or MPEG2 format files will play back on any PC or MAC.  Enjoy:\n\nSource EMI Holland Music Video DVD\nVideo 4:3 Ratio\nSound mp3 320\n\nRigmar Radio:  Rocking in the Free World since 1967","torrent":{"xt":"urn:btih:53b2705db3a56436eca8a44d6224db4f7930d033","amp;dn":"1987+%26+1988+Hits+%28For+VJ+Use+playing+back+on+a+PC+or+MAC+%5BVideo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53b2705db3a56436eca8a44d6224db4f7930d033","infoHashBuffer":{"type":"Buffer","data":[83,178,112,93,179,165,100,54,236,168,164,77,98,36,219,79,121,48,208,51]},"announce":[],"urlList":[]}}