{"title":"Neil Young - Bringin Down Dinner (Live Vicar St 2003)","uid":5130539,"size":65507272,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:53b9f5d051778198a2dbae759b5580a3e7034c5e&amp;dn=Neil+Young+-+Bringin+Down+Dinner+%28Live+Vicar+St+2003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RosaMannen","files":1,"time":1256036253,"description":"Greendale is the name of an album and a movie by Neil Young. Neil Young and Crazy Horse's Greendale, a 10-song rock opera, is set in a fictional California seaside town. Based on the saga of the Green family, the &quot;audio novel&quot; has been compared to the literary classics of Thornton Wilder's Our Town and Sherwood Anderson's Winesburg, Ohio for its complexity and emotional depth in exploring a small town in America.\n\nGreendale combines numerous themes on corruption, environmentalism and mass media consolidation into relevant post-9/11 art. The album, concert, film and DVDs have produced a vast divergence of critical opinion ranging from being called &quot;amateur&quot; to being voted as one of the best albums of 2003 by Rolling Stone magazine music critics.\n\nThe CD was originally released with a DVD of live &quot;Neil-only&quot; acoustic performance of the Greendale material from Vicar Street, Dublin, Ireland. In 2004, the CD was released with a new DVD containing a live performance of Neil Young and Crazy Horse. A DVD-Audio version was also released, with both Advanced Resolution Stereo and 5.1 Surround sound mixes, and a video of &quot;Devil's Sidewalk&quot; from the film. In late 2004, the feature length DVD with actors lip-synching the material was released.\n\nIn 2007, Vertigo Comics announced the production of the comic book adaptation of the album with the same title. According to writer Joshua Dysart, Neil Young is directly involved in the project.\n\nGreendale's blues sound reflects the influence of bluesman Jimmy Reed and his driving electric blues and folk melodies.\n\nAs of 2009, it is the last Neil Young album to feature Crazy Horse.\n\n\n\n.ooOO ROSA MANNEN 2009 OOoo.\n                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         &lt;a href=&quot;\nhttp://thepiratebay.se/user/RosaMannen&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/RosaMannen&lt;/a&gt;\t","torrent":{"xt":"urn:btih:53b9f5d051778198a2dbae759b5580a3e7034c5e","amp;dn":"Neil+Young+-+Bringin+Down+Dinner+%28Live+Vicar+St+2003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53b9f5d051778198a2dbae759b5580a3e7034c5e","infoHashBuffer":{"type":"Buffer","data":[83,185,245,208,81,119,129,152,162,219,174,117,155,85,128,163,231,3,76,94]},"announce":[],"urlList":[]}}