{"title":"Coast to Coast AM - Oct 17 2009 - Zombies &amp; Other Scary Things","uid":5130639,"size":56519626,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:540106e4d74b57fc1987f96cad044be1bc4196dd&amp;dn=Coast+to+Coast+AM+-+Oct+17+2009+-+Zombies+%26+Other+Scary+Things&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1255998250,"description":"Zombie War &amp; Other Scary Things\n\nDate: 10-17-09\nHost: Ian Punnett\nGuests: Max Brooks, Douglas Clegg\n\nIn the first half of the show, Ian was joined by researcher and author of The Zombie Survival Guide, Max Brooks, for a War of the Worlds-style radio report on World War Z, the war with the zombies. Brooks, who documented the oral history of these events*, said the zombie plague originated at a lake in China, where a man and his son were diving for relics. The father disappeared, the boy came up with a bite mark on his foot, and from there it spread, he noted. According to Brooks, the Chinese government covered up the ensuing outbreak and never alerted the international community to the impending worldwide apocalypse.\n\nMany countries fell to the walking plague, Brooks continued, including Japan, North Korea, and part of the United States east of the Rocky Mountains. Israel was one of the few nations to initiate a nationwide quarantine in time, extending a security fence around the entire country (1967 borders). The island nation of Cuba came through unscathed, Brooks added. In all, the zombie war decimated the human population and, even though the worst of it is over, the undead still pose a significant threat to humanity.\n\nBrooks said land areas known as &quot;White Zones&quot; remain infested with zombies. The walking dead roam the ocean floor as well, perhaps in the millions, he warned. Colder areas of the planet must deal with outbreaks every spring, when frozen zombies thaw out and begin searching for humans to consume. Brooks also briefly spoke about some of the heroes of the war, the role religion played during the crisis, and how the U.N. has assisted in the rebuilding process.\n\n*The events depicted in this story are fictitious. Any similarity between persons living and (un)dead is purely coincidental.\n\nIn the latter half of the program, winner of the Bram Stoker Award and the International Horror Guild Award, Doug Clegg talked about the paranormal and other things that scare us. More details forthcoming...\n\nWebsite(s):\nmaxbrooks.com\ndouglasclegg.com\nisisthebook.com\n\nBook(s):\nIsis\nWorld War Z: An Oral History of the Zombie War\nThe Zombie Survival Guide: Complete Protection from the Living Dead\nThe Zombie Survival Guide: Recorded Attacks\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224","torrent":{"xt":"urn:btih:540106e4d74b57fc1987f96cad044be1bc4196dd","amp;dn":"Coast+to+Coast+AM+-+Oct+17+2009+-+Zombies+%26+Other+Scary+Things","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"540106e4d74b57fc1987f96cad044be1bc4196dd","infoHashBuffer":{"type":"Buffer","data":[84,1,6,228,215,75,87,252,25,135,249,108,173,4,75,225,188,65,150,221]},"announce":[],"urlList":[]}}