{"title":"SPY-GAME..DVDrip[vice]","uid":5050440,"size":587177401,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5427bf78369c56b938c5b61c2e27c92a2be30918&amp;dn=SPY-GAME..DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vicerock","files":-1,"time":1250123712,"description":"SPY GAME DVDrip\n\nVIDEO CODEC Xvid\nFORMAT AVI\nSIZE/RES 480x272[wide screen]\nruntime 120.58mins\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp25\n\nAUDIO CODEC MP3\naudio bitrate 128\nsample rate 44100\ninfo 123 kb/s tot , Joint Stereo\n\nCast\n\n* Robert Redford - Nathan D. Muir\n* Brad Pitt - Tom Bishop\n* Catherine McCormack - Elizabeth Hadley\n* Stephen Dillane - Charles Harker\n* Larry Bryggman - Troy Folger\n* Marianne Jean-Baptiste - Gladys Jennip\n* Ken Leung - Li\n* David Hemmings - Harry Duncan\n* Michael Paul Chan - Vincent Vy Ngo\n* Garrick Hagon - CIA Director Cy Wilson\n* Shane Rimmer - Estate Agent\n* Benedict Wong - Tran\n* Adrian Pang - Jiang\n* Omid Djalili - Beirut: Doumet\n* Dale Dye - Rescue Sequence: Cmdr. Wiley\n* Charlotte Rampling - Anna Cathcart\n* James Aubrey - Mitch Alford\nPlot\n\nSet in 1991, the film depicts the U.S. and Chinese Governments on the verge of a major trade agreement with the American President due to pay a visit to China to seal the deal. When the Central Intelligence Agency gets word that their operative Tom Bishop (Brad Pitt) has been captured trying to free an Englishwoman, Elizabeth Hadley (Catherine McCormack), from a Chinese prison near Su Chou (Suzhou), and is being questioned under torture and will be executed within twenty-four hours unless he is claimed by the U.S. Government, they scramble to decide what to do. Lacking the courage to save their agent's life, they say that if they claim Bishop as an agent, they risk destroying the trade agreement. Exacerbating the situation is the fact that Bishop was operating in a &quot;rogue&quot; capacity without permission from the Agency.\n\nIn an attempt to quickly deal with the situation, CIA executives call in Nathan David Muir (Robert Redford), an aging mid-level case officer on his last day before retirement, and the man who recruited Bishop. Although they tell Muir that they simply need him to act as a &quot;stop gap&quot; to fill in some holes in their background files, the officials are in reality hoping that what he gives them is the smoking gun they need to justify letting Bishop die. Realizing as much, Muir attempts to save Bishop by leaking the story to CNN through a contact in Hong Kong, believing that the CIA will rescue Tom once a public outcry puts pressure on them to do so. Unfortunately for Muir, the tactic only stalls them, as a phone call to the FCC from a high ranking executive results in CNN retracting the story.\n\nDuring the debriefing, referred above, Muir describes how he met Bishop in Vietnam and how he recruited Bishop in Berlin in 1975 and continued to work together there. Both sub-plots are given extensive time in the film. Considerable time is also devoted to Muir and Bishop's spy work in Lebanon.\n\nWith his plan quashed, Muir resorts to far more dangerous tactics, secretly creating a forged urgent operational directive from the CIA Director to commence Operation Dinner Out: a daring rescue mission spearheaded by U.S. Navy SEALs. Using US$ 282,000 (all of his life savings) and a misappropriated file on Chinese coastline satellite imagery, Muir bribes a Chinese energy official to cut power to the prison for thirty minutes, during which time the SEAL rescue team retrieves Bishop and Hadley.\n\nThe ending credits dedicate the film to the memory of Elizabeth Jean Scott, the director Tony Scott's mother, who died in 2001.[2]\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0266987/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0266987/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY","torrent":{"xt":"urn:btih:5427bf78369c56b938c5b61c2e27c92a2be30918","amp;dn":"SPY-GAME..DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5427bf78369c56b938c5b61c2e27c92a2be30918","infoHashBuffer":{"type":"Buffer","data":[84,39,191,120,54,156,86,185,56,197,182,28,46,39,201,42,43,227,9,24]},"announce":[],"urlList":[]}}