{"title":"DEATH MACHINE (UNCUT INTERNATIONAL VERSION)","uid":5030699,"size":4680814639,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:54521dc925349449ed9efadbf3917e4a56f58a43&amp;dn=DEATH+MACHINE+%28UNCUT+INTERNATIONAL+VERSION%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"mic32","files":20,"time":1248899992,"description":"Movies : Sci-Fi : DVD Full : English\nDEATH MACHINE (UNCUT INTERNATIONAL VERSION)\n\n\nPAL\n111MINS = 01:51:24\nWIDESCREEN\nINTERACTIVE MENUS\n\n\nA pretty decent low-budget horror/sci-fi film, heavily influenced by both &quot;Robocop&quot; and &quot;Alien,&quot; &quot;Death Machine&quot; served as Norrington's calling card when he was granted the gig to direct the infinitely superior &quot;Blade.&quot; Some directors, like John Carpenter and George Romero, do well with low budgets and seem to fail when given real money to make a movie with. Norrington isn't one of those directors. His first low-budget feature is flawed, but it still has enough style and story to make it worth seeing. \n\nIn the future (2003, that is), a sleazy corporation puts all of its energy into creating weapons of destruction. One project is a Robocop-like system that erases the minds of soldiers and turns them into super-warriors unencumbered by fear or pity. \n\nAnother project, being worked on by Dourif's twisted and psychotic geek character, is known as a &quot;front line morale destroyer&quot; and it's basically a pure killing machine, not unlike what we saw in the first two Robocop films. It has long snapping teeth and a propensity to kill anyone Dourif decides to sick it on. \n\nDourif falls in lust with company exec Pouget. When she rebuffs his advances during the film's way too talky first act, he of course goes ballistic with the device and sends it on a killing spree throughout the corporate headquarters. She, another executive and two left-wing burglars are left to fend for their lives in the building on a night when they all happen to be there. \n\nThe last two thirds of the movie is basically an &quot;Alien&quot; retread, with Pouget joining forces with the burglars to try to destroy the monster machine and not be killed by it in the process. Dourif is a delight as the psychotic engineer. None of the other actors delivered a performance that was remotely remarkable and the effects are so-so. \n\nBut Norrington gives the film a real sense of style and some of the monster-machine chase sequences are truly stunning. He's a great filmmaker, although not a great storyteller. (He wrote the script to this film as well.) \n\n&quot;Blade&quot; would be written by someone else and it really showed off Norrington's real genius. &quot;Death Machine&quot; will probably satisfy some horror fans who have seen just about everything under the sun and are looking for new kicks, but it's not a classic and Norrington would go on to do much better work.\n\n","torrent":{"xt":"urn:btih:54521dc925349449ed9efadbf3917e4a56f58a43","amp;dn":"DEATH+MACHINE+%28UNCUT+INTERNATIONAL+VERSION%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54521dc925349449ed9efadbf3917e4a56f58a43","infoHashBuffer":{"type":"Buffer","data":[84,82,29,201,37,52,148,73,237,158,250,219,243,145,126,74,86,245,138,67]},"announce":[],"urlList":[]}}