{"title":"Blue.Planet.e08.Coasts.720p.x264","uid":5035232,"size":1466566136,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:54e71c208ba432f81dd2d5c9d02fc93bb03edffd&amp;dn=Blue.Planet.e08.Coasts.720p.x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"n3ttik","files":1,"time":1249083315,"description":"BBC - Blue Planet - Coasts - 720p\n\nBroadcast 31 October 2001, the final programme examines the world's coastal environments, &quot;the most dynamic of all ocean habitats&quot;. The perils of living in such places are highlighted by Marine Iguanas on the GalÃƒÂ¡pagos Islands, whose diet of seaweed is quickly grabbed between crashing breakers. Many shores provide sites in which to breed or lay eggs. Apart from birds, turtles are among other major species to do so, and the mass emergence of flatbacks on Crab Island in Australia is reduced by predatory herons, pelicans and other hunters. Each year, four million seabirds, comprising fourteen species, return to the island of Talan in eastern Russia to nest. By ensuring that all their chicks eventually leave at the same time, they lessen the impact of predators. The rough seas of the Southern Ocean play host to penguins, and a group of them is shown being pursued by an aggressive bull sea lion. The planet's coldest seas are in Antarctica, and on South Georgia each spring, thousands of Southern elephant seals arrive to breed. A pair of males is shown fighting a bloody battle to control a harem of females. In Patagonia, the social nature of sea lions is shown as they establish colonies, each of them several hundred strong. While in some respects it is an ideal location for the growing young, high tide brings danger for the colony as a pod of orcas habitually goes on the attack. Having snatched a victim, the predator returns to the open ocean to 'play' with it.","torrent":{"xt":"urn:btih:54e71c208ba432f81dd2d5c9d02fc93bb03edffd","amp;dn":"Blue.Planet.e08.Coasts.720p.x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54e71c208ba432f81dd2d5c9d02fc93bb03edffd","infoHashBuffer":{"type":"Buffer","data":[84,231,28,32,139,164,50,248,29,210,213,201,208,47,201,59,176,62,223,253]},"announce":[],"urlList":[]}}