{"title":"Salween - Eng Sub [Thai Movie]","uid":5067089,"size":1032431430,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:55047724db558b5bd9d4331e5890ddf5ab5bb767&amp;dn=Salween+-+Eng+Sub+%5BThai+Movie%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"poothaijaa","files":-1,"time":1251064775,"description":"Title: Salween\nAKA: Mue Puen 2: Salween\nYear: 1994\nDirector: Chatrichalem Yukol\nGenre: Action / Drama\nRuntime: 120 mins\nCountry: Thailand\nAudio: Thai\nSubtitle: English\n\nStarring:\nSorapong Chatree as Sergeant Ram\nChatchai Plengpanich as Tulay\nSiricoup Metanee as Police Lieutenant Danai\nNappon Gomarachun as Somsak Teeweepong\nChalita Pattamapan as Nid\nRon Rittichai as SLORC colonel\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0368237/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0368237/&lt;/a&gt; &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Salween_(film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Salween_(film)&lt;/a&gt;\n\n\nSource: DVD\nFile format: AVI\n\nPlot:\n\nA text scroll at the opening of the film gives some historical background about Myanmar (or Burma) being granted independence after World War II by the United Kingdom, without the problem of ethnic conflict with the Karen people on the country's border areas being resolved. So since then, the Burmese central government, then known as SLORC and the Karen National Liberation Army have been engaged in a war that is little known to outside people.\n\nA Thai timber baron, Tweepong, exploits the situation by courting both the KNLA and SLORC in order to have the unrest continue while his company logs the teak forests in the border region of the Salween River.\n\nInto this volatile, &quot;wild west&quot; atmosphere comes a young, idealistic police lieutenant, Danai, who's to take charge of the police station at the border town of Fah Soong Pha Sak. He rides into town on his motorcycle as a gun battle has erupted between the police, led by tough Sergeant Ram, against some gun thugs. Danai, wearing his crisp police uniform, ends up dumped in a pig pen, covered in mud. He then gives the unkempt, undisciplined local policemen a dressing down, saying they all must clean up and wear their uniforms.\n\nThe gunmen who started the fight had been sent to kill Ram by Somsak Tweepong, son of the local &quot;godfather&quot;. Somsak later visits Danai to invite him to his father's birthday party.\n\nEager to carry out his duties, Danai starts a foot patrol of his mountainous district and finds that his tight brown uniform and new boots are unsuited to the rugged terrain. While sitting down to rest and care for some blisters on his feet, he encounters a man nattily dressed in white clothes chasing butterflies with a net. The man is the elder Tweepong, who gives Danai some salve.\n\nAfter Danai leaves, Tweepong meets with a SLORC colonel and gains intelligence about the Myanmar government's fight against the Karen.\n\nDanai attends the birthday party for Tweepong, and meets Somsak's wife, who was a former beauty queen and actress from Bangkok. She is unhappily married to Somsak and has become an alcoholic.\n\nDanai continues his tour of the district, meeting Nid, who is a teacher at a school for Thai hill-tribe children. She is also the daughter of Sergeant Ram. Her mother was a Karen woman, who was raped and killed by Somsak Tweepong's men, hence the deep resentment Ram has against Tweepong.\n\nFurther education comes for Danai when fighting between the KNLA and the SLORC spills over into Thailand. As Karen troops, led by KNLA Lieutenant Tulay, are being attacked by a SLORC helicopter, they attempt to wade the Salween River and cross over into Thailand. Danai at first orders Ram to turn the Karen back, but after seeing the helicopter gunship decimate the Karen, he relents, even growing so frustrated as to fire upon the helicopter, which then fires back. However, nothing more comes of this incident.\n\nBut there is more drama in store, as Somsak discovers his wife having an affair. She accuses Somsak of being a homosexual, and Somsak grows enraged. His wife pulls out a gun, and Somsak tries to take it from her, shooting her in the process. She escapes and drives to the police station, where she dies after saying Somsak had shot her.\n\nSomsak is now a fugitive, hiding in Myanmar. Danai at first believes he must go through proper channels to extradite Somsak, but Ram convinces him otherwise, and they take a party into Myanmar to get Somsak back by force.\n\nSomsak's father makes a deal with the KNLA to give them Stinger missiles in exchange for saving his son. Tulay and his men sneak up on Danai's party at night, but let them live in exchange for saving their lives during the earlier incident at the river. Danai tells Tulay that Somsak had committed murder and must be brought back to Thailand for trial. &quot;This is Kawthoolei. Thai laws have no meaning here,&quot; Tulay replies. The next morning, the Karen attack. Ram is fatally shot, but he is able to get off a shot that injures Tulay. Danai and the survivors, including Ram's daughter, take Somsak and head back to Thailand.\n\nJust as Danai and Nid are crossing a small river bridge back to Thailand, they come under attack again by Tulay, who, though injured, was waiting under the water just upstream to ambush them. However, then SLORC troops show up and shoot Tulay. The SLORC colonel says he has made a deal with Tweepong for Somsak, and orders Danai to drop his weapons. Tulay, though, is not yet dead. He floats downstream under the bridge and fatally shoots the colonel. Somsak then runs back towards Myanmar, but Nid still has her pistol. She hands it to Danai, who then shoots Somsak in the back.","torrent":{"xt":"urn:btih:55047724db558b5bd9d4331e5890ddf5ab5bb767","amp;dn":"Salween+-+Eng+Sub+%5BThai+Movie%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55047724db558b5bd9d4331e5890ddf5ab5bb767","infoHashBuffer":{"type":"Buffer","data":[85,4,119,36,219,85,139,91,217,212,51,30,88,144,221,245,171,91,183,103]},"announce":[],"urlList":[]}}