{"title":"X2 La Minaccia, [Simulazione/Manageriale - 1CD - Ita]","uid":5114776,"size":678635520,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:55a0a2fbe9dc49001415cc95dca77a49e5f087ad&amp;dn=X2+La+Minaccia%2C+%5BSimulazione%2FManageriale+-+1CD+-+Ita%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Duracell72","files":1,"time":1254961739,"description":"X2: La Minaccia\n\n:::-&gt;Recensione&lt;-:::\n\nViaggiare nello spazio non significa solo incontrare razze aliene piÃƒÂ¹ o meno bellicose, vivere avventure in compagnia di \n\nHan Solo e del Capitano Kirk o scoprire pianeti paradisiaci dove passare le vacanze. Per chi infatti non ha un soldo ma \n\ntanta voglia di farcela un viaggio spaziale fa rima anche con sacrifici, rischi, estenuanti contrattazioni e tanta fatica. \n\nLeggere per credere.\nSarÃƒÂ  per un caso o forse per un accurata manovra di marketing, ma fatto sta che esattamente vent'anni fa David Braben \n\ne Ian Bell sconvolgevano il mondo videoludico di allora con Elite, capolavoro senza precedenti (e con ben pochi \n\nsuccessori) che permetteva allo sprovveduto giocatore di esplorare un universo vastissimo e di comportarsi come \n\nmeglio credeva. Quel mix di esplorazione, commercio spaziale e combattimento fece storia, ma proprio per la sua \n\nunicitÃƒÂ  ÃƒÂ¨ riuscito a trovare in ben due decenni davvero pochi discepoli in grado di avvicinarvici come fascino e \n\ncomplessitÃƒÂ .\nCi hanno provato rispettivamente Frontier: Elite II, Privateer e Freelancer, ma, pur rimanendo titoli di un certo spessore, \n\nElite continua ad essere considerato il miglior simulatore spaziale-commerciale mai prodotto ad oggi.\n\nLO SPAZIO INFINITO\nTutta questa introduzione per presentare al meglio quello che dopo vent'anni di tentativi si candida a diventare \n\nseriamente il vero successore di Elite. Stiamo parlando naturalmente di X2: La Minaccia, titolo sviluppato da quei Ego \n\nSoft giÃƒÂ  responsabili di X: Beyond The Frontier, altra space-simulation debitrice del capolavoro di Braben e Bell ma piÃƒÂ¹ \n\norientata verso lidi avventurosi per poter parlare di un vero e proprio sequel.\nVerrebbe insomma da dire che siamo in buone mani e in effetti lo sviluppatore tedesco ha giÃƒÂ  dimostrato di avere una \n\ncerta familiaritÃƒÂ  con titoli simili anche in altre occasioni, ragione in piÃƒÂ¹ per avvicinarci a questo gioco con una buona \n\ndose di aspettative. Per chi non avesse avuto la fortuna di giocare ad Elite o a Privateer, va subito detto che X2: La \n\nMinaccia ÃƒÂ¨ un titolo talmente ricco, particolare e unico da essere inclassificabile e anche per questo (come spesso \n\naccade con approcci cosÃƒÂ¬ particolari) difficilmente incontrerÃƒÂ  i favori di tutti.\nImmaginatevi di essere nel bel mezzo di una crisi universale con alieni intenzionati a prendere il comando delle basi \n\nspaziali e dei pianeti abitati dagli umani; nei panni di un avventuriero senza troppi scrupoli vi ritrovate in questa poco \n\nallegra situazione a comandare un cargo spaziale con la speranza un giorno di diventare sempre piÃƒÂ¹ ricchi e potenti e, \n\nperchÃƒÂ¨ no, di assurgere a ruolo di uomo piÃƒÂ¹ schifosamente &quot;miliardario&quot; dell'universo.\nFacile a dirsi, ma difficilissimo a farsi. Tanto per cominciare non aspettatevi di guadagnare denaro e potere come in un \n\nqualsiasi strategico in tempo reale, ovvero ammassando truppe e scatenando l'inferno sulla terra. X2: La Minaccia offre \n\ninfatti un approccio completamente agli antipodi, fatto di lunghi viaggi, contrattazioni e naturalmente anche di \n\ncombattimenti. Non a caso all'inizio del gioco ci troviamo con un budget risibile a pilotare una nave spaziale abbastanza \n\nmalridotta; il nostro scopo ÃƒÂ¨ principalmente quello di commerciare con le decine di stazioni spaziali che popolano il \n\nnostro versante dell'universo.\nQuesto significa comprare merci a un certo prezzo per poi rivenderle a un costo maggiore seguendo l'andamento del \n\nmercato e possibilmente vendendo le nostre merci lÃƒÂ  dove sono piÃƒÂ¹ richieste. Per riuscire nello scopo non dobbiamo \n\nsolo tenere sotto controllo l'andamento del mercato ottenendo informazioni nelle varie basi, ma anche migliorare le \n\ncaratteristiche strutturali della nostra nave come ad esempio la velocitÃƒÂ  (prima arriviamo a destinazione e meglio ÃƒÂ¨), le \n\ndifese (gli attacchi nello spazio sono all'ordine del giorno) e la capacitÃƒÂ  di carico.\nSe si riducesse solo alla sfera del commercio, X2: La minaccia sarebbe solo un discreto titolo di trading simulativo, ma \n\nla veritÃƒÂ  ÃƒÂ¨ che non ci sono limitazioni a quello che potremo fare. Stanchi di sbarcare il lunario vendendo celle di energia, \n\nfrutta e microchip? Nessun problema. Potete diventare dei bounty killer, dei pirati dello spazio, lavorare come tassisti su \n\ncommissione e persino giocare il ruolo del filantropo aiutando le molte razze che popolano l'universo.\nDa questo punto di vista la libertÃƒÂ  di azione ÃƒÂ¨ a dir poco immensa (come immenso ÃƒÂ¨ lo spazio a nostra disposizione) e il \n\nconcetto di linearitÃƒÂ  (per fortuna) non ha trovato terreno fertile da queste parti. Tanto per fare un esempio sulla \n\ncomplessitÃƒÂ  del mondo creato da Ego Soft basti pensare che un aspetto non proprio primario come la nostra \n\nreputazione possiede ben diciassette gradi o che le materie a disposizione sono oltre cinquanta.\n\nNAVI SPAZIALI PER TUTTI I GUSTI\nL'elemento fondamentale del gioco ÃƒÂ¨ comunque ancorato ai viaggi nello spazio, non solo perchÃƒÂ© passeremo la maggior \n\nparte del tempo in cabina di pilotaggio, ma anche perchÃƒÂ© l'aspetto piÃƒÂ¹ esaltante e meglio concepito ÃƒÂ¨ quello riguardante \n\nle navi spaziali. Ne esistono principalmente di dieci classi (si va dall'incrociatore ai caccia passando per le corvette e per \n\nle navi passeggeri) e come se ciÃƒÂ² non bastasse ad aumentare vertiginosamente il fascino del gioco (uno dei nostri scopi \n\npotrebbe essere ad esempio quello di arrivare a possederle tutte), ogni nave puÃƒÂ² essere modificata e potenziata con \n\ndecine e decine di gadget piÃƒÂ¹ o meno costosi. Anche su questo versante perÃƒÂ² le cose non sono semplici.\nAlcuni di questi potenziamenti infatti sono disponibili solo in alcune zone del nostro quadrante e per quanto riguarda le \n\narmi bisogna stare attenti a non comprare modelli incompatibili tra di loro. Se anche la carriera del pirata o del &quot;tassista&quot; \n\nspaziale non facesse a caso vostro, c'ÃƒÂ¨ sempre la possibilitÃƒÂ  di acquistare e costruire fabbriche di materie prime o \n\naddirittura (ma ci vorrÃƒÂ  un budget quasi &quot;murdochiano&quot;) di possedere delle base spaziali.\nCome si puÃƒÂ² vedere, le cose da fare sono moltissime e questo ha spinto la longevitÃƒÂ  a livelli visti raramente in un titolo \n\nsimile. In dieci ore di gioco avrete visto sÃƒÂ¬ o no un dieci per cento di quello che X2: La Minaccia ÃƒÂ¨ in grado di offrire, ma \n\nquesto, come spesso capita, puÃƒÂ² risolversi anche in un approccio molto lento e, per chi non ÃƒÂ¨ appassionato del genere, \n\nabbastanza traumatico.\nBasti pensare che prima di guadagnare qualche soldo abbiamo passato qualche ora girovagando per lo spazio senza \n\nuna meta precisa e in ogni caso, anche dopo aver preso confidenza con i funzionamenti del gioco, ci siamo resi conto di \n\ncome esista una forte discrepanza tra i costi delle navi e dei potenziamenti (decisamente troppo alti) e i nostri guadagni. \n\nCiÃƒÂ² potrebbe benissimo rappresentare un senso di sfida non comune per tutti i fan dei titoli gestionali, ma siamo sicuri \n\nche l'avventore occasionale si farÃƒÂ  prendere dallo sconforto giÃƒÂ  dopo qualche ora di gioco e la vastitÃƒÂ  del mondo a \n\nnostra disposizione acuirÃƒÂ  ulteriormente questa sensazione di spaesamento.\n\nSINFONIE DALLO SPAZIO\nA parte ciÃƒÂ², dobbiamo ammettere che Ego Soft non ha lasciato nulla al caso. Le stesse sessioni di combattimento sono \n\nstate pensate con un approccio piÃƒÂ¹ arcade che simulativo e dopo aver preso confidenza con i comandi della nave, \n\nanche muoversi nello spazio si ÃƒÂ¨ rivelato abbastanza agevole a patto perÃƒÂ² di comandare il tutto con un joystick e non \n\ncon un mouse, il cui utilizzo non ÃƒÂ¨ stato preso quasi per nulla in considerazione dagli sviluppatori.\nAnche con un joystick gran parte delle operazioni dovranno perÃƒÂ² essere svolte con l'aiuto della tastiera e il consiglio ÃƒÂ¨ \n\ndi tenere sempre a portata di mano il manuale che indica nel dettaglio le quasi cinquanta (!) combinazioni di tasti \n\npreviste dal gioco. Avrete capito insomma come l'approccio al gioco non sia dei piÃƒÂ¹ immediati e semplici, ma questo era \n\ngiÃƒÂ  in conto e a favore del sistema di controllo va detto che alla fine non saranno piÃƒÂ¹ di dieci i comandi da utilizzare con \n\npiÃƒÂ¹ frequenza.\nA un gameplay cosÃƒÂ¬ ricco, unico e per certi punti di vista inclassificabile (manca giusto una sezione ruolistica per \n\navvicinarsi al gioco &quot;totale&quot;) Ego Soft ha abbinato una grafica e un sonoro di grande impatto. Le navi spaziali appaiono \n\ndettagliatissime e imponenti proprio come ce le immagineremmo e gli scenari spaziali, con quei colori e quel senso di \n\nprofonditÃƒÂ  infinita, sono tra i piÃƒÂ¹ belli e ricercati di sempre.\nI filmati di intermezzo non sono altrettanto riusciti, ma va detto che il loro numero e la loro utilitÃƒÂ  rimangono marginali \n\nnell'economia del gioco. Un piccolo appunto va fatto anche alla pesantezza del motore grafico. Se giocato a una \n\nrisoluzione alta con il bump mapping e l'antialiasing attivati abbiamo notato forti rallentamenti anche con configurazioni \n\nhardware di tutto rispetto e ciÃƒÂ² anche in situazioni non particolarmente affollate.\nOttimo anche il sonoro, che per partiture musicali e tipologia di effetti sonori ci ha ricordato molto un altro campione del \n\ngenere come Homeworld; i dialoghi non sono stati localizzati in italiano, ma sono comunque presenti i sottotitoli nella \n\nnostra lingua e il doppiaggio originale ÃƒÂ¨ su livelli sicuramente apprezzabili. E ora la parola passa al commento finale.\n\nCOMMENTO FINALE\nEd eccolo qui l'attesissimo erede di quell'Elite che esattamente vent'anni fa aveva scosso il mondo dei videogiochi con \n\nuna tale profonditÃƒÂ  e innovazione da essere considerato ancora oggi un classico senza tempo. X2: La Minaccia ci \n\nriporta proprio in quell'universo spaziale fatto di scambi commerciali, missioni da compiere e combattimenti da vincere \n\nche aveva sancito il successo di quel lontano capolavoro. Da questo punto di vista non possiamo far altro che \n\napplaudire senza mezzi termini il lavoro svolto da Ego Soft. Le cose da fare sono tantissime, la libertÃƒÂ  di azione \n\npressochÃƒÂ© illimitata e la linearitÃƒÂ  del tutto bandita. Potremo commerciare materie prime, acquistare fabbriche, diventare \n\npirati dello spazio o trasportare passeggeri a bordo della nostra nave, il tutto con una profonditÃƒÂ  di gioco e \n\nun'attenzione anche ai piÃƒÂ¹ piccoli dettagli degne di un capolavoro. L'altra faccia della medaglia rivela perÃƒÂ² una struttura \n\ndi gioco molto (forse troppo) impegnativa e una curva di apprendimento tra le meno agibili viste negli ultimi tempi. \n\nD'altronde che X2: la Minaccia non sarebbe stato un titolo per tutti giÃƒÂ  si sapeva, ma avremmo preferito un approccio \n\nmeno traumatico e, almeno per la parte iniziale, piÃƒÂ¹ guidato e meno caotico. Si tratta comunque di difetti relativi che per \n\ngli appassionati del genere possono anche diventare dei pregi, ma resta il fatto che non ci sentiamo di consigliare \n\nl'acquisto del gioco a chi non ha mai avuto troppa familiaritÃƒÂ  con tabelle di trading, potenziamenti di navi spaziali e via di \n\nquesto passo. X2: La Minaccia rimane infatti un gioco di nicchia, bello e appassionante (anche graficamente) per chi \n\navrÃƒÂ  voglia e tempo di esaminarlo in ogni suo anfratto, ma fin troppo ostico per il giocatore occasionale. A voi la scelta.\n\n:::-&gt;Scheda tecnica del Gioco&lt;-:::\n\nDimensione - 664 MB\nLingua -  Italiano\nVersione -  1.4\nGenere  Simulatore/Manageriale\nSviluppatore - EgoSoft\nData di uscita - 1/12/2003\nAnno - 2003\n\nRequisiti Minimi: Pentium III 800Mhz, 128MB RAM, Scheda 3D 32 MB, 1,1GB HD, Windows 98 SE,ME,2000,XP\nRequisiti Necessari: Pentium 4 2Ghz, 512MB RAM, Scheda 3D 128 MB compatibile Pixel Shader 2.0\nPrezzo al momento dell'uscita ufficiale: 49,90 euro","torrent":{"xt":"urn:btih:55a0a2fbe9dc49001415cc95dca77a49e5f087ad","amp;dn":"X2+La+Minaccia%2C+%5BSimulazione%2FManageriale+-+1CD+-+Ita%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55a0a2fbe9dc49001415cc95dca77a49e5f087ad","infoHashBuffer":{"type":"Buffer","data":[85,160,162,251,233,220,73,0,20,21,204,149,220,167,122,73,229,240,135,173]},"announce":[],"urlList":[]}}