{"title":"MONSTERSvs ALIENS..DVDrip[vice]","uid":5091676,"size":460999952,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:563953bf9f9ed82eff6beba6e786ef8badd0c941&amp;dn=MONSTERSvs+ALIENS..DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vicerock","files":-1,"time":1253199677,"description":"MONSTERS VS ALIENS DVDrip\n\nVIDEO CODEC     Xvid\nformat          avi\nsize/res        480x272[wide screen]\nruntime         94:21mins\nvideo bitrate   512\nvideo framerate 25\n\nAUDIO CODEC     mp3\naudio bitrate   128\nsample rate     4100\ninfo     123kb/s joint stereo\n\nPlot\n\nSusan Murphy (Reese Witherspoon) is hit by a meteorite on the day of her wedding to weatherman Derek Dietl (Paul Rudd), absorbing a substance called quantonium and growing into a giant. Alerted to the meteorite crash, the military arrive and capture Susan. She is labeled a monster, renamed &quot;Ginormica&quot; by the government, and sent to a top-secret prison facility headed by General W.R. Monger (Kiefer Sutherland) and containing other monsters: B.O.B. (Seth Rogen), a brainless, indestructible gelatinous blob; Dr. Cockroach, Ph.D. (Hugh Laurie), a mad scientist with the head and abilities of a cockroach; the Missing Link (Will Arnett), an amphibious fish-ape hybrid; and Insectosaurus, a colossal grub that is even larger than Susan. The monsters are forbidden to have any contact with the outside world; while the other monsters have been living contentedly with this lifestyle for the past 50 years, Susan feels incredibly isolated and wishes to return to her old life.\n\nAn alien named Gallaxhar (Rainn Wilson) detects the quantonium radiation emanating from Earth and deploys a gigantic robotic probe to find it and extract it from its source, Susan. After a botched attempt by the President of the United States (Stephen Colbert) to make first contact with the robot, it begins destroying everything in sight, resisting all conventional military force used against it. General Monger convinces the President to use the monsters to fight the robot instead. The monsters accept the mission with the promise of freedom if they succeed. Arriving in San Francisco, Susan is chased by the robot across the city to the Golden Gate Bridge, where the monsters are able to defeat the robot, Susan and Insectosaurus keeping it occupied while Dr. Cockroach sabotages it from inside and B.O.B. clears a path for the cars to evacuate (The Missing Link having been knocked out during the fight).\n\nNow free, Susan returns to her hometown and introduces her family and friends to the monsters, who are quickly rejected after innocently causing a panicked ruckus in the neighborhood. Derek, meanwhile, breaks up with Susan, claiming that he can't be married to someone who could overshadow his career. Initially devastated, Susan realizes that becoming a monster has improved her life, and fully embraces her new friends and lifestyle. Suddenly, she is abducted by Gallaxhar, who apparently kills Insectosaurus when he tries to save her. On Gallaxhar's spaceship, Susan breaks loose and chases Gallaxhar down, only to enter a machine that extracts the quantonium from her body, shrinking her to her normal size. Gallaxhar proceeds to use the quantonium to power a machine which clones him into an army so he can invade Earth.\n\nWith assistance from General Monger, B.O.B., Dr. Cockroach, and the Missing Link infiltrate Gallaxhar's spaceship, rescue Susan, and hot-wire the spaceship's power core, activating the spaceship's self-destruct sequence. However, during their escape attempt, Susan is cut off from her friends, who are trapped in the power core and tell her to save herself. Instead, Susan confronts Gallaxhar, who tries to escape with the quantonium, and attempts to force him into releasing her friends. When Gallaxhar says he cannot reverse the sequence, Susan takes the quantonium back and absorbs it, restoring her to her gargantuan size and allowing her to save her friends. The monsters leap out of the exploding spaceship and are rescued by General Monger on the back of the revived Insectosaurus, who had sealed his body in a cocoon and transformed into a giant butterfly.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0892782/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0892782/&lt;/a&gt;\n\n\nPLEASE SEED AND ENJOY THANKS   ","torrent":{"xt":"urn:btih:563953bf9f9ed82eff6beba6e786ef8badd0c941","amp;dn":"MONSTERSvs+ALIENS..DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"563953bf9f9ed82eff6beba6e786ef8badd0c941","infoHashBuffer":{"type":"Buffer","data":[86,57,83,191,159,158,216,46,255,107,235,166,231,134,239,139,173,208,201,65]},"announce":[],"urlList":[]}}