{"title":"Wondershare HD Video Converter v4.2.0.60+(patch) [Bit-Byte]","uid":5042012,"size":9359093,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:564aecbfae9769de2fbe8c45dc2d7ac8fc764f10&amp;dn=Wondershare+HD+Video+Converter+v4.2.0.60%2B%28patch%29+%5BBit-Byte%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ProDvDRipper","files":2,"time":1249418339,"description":"Wondershare HD Video Converter is the best High Definition Video Converter software which can convert among HD video formats, convert HD videos to SD videos and audios, convert SD (Standard-Definition) videos to HD video. This HD Video Converter supports wide range of HD videos including MOD, TOD, AVCHD (M2TS, MTS, M2T), TS, TP, TRP, H.264/AVC, MKV, HD WMV, MPEG-4 and Quick Time etc.\n\nThis HD Video Converter also gives you freedom to convert among versatile SD videos and audios. Besides, it provides you some amazing video editing functions which allow you to trim, crop, adjust effect, add watermark and subtitle etc to get your ideal video for playback on your portable media players such as iPod, Zune, PSP, Creative Zen, Archos, Xbox 360, iRive etc.\n\n\nKey Features\n\nProfessional-grade HD Video Converter and excellent SD video converter\nConvert HD videos and SD videos without any limitation\n\nSpecialized as AVCHD converter\nConvert camcorder AVCHD video (M2TS, MTS, M2T) to other HD video or SD video.\n\nFeatured as MOD, TOD Converter\nConvert Tapeless Camcorder Video MOD (JVC, Panasonic, Canon), TOD (JVC) to AVI, MP4, WMV etc.\n\nConvert videos to HD video\nConvert video to HD Video including HD ASF, HD AVI, HD MP4, HD MOV, HD WMV, HD MPG, HD VOB.\n\nConvert HD videos to SD videos/audios\nPerfectly convert HD videos including AVCHD (MTS, M2TS), M2T, TS, TP, TRP, H.264/AVC, MKV, HD Quick Time (*.mov) etc to SD (Standard-Definition) videos or audios.\n\nConvert between all standard videos\nConvert between various stand video formats including MP4, MOV, 3GP, AVI, WMV,MKV, RM, MPEG-1, MPEG-2, FLV, ASF, NSV and more.\n\nExtract audio from videos\n\nExtract audio from HD videos or SD videos to M4A, WMA, WAV, MP3, AAC, AC3, APE, MKA, OGG, AU, AIFF, FLAC etc.\n\nPowerful video editing\n\nEnjoy your lifestyle video with powerful video editing \u0013 Crop, Trim, Adjust effect, Add Watermark , Add subtitle etc\n\nCrop video\nCrop video to your ideal size by removing the black bars of video.\n\nTrim video files\nTrim your video files to get your desired video clips.\n\nAdjust video output effect\nMake your special video with special output effect like Gray, Emboss, Negative, Old film.\n\nAdd Watermark\nAdd text or image as watermark to personalize your video.\n\nProduce video with subtitle\nAdd plug-in subtitle in SRT format with .MKV as source file.\n\nPreview video with two real-time preview windows\n\nTwo real time preview windows let you compare and get the best video effects out of your movies.\n\nCustomizable output profiles for your every need\n\nConfigure an output profile such as Resolution, Frame Rate, Encoder and Bit Rate for every video or audio conversion you need.\n\n\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n\n\n\n\n*installation*\n\n1.Unpack with any archiver\n2.install setup.exe.\n3.copy and paste patch in the installer folder run\npatch below on the patch click patch done","torrent":{"xt":"urn:btih:564aecbfae9769de2fbe8c45dc2d7ac8fc764f10","amp;dn":"Wondershare+HD+Video+Converter+v4.2.0.60%2B%28patch%29+%5BBit-Byte%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"564aecbfae9769de2fbe8c45dc2d7ac8fc764f10","infoHashBuffer":{"type":"Buffer","data":[86,74,236,191,174,151,105,222,47,190,140,69,220,45,122,200,252,118,79,16]},"announce":[],"urlList":[]}}