{"title":"Mr. Magoo Cap.08","uid":5652517,"size":182732800,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:56531bb9b348874fcb4d98d94c762b194b94cab5&amp;dn=Mr.+Magoo+Cap.08&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"malagahuelin","files":1,"time":1277682700,"description":"Ã‚Â¿QuiÃƒÂ©n es Mr Magoo? NaciÃƒÂ³ en 1949. Bajito, narigÃƒÂ³n y especialmente miope, se las ingeniaba para salir airoso de todas las situaciones.\nDesde que apareciÃƒÂ³ por primera vez en 1949, Mr. Quincy Magoo fue bajito, calvorota y corto de vista. La base del humor de este hombrecito de nariz prominente fue, justamente, el ingenio que a lo largo de los aÃƒÂ±os puso en juego para sortear dificultades varias. Confundir semÃƒÂ¡foros con policÃƒÂ­as era un clÃƒÂ¡sico del personaje que por nada del mundo se quitaba el sombrero. AsÃƒÂ­ y todo, Magoo se las arreglÃƒÂ³ bastante bien. Sobrevivir a los desastres con una sonrisa y siempre con buen humor era su lema. Magoo podÃƒÂ­a ser torpe o estropear todo. Pero jamÃƒÂ¡s se daba por vencido. Nunca perdÃƒÂ­a el sentido del humor.\nEl personaje surgiÃƒÂ³ en United Productions of America (UPA), una productora de pelÃƒÂ­culas educativas que en 1948 firmÃƒÂ³ un contrato con Columbia Pictures para producir dibujos animados. UPA querÃƒÂ­a innovar con personajes humanos. Personas que pudieran reflejar lo que le pasa a todo el mundo: lograr objetivos por suerte, por chances. Pero no por trabajar sobre esos problemas, decÃƒÂ­a Stephen Bosustow, el presidente de la productora.\nA primera vista Magoo parecÃƒÂ­a tener todo en contra: bajito, narigÃƒÂ³n y miope. Pero sin embargo salÃƒÂ­a bien parado. Era cortÃƒÂ©s con las mujeres, amable con su madre (a MamÃƒÂ¡ Magoo le encantaba correr carreras de coches) y juguetÃƒÂ³n con su perro Mc Barker. AdemÃƒÂ¡s de la mascota, aparecieron en los capÃƒÂ­tulos televisivos su inseparable sobrino Waldo y el hamster Hamlet. Cuando despuntaba la dÃƒÂ©cada del 50 se transformÃƒÂ³ en un buen elemento de marketing. La compaÃƒÂ±ÃƒÂ­a de electrodomÃƒÂ©sticos General Electric lo eligiÃƒÂ³ como modelo para su campaÃƒÂ±a de lamparitas, bajo el slogan &quot;Ver es mÃƒÂ¡s fÃƒÂ¡cil con lamparitas G.E., las mejores&quot;. AsÃƒÂ­, el hombrecito del saco largo fue ganando popularidad. En la TV tuvo sus especiales (en la cadena CBS), donde protagonizaba roles de personajes famosos de novelas clÃƒÂ¡sicas. Fue Cyrano, Long John Silver, Rip Van Winkle y el TÃƒÂ­o Sam, el rol que le permitiÃƒÂ³ reÃƒÂ­rse y a la vez repasar la historia de los Estados Unidos.\n\n","torrent":{"xt":"urn:btih:56531bb9b348874fcb4d98d94c762b194b94cab5","amp;dn":"Mr.+Magoo+Cap.08","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56531bb9b348874fcb4d98d94c762b194b94cab5","infoHashBuffer":{"type":"Buffer","data":[86,83,27,185,179,72,135,79,203,77,152,217,76,118,43,25,75,148,202,181]},"announce":[],"urlList":[]}}