{"title":"Cassie - Me &amp; U","uid":5089317,"size":125095940,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:566b089afcbf62a70febb371a3ec02456e677eb1&amp;dn=Cassie+-+Me+%26+U&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1253000632,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Me &amp; U&quot; is a song by Cassie, and produced by Ryan Leslie for her eponymous debut album, Cassie (2006). It was released as the album's first single in 2005 and reached number three on the U.S. Billboard Hot 100 in 2006. It remained in the top forty for nearly five months.\n\nThe song's &quot;Bad Boy&quot; remix features Sean &quot;Diddy&quot; Combs and Yung Joc and the song's &quot;The Inc&quot; remix features Ja Rule and Harry-O. The single has been a successful debut as a top three single in the U.S., a top five single in New Zealand, a top ten hit in the United Kingdom, Ireland, and France, and a top twenty song in Australia. A remix featuring Ray-J was also created. There are also remixes featuring Ryan Leslie, Young Blaze, The Ying Yang Twins, Streetz &amp; Young Deuces, Maino, Dons &amp; Tricosta, Lil Fizz, and a club dance version featuring 50 Cent.[citation needed] This song is featured on DANCE! Online, a multiplayer online casual rhythm game.\n\nThe single was certified platinum by the RIAA on December 14, 2006.\n\nIn the music video, Cassie comes in with her phone which is playing part of the chorus to &quot;Me &amp; U&quot; while improvising some lyrics that were not in the original song. She puts the song on and begins to dance and sing along, hurting herself while doing a spinning move, changing her outfit, and then being able to successfully complete the spinning move later on. The video is directed by Norwegian-born director Ray Kay.\n\nThe single became Cassie's most popular single to date, peaking at number three on the Billboard Hot 100 a short while after the song was released. It also reached the top of the Hot R&amp;B/Hip-Hop Songs chart. In the UK, the song entered the UK Singles Chart at number twenty-three and, within a week's time, rose to and peaked of number six, remaining there for a week before dropping down to number nine. The song also did well around the rest of Europe, including France, Germany, and Ireland.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:566b089afcbf62a70febb371a3ec02456e677eb1","amp;dn":"Cassie+-+Me+%26+U","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"566b089afcbf62a70febb371a3ec02456e677eb1","infoHashBuffer":{"type":"Buffer","data":[86,107,8,154,252,191,98,167,15,235,179,113,163,236,2,69,110,103,126,177]},"announce":[],"urlList":[]}}