{"title":"R-Drive Image 4.7 build 4708 Portable","uid":5586335,"size":21411393,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:56aff90f4adb98c021071b60512691ea33cf03f5&amp;dn=R-Drive+Image+4.7+build+4708+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NoExcuses","files":4,"time":1274710283,"description":"R-Drive Image Corporate 4.7 Build 4708 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Key are included...\n\n\nR-Drive Image 4.7 is a potent utility providing disk image files creation for backup or duplication purposes. A disk image file contains the exact, byte-by-byte copy of a hard drive, partition or logical disk and can be created with various compression levels on the fly without stopping Windows OS and therefore without interrupting your business. These drive image files can then be stored in a variety of places, including various removable media such as CD-R(W)/DVD, Iomega Zip or Jazz disks, etc.\n\nR-Drive Image restores the images on the original disks, on any other partitions or even on a hard drive's free space on the fly. To restore system and other locked partitions R-Drive Image is switched to the pseudo-graphic mode directly from Windows or bootable version created by the utility is launched from CD disc or diskettes.\n\nUsing R-Drive Image, you can completely and rapidly restore your system after heavy data loss caused by an operating system crash, virus attack or hardware failure. You can also use R-Drive Image for mass system deployment when you need to setup many identical computers. In other words, you can manually setup one system only, create an image of the system, and then deploy it on all other computers, saving your time and costs. If you need to restore only certain files from a disk image, you can connect that image as a virtual disk and copy those files directly from the disk image using Windows Explorer or any other file utility.\n\nR-Drive Image is one of the best backup and disaster recovery solutions to prevent losing your data after a fatal system failure. \n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.drive-image.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.drive-image.com/&lt;/a&gt;\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\nThis also has been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista/W7 machine. It's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:56aff90f4adb98c021071b60512691ea33cf03f5","amp;dn":"R-Drive+Image+4.7+build+4708+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56aff90f4adb98c021071b60512691ea33cf03f5","infoHashBuffer":{"type":"Buffer","data":[86,175,249,15,74,219,152,192,33,7,27,96,81,38,145,234,51,207,3,245]},"announce":[],"urlList":[]}}