{"title":"TVO - The Agenda with Steve Paikin, May 15, 2009: W(h)ither the ","uid":5100627,"size":120496671,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:56b33cbb4448f071cd564f4b92a10910278b4cd8&amp;dn=TVO+-+The+Agenda+with+Steve+Paikin%2C+May+15%2C+2009%3A+W%28h%29ither+the+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Temptation","files":1,"time":1253956340,"description":"TVO - The Agenda - May 15, 2009 - W(h)ither the United States\n\n[b]TVO - The Agenda with Steve Paikin, May 15, 2009: W(h)ither the United States?[/b]\n\n[u]The Debate: W(h)ither the United States?[/u]\n\nThe Obama administration's emerging foreign policy: mea culpa or managing the relative decline of American power?\n\n[u]Guests:[/u]\n\nAndrew Bacevich is professor of international relations at Boston University, and author of The Limits of Power: The End of American Exceptionalism.\n\nPeter Beinart is a senior fellow with the Council on Foreign Relations, and a columnist for the Washington Post.\n\nWenran Jiang is an associate professor of political science and Mactaggart research chair of the China Institute at the University of Alberta. He is a senior fellow with the Asia Pacific Foundation of Canada, and an online columnist for Business Week.\n\nSergei Plekhanov is an associate professor in the Department of Political Science at York University.\n\nJanice Stein is TVO's international affairs analyst, the Belzberg professor of Conflict Management in the Department of Political Science and the director of the Munk Centre for International Studies at the University of Toronto.\n\nFor more information on this episode, including information on the guests and various other resources and links, visit the [url=http://www.tvo.org/cfmx/tvoorg/theagenda/index.cfm?page_id=7&amp;bpn=779513&amp;ts=2009-05-15%2020:00:35.0]episode webpage[/url]\n\n-----\n\nNote:  This is an iPod video podcast that is available for free download from the website.  Quality is good.  Audio podcasts (mp3 format) are also available for free download for the individual segments.    \n\nType: mp4 file\nSize: 114MB\nRuntime: 00:54:27\nVideo: MPEG4 Video (H264) 320x240 \nAudio: AAC 32000Hz mono 48Kbps \n\nDownload this episode using the attached torrent file or download it directly using this link: &lt;a href=&quot;\nhttp://feeds.tvo.org/~r/tvo/TxZN/~5/M9G96kY7weU/TAWSP_Dbt_20090515_779513_0_320x240_304k.mp4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://feeds.tvo.org/~r/tvo/TxZN/~5/M9G96kY7weU/TAWSP_Dbt_20090515_779513_0_320x240_304k.mp4&lt;/a&gt;\n\nYou can also watch a flash video of this episode through your web-browser here: &lt;a href=&quot;\nhttp://www.tvo.org/cfmx/tvoorg/theagenda/index.cfm?page_id=7&amp;bpn=779513&amp;ts=2009-05-15%2020:00:35.0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tvo.org/cfmx/tvoorg/theagenda/index.cfm?page_id=7&amp;bpn=779513&amp;ts=2009-05-15%2020:00:35.0&lt;/a&gt;\n\n-----\n\nAndrew Bacevich is that rare breed in American political discourse: a principled conservative who stands out in stark contrast to themonstrosity and demonstrably incoherent, unprincipled ideology that is American conservatism, sometimes labelled libertarianism[/url], of the Reagan revolution and Republican party variety, which is mostly a racist, &quot;God Bless America and kill the darkies abroad!!&quot; screeching, anti-government, anti-tax, corporate-and-private-power-worshipping philosophy.  It is an ideology that hypocritically preaches incessantly about &quot;limited government&quot; [url=http://www.salon.com/opinion/greenwald/2009/09/14/resentment/index.html]but which is anti-government and anti-state only when it comes to social programs for the poor, the weak, the powerless and minorities[/url], and whose criticisms of expansive government, coercive state-power, and executive and federal power overreach are notably absent when it comes to the expansion of the domestic police state and of [url=http://www.salon.com/opinion/greenwald/2009/09/03/afghanistan/]the grotesque, weapons-of-mass-destruction-producing and mass-murdering apparatus that is the expansive American military establishment, American imperial power-structure and the National Security State[/url].\n\nIt is quite revealing to see a principled conservative like Andrew Bacevich arriving to very similar conclusions about American power, imperialism and foreign policy as someone from the left, such as Noam Chomsky.\n\n[b]Resources and links to related material[/b]\n\n1) [url=http://www.salon.com/opinion/feature/2009/04/30/bacevich/index.html]Farewell to the American Century by Andrew Bacevich:[/url]\n\nAmericans have perpetuated a mythic version of the past that never even approximated reality and today has become downright malignant.\n\n2) Andrew Bacevich on PBS Bill Moyer's Journal: http://www.pbs.org/moyers/journal/08152008/watch.html\n\n3) [url=http://www.salon.com/opinion/greenwald/2009/09/03/afghanistan/]Glenn Greenwald - The looming political war over Afghanistan[/url]\n\n4) [url=http://www.salon.com/opinion/greenwald/2009/09/21/iran/index.html]Glenn Greenwald - Our war-loving Foreign Policy Community hasn't gone anywhere[/url]\n\n5)\n\n-----\n\n[b]TVO - The Agenda with Steve Paikin[/b]\n\n[i]The Agenda with Steve Paikin[/i] is TVO's flagship current affairs program - devoted to exploring the social, political, cultural and economic issues that are changing our world, at home and abroad. The Agenda airs weeknights at 8:00 PM EST on TVO - Canada's largest educational broadcaster.\n\nTVO's [i]The Agenda with Steve Paikin[/i] website:  [url]http://www.tvo.org/agenda/[/url]\n\n\n","torrent":{"xt":"urn:btih:56b33cbb4448f071cd564f4b92a10910278b4cd8","amp;dn":"TVO+-+The+Agenda+with+Steve+Paikin%2C+May+15%2C+2009%3A+W%28h%29ither+the+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56b33cbb4448f071cd564f4b92a10910278b4cd8","infoHashBuffer":{"type":"Buffer","data":[86,179,60,187,68,72,240,113,205,86,79,75,146,161,9,16,39,139,76,216]},"announce":[],"urlList":[]}}