{"title":"Rush - Feedback (2004) [FLAC] -  {troma}","uid":5131006,"size":205587907,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:57287bc51d53d652f4b994bbb8df08f47e9dae24&amp;dn=Rush+-+Feedback+%282004%29+%5BFLAC%5D+-++%7Btroma%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tromaster","files":16,"time":1256059724,"description":"Rush - Feedback\n\n\nThom Jureck from Allmusic comments:\n\nThis is a riot! Rather than put out some windy and dreary box set to celebrate their 30th anniversary, Canada's seminal power prog band and one of big rock's most enduring units turns the tables and lays out hot and heavy covers of eight classics from the annals of rock &amp; roll history. The track list is amazing, and the cool thing is that the arrangements of these nuggets are not all ripped up and mutated, either. &quot;Summertime Blues&quot; may begin as a nod to Jimi Hendrix's &quot;Foxy Lady&quot;, but it comes roaring back as an acknowledged homage to the Who's Live at Leeds version. The version of Stephen Stills' &quot;For What It's Worth&quot; begins as a slippery little acoustic tune but quickly turns into a heavy, droning rock orgy. &quot;The Seeker&quot; goes for the jugular in the same way that the Who's did; Geddy's sneer has a little less contempt than Daltrey's but it's just as hungry and desperate. &quot;Heart Full of Soul&quot; is pure psychedelic Yardbirds elegance with a bunch of space and dimension added to redeem the track for the 21st century. The backmasked guitars on &quot;Mr. Soul&quot; and Neil Peart's deliberate mix of thud and snap give the cut a solid footing for Alex Lifeson to unhurriedly coax Lee's vocal along the lyric. The ringing of Lifeson's chords that barely hold this side of overblown feedback is masterful in keeping the original spirit of the song while future-dating its sonics. Rush's read of &quot;Seven and Seven Is&quot; is much faster than Love's original, but its barely-on-the-rails tempo is welcome in lieu of the fact that these guys are all in their fifties and play like they're kids. &quot;Shapes of Things to Come&quot; is fun, and a real attempt to provide nuance to a great song, especially the cross-channel fading in the guitar mix. But on &quot;Crossroads&quot;, the other bookend of this EP, Rush give a romper-stomper wailing performance of Cream's arrangement of Robert Johnson's seminal blues tune. Lifeson leaves Eric what's-his-name in the dust. Lee may not be the vocalist that Jack Bruce is but he kicks his ass as a bass player, and his moment of glory in this cut tears the roof off the song. None of these tunes are done with an ounce of camp. What the listener encounters is a Rush that has never ever been heard before: they indulge in the hero-worship and dream roots of the garage band that eventually became Rush, and they simultaneously search for the young garage band whose members never dreamed they'd be playing these tunes 30 years later as Rush. Anyone who thinks that there is no life left in the classics of the genre needs to hear this. That something this wild and freewheeling could only be pulled off by a band with 30 years experience is not only worth noting, but celebrating.\n\nTracklist:\n01. Summertime Blues\n02. Heart Full of Soul\n03. For What It's Worth\n04. The Seeker\n05. Mr. Soul\n06. Seven and Seven Is\n07. Shapes of Things\n08. Crossroads\n\nThe musicians:\nGeddy Lee - bass guitar, vocals\nAlex Lifeson - guitars (electric, acoustic, mandola)\nNeil Peart - drums and cymbals\n\nRecorded at Phase One Studios, Toronto, Canada, between March and April 2004.\nReleased on 29 June 2004.\nProduced by David Leonard and Rush.\nLabel: Anthem/Atlantic.\nGenre: Progressive rock.\n\n\nRipped with EAC in Secure mode, Test &amp; Copy.\nEncoded with FLAC Frontend at level 8, with full tagging.\nIncludes artwork, EAC CUE and LOG files, AudioChecker log, and NFO file.\n\nBe fair &amp; share!\n","torrent":{"xt":"urn:btih:57287bc51d53d652f4b994bbb8df08f47e9dae24","amp;dn":"Rush+-+Feedback+%282004%29+%5BFLAC%5D+-++%7Btroma%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57287bc51d53d652f4b994bbb8df08f47e9dae24","infoHashBuffer":{"type":"Buffer","data":[87,40,123,197,29,83,214,82,244,185,148,187,184,223,8,244,126,157,174,36]},"announce":[],"urlList":[]}}