{"title":"For All the Drifters","uid":5036553,"size":178322309,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:575bfdfb4b47c1d8b4f4f77f1b7c1fb0964014ed&amp;dn=For+All+the+Drifters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ephilei","files":38,"time":1249151670,"description":"Perfect Machine EP\nFor All the Drifters (self-titled)\n20 misc tracks\n\nSeveral members have now created Paper Route\n\nKen Scruggs / Sensored Magazine / May 26th 2004\n\nFor All the Drifters began their journey in the creation of music at a midwest college in Greenville, IL, in the fall of 2000. Using their energetic, original sound, the five-member band discovered and won over new blood with every passion-filled performance. A year later, with numerous successful shows and a nice following under their belts, they decided to move to Nashville to continue winning hearts and to make contact with like-minded musicians and artists.\n\nHaving previously released a full length LP and two EP's, For All the Drifters went back into the studio, on their own dime, to lay down fresh ideas. &quot;We're sort of looking at this EP as the one that will really establish who we are,&quot; says singer JT Daly. &quot;Our goal is to capture the heart and energy that we are known for, while pushing ourselves as much as we can in the process.&quot; This time around they enlisted the ears of producer Matt Goldman, of Copeland and Dennison Mars fame.\n\nAfter holing up for eight days last year at Atlanta's In the Dark Studios, For All the Drifters churned out an EP that has, in fact, put definite features on the face of an already talented band. Their new self-titled EP is a small opus in and amongst itself. Their display of intensely moving music mixed with equally inspiring and heartfelt lyrics create a mysterious feel to their music. It's what you get if U2, Switchfoot, and Jeff Buckley were to come together as one. &quot;No Place to Go,&quot; a particular favorite, causes an unexplainable excitement to take over. Another favorite, &quot;Evening Meets the Dawn,&quot; is an anthem that delivers a &quot;dose of okay&quot; to any listener.\n\nThere is only one thing wrong with this release - it's only a six song EP. For All the Drifters have created with this EP what many artists strive to do when releasing a full length LP, which is to have the listener not take it out of the player. For All the Drifters have defiantly made their voice heard with this release and you would be the unfortunate not to hear it for yourself.\n\nFor All the Drifters are:\nJT Daly - vocals, pianet, Casio\nChad Howat - bass, piano, V50\nBrian Lee - guitars, therumin, organ\nRyan Young - drums\nAndrew Smith - vocals, guitar\n\n&quot;It is boldy apparent that when For All The Drifters take the stage, the connection with the audience is immediate.&quot; -- Paul Goodenough, The Papyrus","torrent":{"xt":"urn:btih:575bfdfb4b47c1d8b4f4f77f1b7c1fb0964014ed","amp;dn":"For+All+the+Drifters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"575bfdfb4b47c1d8b4f4f77f1b7c1fb0964014ed","infoHashBuffer":{"type":"Buffer","data":[87,91,253,251,75,71,193,216,180,244,247,127,27,124,31,176,150,64,20,237]},"announce":[],"urlList":[]}}