{"title":"Efter.BrÃƒÂ¶llopet_2006_SWESUB_DVDRip_XviD","uid":5044173,"size":734160193,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:579fe068ec5450218cf8a0f29e0a80363d84c851&amp;dn=Efter.Br%C3%83%C2%B6llopet_2006_SWESUB_DVDRip_XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FF_hightopper","files":-1,"time":1249543640,"description":"Jacob Pederson lives in shanty surroundings in Bombay, India, and assists in the running of Anand \n\nOrphanage and School. He had attempted a number of projects to assist orphans, including child \n\nprostitutes - all quite in vain. He has adopted a young male orphan, Pramod, and takes special care of \n\nhim. With growing pressure on the facilities, which is on the verge bankruptcy, the orphanage receives \n\nan offer of funding from wealthy Danish citizen, Jorgen, which may put an end to it's problems. In \n\norder to obtain the monies, Jacob must travel to Copenhagen, meet with Jorgen, get financial \n\nassistance, and be back to celebrate Pramod's 8th birthday. He sets forth, is received by Christina \n\nRefner, an employee and future son-in-law of Jorgen. Jacob is shown all possible courtesy and even \n\nhoused in a posh apartment. He subsequently meets with Jorgen, shows him video-tapes and submits that a \n\nfew Kroner could really save several lives which would otherwise succumb to minor illnesses and \n\ninfections. Jorgen views the videos, but does not display much interest. He invites Jacob to attend his \n\ndaughter's wedding. Jacob does attend the ceremony, is introduced to Helene, Jorgen's wife; the bride, \n\nAnna; and Jorgen's twins - Martin and Morten. After the wedding ceremony, Christian makes a speech. \n\nQuite unconventionally, Anna also decides to make a speech - it is this speech that will shatter \n\nJacob's world, slowly make him realize that this invitation to Copenhagen was a ploy to not only \n\nensnare him but also prevent him from returning to India.\n","torrent":{"xt":"urn:btih:579fe068ec5450218cf8a0f29e0a80363d84c851","amp;dn":"Efter.Br%C3%83%C2%B6llopet_2006_SWESUB_DVDRip_XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"579fe068ec5450218cf8a0f29e0a80363d84c851","infoHashBuffer":{"type":"Buffer","data":[87,159,224,104,236,84,80,33,140,248,160,242,158,10,128,54,61,132,200,81]},"announce":[],"urlList":[]}}