{"title":"Kings_Of_Modesty_-_Hell_Or_Highwater_-_2009-RMT","uid":5116263,"size":96601717,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:57b4759b221a714a0e79d04f1b06b100a8f46dad&amp;dn=Kings_Of_Modesty_-_Hell_Or_Highwater_-_2009-RMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CD-Uploader","files":13,"time":1255085307,"description":"Kings_Of_Modesty_-_Hell_Or_Highwater_-_2009-RMT\n\n\nGenre: Progressive Metal / Finland 2009\nRunning Time: 50.38 92,1 mb\nLabel: Escape Music\n\n\n\n\n01. Never Touched The Rainbow\n02. Hourglass\n03. Deep Down\n04. Staring Eyes\n05. Hell Or Highwater\n06. Suicidal Mission\n07. Once Upon A Time\n08. Tailspin\n09. We Will March Our Way\n10. Miracle\n11. Two Hearts Collide\n\n\n\nArtist Bio : \nKings of Modesty has a long history, which stems back to the year 1994 when the band was formed by guitarist Samuel Hjelt and drummer Raino Simoinen. They asked their friend Henrik Tuura to play bass and Samuel's older brother Mikael to play keyboards. The band originally took the name of &quot;Face of Modesty&quot;.\n\nFour years ago and after few lead singers other band members asked their old friend Jason Flinck to join their band as a lead singer and hence the current line-up was born. The band also changed their name to Kings of Modesty at the very same time as Jason joined the band. Kings Of Modesty is a band which has gained a lot of attention by gigging successfully around Finland and Switzerland with many well-known artists.\n\nAlthough Kings Of Modesty hasn't released any records earlier it's members do have a lot of experience in music: Jason Flinck plays bass and sings backing vocals in the band Brother Firetribe which is a sideproject with NIGHTWISH -guitarist Emppu Vuorinen and LEVERAGE-singer Pekka Heino. Samuel Hjelt is former guitarist from the band called Ancara in which he did two albums before concentrating in Kings Of Modesty.\n\nSo Kings of Modesty has been continuing a successful gigging circuit until the band wanted to start working to release their excellent music in 2007 when Emppu Vuorinen, a guitarist of NIGHTWISH and a close friend to Kings of Modesty helped the band to produce their promo EP. This included four brilliant songs: &quot;Suicidal Mission&quot;, &quot;Staring Eyes&quot;, &quot;Tailspin&quot; and &quot;Miracle&quot;. Emppu also gave his visions into production and thus the promo EP was recorded at Emppu's E-Major studios in 2007.\n\nThe Promo EP gained a lot of interest and &quot;Miracle&quot; was played by several radiostations in USA. The band continued working hard and in the autumn of 2008 Samuel Hjelt and Jason Flinck started producing the debut album by Kings Of Modesty. During the long months of autumn and winter new material was written and by the June of 2009 the debut album &quot;Hell Or Highwater&quot; with 11 fantastic songs finally saw daylight.\n\nAlong with the new material Kings Of Modesty decided to appoint a manager to administer band's business and hence Jere Putkisaari joined the crew in spring of 2009. By that time Kings Of Modesty had achieved a lot of interest and started negotiations with several record labels and after a while the band decided to sign a deal with Escape Music Ltd represented by Khalil Turk. &quot;Hell Or Highwater&quot; is due to be released in all over Europe in 25th of September 2009.\n\nThe songs of coming debut were noticed immediately; although the album hadn't been released yet, the opening track &quot;Never Touched The Rainbow&quot; has already been played in radio stations in Europe.\n\nAll songs has been written and produced by Samuel Hjelt and Jason Flinck except songs &quot;Staring Eyes&quot;, &quot;Suicidal Mission&quot; and &quot;Miracle&quot; in which Raino Simoinen, Henrik Tuura and Mikael Hjelt also participated in producing. Mikael Hjelt has also participated producing in songs &quot;Deep Down&quot; and &quot;Two Hearts Collide&quot;.\n\n&quot;Hell or Highwater&quot; was mixed by LEVERAGE-guitar wizard Torsti Spoof and Jari Mikkola at the Studio Audio and mastered in Finnvox Studios by Mika Jussila who has mastered also Nightwish Albums. Cover art was created by LEVERAGE-drummer Valtteri Revonkorpi and Photos were taken by Kari &quot;Carda&quot; Helenius.\n\nKings of Modesty are a band destined to go places and their debut album is crammed full of exciting melodies. The highlight of 2009! ","torrent":{"xt":"urn:btih:57b4759b221a714a0e79d04f1b06b100a8f46dad","amp;dn":"Kings_Of_Modesty_-_Hell_Or_Highwater_-_2009-RMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57b4759b221a714a0e79d04f1b06b100a8f46dad","infoHashBuffer":{"type":"Buffer","data":[87,180,117,155,34,26,113,74,14,121,208,79,27,6,177,0,168,244,109,173]},"announce":[],"urlList":[]}}