{"title":"Desktop Icon Toy v4.0","uid":5117239,"size":2157499,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5805eaf8109082d5ffc160dab57f7a30dc1d4114&amp;dn=Desktop+Icon+Toy+v4.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"log_in","files":4,"time":1255124058,"description":"upload at virustotal\nresults: 92.68% clean (3/41)\nreason: keygen\n_________\n\n    You can arrange your desktop icons into many complex figures and shapes, like a:\n\n        * Clock (all the icons will be aligned as a analog clock, showing the exact time).\n        * 4-pointed, 5-pointed, or 6-pointed Stars, a Cross, and all kinds of Hearts.\n        * Horizontal or Vertical Ellipse, Spiral, and Circle.\n        * Triangle, Rhombus, Pentagon, Hexagon, and many many Shapes.\n        * Align desktop icons to the left, right, top or bottom.\n        * Neaty Around all the Edges.\n\n\n    Of course, not only that, you could also:\n\n        * Arrange icons precisely with:\n              o &quot;CTRL&quot; + &quot;Arrow Key&quot;, which moves an individual icon in that direction by one pixel.\n              o &quot;ALT&quot; + &quot;Arrow Key&quot;, which moves an individual icon in that direction by ten pixels.\n        * Customize the layout by changing the order of the icons such as placing &quot;My Computer&quot; as the last one, sorting icons by name, or changing the start position of the first icon.\n\n    * Save Desktop Icon Position\n\n    Would you always work on different screen2 resolutions? Is your desktop icon's layout always messed up?\n\n    Desktop Icon Toy can save desktop icon layout for different screen2 resolutions, and it will automatically repostion and restore the proper layout when the screen2 resolution has been changed.\n\n    You can also save multiple layouts by different layout names. \n\n    * Mouse Gesture\n\n    Desktop Icon Toy also supports Mouse Gesture. You can simply hold down the left mouse button in the empty area of desktop, and then move mouse to right (left, top or bottom) and release it. All icons will be arranged to right (left, top or bottom).\n\n    More features can be configured in option panel. \n\n    * Animate Desktop Icons\n\n    With Desktop Icon Toy, you could make cool effects.\n\n        * Hover your mouse cursor over an icon to make it dance.\n        * Drag the icons at different speeds and drop them at another location and they will:\n              o Race around the desktop at blinding speed or a snails pace.\n\n    * Remove Desktop Icon Texts\n\n    Usually, you could easily identify different programs by their icons and positions on desktop.\n    However, (as I suspect you do) you may have many icons cluttering your desktop,\n    and as you can see, it has become very slow to refresh the desktop.\n\n    Now, you could remove the classic ugly text below the desktop icons, and replace it with a cool customized pop-up tooltip which contains the full text. NOT, just the limited text that normally appears.\n\n    Miraculously, this will significantly improve the performance when refreshing your desktop,\n    and your desktop will finally become very neat and tidy; more like a window on the world that you expected. \n\n    * Show/Hide Desktop Icons or Desktop Icon Texts on Demand\n\n          o Have you chosen a favorite picture as your wallpaper?\n          o Do you have a little regret as desktop icons covered up your wallpaper?\n          o Do you wish to show/hide your desktop icons or desktop icon texts on demand?\n\n\n    With Desktop Icon Toy, your desktop icons or desktop icon texts could be always hidden, and would only be shown when you really need them. (Such as click desktop, mouse over desktop or over desktop icons.)\n\n    Now, you will always enjoy your beautiful wallpaper. \n\n    * Lock Desktop Icons\n\n    Besides saving and restoring the layout your icons, Desktop Icon Toy allows you to also lock the desktop icons.\n    (Don't worry about carelessly moving your icons again.) \n\n    * Swap Desktop Icons in Primary Monitor\n\n          o Do you have multiple monitors?\n          o Do you frequently switch between single monitor and multiple monitors?\n          o Have you frustrated by frequently arranging the icons druing switch of monitors?\n\n\n    With Desktop Icon Toy, you can always keep icons in the layout of multiple monitors. If you switch in single monitor mode,\n    you still could swap secondary monitor icons in primary monitor, which allow you to access them temporarily.\n\n    * Change Desktop Icon Size\n\n    If you are tired of the small desktop icons, now you can\n\n        * Resize them and make them bigger, like:\n              o 48x48\n              o 64x64\n              o 128x128\n\n    * Place Desktop Notes\n\n    Would you like to stick some notes on your desktop?\n\n    With Desktop Icon Toy, you could add a note for any icons. It will be displayed when you hover the mouse over the icon.\n\n    You could also embed the HTML tags into the note to enrich its appearance.\n\n    * Change Desktop Icon Text Color\n\n    Sometimes you change to use a beautiful wallpaper, but maybe hard to see your desktop icon text again as its default color is similar to your wallpaper. Even more there will be an ugly background under the test.\n\n    With Desktop Icon Toy, you can change the desktop icon text or background to any color.\n\n    You can also make the background of desktop icon text transparent.\n\n    * More Features\n\n        * Remove all desktop icons, and only keep the icon texts.\n        * Change desktop icons to small mode,\n          (all the icons will become small, and icon texts will be placed on the right of icons.)\n        * Remove desktop icon shortcut overlay.\n        * Activate desktop icons using single mouse click.\n        * Automatically select icon when mouse hovers over an icon.\n\n\n_________\n\nHow to install:\n1) Install \t\t\n2) use keygen (in sandboxie preferably)\n________\n\nPlease seed and comment.","torrent":{"xt":"urn:btih:5805eaf8109082d5ffc160dab57f7a30dc1d4114","amp;dn":"Desktop+Icon+Toy+v4.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5805eaf8109082d5ffc160dab57f7a30dc1d4114","infoHashBuffer":{"type":"Buffer","data":[88,5,234,248,16,144,130,213,255,193,96,218,181,127,122,48,220,29,65,20]},"announce":[],"urlList":[]}}