{"title":"Osho - Philosophia Perennis Vol 2 Dis 11","uid":5109479,"size":4600381440,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:58d9dd499a6e05dba76f76c2b9416c539b87497b&amp;dn=Osho+-+Philosophia+Perennis+Vol+2+Dis+11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DhyanDeepak","files":-1,"time":1254649932,"description":"Philosophia Perennis, Vol 2\nChapter #11\nChapter title: Only God Is\n10 January 1979 am in Buddha Hall\n\n\tArchive code: \t7901100\n\tShortTitle: \tPEREN211\n\tAudio: \tYes\n\tVideo: \tYes\n\tLength: \t101 mins\n\n\n... THAT THESE UNFORTUNATES SEEK AFAR THE GOODNESS WHOSE SOURCE WITHIN THEY BEAR.\n\nFOR FEW KNOW HAPPINESS: PLAYTHINGS OF THE PASSIONS, HITHER; HITHER TOSSED BY ADVERSE WAVES, UPON A SHORELESS SEA, THEY BLINDED ROLL, UNABLE TO RESIST OR TO THE TEMPEST YIELD.\n\nGOD! THOU COULDST SAVE THEM BY OPENING THEIR EYES.\n\nBUT NO: 'TIS FOR THE HUMANS OF A RACE DIVINE TO DISCERN ERROR, AND TO SEE THE TRUTH.\n\nNATURE SERVES THEM....\n\n... THOU WHO FATHOMED IT. O WISE AND HAPPY MAN, REST IN ITS HAVEN. BUT OBSERVE MY LAWS, ABSTAINING FROM THE THINGS WHICH THY SOUL MUST FEAR, DISTINGUISHING THEM WELL; LETTING INTELLIGENCE O'ER THY BODY REIGN.\n\nSO THAT, ASCENDING INTO RADIANT ETHER, MIDST THE IMMORTALS, THOU SHALT BE THYSELF A GOD.\n\nTHE LAST SUTRAS OF PYTHAGORAS ON PERFECTION.... The first thing to be remembered: that perfection is not a goal. No enlightened person has ever been goal-oriented; he cannot be. Goal-orientation is the way of the mind. Mind exists through goals, mind exists in the future, mind exists in ambition. Mind is always an achieving mind.\nThe enlightened person lives in no-mind. No-mind is enlightenment. Hence, the enlightened one cannot be goal-oriented; he has no future, for him all is present. And that's why he's continuously misunderstood. He talks of the present but people hear him through their minds, and minds immediately distort. Minds immediately change it into a goal, into some idea that has to be achieved in the future...","torrent":{"xt":"urn:btih:58d9dd499a6e05dba76f76c2b9416c539b87497b","amp;dn":"Osho+-+Philosophia+Perennis+Vol+2+Dis+11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58d9dd499a6e05dba76f76c2b9416c539b87497b","infoHashBuffer":{"type":"Buffer","data":[88,217,221,73,154,110,5,219,167,111,118,194,185,65,108,83,155,135,73,123]},"announce":[],"urlList":[]}}