{"title":"Cher - Perfection (Live)","uid":5098361,"size":232110084,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:58e1674fa13fdfd4a0c714fb3eb79bda712dc01d&amp;dn=Cher+-+Perfection+%28Live%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1253766060,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nIn 1987-1988, after firmly establishing herself as one of filmdom's most sought-after actresses, the multifaceted Cher staged a highly successful musical comeback with her rock &amp; roll-leaning album Cher. The album scored a Top Ten hit with her version of the Michael Bolton power ballad &quot;I Found Someone&quot; (previously a minor hit for Laura Branigan), a Top 20 hit with the biting, Bon Jovi-penned &quot;We All Sleep Alone,&quot; and a club hit with the almost forgotten Madonna-ish dance ditty &quot;Skin Deep&quot; (a radical departure from the album's other songs, yet a definite highlight). The album also includes a rock remake of her 1966 smash, &quot;Bang Bang.&quot; Other highlights include her collaboration with Darlene Love and Bonnie Tyler titled &quot;Perfection,&quot; the rockin' &quot;Dangerous Times,&quot; &quot;Give Our Love a Fighting Chance,&quot; and the wonderfully sweet ballad &quot;Main Man&quot; (for which a video was also filmed). Despite this impressive comeback album, 1989's Heart of Stone was an even bigger success. In an era of hair bands, leather accessories, and arena-sized ballads, faux metal babe Cher once again reaffirmed her never-ending and eternally surprising popularity.\n\nCher is the nineteenth studio album by American singer-actress Cher, released on November 10, 1987 by Geffen Records. The RIAA certified it Platinum in July 1992.\n\nFive years after the release of Cher's last album I Paralyze and her decision to focus on a film career, Cher signed with Geffen Records and was rushed to the studio to record what would become her comeback album. The self-titled album Cher was released in the fall of 1987. The record was produced by Michael Bolton, Jon Bon Jovi, Richie Sambora and Desmond Child. Among the notable guest artists, Bonnie Tyler and Darlene Love were backing vocalists on &quot;Perfection&quot;.\n\nAfter a series of pop and disco records, Cher moved to a radio-friendly rock sound, which helped her get back onto the charts. The album includes a new version of her 1966 hit &quot;Bang Bang (My Baby Shot Me Down)&quot;, Michael Bolton's &quot;I Found Someone&quot; (originally written for and recorded by Laura Branigan), several songs written by Desmond Child and two by Diane Warren, who would go on to write many more songs for the singer.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:58e1674fa13fdfd4a0c714fb3eb79bda712dc01d","amp;dn":"Cher+-+Perfection+%28Live%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58e1674fa13fdfd4a0c714fb3eb79bda712dc01d","infoHashBuffer":{"type":"Buffer","data":[88,225,103,79,161,63,223,212,160,199,20,251,62,183,155,218,113,45,192,29]},"announce":[],"urlList":[]}}