{"title":"Indie 69 August 2009 Rock Pop Playlist - Various Artists","uid":5037337,"size":483105608,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5901cce57a5bfc8969ae0735dbb7fc26a69247c4&amp;dn=Indie+69+August+2009+Rock+Pop+Playlist+-+Various+Artists&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"indie69","files":75,"time":1249186939,"description":"Indie 69 Rock Pop Playlist August 2009.\n\nThe Saintly Edition.\n\nI was really rushed at the end there, so if I got any dupes, so VERY\nsorry for it. I ran into some technical problems and at the end had to replace\nseveral tracks I loved due to potential issues with the tracks themselves.\nIt wasn't DRM, but it was odd. Files unprotected but unchangeable, not read\nonly yet I could not alter the id tags. Very strange. Fixed, more tracks added\nand here it is for your listening pleasures.\n\nThere are some leftovers from last month that would not fit but I really liked\n(about 5 or 6) and STILL it was a hard month for finding new music, at least\nfor me. In the end it all worked out.\n\nFor the love of the music, if you fall in love with a track, seek out the\nalbum or track and purchase it. Or go see a show. FUN. is on tour!! That\nshould be a fun, sing-along show. Look for me in the front singing along.\n(if I leave the cave long enough.. and I can find SPF-5200 sunblock)\n\nSummer has come, and it feels like it's almost over. This one went by far\ntoo fast. Enjoy what's left of it and I hope you don't hear the circus music\nin your sleep.\n\nNo bonus tracks, no videos this month. But if youthe artists here,\nI know for sure you'll find some pretty amazing stuff.\n\nFor those who I have been in touch with over the past few months, sorry for\nbeing such a hermit. And thanks for the suggestions, invitations, tracks.\n\nAnd BIG thanks to all the others who do playlists, I download and I listen\nand I love them all. (when will we get our Criznittle back????)\n\nI love comments, suggestions, rants and criticisms. Leave them at your\nfavorite torrent site under my torrents and I'll be sure to read and \nrespond.\n\nUntil September, keep your feet off the ground and keep reaching for the\ncookie jar.\n\nCover image courtesy of  &lt;a href=&quot;\nhttp://www.flickr.com/photos/paullew/1256448234/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.flickr.com/photos/paullew/1256448234/&lt;/a&gt;\nand Creative Commons!","torrent":{"xt":"urn:btih:5901cce57a5bfc8969ae0735dbb7fc26a69247c4","amp;dn":"Indie+69+August+2009+Rock+Pop+Playlist+-+Various+Artists","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5901cce57a5bfc8969ae0735dbb7fc26a69247c4","infoHashBuffer":{"type":"Buffer","data":[89,1,204,229,122,91,252,137,105,174,7,53,219,183,252,38,166,146,71,196]},"announce":[],"urlList":[]}}