{"title":"Movie Label 2010 v5.1.1.966","uid":5075148,"size":16978474,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5976fc195abb29117ac456301bea2b0568984829&amp;dn=Movie+Label+2010+v5.1.1.966&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"spotted_jackal","files":-1,"time":1251756370,"description":"With more than 10 years of experience in creating collection software; Code|Aero Technologies now offers Movie Label.\nThis cutting edge software contains powerful functionality but is very easy to use. It enables you to catalog your \nentire movie collection (DVD, VHS, Blu-ray, HD DVD, movies on your harddrive, etc).\n\n\nWhat can Movie Label do for you ?\n\n* Get your whole collection organized in no time. Simply type titles or scan barcodes and all information about your \nmovies and TV-series is automatically downloaded.\n* Find those golden oldies with the powerful yet easy-to-use search engine.\n* Save money by not purchasing duplicate movies and by keeping track of DVDs on loan.\n* Get the full picture of your collection with statistics and reports.\n* Catalog any kind of media ranging from DVD and Blu-ray to Divx movies on your hard drive, or even VHS if you still have those. \nYou can even add your own media types, making Movie Label future proof.\n* See your collection with whole new eyes and learn new things about your movies by reading the downloaded trivia.\n* Export your collection and save it on your mobile device to carry it along at all times. Movie Label exports to a variety of formats.\n\nWhat information is downloaded ?\n\nThe following info is downloaded when available:\n\n* Media: Cover Art, Trailer link\n* Lists: Cast, Crew, Genres, Audio Formats, Languages, Subtitles, Aspect Ratios, TV-series episodes (including plot etc for each episode)\n* Info: Title, Original Title, Plot, Tagline, Studio, Release Date, Certification, Country, Rating, Trivia (fun facts), etc..\n* The above and more is downloaded. Apart from the downloaded information you can add a lot of info: Last Watched, Special Features,\nRating, Price, Location, Website, etc..\n\n\nAre there any limits to the product ?\n\nMovie Label is a very mature product that uses a powerful database engine. This sets it apart from other products in the category.\n\n* There is no limit to the number of databases you can keep. So keep one database for each family member if you wish.\n* There is no limit to the size of each database and the product wont get slow even after adding thousands of movies.\n* Movie Label is built from the ground up to support Unicode so you can use characters from any part of the world.\n\nQuick Facts\n\n* Quickly get your movie library organized by typing the title or barcode.\n* Catalog any type of media (DVD, Blu-ray, VHS, LD, Divx, etc).\n* Scan your hard drive to find movie files and add them to your collection.\n* Keep track of movies on loan with the built-in loan manager.\n* Search and sort your collection with one click.\n* Print reports and watch a variety of statistics.\n* Export to various formats (HTML, XML, PDF, Excel, etc)\n* Keep a list of wanted and ordered items.\n* Create any number of databases of any size.[/img","torrent":{"xt":"urn:btih:5976fc195abb29117ac456301bea2b0568984829","amp;dn":"Movie+Label+2010+v5.1.1.966","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5976fc195abb29117ac456301bea2b0568984829","infoHashBuffer":{"type":"Buffer","data":[89,118,252,25,90,187,41,17,122,196,86,48,27,234,43,5,104,152,72,41]},"announce":[],"urlList":[]}}