{"title":"The.Uninvited.2009.PAL.NORDIC.DVDR-AFTERMATHThe.Uninvited.20","uid":5040245,"size":4679761308,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:598ffc21faf9488238620416df68aefd4f9e0751&amp;dn=The.Uninvited.2009.PAL.NORDIC.DVDR-AFTERMATHThe.Uninvited.20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FF_hightopper","files":-1,"time":1249336050,"description":"Anna, a beautiful teen girl (Emily Browning) is being released from a mental hospital. A therapist advises Anna to 'finish things that she has started', implying be productive and positive going forward. We learn Anna recently has lost her invalid mother in a fire, causing her breakdown.\n\nShe returns to her New England mansion along the shoreline. Her father (David Straitharn) introduces his new girlfriend To Anna's distress it is Rachel (Elizabeth Banks), the former at-home-nurse for her sick mother. Her mother had been housed in the family boathouse, and died when it burned down. It has now been restored, distressing Anna. We meet Anna's older sister Alex, and Matt, who makes out with Anna that night. He has something to tell Anna about the fire, but is stopped by Rachel's arrival. Meanwhile Rachel continues to try to befriend the girls, as they all fake their smiles.\n\nAnna that night has a vision (we dont see her as asleep) of the grotesque burned corpse of her mother warning her about Rachel, by pointing in her direction, with a bell around the wrist she used to summon help when she was alive. Anna tells her sister the next day about the warning. Her sister says it was not a nightmare, &quot;you looked awake&quot;. They plan to snoop around about who Rachel really is or wants.","torrent":{"xt":"urn:btih:598ffc21faf9488238620416df68aefd4f9e0751","amp;dn":"The.Uninvited.2009.PAL.NORDIC.DVDR-AFTERMATHThe.Uninvited.20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"598ffc21faf9488238620416df68aefd4f9e0751","infoHashBuffer":{"type":"Buffer","data":[89,143,252,33,250,249,72,130,56,98,4,22,223,104,174,253,79,158,7,81]},"announce":[],"urlList":[]}}