{"title":"Motley Crue - Shout At The Devil (Live)","uid":5068217,"size":120573956,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:59babdebad15378fe3b94f4fd058623a6d7e8bce&amp;dn=Motley+Crue+-+Shout+At+The+Devil+%28Live%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1251115014,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nA live performance by Motley Crue - Shout At The Devil from the Carnival of Sins Tour.\n\n\n&quot;Shout at the Devil&quot; is a popular song by the American heavy metal band MÃƒÂ¶tley CrÃƒÂ¼e. Written by bassist Nikki Sixx, the song is the title track of their 1983 album.\n\nThis song underwent some controversy because some people saw it as encouraging devil worship. However, this was dropped when Nikki Sixx denied any Diabolatry in the song while playing in Reno, Nevada. The song was rerecorded by the band in 1997 album, Generation Swine, titled &quot;Shout at the Devil '97&quot;.\n\nThe song was featured in the teen comedy/horror movie Idle Hands, as well as the best selling video game Guitar Hero II for PlayStation 2 and Xbox 360, in the Opening Licks tier.\n\n&quot;Shout at the Devil&quot; is also the entrance song for New York Yankees pitcher Joba Chamberlain and for Ultimate Fighting Championship mixed-martial artist Brock Lesnar.\n\nThe song was covered by Stuck Mojo during the sessions for their 1996 album Pigwalk, and can be found on the compilation album, Violate This. It featured producer Devin Townsend on guest vocals.\n\nThe song's lyrics also mention two songs by Aerosmith: &quot;Round and Round&quot; and &quot;Seasons of Wither&quot;\n\nMÃƒÂ¶tley CrÃƒÂ¼e is a Grammy-nominated American hard rock band formed in Los Angeles, California in 1981.\n\nThe band was founded by bass guitarist Nikki Sixx (who was, at the time, in a band called London) and drummer Tommy Lee, who were later joined by lead guitarist Mick Mars and lead singer Vince Neil. MÃƒÂ¶tley CrÃƒÂ¼e has sold more than 80 million album copies worldwide, including 23.5 million in the U.S.\n\nThe band has often been noted for their hard-living lifestyles; all members have had numerous brushes with the law, spent time in jail, suffered long addictions to alcohol and drugs, had countless escapades with women, and are heavily tattooed. Their ninth studio album entitled Saints of Los Angeles was released on June 24, 2008, while a film adaptation of their best-selling autobiography The Dirt, is due to be released sometime in 2011.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:59babdebad15378fe3b94f4fd058623a6d7e8bce","amp;dn":"Motley+Crue+-+Shout+At+The+Devil+%28Live%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59babdebad15378fe3b94f4fd058623a6d7e8bce","infoHashBuffer":{"type":"Buffer","data":[89,186,189,235,173,21,55,143,227,185,79,79,208,88,98,58,109,126,139,206]},"announce":[],"urlList":[]}}