{"title":"Black Hawk Down 2001","uid":5661323,"size":1035111082,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5a7b3c119aa24f097c5fae8b3fda7a8ee20172f2&amp;dn=Black+Hawk+Down+2001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nino2321","files":1,"time":1277989467,"description":"In a raid, a task force of Delta Force soldiers, Army Rangers, and Special Operations Aviation Regiment attempt to capture two of Mohamed Farah Aidid's senior subordinates in the Bakaara Market neighborhood of Mogadishu. The mission is led by Major General William F. Garrison and is supposed to take no more than half an hour. The extraction by the Delta team is successful, but the Somali militia, armed with RPGs, shoot down two Black Hawk helicopters, and the resulting rescue extends the mission to over 18 hours.\n\nThe film follows many characters through the build-up, assault and rescue. It shows how Staff Sergeant Matt Eversmann is placed in charge of Ranger Chalk Four, before portraying the raid and successful extraction of the wanted persons, and shows the first injury, as PFC Todd Blackburn falls from a helicopter as it maneuvers to avoid an RPG. This is the beginning of the indication that the troops are overwhelmed by the volume of enemy militia, and builds up to the two helicopter crashes: Super Six-One piloted by Cliff &quot;Elvis&quot; Wolcott, and Super Six-Four piloted by Mike Durant. Durant is taken prisoner after the two Delta snipers who requested to be inserted near the crash site of Super Six-Four (Randy Shughart and Gary Gordon) are killed while defending him.\n\nThe film also follows two Chalk Four machine gunners who are supposed to return with the extraction team, but miss the humvees as they leave, and get lost. One of them is deafened by machine-gun fire, but they eventually make their way back to Eversmann. Cpl Jamie Smith attempts to rescue one of them whose flashbang grenade was shot and exploded, but Smith is shot as well, and eventually bleeds to death as the Rangers attempt to give him medical care.\n\nThe film approaches its conclusion as the U.S. forces regain control with strafing runs by Little Bird helicopters, and a convoy of troops from the 10th Mountain Division, along with other United Nations forces (Pakistan Army and Malaysian Army), arrives to extract the wounded. Back at the base, Norm &quot;Hoot&quot; Hooten begins to restock on ammunition, preparing to go back out to rescue downed soldiers, and Eversmann tells dead Jamie Smith that he will fulfill his dying wish.\n\nThe film ends with text informing the viewer that &quot;1000 Somalis died and 19 Americans lost their lives in the conflict (the 19 soldiers and officers who died are then listed by name and rank). Mike Durant was released after 11 days of captivity. On August 2, 1996, warlord Mohamed Farrah Aidid was killed in Mogadishu. General Garrison retired the following day.&quot;\n","torrent":{"xt":"urn:btih:5a7b3c119aa24f097c5fae8b3fda7a8ee20172f2","amp;dn":"Black+Hawk+Down+2001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a7b3c119aa24f097c5fae8b3fda7a8ee20172f2","infoHashBuffer":{"type":"Buffer","data":[90,123,60,17,154,162,79,9,124,95,174,139,63,218,122,142,226,1,114,242]},"announce":[],"urlList":[]}}