{"title":"Shania Twain - Don't","uid":5094406,"size":147654660,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5b34247fbcf09da2e5adc0578c9218d2f9a3b1c0&amp;dn=Shania+Twain+-+Don%5C%27t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1253432572,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Don't!&quot; is a song by Canadian singer Shania Twain. It was the second single released from her 2004 Greatest Hits album. The song was written by Twain and then-husband Mutt Lange. &quot;Don't!&quot; underperformed on most charts, mostly due to no promotion by Shania and very little by the label. The highest it made was number ten airplay in Canada. The song was also included under the end credits of the 2005 film An Unfinished Life, and in the Brazilian soap opera AmÃƒÂ©rica.\n\nThe music video for &quot;Don't!&quot; was shot in Oaxaca, Mexico at an abandoned hotel and Yucca plantation. It was filmed on October 24, 2004 and released December 30, 2004, it was directed by Wayne Isham. The video is available on some of the commercial singles for &quot;Don't!&quot;. In 2006, CMT Canada named &quot;Don't!&quot; the eighth sexiest country music video.\n\nIn the video Twain is riding around on her horse through rows of Yucca wearing red dress, and walking around within the hotel wearing white dress with the corset. Near the end of the video a tear running down Shania's face can be seen\n\n&quot;Don't!&quot; debuted on the Billboard Hot Country Singles &amp; Tracks chart the week of January 29, 2005 at number 44, Twain's fourth highest debut of all time, and highest of the week. The single spent 15 weeks on the chart and climbed to a peak position of number 24 on April 2, 2005, where it remained for one week. &quot;Don't!&quot; became Twain's first single to miss the top twenty since 2000's &quot;Rock This Country!&quot;.\n\nReleased to adult contemporary radio on March 28, 2005, &quot;Don't!&quot; debuted at number 29, the highest debut of the week, on April 16, 2005. The single spent 16 weeks on the chart and climbed to a peak position of number 18 on May 14, 2005, where it remained for four non-consecutive weeks. &quot;Don't!&quot; became Twain's tenth consecutive top twenty single, making all of Twain's singles released to AC hit the top twenty so far.\n\nIn the UK, &quot;Don't!&quot; appeared at its peak position of number 30 on March 12, 2005. This became, and remains her lowest peaking single in that country, and only remained on the chart for two weeks. It fell to number 57 in its second week, then fell off the chart completely. The low peak can be attributed to no promotion by Twain or the label, and was basically released for fans.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:5b34247fbcf09da2e5adc0578c9218d2f9a3b1c0","amp;dn":"Shania+Twain+-+Don%5C%27t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b34247fbcf09da2e5adc0578c9218d2f9a3b1c0","infoHashBuffer":{"type":"Buffer","data":[91,52,36,127,188,240,157,162,229,173,192,87,140,146,24,210,249,163,177,192]},"announce":[],"urlList":[]}}