{"title":"Largo Winch 1-3 (English)","uid":5061922,"size":246411883,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5b5e0008dc53c12682aa8b93706519dcae269c87&amp;dn=Largo+Winch+1-3+%28English%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ParrowJack","files":4,"time":1250747840,"description":"Largo Winch is a Belgian comic book series by Philippe Francq and Jean Van Hamme, published by Dupuis.  Largo Winch started as a series of novels by Jean Van Hamme in the late 1970's, but stopped due to a lack of success and the huge amount of work Van Hamme had in the meantime with his comic books (e.g. Thorgal).  When Francq wanted to start a series with Van Hamme, he revived his old hero, and reworked the novels into the first albums of the comic series.  Later, new stories followed.\n\nIn the first two volumes of the series, L'h?ritier and Le Groupe W, Largo, a young and handsome orphan, is propelled to the head of a business empire, Group W, after his adoptive father Nerio is murdered, and goes through a lot of troubles to preserve his inheritance and avenge Nerio.  The following albums are more or less based on the same basic plot: someone is trying to harm Largo's company or to take control of it from him, and he has to fight that someone to ensure the survival of his holdings.\n\nCinebook have translate Largo Winch into Englishand have release them in issues of 2 at a time as a single book.\n\nDue to scenes of an adult nature this torrent comes with an ADULT rating.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:5b5e0008dc53c12682aa8b93706519dcae269c87","amp;dn":"Largo+Winch+1-3+%28English%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b5e0008dc53c12682aa8b93706519dcae269c87","infoHashBuffer":{"type":"Buffer","data":[91,94,0,8,220,83,193,38,130,170,139,147,112,101,25,220,174,38,156,135]},"announce":[],"urlList":[]}}