{"title":"Mile Sur","uid":5555801,"size":23059923,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5b870bf9249e81fcee40769801a088d5d6b5de26&amp;dn=Mile+Sur&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"stonned22","files":1,"time":1273679709,"description":"&quot;Ek sur&quot; (One Tune) (languages of India), or &quot;Mile Sur Mera Tumhara&quot; as it is better known, is an Indian song and accompanying video promoting national integration and unity in diversity.\n\nThe concept for Mile Sur was developed in 1988 by Lok Seva Sanchar Parishad, and promoted by Doordarshan (then India's sole TV broadcaster) and India's Ministry of Information. The song was composed by Ashok Patki, co-composed &amp; arranged by Louis Banks, written by Piyush Pandey (then an Account Manager and presently the Executive Chairman and Creative Head of Ogilvy and Mather, India). The project was conceived and directed by Suresh Mullick (then all India Creative Director, Ogilvy &amp; Mather) and recorded by a group of people from all walks of life, including a supergroup of popular Indians - musicians, sports persons, movie stars, etc.\n\nThe national integration video was intended to instill a sense of pride and promote unity amongst Indians, highlighting the different linguistic communities and societies that live in India - India's unity in diversity, so to speak.\n\n\n\nPS:- Please Seed !!!!","torrent":{"xt":"urn:btih:5b870bf9249e81fcee40769801a088d5d6b5de26","amp;dn":"Mile+Sur","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b870bf9249e81fcee40769801a088d5d6b5de26","infoHashBuffer":{"type":"Buffer","data":[91,135,11,249,36,158,129,252,238,64,118,152,1,160,136,213,214,181,222,38]},"announce":[],"urlList":[]}}