{"title":"Gert NygÃƒÂ¥rdshaug - 4 LydbÃƒÂ¸ker pÃƒÂ¥ Norsk","uid":5121234,"size":1959484166,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5c7ee91112e518db277826a6a4171276ff8ad02a&amp;dn=Gert+Nyg%C3%83%C2%A5rdshaug+-+4+Lydb%C3%83%C2%B8ker+p%C3%83%C2%A5+Norsk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"schneide240","files":526,"time":1255361587,"description":"Alle Orkaners Mor\n\nOmtale\nFredric Drum drar pÃƒÂ¥ ferie til Mexico. Der blir han ringt opp av sin onkel, KRIPOS-etterforskeren Skarphedin Olsen. Han forteller at en av hans arkeologivenner er forsvunnet i Mexico. Skarphedin kobler Drum til de lokale politistyrkene, og mens Drum leter etter den bortkomne vennen trekkes han inn i jakten pÃƒÂ¥ en lokal massemorder, i en politisk valgkamp samt i en utforskning av Maya-kulturens gamle skrifter. Dette er den niende romanen om Fredric Drum og Skarphedin Olsen. \n\n\nFortellerens Marked\n\nOmtale\nBibliotekar Gerbert Rodin i fjellbygda Vanndal befinner seg i den egyptiske ÃƒÂ¸rken sammen med en mystisk kvinne. Gjennom to ÃƒÂ¥r har han og bygdas veterinÃƒÂ¦r mottatt ÃƒÂ¥tte brev fra den frafalne presten Gotvin Soleng. Det viser seg at disse brevene inneholder en oppdagelse som skal komme til ÃƒÂ¥ forandre verdenshistorien for alltid. Boken er en frittstÃƒÂ¥ende oppfÃƒÂ¸lger av Prost Gotvins geometri. \n\n\nHonningkrukken\n\nOmtale\nHandlingen i denne romanen er lagt til St. Emilion, et av Frankrikes mest tradisjonsrike vindistrikter. Fredric Drum som befinner seg i distriktet for ÃƒÂ¥ kjÃƒÂ¸pe opp vin til sin lille restaurant i Norge, vikles uforvarende inn i et forsvinningsmysterium. I lÃƒÂ¸pet av et par mÃƒÂ¥neder er syv mennesker i alderen 9 til 63, alle hjemmehÃƒÂ¸rende i St. Emilion, blitt borte. Antagelig er de drept. Og mye tyder pÃƒÂ¥ at Fredric skal bli det ÃƒÂ¥ttende offer. Politiet stÃƒÂ¥r makteslÃƒÂ¸se, de tror en sinnsyk massemorder kan vÃƒÂ¦re pÃƒÂ¥ ferde. Dette er den fÃƒÂ¸rste boka om Fredric Drum og Skarphedin Olsen. \n\n\nJegerdukken\n\nOmtale\nEt sensasjonelt arkeologisk funn er gjort i Nord-ÃƒËœsterdal: To sÃƒÂ¥kalte moselik er gravd frem, samt gjenstander med merkelige inskripsjoner. SÃƒÂ¥ dukker en gammel jegeramulett opp, i form av en dukke. Dette er den andre romanen om Fredric Drum og Skarphedin Olsen. ","torrent":{"xt":"urn:btih:5c7ee91112e518db277826a6a4171276ff8ad02a","amp;dn":"Gert+Nyg%C3%83%C2%A5rdshaug+-+4+Lydb%C3%83%C2%B8ker+p%C3%83%C2%A5+Norsk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c7ee91112e518db277826a6a4171276ff8ad02a","infoHashBuffer":{"type":"Buffer","data":[92,126,233,17,18,229,24,219,39,120,38,166,164,23,18,118,255,138,208,42]},"announce":[],"urlList":[]}}