{"title":"CheckUp 2.6.2 + Serial","uid":5576417,"size":19438027,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:5ca2e7b950c18f2f95945ac6e2370c9a7fcccce9&amp;dn=CheckUp+2.6.2+%2B+Serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ReliableTorrent","files":-1,"time":1274396669,"description":"Product Description:\nWith its use of the latest Mac OS X technologies, breakthrough ease-of-use and innovation, all Mac users will find CheckUp very useful and even fun.\nIt's like the dashboard of your car! CheckUp is designed to check the health of your disks and memory. CheckUp is also able to detect the most common issues found on Mac computers upon launch. It will show you how to fix them. CheckUp allows you to visualize the behavior of your computer in real time with a clear interface accessible to all levels.\nWhether you are a beginner or professional, you will be able to survey your processor activity, the level of filling for your disks, the processes using the most resources and the network activity.\nYou can detect duplicate files present on your disk and delete them, uninstall unused applications with associated files, optimize the performance of your Mac and more. CheckUp is able to monitor the health of your computer even when the application is not launched thanks to a small process running in the background. In case of serious problems, you will be alerted with a notification message that will appear above any application.\n\n\nWhat's new in this version:\nSupport of the new MacBook pro with Intel Core i5/i7\nImproved user interface\nImproved license management\n\n\nOperating System Requirements:\nThis product is designed to run on the following operating systems:\nMac OS X 10.5 Intel\nMac OS X 10.5 PPC","torrent":{"xt":"urn:btih:5ca2e7b950c18f2f95945ac6e2370c9a7fcccce9","amp;dn":"CheckUp+2.6.2+%2B+Serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ca2e7b950c18f2f95945ac6e2370c9a7fcccce9","infoHashBuffer":{"type":"Buffer","data":[92,162,231,185,80,193,143,47,149,148,90,198,226,55,12,154,127,204,204,233]},"announce":[],"urlList":[]}}