{"title":"Black Nation (Matz Hjelm)","uid":5672961,"size":453903717,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:5ced065de19d8363c879538c408649706a9de2d1&amp;dn=Black+Nation+%28Matz+Hjelm%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1278422672,"description":"The stark reality and contrast of these headlines points out the dichotomy of post election '08 America. A black man has attained the highest office in the world, while according to the New York Times black men are 'sleeping through the holocaust'. One only has to look to the City of Detroit, once a model of upward mobility for blacks in America. It now sits as a mere shell of its former self - vultures literally picking at the bones of its once great buildings - stripping them of everything from wire to copper pipes. Its economy already in tatters, it awaits the imminent collapse of the auto industry. How is it even possible for the African American men of this once proud City to conceive of a way out of the double jeopardy of crime and unemployment - let alone take positive steps toward the future?\n\nBlack Nation is a documentary feature film that takes a hard, uncompromising look at the state of Black men in America today through the prism of the streets of Detroit and the City's controversial Church Shrine of the Black Madonna. The Church's focus on delivering pragmatic programs centered around economic self sufficiency, is a model for Obama's America, as it searches for solutions to seemingly impossible problems. Set within the framework of a Father's day service, the film tracks the despair of its congregation while at the same time showing the way forward with the great hope and dignity embodied in Obama's words - 'yes we can'! The Church strives to promote and develop community led programs and institutions that restore pride and dignity to its congregation and in particular, black men. They are leading by example.\n\nSwedish director and internationally renowned video artist, Mats Hjelm, has a deep personal connection to the City and the Church. This connection began with his filmmaker fatherÃƒÂ¢'s documentation of the 1967 Detroit riots, the Church's part in this seminal event and the filming of Stokely Carmichael's (Black Panther Party) 1968 fundraising tour of Europe. Segments of this historic footage are included in the film. His connection was further deepened through his formal education at Michigan's prestigious Cranbrook Academy of Art. Wonderfully shot in HD and presented in 35mm, the result is a beautiful film unlike any other that will deeply affect your view of America today.\n &lt;a href=&quot;\nhttp://blacknationthefilm.com/about.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://blacknationthefilm.com/about.php&lt;/a&gt;\n\n\n  ____                      _                      _   _       _\n / ___|___  _ __  ___ _ __ (_)_ __ __ _  ___ _   _| | | |_   _| |__\n| |   / _ \\| '_ \\/ __| '_ \\| | '__/ _` |/ __| | | | |_| | | | | '_ \\\n| |__| (_) | | | \\__ \\ |_) | | | | (_| | (__| |_| |  _  | |_| | |_) |\n \\____\\___/|_| |_|___/ .__/|_|_|  \\__,_|\\___|\\__, |_| |_|\\__,_|_.__/\n                     |_|                     |___/\n   ____\n  / ___|___  _ __ ___\n | |   / _ \\| '_ ` _ \\\n | |__| (_) | | | | | |\n(_)____\\___/|_| |_| |_|\n\n\nPLEASE KEEP SEEDED TO PASS ON THE MESSAGE.  PLEASE VISIT OUR SITE AND SHARE THE WORD!\n\n* Don't Be Fooled Any Longer on Darwinism, Evolution, Global Warming Lies, Internationalism, etc.\n* Get The Message Out, Openly!\n* Be part of Advanced Science\n* Go to site to request reseeding!\n* Copy Our Torrents To All 'Open' Trackers!!!\n","torrent":{"xt":"urn:btih:5ced065de19d8363c879538c408649706a9de2d1","amp;dn":"Black+Nation+%28Matz+Hjelm%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ced065de19d8363c879538c408649706a9de2d1","infoHashBuffer":{"type":"Buffer","data":[92,237,6,93,225,157,131,99,200,121,83,140,64,134,73,112,106,157,226,209]},"announce":[],"urlList":[]}}