{"title":"Vista_x86_Home_Premium","uid":5555783,"size":2909491247,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5d605904371f12a3dbb32ed496d8a9f09638711c&amp;dn=Vista_x86_Home_Premium&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"triphead","files":2,"time":1273678904,"description":"My hard drive died...\n\nI took my PC to PC World to get a new one, and for them to install Vista Home Premium on the new disc (I didn't have the time to do it myself).\nThey told me, &quot;sorry but Vista's no longer available - you'll have to have Windows 7.&quot; \n\nSo, they installed it....and things started going wrong. Finally, after 5 weeks of this black-screening nonsense, I rang Microsoft to find out why Win7 kept killing my PC. To be fair, they were pretty good - a day later they rang me up to tell me that the problem was actually my PC - it is not Win7 compatible! - and PC World should've never installed it in the first place. \n\nI needed Vista back. I downloaded 5 different versions, and none of them worked. They either didn't like my original Windows key, or they claimed there were files missing from the install disk.\n\nSo, after about 15 minutes of looking for fixes (and failing) I finally made this installation disk, burned the ISO, AND IT WORKED! Happy faces all round!\n\nThis install contains the INSTALL.WIM file from a Vista Ultimate Edition, and the rest of the disk is from an alleged Windows Vista x86 Recovery Disk....whatever, it works for Home Premium and it might work for other versions. I only own Home Premium, so that's the key I used.\n\nI burnt the ISO using PowerISO at 4x speed and it's worked on 2 PCs so far, without a single hitch.\n\nThis WILL install over Windows 7 with no problems.\n\nEnjoy..","torrent":{"xt":"urn:btih:5d605904371f12a3dbb32ed496d8a9f09638711c","amp;dn":"Vista_x86_Home_Premium","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d605904371f12a3dbb32ed496d8a9f09638711c","infoHashBuffer":{"type":"Buffer","data":[93,96,89,4,55,31,18,163,219,179,46,212,150,216,169,240,150,56,113,28]},"announce":[],"urlList":[]}}