{"title":"Megadeth - Peace Sells","uid":5063883,"size":158908420,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5d7a89f2e78c3d97a6685d54912b2d3cdc517cfb&amp;dn=Megadeth+-+Peace+Sells&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1250840731,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Peace Sells&quot; is the name of a song by Megadeth from the album Peace Sells... but Who's Buying?, written by Dave Mustaine. It is one of their most popular songs of the album, along with Wake Up Dead. VH1 ranked it as #11 on their list of the 40 greatest metal songs of all time and in 2009 it was named the 51st best hard rock song of all time also by VH1. The opening bassline was also used as the theme for MTV News. Mustaine claims he never received any royalties for MTV's usage of the song. \n\nLyrically, it deals with disillusion, Cold War politics, and military combat, all recurring themes in Megadeth songs. It also deals with negative stereotypes about &quot;metalheads&quot;, all of which Mustaine claims are untrue.\n\nA music video was also produced for the song, which features a teenage boy, wearing a Slayer t-shirt, watching a montage of a live Megadeth performance and war footage on his living room television set. The boy's father, played by Jello Biafra, states &quot;I want to watch the news!,&quot; and changes the television channel to a news station using the remote control. His son, replying with &quot;This is the news!,&quot; changes it back to the Megadeth performance using the TV set's channel knob. This part of the video was parodied by comedian Brian Posehn in his Metal by Numbers video.\n\nThe song was also featured in the popular games like Grand Theft Auto: Vice City, True Crime: Streets of LA, the soon to be released NHL 10 and is a playable track on Rock Band 2.\n\nPeace Sells... But Who's Buying? is the second studio album by American heavy metal band Megadeth, released in 1986. Originally, the project was handled by Combat Records, and this resulted in the first mix of the album (nicknamed Peace Diffs... but Who's Buyin?, also known as Peace Sells Combat Mix), which can be found on the internet as a bootleg. Eventually Capitol Records bought the rights to the album and a producer was hired to mix it himself. It was remixed and remastered in 2004 by Dave Mustaine (though it is not known if the remaster is of the Combat release, the Capitol release, or a combination of both).\n\nProfessional rock critic Steve Huey noted the album's combination of &quot;punkish political awareness with a dark, threatening, typically heavy metal worldview.&quot; For instance, the album's cover makes an ironic statement about the Cold War. On the backdrop of a red and orange sky, it shows the United Nations headquarters soon after a nuclear attack. In the foreground is the band's mascot, Vic Rattlehead, who is leaning against a sign reading &quot;For Sale&quot; (&quot;Vic Realtors&quot; appearing in some copies), implying that the United Nations is for sale. The cover and the title suggest that while peace is a popular theme, it has become commodified, yet the ideal not achieved. These themes carry into the title track, with its strong themes of youth disillusionment. Dave Mustaine lifted the title from a Reader's Digest article, where it was written &quot;Peace Would Sell But No One Would Buy It&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:5d7a89f2e78c3d97a6685d54912b2d3cdc517cfb","amp;dn":"Megadeth+-+Peace+Sells","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d7a89f2e78c3d97a6685d54912b2d3cdc517cfb","infoHashBuffer":{"type":"Buffer","data":[93,122,137,242,231,140,61,151,166,104,93,84,145,43,45,60,220,81,124,251]},"announce":[],"urlList":[]}}