{"title":"Alice Cooper - Freedom","uid":5083885,"size":136536068,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5dd1d7d0dbfa7272b7f1205273b9adbe1ef5f1c0&amp;dn=Alice+Cooper+-+Freedom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1252562147,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Freedom&quot; is a 1987 single by rock singer Alice Cooper, taken from his 10th solo studio album, Raise Your Fist and Yell. The song is the album's hit single, reaching #50 on the UK charts. It was the only single from the album, and the only song which had a music video made for it. It was written by Alice Cooper and Kane Roberts.\n\nRaise Your Fist and Yell is a 1987 concept album by rock musician Alice Cooper. It features the track &quot;Prince of Darkness&quot;, which is featured very briefly in the John Carpenter film of the same name, in which Cooper has a cameo as a murderous vagrant. The song can be heard on the Walkman of one of his victims. A music video was made for the song &quot;Freedom&quot; which also became the album's hit single.\n\nThe album continues the splatter film trend created by Cooper's previous album Constrictor. The track &quot;Lock Me Up&quot; features a guest appearance from Robert Englund, who portrayed Freddy Krueger in the A Nightmare On Elm Street series.\n\nThe album also seems to loosely have a story. The story is about an unnamed serial killer that has an obsession with horror movies, he then proceeds to ride around at night picking up prostitutes and murdering them. He also sees a young woman named Mary as &quot;Gail&quot; one of his previous victims whom he stabbed in the chest with a knife and buried (possibly a coincidence, but Alice's wife Sheryl Cooper's middle name is Gail). In the final song &quot;Roses on White Lace&quot; it is revealed that the killer breaks into the room of a bride-to-be and brutally kills her; after which he proceeds to hide away pieces of her body. The story has a few similarities to Cooper's 2008 concept album Along Came a Spider.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:5dd1d7d0dbfa7272b7f1205273b9adbe1ef5f1c0","amp;dn":"Alice+Cooper+-+Freedom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dd1d7d0dbfa7272b7f1205273b9adbe1ef5f1c0","infoHashBuffer":{"type":"Buffer","data":[93,209,215,208,219,250,114,114,183,241,32,82,115,185,173,190,30,245,241,192]},"announce":[],"urlList":[]}}