{"title":"stormpredator 3.2.5  DATABASE","uid":5021518,"size":356866965,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5e241ed64737a5e90ffff34809ffa282b0044d33&amp;dn=stormpredator+3.2.5++DATABASE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"trancemix07","files":1,"time":1248480646,"description":"The Program has tripled in size since 3.2.5 and since i included the crack to 3.2.5  -PLUS- the trial + upgrade of the NEWEST VERSION AVAILABLE 3.3.0 for you to find cracks too (because i dont have the time anymore) which are 97 MB's each, compared to the earlier 3.2.5 version that was only 30 MB's I DONT WANT TO HEAR ANY COMPLAING. This Is only my First torrent so give me a break. If i get a request for the uncompressed files or so you can download them seperatly i might do it, or maybe even just release the crack with the 3.2.5 version by itself, which should only equal 35 MB's ONLY, then i will do so..\n\nthanks for browsing my torrents, but at this rate i will only be uploading once a year because of their servers.\n\nAND NOW the description that took me 2 hours to write because i wanted it just p[erfect:\n\n\nStormPredator 3.2.5 Crack  w/--&gt; SAVED WEB PAGE Database\n\n\n\nHere it is Peeps, AS I PROMISED:\n\nHomepage SiteRip and trial installs of Stormpredator 3.3.0 so you can spend your time looking for the updated crack, as this one was found 2-3 years ago with about a weeks worth of surfing the net and &quot;dodging bullets&quot; from all the crack sites.\n\nJust Follow the folders to the crack which is unzipped and ready to go,\ncopy and paste the contents of the crack folder with all its files, REPLACING/OVERWRITING the files in the Programs Files directory\n\nThats it-Your Done\n\n\nAnd rememberr to help me to SEED because i have a tendency to nuke my uploads/downloads thinking that i am getting hacked... I have schitzophrenia and am very PARANOID..lol\n\n--------------\nThe Trick to the &quot;Wrong Code&quot; is actually a bad guys technique to destroy the world\n\nFLOOD THE FUCKING SITE as fast as you can with the UPLOAD FORMS over and over again until after  about 3-5 tries w/ the correct code and each time selcting the torrent again ,, that it actually WORKS.\n\nGUYS FIX YOUR SERVERS or sell some more products to get more hardware... BUT what do i know, Im just the DUMBASS who wasted 12 hours straight and nearly anihilated my router TRYING To UPLOAD \n-GET THIS-\nJust one torrent that probably none wants anyway\n\nI still love you PIRATEBAY....LMAO","torrent":{"xt":"urn:btih:5e241ed64737a5e90ffff34809ffa282b0044d33","amp;dn":"stormpredator+3.2.5++DATABASE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e241ed64737a5e90ffff34809ffa282b0044d33","infoHashBuffer":{"type":"Buffer","data":[94,36,30,214,71,55,165,233,15,255,243,72,9,255,162,130,176,4,77,51]},"announce":[],"urlList":[]}}