{"title":"The secret evidence of global warming Bush tried to hide...","uid":5024826,"size":114888913,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:5e712e99cd12e768ea23770ecc8d76bf0c293624&amp;dn=The+secret+evidence+of+global+warming+Bush+tried+to+hide...&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"the_Phyrexian","files":8,"time":1248641308,"description":"Photos from US spy satellites declassified by the Obama White House provide the first graphic images of how the polar ice sheets are retreating in the summer. The effects on the world's weather, environments and wildlife could be devastating.\n\nGraphic images that reveal the devastating impact of global warming in the Arctic have been released by the US military. The photographs, taken by spy satellites over the past decade, confirm that in recent years vast areas in high latitudes have lost their ice cover in summer months.\n\nThe pictures, kept secret by Washington during the presidency of George W Bush, were declassified by the White House last week. President Barack Obama is currently trying to galvanise Congress and the American public to take action to halt catastrophic climate change caused by rising levels of carbon dioxide in the atmosphere.\n\nOne particularly striking set of images - selected from the 1,000 photographs released - includes views of the Alaskan port of Barrow. One, taken in July 2006, shows sea ice still nestling close to the shore. A second image shows that by the following July the coastal waters were entirely ice-free.\n\nThe photographs demonstrate starkly how global warming is changing the Arctic. More than a million square kilometres of sea ice - a record loss - were missing in the summer of 2007 compared with the previous year.\n\nNor has this loss shown any sign of recovery. Ice cover for 2008 was almost as bad as for 2007, and this year levels look equally sparse.\n\n&quot;These are one-metre resolution images, which give you a big picture of the summertime Arctic,&quot; said Thorsten Markus of Nasa's Goddard Space Flight Centre. &quot;This is the main reason why we are so thrilled about it. One-metre resolution is the dimension that's been missing.&quot;\n\nDisappearing summer sea ice poses considerable dangers, scientists have warned. Ice shelves are used by animals such as polar bears as platforms for hunting seals and other sea creatures. Without them, they could starve. In addition, ice reflects solar radiation. Without that process, the Arctic sea could warm up even more. The phenomenon threatens to set off runaway heating of the planet, say climatologists.\n\nThe latest revelations have triggered warnings from scientists that they no longer have the funds to keep a comprehensive track of climate change. Last week the head of the US's National Oceanic and Atmospheric Administration (NOAA), Professor Jane Lubchenco, warned that the gathering of satellite data - crucial to predicting future climate changes - was now at &quot;great risk&quot; because America's ageing satellite fleet was not being replaced.\n\n&quot;Our primary focus is maintaining the continuity of climate observations, and those are at great risk right now because we don't have the resources to have satellites at the ready and taking the kinds of information that we need,&quot; said Lubchenco, who was appointed by Obama. &quot;We are playing catch-up.&quot;\n\nEven before her warning, scientists were saying that America, the world's scientific superpower, was virtually blinding itself to climate change by cutting funds to the environmental satellite programmes run by the Oceanic and Atmospheric Administration and Nasa. A report by the National Academy of Sciences this year warned that the environmental satellite network was at risk of collapse.\n\nIn February, a Nasa satellite carrying instruments to produce the first map of the Earth's carbon emissions crashed near Antarctica only three minutes after lift-off.\n\nThe satellite would have measured carbon emissions at 100,000 points around the planet every day, providing a wealth of data compared to the 100 or so fixed towers currently in operation in a land-based network.\n\nThe NOAA is under additional pressure to provide environmental data because of the re-emergence of the El NiÃƒÂ±o climate phenomenon, where warming of the tropical Pacific causes heatwaves, droughts and flooding around the world. June's land and sea surface temperatures were the second hottest on record, and scientists are predicting this will be the warmest decade in recorded history. The last major El NiÃƒÂ±o was in 1998, the hottest year in recorded history.\n\nThe Obama administration has already taken steps to tackle America's flagging scientific lead. The president's economic recovery plan allotted $170m (Ã‚Â£100m) to help close the gaps in climate modelling. The NOAA is seeking an additional $390m in its 2010 budget to upgrade environmental satellites, and help make data more available to researchers and government officials.\n &lt;a href=&quot;\nhttp://www.guardian.co.uk/environment/2009/jul/26/climate-change-obama-administration&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.guardian.co.uk/environment/2009/jul/26/climate-change-obama-administration&lt;/a&gt;\n\n\nPlease find attached four images :) both as pdf and as img","torrent":{"xt":"urn:btih:5e712e99cd12e768ea23770ecc8d76bf0c293624","amp;dn":"The+secret+evidence+of+global+warming+Bush+tried+to+hide...","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e712e99cd12e768ea23770ecc8d76bf0c293624","infoHashBuffer":{"type":"Buffer","data":[94,113,46,153,205,18,231,104,234,35,119,14,204,141,118,191,12,41,54,36]},"announce":[],"urlList":[]}}