{"title":"Pink Floyd Making of the Dark Side of the Moon DVD","uid":5515867,"size":3943303215,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5e79889f513a5c969617454abaed859d9097f413&amp;dn=Pink+Floyd+Making+of+the+Dark+Side+of+the+Moon+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":14,"time":1272247204,"description":"The most phenomenal recording in rock &amp; roll history is thoroughly examined in Pink Floyd: The Dark Side of the Moon. The Floyd's 1973 masterpiece remained on bestseller charts for nearly 14 years, and its enduring importance is honored here by all four members of Pink Floyd and key personnel (engineer Alan Parsons, mixing supervisor Chris Thomas, sleeve designer Storm Thorgerson, and others) who played essential roles in the landmark album's creation. Produced for the Classic Albums series that originally aired on VH-1, this thorough and thought-provoking study highlights a track-by-track dissection of the LP's master tapes (including the spoken-word passages that bookend the album), superbly interlaced with archival footage, early demo tapes, concert animations, and latter-day acoustic performances by David Gilmour, Roger Waters, and Richard Wright to demonstrate each track's contribution to the final mix--a sonic exploration that extends to the illuminating bonus features. Informative interviews abound (including Rolling Stone senior editor David Fricke), and much-deserved credit is given to saxophonist Dick Parry, solo vocalist Clare Torry, and former Capitol Records chairman Bhaskar Menon, who fostered the album's U.S. commercial success. For Floyd fans, musicians, and studio technicians alike, this is a must-have addition to any DVD library. --Jeff Shannon\n\nPink Floyd's &quot;Dark Side of the Moon&quot; Classic Album is the creative story behind the masterpiece: &quot;Dark Side Of The Moon&quot;. &quot;Dark Side Of The Moon&quot; transformed Pink Floyd from art house favorites to global, stadium superstars. Prior to 1973, Pink Floyd maintained a relentless gigging schedule and by the time they came to record &quot;Dark Side Of The Moon&quot; had already created many of the basic tracks. &quot;Dark Side Of The Moon&quot; would be the first Pink Floyd (post Syd Barrett) album where Roger Waters would supply all the lyrics around a concept: The Circle of Life. With the timeless qualities of its production and musicality, allied to the hypnotic evocation of its central themes - alienation, paranoia, madness, war and death, &quot;Dark Side Of The Moon&quot; would become the album that would dominate the 70's and 80's (with a record number of 741 consecutive weeks in the Billboard 200). This program takes an in depth look at the making of the 1973 album. All four members of the band Roger Waters, David Gilmour, Nick Mason and Richard Wright are featured in exclusive interviews. Roger, David and Richard play songs and demonstrate themes from the album. Alan Parsons (the original engineer) takes you through the multi track tapes giving a unique insight into the musical fabric of the record and the program is illustrated throughout with archive footage. &quot;Dark Side Of The Moon&quot; with its combination of great songs, inventive effects and one of the best known sleeves ever, tapped into the world's collective subconscious and became a landmark in Rock history and a truly Classic Album. Pink Floyd's &quot;Dark Side of the Moon&quot; Classic Album is the creative story behind the masterpiece: &quot;Dark Side Of TheMoon,,Thanks for all your help Moon&quot;. &quot;Dark Side Of The Moon&quot; transformed Pink Floyd from art house ","torrent":{"xt":"urn:btih:5e79889f513a5c969617454abaed859d9097f413","amp;dn":"Pink+Floyd+Making+of+the+Dark+Side+of+the+Moon+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e79889f513a5c969617454abaed859d9097f413","infoHashBuffer":{"type":"Buffer","data":[94,121,136,159,81,58,92,150,150,23,69,74,186,237,133,157,144,151,244,19]},"announce":[],"urlList":[]}}