{"title":"Kingdom Come - Get It On","uid":5085198,"size":170387460,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5ebaad37ee838d8dcf0a99ada08f4c15b641ec22&amp;dn=Kingdom+Come+-+Get+It+On&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1252665912,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Get It On&quot; is the debut single by hard rock/glam metal band Kingdom Come from their self-titled debut album.\n\nKingdom Come is a hard rock band fronted by Hamburg-born vocalist Lenny Wolf. The group's first album, Kingdom Come was that band's only international hit. The musical style on their debut was very close to the early blues-rock style of Led Zeppelin leading to a backlash from critics and the band being dubbed &quot;Kingdom Clone&quot; in the press. The band currently consists of an entirely German line-up.\n\nThe group was formed in 1987 after the breakup of Wolf's moderately successful rock project Stone Fury. Wolf's A&amp;R man, Derek Shulman and record company, Polygram, allowed him incredible freedom to assemble Kingdom Come's lineup and direct its sound, and he recruited Pittsburgh-based lead guitarist Danny Stag, Louisvillians Rick Steier (guitar) and James Kottak (drums) and Northern Californian Johnny B. Frank on bass. Stag and Frank had previously been members of the bands WWIII and Population 5. Kingdom Come marked the first band where Wolf sang without playing guitar. (The frontman later admitted that, for a while, it was a very awkward adjustment.)\n\nKingdom Come's sound was thought by many to be highly derivative of Led Zeppelin's, to the point that some listeners initially thought that Kingdom Come was actually a Led Zeppelin reunion. In 1988, Lenny &amp; company released their debut LP, Kingdom Come.\n\nOpening act for 1988 Scorpions Savage Amusement US Tour. They toured in England supporting Magnum on their Wings Of Heaven tour during that year.\n\nThe band's first single, &quot;Get It On,&quot; was a big enough hit on AOR stations that the band's eponymous debut went gold. Their second single/video for the power ballad &quot;What Love Can Be&quot; received much airplay on US radio and MTV. By the time the single/video &quot;Loving You&quot; was released, the album had sold to platinum status in the United States, Germany and Canada, among other music markets. The band was chosen to open for the North American Monsters of Rock tour in 1988, supporting Dokken, Scorpions, Metallica and Van Halen. Following that, they were tapped to support the Scorpions on their North American &quot;Savage Amusement&quot; tour, until they were forced off. (According to Stag, Lenny Wolf found the stage ramps reserved for the Scorpions' set irresistible. After several reprimands from The Scorpions' management, the singer continued to use the full stage and the band was asked to forfeit the rest of the tour. Coincidentally, Scorpions were also signed to PolyGram, though only in America.)\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:5ebaad37ee838d8dcf0a99ada08f4c15b641ec22","amp;dn":"Kingdom+Come+-+Get+It+On","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ebaad37ee838d8dcf0a99ada08f4c15b641ec22","infoHashBuffer":{"type":"Buffer","data":[94,186,173,55,238,131,141,141,207,10,153,173,160,143,76,21,182,65,236,34]},"announce":[],"urlList":[]}}