{"title":"Wondershare Video Converter Platinum v4.2.1.0+(patch) [Bit-Byte]","uid":5042056,"size":9239847,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5fa773f4df7449da0f83cb6d10ac5ef99a0c7fa6&amp;dn=Wondershare+Video+Converter+Platinum+v4.2.1.0%2B%28patch%29+%5BBit-Byte%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ProDvDRipper","files":2,"time":1249420689,"description":"Wondershare Video Converter Platinum is the best video converter software that can convert all common video files to various formats to meet different format requirements and for playback on most popular players including iPod, iPhone, Apple TV, Zune, PSP, Pocket PC, Creative Zen, PS3, Xbox 360, Archos and more. It is also the best HD video converterand AVCHD video Converter which can convert HD video and AVCHD video to avi, convert m2ts to avi, convert mts to avi, convert ts to mp4 etc with excellent quality.\n\nWondershare video converter supports almost video formats such as MP4,MKV, MOV, 3GP, AVI, WMV, RM, MPEG-1, MPEG-2, FLV, ASF and also HD video formats including M2TS, MTS, TS, TP and TRP. It also supports audio formats including M4A, WMA, WAV, MP3, AAC,MKA, AIFF, FLAC and AC3. With the video joiner of this all-in-one video format converter, you can even merge multiple files into a single video file, and can trim or crop to edit your videos according to your need.\n\nKey Features\n\nConvert video to all popular portable players\nSupport all popular video and audio players such as iPod, Zune, PSP, Pocket PC, Creative Zen, Archos, PS3, Xbox 360, Wii, HP iPAQ, iRiver and so on.\nFast speed, High Definition, Professional conversion\n\nConvert video, High Definition video to popular video with super fast speed, excellent quality.\n\nConvert between all stand video\nIt can convert between various stand video formats including MP4, MOV, 3GP, AVI, WMV,MKV, RM, MPEG-1, MPEG-2, FLV, ASF and more.\n\nNew upgrade to support high definition video and AVCHD Video\nConvert video to HD Video including HD ASF, HD AVI, HD MP4, HD MOV, HD WMV, HD MPG, HD VOB.\nConvert HD Video and AVCHD video including m2ts, mts, ts, tp, trp to popular video such as avi, mp4, flv etc.\n\nExtract Video to various Audio formats\n\nExtract audio from video to M4A, WMA, WAV, MP3, AAC, AC3, APE, MKA, OGG, AU, AIFF, FLAC etc.\n\nFast conversion speed\nProvide &gt;300% converting speed, so fast beyond your imagination and automatically shut down your PC after conversion.\n\nPowerful PSP and iPod manager tools\nBuilt- in iPod Video Transfer/PSP Movie Manager allow you to transfer files between PC and iPod/PSP freely.\nPowerful video editing\n\nTo crop, trim, merge, add watermark and subtitile to enjoy your personalized video\n\nCrop video\nEasily to crop video to create your ideal video with different screen size.\n\nTrim video files\nTrim your video files to convert your favorite movie clips.\n\nAdjust video output effect\nAdd special effect to your video such as Gray, Emboss, Negative, Old film.\n\nAdd Watermark\nAdd either text or image as watermark to coin and color your video files in a personalized way.\n\nProduce video with subtitle\nAllow you to add and edit subtitle with .MKV as source file and plug-in subtitle in SRT format to your video.\n\nMerge and split video clips\nComplete with a Video Joiner that lets you merge more than one file into a single file.\n\nCapture pictures\nCapture pictures from your video and save them as jpeg and bmp files.\n\nPreview and compare\n\nTwo real time preview windows let you compare and get the best video effects out of your movies.\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n\n\n\n\n*installation*\n\n1.Unpack with any archiver\n2.install setup.exe.\n3.copy and paste patch in the installer folder run\npatch below on the patch click patch done\n\n","torrent":{"xt":"urn:btih:5fa773f4df7449da0f83cb6d10ac5ef99a0c7fa6","amp;dn":"Wondershare+Video+Converter+Platinum+v4.2.1.0%2B%28patch%29+%5BBit-Byte%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fa773f4df7449da0f83cb6d10ac5ef99a0c7fa6","infoHashBuffer":{"type":"Buffer","data":[95,167,115,244,223,116,73,218,15,131,203,109,16,172,94,249,154,12,127,166]},"announce":[],"urlList":[]}}