{"title":"Coast to Coast AM - August 30th 2009 - Artificial Intelligence","uid":5074839,"size":56920616,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5feff046f8f8374f4e96c685d45d039eba18d243&amp;dn=Coast+to+Coast+AM+-+August+30th+2009+-+Artificial+Intelligence&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jeffchil","files":7,"time":1251735650,"description":"Artificial Intelligence\n\nDate:\n08-30-09\n\nHost:\nArt Bell\n\nGuests:\nBart Kosko\n\nBroadcasting live from Manila, Art Bell welcomed professor of Electronic Engineering at USC, Bart Kosko for a discussion on artificial intelligence, nanotechnology, noise, and other cutting edge spheres of scientific research. &quot;Things that used to be considered artificial intelligence, if you could achieve them, have long since been achieved,&quot; Kosko observed. To that end, he noted that calculus as well as voice and image recognition abilities were all once in the realm of AI.\n\nHe detailed various fields where replacing humans with computers ranged from problematic to beneficial. One such environment is the courtroom, where it might be possible for a computer to recognize the legal arguments against objections in a trial. However, Kosko said, &quot;if you get it wrong, it could have catastrophic consequences for the case.&quot; He explained that the field of medical diagnostics is moving towards more reliance on computers but will probably never fully embrace them because of the legal risks involved. One area where computers have helped ease the burden of humans is in aviation, he said, because &quot;it's subject to such well-behaved physical dynamics,&quot; many of which are extremely complex.\n\nOther topics covered by Kosko included the financial crisis, a situation that he was confident America would &quot;innovate our way out of,&quot; most likely through the field of nanotechnology. He also talked about his research into noise, which he called &quot;arguably the secret of life,&quot; since it plays a major role in the quantum level of all matter. On the concept of replacing the human brain with a computer, Kosko put forward the idea that a piece-by-piece transference would allow for a person to remain conscious throughout and, thus, &quot;there's no question about suddenly waking up in a chip that's not you.&quot; ","torrent":{"xt":"urn:btih:5feff046f8f8374f4e96c685d45d039eba18d243","amp;dn":"Coast+to+Coast+AM+-+August+30th+2009+-+Artificial+Intelligence","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5feff046f8f8374f4e96c685d45d039eba18d243","infoHashBuffer":{"type":"Buffer","data":[95,239,240,70,248,248,55,79,78,150,198,133,212,93,3,158,186,24,210,67]},"announce":[],"urlList":[]}}