{"title":"Joboshare Audio Converter 2.0.4 LATEST RIP--CONVERT--BURN","uid":5674665,"size":5327704,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:604ef44768c418c9c195207399727ced407f1e5b&amp;dn=Joboshare+Audio+Converter+2.0.4+LATEST+RIP--CONVERT--BURN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BLACKTROY","files":1,"time":1278474780,"description":"REMEMBER YOU GOT IT HERE FIRST\n\n\n\n                    Joboshare Audio Converter 2.0.4\n                   \nEnjoy listening audio/music with your CD player or burn a classic music CD for your friends as special gift. You could need our product-Joboshare Audio Converter. With this software, you can convert audio/video format to the target audio for burning new music CD, or easily let you rip your Audio CD contents on your computer for backup. And it provides three main solution for your CD as follows: \n\n1)Video/Audio Converter, it allows you to convert video formats (such as MP4, MPEG, WMV, AVI, MP4, 3GPP, 3G2, MOV, RM, RMVB, OGG, DV, H.264/AVC) and all popular audio formats (such as MP3, MP2, AC3, WMA, WAV, AAC, M4A, FLAC, OGG, AU) to the target audio format, such as MP4 to MP3, WAV to MP3, AAC to MP3, etc. \n\n2)Audio CD Ripper, as best CD ripper software, you can extract/rip music or audio from Audio CD to your computer for backup, such as MP3 CD to WMV, WMA CD to AAC, MP3 CD to M4A, etc. Enjoy them with the local player or upload to Internet for sharing. \n\n3)CD Burner, it can help you convert all popular video and audio formats, such as AVI, MPEG, WMV, MP4, 3GP, ASF, MOV, RM, MP2, MP3, WMA, WAV, AU, M4A, RA, OGG, and AC3 to audio formats and burn them to Audio CD, MP3 CD or WMA CD. \n\n\n\n\n Key Functions \n\nAudio Converter\nEasily convert audio formats MP3, MP2, AC3, WMA, WAV, AAC, M4A, FLAC, OGG, AU to the target audio format; \nSuch as WAV to MP3, AAC to MP3, MP3 to M4A, etc;\nVideo to audio Converter\nExtract audio from various videos, such as MPEG, MP4, WMV, AVI, MP4, 3GPP, 3G2, MOV, RM, RMVB, OGG, DV, H.264/AVC, etc.;\nAudio CD Ripper\nFast extract music from CD and rip audio to MP3, MP2, AC3, WMA, WAV, AAC, M4A, FLAC, OGG and AU;\nCD Burner\nAllow you to create Audio CD in directly way and burn video/audio files to Audio CD, MP3 CD or WMA CD for backup;\n Key Features \n\nBatch conversion\nMultithreading and batch conversion provide super fast conversion speed due to multi-core CPU support and convert multiple video files at a time;\nAudio parameter settings\nNot only the default but more settings to customize: Bit Rate, Sample Rate, Channel, Volume and Codec; \nTrim segment\nTrim video files to convert selected movie clips by setting start time and duration in the general panel;\nAudition of the audio files\nAllows you to preview video or Audio CD files with the built-in player before converting and have comparison with previous audio files you want to convert;\nEdit ID3 tags \nUsers can edit the ID3 tags such as files like Title, Author, Album, and Genre of audio to organize multimedia library;\nRun in Background\nYou can do other jobs while letting Joboshare Audio Converter run in the background;\nSet Action after Conversion\nChoose between Hibernate, Shut Down, Standby or Close Application to perform once conversion is done;\n\nUser-friendly UI\nJoboshare Audio converter is so easy to use audio converter which only a few clicks are enough to convert AVI to MP3, WMV to MP3, and so on;\nOptional skins and languages\nOffer several interface skins and English, and Chinese languages to meet your needs;\nWindows 7 supported\n\nSystem Requirements\n\nWindows 2000/2003/XP/Vista and Windows 7;\nIntel PentiumÃ‚Â® 4, Intel Centrino, Intel Xeon, Intel CoreÃ‚Â® Duo (or compatible) processor;\n512 MB RAM or more;\nMore than 30 MB free hard disk space;\n800x600 or higher Resolution, 16 bit or higher Graphic card.","torrent":{"xt":"urn:btih:604ef44768c418c9c195207399727ced407f1e5b","amp;dn":"Joboshare+Audio+Converter+2.0.4+LATEST+RIP--CONVERT--BURN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"604ef44768c418c9c195207399727ced407f1e5b","infoHashBuffer":{"type":"Buffer","data":[96,78,244,71,104,196,24,201,193,149,32,115,153,114,124,237,64,127,30,91]},"announce":[],"urlList":[]}}