{"title":"Eclipse Prophecy - Through The Storm (SINGLE)","uid":5111066,"size":11016402,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:60796d74d095b8dd699978cb28bc41e954d36f4b&amp;dn=Eclipse+Prophecy+-+Through+The+Storm+%28SINGLE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"powerflame","files":1,"time":1254739134,"description":"Through The Storm:\n\nThis is the first single released by Eclipse Prophecy from their first full lenght album. \nThe name of the album and also its release date haven't been revealed yet, so it's gonna be interesting to stay up to date with them!\n\nBIOGRAPHY\n\nFormed in Montreal in 2003 by David Mc Gregor, Eclipse Prophecy are one of power metal's most original, innovative and powerful power metal band rising from the new generation. Influenced by old school thrash metal and progressive / power metal, they know the meaning of rocking the stage! \n\nIn 2007, their first demo was sold in over 14 countries, was greatly acclaimed of the public and well received on the metal scene critics. The cover art was made by the talented Pascal Laquerre : Tormentor Allegoria and the &quot;PREVAIL&quot; Kataklysm album cover art. \n\nIn late 2007 they opened for the bands Epica and Visions Of Atlantis in Montreal. \n\nIn late 2008 they received an endorsement deal with the reknown company MADISON AMPS.Which many bands are using such as : Symphony X, Kamelot, Into Eternity, Cryptopsy and Eluveitie.\n\nIn August 2009, Patrice Hamelin (From Martyr and Quo Vadis) joined the band to fill the drums duties.\n\nIn September 2009 they opened for the bands Stratovarius and Pagan's Mind and their performance was a great success! \n\nEclipse Prophecy are now looking for a label and are working on their first full length album at the Audio Suites Studio with Pierre Pineault, knowing they are ready for the major leagues! \n\nMEMBERS\n\nDavid Mc Gregor - Vocals / Rhythm Guitars\nMartin Machado - Lead Guitars\nDanny Mc Gregor - Bass\nPatrice Hamelin - Drums\n\nOFFICIAL MYSPACE PAGE\n","torrent":{"xt":"urn:btih:60796d74d095b8dd699978cb28bc41e954d36f4b","amp;dn":"Eclipse+Prophecy+-+Through+The+Storm+%28SINGLE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60796d74d095b8dd699978cb28bc41e954d36f4b","infoHashBuffer":{"type":"Buffer","data":[96,121,109,116,208,149,184,221,105,153,120,203,40,188,65,233,84,211,111,75]},"announce":[],"urlList":[]}}