{"title":"Fallout 3 Broken Steel &amp; Point Lookout [Expansion][Spanish][XBOX","uid":5071774,"size":7838695485,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:610b89a2d59788b6f9dac5594be6ae25152a2a49&amp;dn=Fallout+3+Broken+Steel+%26+Point+Lookout+%5BExpansion%5D%5BSpanish%5D%5BXBOX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"laurinha","files":2,"time":1251469545,"description":"Broken Steel: Puede que gracias a ti el Enclave sufriera un buen revÃƒÂ©s con el Proyecto Pureza, pero sus tropas siguen ahÃƒÂ­ fuera y son una grave amenaza para el pueblo y la seguridad de Yermo Capital. En Broken Steel, tu personaje dejarÃƒÂ¡ atrÃƒÂ¡s lo sucedido con el Proyecto Pureza y trabajarÃƒÂ¡ codo con codo con la Hermandad del Acero para erradicar al Enclave de una vez por todas. ViajarÃƒÂ¡s a nuevos escenarios, como la Central Olney; manejarÃƒÂ¡s nuevas armas de destrucciÃƒÂ³n, como el caÃƒÂ±ÃƒÂ³n Tesla; te enfrentarÃƒÂ¡s a poderosas criaturas, como el Cacique Supermutante; quedarÃƒÂ¡s maravillado ante la potencia destructora de Liberty Primer; conseguirÃƒÂ¡s nuevos extras, como la devastadora AnomalÃƒÂ­a Nuclear... Ã‚Â¡y podrÃƒÂ¡s jugar a Fallout 3 hasta el nivel 30!\n\nPoint Lockout: Compra tu pasaje, sube a bordo del Duque Gambito y deja que Tobar el Barquero te conduzca hasta Point Lookout, una intrigante ciudad costera. Ã‚Â¿QuÃƒÂ© secretos encierra el destartalado parque de atracciones? Ã‚Â¿QuiÃƒÂ©n vive en la enorme mansiÃƒÂ³n? Ã‚Â¿Por quÃƒÂ© son tan importantes las pungas? Ã‚Â¿QuÃƒÂ© horrores esconde el turbio pantano? Point Lookout es la entrega para descarga mÃƒÂ¡s abierta de la saga; para que puedas explorar esta regiÃƒÂ³n insÃƒÂ³lita a tus anchas. Una lÃƒÂ­nea de acciÃƒÂ³n totalmente nueva que te invita a descubrir los secretos de la ciudad y a empuÃƒÂ±ar novedosas armas, como la escopeta de doble caÃƒÂ±ÃƒÂ³n, contra los peligrosos habitantes del pantano. AventÃƒÂºrate hacia Point Lookout... si te atreves. Y reza por que no sea un viaje sin retorno.\n","torrent":{"xt":"urn:btih:610b89a2d59788b6f9dac5594be6ae25152a2a49","amp;dn":"Fallout+3+Broken+Steel+%26+Point+Lookout+%5BExpansion%5D%5BSpanish%5D%5BXBOX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"610b89a2d59788b6f9dac5594be6ae25152a2a49","infoHashBuffer":{"type":"Buffer","data":[97,11,137,162,213,151,136,182,249,218,197,89,75,230,174,37,21,42,42,73]},"announce":[],"urlList":[]}}