{"title":"The starter wife s1e1-2","uid":5033174,"size":868251648,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6167e19977c35344a740e95f4b1ab77a837cd033&amp;dn=The+starter+wife+s1e1-2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":2,"time":1248986466,"description":"Molly Kagan has it all -- a movie-mogul husband, a beautiful daughter, a fabulous, expensively decorated mansion in Brentwood, access to the most exclusive country clubs and reservations at the hottest Los Angeles restaurants ... until she gets a phone call that changes everything.\n\nWith the call, Molly's husband, Kenny, informs her that he is leaving her and preparing a divorce to end their 10 years of marriage. Now, Molly has lost her &quot;Wife Of&quot; status and has been bumped to a &quot;Starter Wife&quot;, a considerable step down in the Hollywood social scene.\n\nNews travels fast in Los Angeles, and within hours, Molly is removed from the elite social calendar and is shunned by the other &quot;Wife Ofs&quot; that used to be her circle of best friends. And just when things couldn't get any worse, Molly learns that Kenny cheated on her with a pop star half her age. Just when Molly is about to give up, her friend Joan invites her stay at her beach house for the summer in Malibu Colony, one of the top private Hollywood hangouts.\n\nWith the support of friend, old and new, Molly learns she needs to stand on her own two feet and make the most of what life has thrown her way.","torrent":{"xt":"urn:btih:6167e19977c35344a740e95f4b1ab77a837cd033","amp;dn":"The+starter+wife+s1e1-2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6167e19977c35344a740e95f4b1ab77a837cd033","infoHashBuffer":{"type":"Buffer","data":[97,103,225,153,119,195,83,68,167,64,233,95,75,26,183,122,131,124,208,51]},"announce":[],"urlList":[]}}