{"title":"017-Coast to Coast-Ian Punett with Randy Frost 24 Apr 10 .m4a","uid":5567879,"size":106408334,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:61a108b94d7092f6e6e1c70b3a61543e604ba2e5&amp;dn=017-Coast+to+Coast-Ian+Punett+with+Randy+Frost+24+Apr+10+.m4a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"panzerfaust69","files":1,"time":1274051124,"description":"Compulsive Hoarders &amp; Open Lines\n\n\nDate:04-23-10\n\nHost:Ian Punnett\n\nGuests:Randy Frost, Open Lines\n\nFilling in for George Noory, Ian Punnett welcomed psychology professor Randy Frost, Ph.D., who discussed his research into compulsive hoarding. According to Frost, between 2 to 5 percent of the population are hoarders. They typically exhibit three interrelated problems: 1) excessive acquisition, 2) difficulty discarding things, and 3) inability to organize. In addition, a hoarder's identity often is tied to his or her possessions. As an example, Frost cited the case of Irene, a hoarder who collected hundreds of cook books, countless recipes from magazines and the cooking sections of newspapers, yet almost never cooked.\n\nFrost also detailed the tragic story of Langley and Homer Collyer. The brothers had packed their Harlem mansion with 170 tons of stuff, including thousands of books, bundles of newspapers, baby carriages, chandeliers, 17 keyboard instruments (including 14 pianos, two organs and a clavichord), the top of a horse-drawn carriage, and even a Model T car. A system of booby-trapped tunnels provided the only means of moving through the house, Frost said. Langley died in 1947 after one of his own traps fell and crushed him. Homer, who was blind and paralyzed, died shortly afterward from a heart attack induced by starvation, he added.\nOpen Lines\n\nThe latter half of the program featured Open Lines. Several callers phoned in to chat about chemtrails, as well as the topic of the previous two hours -- hoarding. Laura from Reading, Pennsylvania, admitted that she is a hoarder and has grieving feelings over some of her stuff that got moved to a location where she can no longer access it. Mark in Wichita, Kansas, indentified his mother as a hoarder. Mark said his mom became obsessed with collecting things, ranging from phone books to dolls to aluminum TV dinner trays, after the Great Depression.\n\nAn interesting call came in from Dwayne in South Haven, Michigan, who shared his fascinating theory of gravity. According to Dwayne, heat is the energy source powering gravity. &quot;If you had a mass the size of our planet and it had no heat energy, it would have no gravitational field,&quot; he proclaimed. Dwayne suggested a spaced-based experiment involving three spheres of different temperatures would prove his theory.\nWebsite(s):\n# smith.edu\nBook(s):\n# Stuff: Compulsive Hoarding and the Meaning of Things\n\n","torrent":{"xt":"urn:btih:61a108b94d7092f6e6e1c70b3a61543e604ba2e5","amp;dn":"017-Coast+to+Coast-Ian+Punett+with+Randy+Frost+24+Apr+10+.m4a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61a108b94d7092f6e6e1c70b3a61543e604ba2e5","infoHashBuffer":{"type":"Buffer","data":[97,161,8,185,77,112,146,246,230,225,199,11,58,97,84,62,96,75,162,229]},"announce":[],"urlList":[]}}