{"title":"Tales of Ghosts and the Supernatural - 1  (Discovery Channel)","uid":5055352,"size":3283846675,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:61ed265491416c0821eb6e30766d6a65d3220f53&amp;dn=Tales+of+Ghosts+and+the+Supernatural+-+1++%28Discovery+Channel%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sheila6","files":9,"time":1250380930,"description":"TV : Documentary : TV quality : English\n\n\n\nThese were originally uploaded as single files on TPB but have since rather spookily disappeared  ;)\n\nThe shows are constructed in a documentary style with a mix of recreations of what supposedly happened and interviews with the people that had the experiences. Even though I'm a skeptic of ghost stories I really enjoy these shows.\n\n\n\nEpisodes included:\n\nHell House: A family buys their dream home - a 19th-century farmhouse - in rural Connecticut, only to suffer violent attacks under strange circumstances. As evil lurks, a world-renowned team of psychic investigators is called in to determine what is present ... and what it wants.\n\nThe Haunting of Summerwind: On the shores of West Bay Lake, Wis., a loving family meticulously restoring a home becomes prey to a supernatural presence that drives a husband to the brink of homicidal madness.\n\nEchoes From the Grave: Convinced that buying a historic home is a dream come true, a family soon learns they're being threatened by unseen forces in a haunting that becomes increasingly intense and suggests their house is actually a way station between life and death.\n\nDarkness Follows: The diabolical, psychic link between a killer and his victim permeates a recently-renovated Montreal townhouse, and the new owners realize an unhappy ghost and the spirit of a coldhearted murderer are trying to sever family ties, past and present.\n\nLake Club Horror: In 1974, a one-time Springfield, Ill., dance hall and gambler's paradise is transformed into a rock 'n' roll nightclub besieged by phantom music, inexplicable blasts of cold air and an ominous warning that one of the new owners is about to die.\n\nGateway to Hell: In Wilder, Ky., country musician Bobby Mackey starts his own nightclub in an old, abandoned slaughterhouse. While renovating, Bobby's wife Janet and his employee Carl Lawson are physically assaulted by ghosts. Bobby refuses to believe their stories, until his friend Doug Hensley researches the history of the building and learns that two murderers disposed of a victim's remains in the basement.\n\nThe Diabolical: Marie Potter has always known that her mentally handicapped daughter Julie has the ability to communicate with paranormal entities, but it seems rather harmless to her. However, when odd occurrences begin to take place, Marie and her new boyfriend Chris use a Ouija board in an attempt to find out what Julie is communicating with, and inadvertently open a gateway for a demonic force.\n\nHaunting In Connecticut: When the Parker family moved into a Connecticut rented home in 1986, they were faced with crucifixes, coffin keys and toe tags; they had just moved into a former funeral parlour. They packed away all the funeral paraphernalia but this did not keep the spirits at bay and within a couple of months, the children told their mother that they often saw three men by their beds at night. Mr and Mrs Parker endured frightening experiences, such as hearing funeral music and seeing doors open and shut without reason. The encounters only got worse - Mrs. Parker witnessed her niece fighting off an attack by an unseen intruder while she lay in bed. Mr and Mrs Parker, at their wits end, hired a controversial couple who specialise in the supernatural. The demonologist and his clairvoyant wife attempted to rid the house of the evil spirits through an exorcism.\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:61ed265491416c0821eb6e30766d6a65d3220f53","amp;dn":"Tales+of+Ghosts+and+the+Supernatural+-+1++%28Discovery+Channel%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61ed265491416c0821eb6e30766d6a65d3220f53","infoHashBuffer":{"type":"Buffer","data":[97,237,38,84,145,65,108,8,33,235,110,48,118,109,106,101,211,34,15,83]},"announce":[],"urlList":[]}}