{"title":"Clique Girlz - Then I Woke Up  (2nafish)","uid":5508155,"size":203995140,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:624e792175c1fbcbe6a572e3b74528aa415868cc&amp;dn=Clique+Girlz+-+Then+I+Woke+Up++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1271927089,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nIncredible is the debut album of girl group Clique Girlz. In promotion of the upcoming album, an EP  entitled Clique Girlz was released in April 2008. The band also released &quot;Incredible,&quot; a single available for digital download on iTunes and other online music stores. They also released another EP entitled Smile  to iTunes. Their last release was an EP called Incredible.\n\nThe album features the singles: &quot;Then I Woke Up&quot;, and &quot;Incredible.&quot; It also includes many other songs that have been released before by the Clique Girlz, such as &quot;Smile&quot; and &quot;The Difference In Me.&quot;\n\nIncredible was supposed to come out in the summer of 2008, but the album was pushed back several times until the summer of 2009. No official release date has been announced yet.\n\nThe Clique Girlz have filmed music videos for &quot;Then I Woke Up,&quot; &quot;Incredible&quot; and &quot;You Think.&quot;\n\nThe group performed &quot;Incredible&quot; on The Today Show on June 17, 2008, along with many other promotional appearances opening for many artists such as: Demi Lovato, and the Jonas Brothers, The Cheetah Girls and The Backstreet Boys.\n\nThe Clique Girlz (formerly known as Clique) are an American  girl group consisting of sisters Destinee and Paris Monroe.\n\nIn 2004, Ariel Moore met sisters Destinee and Paris Monroe at school, and developed a friendship. The three started to perform together as a group, named Clique, with the Monroes' mother, Lenore, aidk idkds the group's manager.\n\nThe group recorded the song &quot;Lemonade&quot; for Alex's Lemonade.\n\nIn 2006, the group attended a &quot;meet and greet&quot; before a Backstreet Boys concert, where band member Howie D invited them to open the show. They opened for other artists including Billy Ray Cyrus, The Click Five, Kirk Franklin, and the Jonas Brothers.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:624e792175c1fbcbe6a572e3b74528aa415868cc","amp;dn":"Clique+Girlz+-+Then+I+Woke+Up++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"624e792175c1fbcbe6a572e3b74528aa415868cc","infoHashBuffer":{"type":"Buffer","data":[98,78,121,33,117,193,251,203,230,165,114,227,183,69,40,170,65,88,104,204]},"announce":[],"urlList":[]}}