{"title":"Discovery - Project Earth","uid":5087010,"size":5537874458,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:6266e4dee3e51b3e0ef19712c1882f656ac57c4c&amp;dn=Discovery+-+Project+Earth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"botuloid","files":9,"time":1252796103,"description":"&quot;Discovery Project Earth&quot; premiered on the Discovery channel on 22 August 2008. You've heard the dire warning, you've seen the detailed PowerPoint, you've even bought that light bulb with the swirls, but how about some real action? Now the world's leading scientists meet three uncompromising visionaries to put the most ambitious geo-engineering ideas to the test, tackling global climate change in &quot;Discovery Project Earth&quot;.\n\nFrom covering acres of Greenland's glaciers in protective blankets to stop it from melting to constructing space rockets to send tiny reflective lenses into orbit to planting thousands of saplings via a mass aerial drop to reforest barren areas, these are experiments on an epic scale. Each one will push the boundaries of science and technology, but will they produce groundbreaking environmental results?\n\nThis torrent contains the entire series, with all files having the following properties:\n\nLength: ~44 min\nResolution: 1280 x 720\nAspect ratio: 1.7778\nVideo Bitrate: 1500 kbps\nFPS: 29.970\nVideo Codec: x264\n\nAudio Bitrate: 384 kbps\nFreq: 48,000 Hz\nChannels: 2\nAudio Codec: a52\n\nS01E01 - Engineering the Future (Aug/22/2008)\nBasically just an introduction to the series, and a preview of the technologies to be tested out.\n\nS01E02 - Wrapping Greenland (Aug/22/2008)\nDr. Jason Box, a glacierologist from Ohio State University wants to prevent glaciers from melting by covering them with blankets that will reflect the power of the sun. Jason is convinced that his specially chosen material is resilient enough for Arctic conditions but just how indestructible is it really?\n\nS01E03 - Raining Forests (Aug/29/2008)\nTrees are great &quot;carbon absorbers&quot; and this episode tests an ambitious program to replenish the World's forests by planting saplings via a massive helicopter launch system.\n\nS01E04 - Brighter World (Aug/29/2008)\nJohn Latham, an atmospheric physicist based at the National Center for Atmospheric Research in Colorado, and Stephen Salter, an Edinburgh University engineer, believe that by changing the size of water droplets in clouds they can increase the clouds ability to reflect the sun and stop global warming. Their vision is to build a flotilla of ships that will roam the world's oceans and seed clouds with minute particulates.\n\nS01E05 - Infinite Winds (Sep/05/2008)\nFred Ferguson, a Canadian engineer specializing in airships, has designed a revolutionary wind turbine that will use the constant winds that exist at 1,000 feet above sea level to produce energy. Testing a 70 foot prototype for the first time, they will need to prove that is can convert this untapped energy into electricity.\n\nS01E06 - Hungry Ocean (Sep/05/2008)\nOceans cover 70 percent of our planet and are the most important carbon sink we have, but the phytoplankton that converts carbon dioxide into living matter is dying off from climate change. Dr. Brian von Herzen of the California Institute of Technology will deploy five wave-powered pumps in the rough Hawaiian surf in an attempt to restore this critical natural mixing effect.\n\nS01E07 - Space Sunshield (Sep/12/2008)\nAstronomer and professor Roger Angel thinks he can diffract the power of the sun by placing trillions of lenses in space and creating a 100,000 square mile sunshade. See how the lenses are constructed and the rocket delivery system is tested in this audacious experiment to reduce the planet's warming.\n\nS01E08 - Orbital Power Plant (Sep/12/2008)\nWe could have a source of never-ending power and, at the same time, reduce our carbon emissions to virtually zero by sending thousands of satellites into space, which will gather energy from the sun and then beam them down to earth as a microwave. Former NASA physicist John Mankins puts his theory into practice.\n\nS01E09 - Fixing Carbon (Sep/19/2008)\nWhat if we could remove the global warming problem simply by scrubbing the air clean of carbon dioxides and adding to the greenhouse gases? 2006 Canadian Geographic Environmental Scientist of the Year Canadian professor David Keith, believes he can using a machine which pulls in ambient air, sprays it with sodium hydroxide solution and then releases it back as clean air.","torrent":{"xt":"urn:btih:6266e4dee3e51b3e0ef19712c1882f656ac57c4c","amp;dn":"Discovery+-+Project+Earth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6266e4dee3e51b3e0ef19712c1882f656ac57c4c","infoHashBuffer":{"type":"Buffer","data":[98,102,228,222,227,229,27,62,14,241,151,18,193,136,47,101,106,197,124,76]},"announce":[],"urlList":[]}}