{"title":"Army Men - Sarge's War [2004]","uid":5021815,"size":753472655,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:62caa09d6e064875e35412c5ccf14a7f682eb588&amp;dn=Army+Men+-+Sarge%5C%27s+War+%5B2004%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Fox_Almighty","files":2,"time":1248497813,"description":"Army Men - Sarge's War [2004]\n\n\nPlot\nThe game begins with an attack on Greentown by the Tan army and Sarge battling through the war-torn city to save it. After the battle, Sarge is informed by Colonel Grimm that the Tan Army has surrendered and that there will be a peace ceremony later that night, but that a rogue Tan division - Operation &quot;Vengeance&quot; - led by Lord Malice has stolen some infantry molds and can now build an army. Sarge's mission is to find and terminate Malice.\n\nSarge arrives in the area (a beach) and battles his way to the Tan portal. There, he discovers plans indicating that Malice has placed a bomb at the peace ceremony, hidden in the Peace Statue. Sarge charges through the portal to stop the ceremony, but he is too late - as the bomb goes off, his entire squad, as well as Plastro, Colonel Grimm, the Heroes and the Green and Tan armies are annihilated. Sarge then sets out to kill Malice.\n\nHe battles his way through the remains of Greentown to another Tan portal. Upon proceeding through the portal he finds himself in Malice's artillery base. Sarge destroys all the artillery and discovers a plastic well mine that Malice is using to build his army. Sarge floods the mine, rendering it nearly useless. He then travels across the desert to Malice's castle. Malice is using the castle as a communication center for his air and ground forces, as well as a prison base for some of the Green army's finest men. Sarge penetrates the castle's defenses, frees the prisoners and destroys the communications tower. Discovering a passage from the castle to a kitchen in the Real World, Sarge flashes back to a time when he was in a similar kitchen, in a squad led by Major Gooding. During the mission, Gooding is ambushed by Tan forces. Sarge finds Gooding's arm near the sink, leading him to the conclusion that Gooding is dead. As Sarge calls for extraction, the flashback ends, and Sarge moves forth.\n\nAt the end of the game, Sarge finally reaches Lord Malice's headquarters, where he battles Malice himself. After defeating and fatally wounding Malice, Sarge asks him why he killed the Greens and Tans in Greentown. Malice reveals that it was simply to make Sarge suffer. Sarge removes Malice's facemask and discovers that he was actually Major Gooding, who was accidentally left for dead. Eventually, the Tan found him and turned him into the Lord Malice he is now. At the end of the scene, Sarge is seen walking out, saying that war makes ultimately no sense.\n\nThe closing animation reveals storage tubes inscribed with the names of the deceased soldiers from the Greentown attack, hinting that Col. Grimm and the Heroes, along with Vikki, may not have died, and perhaps Malice had simply killed copies of them in order to play on Sarge's emotions - an action that ultimately was the Lord Malice's undoing.\n\n\nGenres: Action, shooter \nModes: Single-player, multiplayer \n\nNOTES: I bought the cd, stuck it in the drive, installed it, worked fine, hated the game but noticed other ppl wanting it to complete their collection, so here it is... The .iso image should work flawlessly on Windows XP SP3 and lower... I can't vouch for Vista cuz well... Vista sucks... Vista is random with all programs and games...\nDon't complain that the game isn't working, instead, figure out the solution and post it here, so others can know about it... Complaining is a waste of time since it solves nothing and my description clearly says it's a new cd which couldn't possibly have errors on it.\n\nInstall and play, and make sure you seed a little bit cuz I'm sure this torrent won't survive long without your help.","torrent":{"xt":"urn:btih:62caa09d6e064875e35412c5ccf14a7f682eb588","amp;dn":"Army+Men+-+Sarge%5C%27s+War+%5B2004%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62caa09d6e064875e35412c5ccf14a7f682eb588","infoHashBuffer":{"type":"Buffer","data":[98,202,160,157,110,6,72,117,227,84,18,197,204,241,74,127,104,46,181,136]},"announce":[],"urlList":[]}}