{"title":"Paramore - Misery Business","uid":5094466,"size":120307716,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:62d494fecb9dac105648addaae502c18d58e93c2&amp;dn=Paramore+-+Misery+Business&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1253439427,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Misery Business&quot; is the first single from Paramore's second album, Riot!. &quot;Misery Business&quot; was the third Paramore video to be directed by Shane Drake, and was nominated for the &quot;Best Video&quot; award at the Kerrang! Awards 2007, but lost to Fall Out Boy's &quot;This Ain't a Scene, It's an Arms Race&quot;.\n\nThis song is featured in the video games Saints Row 2 and NHL 08 and also featured in Guitar Hero World Tour.\n\nThe music video was filmed at Reseda High School in Reseda, California on December 21, 2006, and features a school and a band performance. It is directed by Shane Drake who also directed the videos for &quot;Pressure&quot; and &quot;Emergency&quot;. It stars Amy Paffrath as the bully.\n\nThe music video starts out with the band playing the song with an assortment of &quot;RIOT!&quot;s (a reference to the albums name) in the background. It switches from the band playing to a high school, where a girl in a blue dress and heavy makeup walks in. The girl pushes the school cheerleaders aside her as she walks into the hallway. She cuts off a girl's braid with scissors, grinning at the girl while showing it to her. Later, as she is walking down the hall, a boy comes out of the nurse's station with his arm in a sling. She proceeds to push him into the wall, further injuring him. The band plays more, and the girl walks up on a girl and a boy together, obviously in love. She pushes the girl's face out of the way, and goes into a passionate kiss with the boy, then leaves, smiling. It switches again to the band playing, then the band comes out of a classroom together. Hayley (Williams) and the girl confront each other in the hall. Hayley reaches into the girl's bra and pulls out &quot;false&quot; pads, then uses a towel and wipes the girl's makeup off, exposing her for what she is. The video ends as the band finishes the song; and they walk away as Zac Farro turns around and laughs.\n\nIn the week ending June 21, 2007, &quot;Misery Business&quot; managed to debut at #99 on the Billboard Hot 100. &quot;Misery Business&quot; is the third charting single for the group in the United States. In the following week the song went up 13 positions to reach #86. Due to increased digital downloads during the month of August 2007, most notably during the latter half of the month, it re-entered the Billboard Hot 100 during the chart week of September 1, 2007 at #34, which was its peak until the chart week of January 5, 2008, when the song reached #31. Its current peak is #26. It also peaked at #3 on the Hot Modern Rock Tracks chart, and at #7 on the iTunes chart. The song was certified Platinum in the U.S on September 17, 2008, selling over 1,000,000 copies.\n\nThe single will be re-released in the UK accorto Record Store. It was re-released on February 11, 2008 and includes 3 vinyl records. It has been a success in many countries in Latin America including Mexico, Colombia, Argentina, Chile and others.\n\nThe single, to date, has peaked at #17 on the UK Singles Chart. It is also the group's first charting single in the UK.\n\n&quot;Misery Business&quot; has also debuted on the Dutch Top 40 peaking at #28 and in Finland at #23. It peaked on the German Top 40 at #12, which is the band's peak position in Germany.\n\nAlternative Press named &quot;Misery Business&quot; Video of the Year in 2007.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:62d494fecb9dac105648addaae502c18d58e93c2","amp;dn":"Paramore+-+Misery+Business","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62d494fecb9dac105648addaae502c18d58e93c2","infoHashBuffer":{"type":"Buffer","data":[98,212,148,254,203,157,172,16,86,72,173,218,174,80,44,24,213,142,147,194]},"announce":[],"urlList":[]}}