{"title":"Dead Ringers  (BBC  - Series 01 to 07 Complete)","uid":5136289,"size":901003417,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6332f4ec829602c462edb9175df767d89ad85acc&amp;dn=Dead+Ringers++%28BBC++-+Series+01+to+07+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dougietrotter","files":-1,"time":1256503494,"description":"Dead Ringers - Series 01 to 07 - Audio Comedy - BBC7 via DVB-T  \n\n\n34 x 30 Minute Episodes - 128Kbps - Mp3\n\n\n\n\nDead Ringers is a UK radio (and television) comedy impressions show on BBC Radio 4  \n\nDespite its emphasis on British personalities who may not be well known in other countries, Dead Ringers has been shown outside the UK on BBC Prime in Europe and Africa, BBC America in the United States, ABC in Australia, BBC Canada in Canada and UK.TV in New Zealand, but has had to be re-edited considerably; although much of the show can be watched without contextual knowledge.\n\nDead Ringers transports you to an alternative Radio 4 where deadly continuity announcers rule the roost and Home Truths finally (inevitably?) clashes with John Peel's Radio 1 Show. Where a desperate Time Lord calls directory enquiries in search of his sworn arch-enemy and Alan Bennett and Thora Hird are the kind of thugs you most certainly wouldn't share your buttered scones with.\n\n\n\n\n\nDead Ringers - S01 - E01 - London, Last Thursday Night\nDead Ringers - S01 - E02 - You're Listening To The Today Programme\nDead Ringers - S01 - E03 - Thank You For Coming To The Interview, Mr Boyle\nDead Ringers - S01 - E04 - The News At 9 O'clock\n\nDead Ringers - S02 - E01 - Well, Time Now To Grill Headlines Over A Live Flame\nDead Ringers - S02 - E02 - Hi, It;s Gary Lineker Here.\nDead Ringers - S02 - E03 - And Hearts Were Lifted This Week\nDead Ringers - S02 - E04 - Ewan, We Need To Talk\nDead Ringers - S02 - E05 - Yes, It's Me, Trevor McDonald\nDead Ringers - S02 - E06 - And Here She Is Waving Regally To The Crowd\nDead Ringers - S02 - E07 - You're Listerning To. Today\nDead Ringers - S02 - E08 - Lovely, Welcome To Dibley Everyone\n\nDead Ringers - S03 - E01 - You're Listening To Today Where It's 24 Hours From Tulsa\nDead Ringers - S03 - E02 - G'day There. It's Your Old Mate Rolf Here\nDead Ringers - S03 - E03 - We Talk Tonight\nDead Ringers - S03 - E04 - What A Long But Rewarding Day That Was Cherie\nDead Ringers - S03 - E05 - What A Momentous Moment This Is Sue\n\nDead Ringers - S04 - E01 - This Is Bbc Radio 4. In Half An Hour, The Archers\nDead Ringers - S04 - E02 - Er, Mr President. Great News. They;ve Said Yes\nDead Ringers - S04 - E03 - As Leader Of This Conservative Party\nDead Ringers - S04 - E04 - People Of Great Britain, This Is Your Prime Minister\n\nDead Ringers - S05 - E01 - And As The Race Draws To A Close\nDead Ringers - S05 - E02 - Well, I'm Leaving You J R\nDead Ringers - S05 - E03 - People Of Britain. No, We Were Not Dreaming\nDead Ringers - S05 - E04 - (Never Broadcast, 9-11)\n\nDead Ringers - S06 - E01 - People Of Great Britain, This Is Your Prime Minister\nDead Ringers - S06 - E02 - Ok, Ok, Er Gentlemen Of The Press, Welcome To The White House\nDead Ringers - S06 - E03 - Ah, Mr President. Can We Stop Looking For It Now\nDead Ringers - S06 - E04 - BBC Radio 4, I'm Charlotte Green\nDead Ringers - S06 - E05 - People Of Britain, My Visit To The Indian Subcontinent\n\nDead Ringers - S07 - E01 - You Join Us On A Very Solemn Day\nDead Ringers - S07 - E02 - And Now On R4, Its Time For The Archers\nDead Ringers - S07 - E03 - On The Week That He Is Celebratified\nDead Ringers - S07 - E04 - Yes, You Join Me John Motram\nDead Ringers - S07 - E05 - Golden Jubilee Special\n\n\nAudio Format    : MP3\nDuration Approx : 28mn 54s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n\n\nEnjoy and Seed!!\n","torrent":{"xt":"urn:btih:6332f4ec829602c462edb9175df767d89ad85acc","amp;dn":"Dead+Ringers++%28BBC++-+Series+01+to+07+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6332f4ec829602c462edb9175df767d89ad85acc","infoHashBuffer":{"type":"Buffer","data":[99,50,244,236,130,150,2,196,98,237,185,23,93,247,103,216,154,216,90,204]},"announce":[],"urlList":[]}}