{"title":"TweakNow RegCleaner Pro v4.6.3 Portable","uid":5134415,"size":11214064,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:637032f592aa9f829037cbe00ff419de777c6c8d&amp;dn=TweakNow+RegCleaner+Pro+v4.6.3+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NoExcuses","files":3,"time":1256376629,"description":"TweakNow RegCleaner v4.6.3 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Patch are included.\n\n\nThe Registry is a heart and soul of any Windows system. It contains information that controls how your Windows appears and how it behaves. Most applications today use registry to store configuration and other important data. When you install an application,  a new registry entries will be created. These entries will automatically be deleted when you uninstall the application. Unfortunately, it does not always work that way.  Sometimes, you will find that some applications fail to remove their own registry entries. These entries will become obsolete. \nAfter a long period, after installing and uninstalling a lot number of applications, your Windows registry will contain a large number of obsolete entries. These will significantly increase the registry size and thus will slowdown your computer, because Windows will need more time to load, search, and read data from registry.\n\nTo keep your computer in top performance, it is recommended to periodically clean your Windows registry.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.tweaknow.com/RegCleaner.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tweaknow.com/RegCleaner.html&lt;/a&gt;\n\n\nThis package contains a first Portable version built using RunHiddenConsole.exe to start the Batch file that changes some values in Registry, runs the program and deletes the Registry values when exiting from the program just to avoid having the sloppy DOS window in the background. Some AVs complain with it recognizing RunHiddenConsole.exe as a malicious/potentially harmful program as it can be used to hide malicious behaviours. If it's your case, or just don't trust in the first one, use the second version.\n\n\nThe Portable SFX EXE files are built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built up on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:637032f592aa9f829037cbe00ff419de777c6c8d","amp;dn":"TweakNow+RegCleaner+Pro+v4.6.3+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"637032f592aa9f829037cbe00ff419de777c6c8d","infoHashBuffer":{"type":"Buffer","data":[99,112,50,245,146,170,159,130,144,55,203,224,15,244,25,222,119,124,108,141]},"announce":[],"urlList":[]}}