{"title":"Coast to Coast AM - Aug 20 2009 - Crystal Skulls Special","uid":5064658,"size":55508865,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:64239a9da9edf87e3db9ec0dc26c7ecc5fd57b5b&amp;dn=Coast+to+Coast+AM+-+Aug+20+2009+-+Crystal+Skulls+Special&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1250867598,"description":"A special show on the powers and mysteries of Crystal Skulls featured five different guests, who will all be appearing at the upcoming Crystal Skulls Festival/World Mysteries Conference. Professional astrologer and student of the paranormal, Cece Stevens, who's organized the conference, came on first. She works with a crystal skull called &quot;Bob&quot; that was carved by a shaman five years ago. Because the crystal itself is ancient, the skull's age doesn't necessarily reflect its power, she explained. She sees the skulls as transmitters and receivers, and &quot;Bob&quot; is known to grant people wishes, she said.\n\nSherry Whitfield Merrell, known for working with angels, is the caretaker of a skull named &quot;Synergy,&quot; who is said to be made by a tribe in the South Pacific. The 15 1/2 pound skull is thought to be modeled after a real human skull as it has slight imperfections that might be found in a person. Curiously, it has a second crystal growing through its cheekbone, she detailed. Merrell believes the crystal skulls can reflect, refract, transform, store, and amplify energy, and that the oldest ones can act as witnesses. \nPsychic medium Jane Doherty talked about interactions with her skull, &quot;Maya,&quot; whose appearance has changed over time, going from milky white to clear. At a lecture tour in Chicago, while a man was holding &quot;Maya,&quot; smoke was seen rising from the skull, and &quot;Maya&quot; also moved slightly when on her dresser, she reported. Doherty suggested that the crystal skulls have UFO/ET connections, and that some of the skulls could be serving as a kind of monitoring device for the aliens.\n\n\nIncan medicine man Wachan talked about his mission to bring love and respect to Mother Nature, as Earth can be considered a living being. Author Jaap van Etten said the Conference will feature the largest number of crystal skulls ever gathered together, and that interest in them has increased exponentially. The way a skull is carved creates a particular field of vibration that people can resonate with, he noted.\n\nTitor Update\nFirst hour guest, Oliver Williams shared an update on the John Titor time travel story. Titor, an alleged time traveler who made computer forum postings in 2000 and 2001 about the future, had predicted America would be headed into another civil war. By 2009, states rights would be a paramount issue, he wrote, and Williams noted that Texas may consider seceding from the union over various issues. Titor further predicted that Russia would stage a nuclear attack against American cities, and this would actually aid one side in America's civil war.\n\n[This information has been shared to spread knowledge to those who otherwise would not have access to it.  If you can afford it please support www.coasttocoast.com]","torrent":{"xt":"urn:btih:64239a9da9edf87e3db9ec0dc26c7ecc5fd57b5b","amp;dn":"Coast+to+Coast+AM+-+Aug+20+2009+-+Crystal+Skulls+Special","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64239a9da9edf87e3db9ec0dc26c7ecc5fd57b5b","infoHashBuffer":{"type":"Buffer","data":[100,35,154,157,169,237,248,126,61,185,236,13,194,108,126,204,95,213,123,91]},"announce":[],"urlList":[]}}