{"title":"Pitbull - Hotel Room Service","uid":5109288,"size":165210116,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:645df189bd5f402b4e4fb5c511a99998c6b598e6&amp;dn=Pitbull+-+Hotel+Room+Service&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1254636349,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Hotel Room Service&quot; is a song by hip-hop artist and rapper Pitbull released as the third single from his upcoming album, Rebelution. The song features samples of &quot;Push the Feeling On&quot; by Nightcrawlers. It was released to both iTunes and mainstream radio on June 16, 2009. It has peaked at #8 on the Billboard Hot 100, making it his second most popular single after I Know You Want Me (Calle Ocho).\n\nThe song references &quot;Whatever You Like&quot; by T.I. when it says &quot;And like T.I.'s Whatever You Like&quot;; &quot;Gimme that sweet, that nasty, that gooshy stuff&quot; is a line from Jay-Z's &quot;I Just Wanna Love U (Give It 2 Me)&quot;; &quot;Pull that g-string down south&quot; is taken from The Notorious B.I.G.'s &quot;Nasty Girl&quot; and the line &quot;We at the hotel, motel, holiday inn&quot; is a line in the song &quot;Rapper's Delight by the Sugarhill Gang. On September 16, the official remix to &quot;Hotel Room Service&quot; was released, which features The Pussycat Dolls lead singer Nicole Scherzinger. The song also implies Infidelity with the line &quot;Forget about your boyfriend and meet me at the hotel room&quot;.\n\nJim Jonsin and Feisty from For the Love of Ray J make cameo appearances in the video. The popular model, Sagia CastaÃƒÂ±eda, who appeared in the I Know You Want Me (Calle Ocho) video also appears in this video as well.\n\nRebelution is the fourth studio album by Miami rapper Pitbull, released on September 1, 2009. Featured guests include Akon, Avery Storm, Nayer, Lil Jon, The New Royales, Bass III Euro &amp; Slim of 112. It is also his first album to be released on his own Mr. 305 Inc. label.\n\nArmando Christian PÃƒÂ©rez (born 1981), better known by his stage name Pitbull, is an American recording artist. His first recorded performance was from the Lil Jon album Kings of Crunk in 2002, after which he released his debut album in 2004 titled M.I.A.M.I. (short for Money Is a Major Issue) under TVT Records. Since then, he has released two other albums under the label, El Mariel in 2006 and The Boatlift in 2007. He is also the host of his own Spanish-language program on the cable channel Mun2 titled La Esquina (Spanish for The Corner).\n\n\nSome lyrics are censored in this video.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:645df189bd5f402b4e4fb5c511a99998c6b598e6","amp;dn":"Pitbull+-+Hotel+Room+Service","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"645df189bd5f402b4e4fb5c511a99998c6b598e6","infoHashBuffer":{"type":"Buffer","data":[100,93,241,137,189,95,64,43,78,79,181,197,17,169,153,152,198,181,152,230]},"announce":[],"urlList":[]}}