{"title":"Need.For.Speed.Shift-RELOADED","uid":5089786,"size":5408616355,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:649181f6093d839e33547c7dfad8faeaac59b619&amp;dn=Need.For.Speed.Shift-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"iCom1337","files":-1,"time":1253041798,"description":"Need for Speed: Shift (c) Electronic Arts\n\n09/2009 :..... RELEASE.DATE .. PROTECTION .......: Securom/Serial\n1 :.......... DISC(S) .. GAME.TYPE ........: Racing\n\nFeel what its really like to race high-end performance cars as Need for\nSpeed SHIFT thrusts you into the heart of the action for the true drivers\nexperience. Immersive and exciting features such as a stunningly realistic\nfirst-person cockpit view and an all-new crash mechanic deliver an unrivaled\nsensation of the speed and exhilaration of racing a car on the extreme edge\nof control. Plus, an ultra-realistic physics engine lets you feel every bump\nas you race around some of the worlds top tracks. Whether youre battling\nonline or playing through your career, build your unique driver profile from\nmoment to moment and from race to race and get rewarded for driving the way\nyou want to drive.\n\nFeatures\n* The True Drivers ExperienceAn unrivalled in-car experience and new\nphysics engine deliver the severe G-forces, bumps, and impact of being\nbehind the wheel of an elite race car.\n* Driver ProfileWhat kind of driver are you? Your unique driver profile\ntracks your evolution as a race driver from event to event based on your\ndriving skill and style. Will you be respected or feared?\n* Dynamic Crash EffectsFeel your car take damage as you hit a static object\nor opponents car. A combination of visual and audio effects will leave you\ndisorientated and briefly disrupt the race.\n* Customize Your CarTailor almost every aspect of your car with the\ncomprehensive customization system. Go under the hood to increase the cars\nperformance then personalize its look inside and out to reflect your\nindividual style.\n* Take the Race OnlineYour driver profile continues to build online and\nhelps match you against the most suitable rivals for your ability.\nKeep building your skills and work your way toward challenging the best\ndrivers in the world.\n\n1. Unrar.\n2. Burn or mount the image.\n3. Install the game.\n4. Copy over the cracked content.\n5. Play the game.\n6. Support the software developers. If you like this game, BUY IT!\n\nSystem requirements:\nMINIMUM:\n\nOperating System Windows XP Service Pack 3 or Vista Service Pack 1\nCPU: Intel Pentium 4 (or equivalent) CPU running at 3,2GHz or higher (3.4GHz for Windows Vista)\nMemory: 1GB RAM (Vista 2GB)\nHard Drive Space: 10 GB of free space\nGraphics Hardware: 256 MB RAM with Pixel Shader 3 (PCI-Ex)\nSound Hardware: DirectX 9.0c compliant card (DirectX 10.1 compliant if applicable)\nDVD Drive: 8X or faster DVD Drive\nFor Online Play: Network card with broadband connectivity\n\n\nRECOMMENDED:\n\nOPERATING SYSTEM: Windows XP Service Pack 3 or Vista Service Pack 1\nCPU: Intel Core 2 Duo 2,5GHz or AMD 64 X2 2,0 GHz\nMEMORY: 2GB RAM (Vista 3GB)\nHard Drive Space: 10 GB of free space\nGRAPHICS HARDWARE: 512 MB RAM with Pixel Shader 3 (PCI-Ex)\nSound Hardware: DirectX 9.0c compliant card (DirectX 10.1 compliant if applicable)\nDVD Drive: 8X or faster DVD Drive\nFor Online Play: Network card with broadband connectivity","torrent":{"xt":"urn:btih:649181f6093d839e33547c7dfad8faeaac59b619","amp;dn":"Need.For.Speed.Shift-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"649181f6093d839e33547c7dfad8faeaac59b619","infoHashBuffer":{"type":"Buffer","data":[100,145,129,246,9,61,131,158,51,84,124,125,250,216,250,234,172,89,182,25]},"announce":[],"urlList":[]}}