{"title":"Coast to Coast AM - August 26th 2009 - Mysterious Locations &amp; Cr","uid":5072912,"size":56355203,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:650a297c908e47a4f204ed670a772e92650028c8&amp;dn=Coast+to+Coast+AM+-+August+26th+2009+-+Mysterious+Locations+%26+Cr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jeffchil","files":6,"time":1251564600,"description":"Mysterious Locations &amp; Creatures\n\nDate:\n08-26-09\n\nHost:\nGeorge Noory\n\nGuests:\nDavid Hatcher Childress, Steve Alten\n\nAuthor, researcher, and archaeologist David Hatcher Childress spoke about a variety of mysterious and sometimes ancient places and creatures. There is evidence of ancient visitors to the New World, who may have come here by boat as far back as 1,000 to 2,000 BC, he said. He cited an expedition to the Grand Canyon reported in the Phoenix Gazette in 1909, in which artifacts such as a Buddha-like statue were found, as well as the case of the Elephant Stone of Aztec, New Mexico in which elephants and hieroglyphics were carved into ancient slabs.\n\nAmong some of Childress' other intriguing observations and reports:\n\n    * Huge vulture-like birds resembling teratorns, thought to be long extinct, have been sighted in South America, New Guinea and Africa.\n    * The strange Marfa Lights phenomenon in Texas, which can be readily observed from a vantage between Alpine and Marfa, may be due to piezoelectric pressures on the Earth.\n    * Victorio Peak in a mountain in New Mexico was reported by an explorer to contain a vast treasure of gold. The area eventually became part of a military range, and an iron door was placed at the entrance, sealing it off.\n    * Another lost treasure was said to exist in catacombs under the Death Valley, including giant mummies buried there, claimed a man nicknamed 'Death Valley Scotty.' A villa known as Scotty's Castle was built at the site.\n    * Giant skulls were found in the Aleutians, collected by the Smithsonian, and never seen again.\n    * Obelisks on the moon, such as the Blair Cuspids, could relate to ancient monolithic towers found in Egypt and other locations, and might function as power stations similar to what Tesla conceived.\n","torrent":{"xt":"urn:btih:650a297c908e47a4f204ed670a772e92650028c8","amp;dn":"Coast+to+Coast+AM+-+August+26th+2009+-+Mysterious+Locations+%26+Cr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"650a297c908e47a4f204ed670a772e92650028c8","infoHashBuffer":{"type":"Buffer","data":[101,10,41,124,144,142,71,164,242,4,237,103,10,119,46,146,101,0,40,200]},"announce":[],"urlList":[]}}