{"title":"Ancient Aliens 2009 HDTVRip XviD AC3","uid":5136658,"size":1467289600,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:656a8c8cc46d76f4040c70c0e4fab57e93efbfde&amp;dn=Ancient+Aliens+2009+HDTVRip+XviD+AC3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Spartan_300","files":-1,"time":1256543894,"description":"==============\nFormat: HDTVRip\nVideo: 720x400 (1.80:1), 23.976 fps, XviD build 47 ~1768 kbps avg, 0.26 bit/pixel\nAudio: 48 kHz, AC3 Dolby Digital, 2/0 (L,R) ch, ~384.00 kbps avg\nFilesize: 1399.32 Mb ( 1Ã‚Â 467Ã‚Â 289Ã‚Â 600 bytes )\nPlay length: 01:30:29.724 (130183 frames)\n==============\n\n\nAncient Aliens\n==============\n\nHistory, Science Documentary hosted by Robert Clotworthy and published by History Channel in 2009 - English narration\n\n \n\nWhat if life on Earth began in outer space? Millions of people accept the theory that intelligent life forms visited Earth thousands of years ago and were worshiped as gods by primitive man. Are monuments like Stonehenge and Easter Island the last remains of an ancient alien visitation? From unexplainable super structures, to knowledge of the solar system, mathematics, and even the ability to make electricity, this special explores evidence of super-human influences on ancient man and embarks on an around-the-world search for answers. \n\nPresented in the 1968 bestselling book Chariots of the Gods by Erich von Daniken, the theory of &quot;ancient aliens&quot; rocked people's beliefs in mankind's progress. Ancient cave drawings of strange creatures, remains of landing strips in Peru, and Indian texts that describe the &quot;flying machines of the gods&quot; were just a few of the odd archaeological artefacts cited by von Daniken as proof that ancient astronauts were well known to our ancestors.\n\nProduced with the exclusive cooperation of von Daniken himself, Ancient Aliens launches all-new expeditions to seek out and evaluate this evidence, with a concentration on the latest discoveries of the last 30 years, including unusual DNA findings on man's evolution and newly decoded artefacts from Egypt to Syria to South America. It is a balanced investigation into a theory some believe cannot be true, but many agree cannot be ignored.\n","torrent":{"xt":"urn:btih:656a8c8cc46d76f4040c70c0e4fab57e93efbfde","amp;dn":"Ancient+Aliens+2009+HDTVRip+XviD+AC3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"656a8c8cc46d76f4040c70c0e4fab57e93efbfde","infoHashBuffer":{"type":"Buffer","data":[101,106,140,140,196,109,118,244,4,12,112,192,228,250,181,126,147,239,191,222]},"announce":[],"urlList":[]}}