{"title":"Ricky Skaggs - Ricky Skaggs Solo Songs My Dad Loved","uid":5560593,"size":57730399,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6583e327096127dc9cc4da97ca91de88347810f3&amp;dn=Ricky+Skaggs+-+Ricky+Skaggs+Solo+Songs+My+Dad+Loved&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"ZMist","files":-1,"time":1273823997,"description":"Ricky Skaggs - Ricky Skaggs Solo Songs My Dad Loved\n\nThe album features mostly songs that are now considered public domain but that were also recorded by artists such as the Monroe Brothers, the Stanley Brothers, Clyde Moody and others. Skaggs adapted some to instrumental recordings he's made in recent years but never released, and he laughs when he says that his father would probably listen to some of the arrangements and say &quot;there's just too much stuff on there, son.&quot; Nevertheless, Skaggs kept most of the tracks &quot;very modestly dressed...just mandolin, guitar and two vocals or two guitars and vocals or one claw-hammer banjo or something.&quot;\n\nAnd the set truly is a solo venture, with Skaggs singing every part and playing every instrument himself. &quot;I'm no stranger to doing overdubs and double-tracking stuff,&quot; he notes. &quot;I really enjoyed it, and I was so happy with the way it came out I said, 'Y'know, I could do this again and would really have fun doing it.' I learned so much it would be fun to try it again.&quot;\n\nSkaggs has similarly modest expectations for the album's sales potential, however. &quot;I wasn't expecting anything out of it, really,&quot; he admits. &quot;I just thought it would be a cool, fun project and the family will like it. We can give it away at Christmas time and stuff. If this sells 25 copies to the family, that'd be fine with me.&quot;\n\nSkaggs is also preparing to work on another gospel album, which he plans to record in October or November with producer and songwriter Gordon Kennedy in Nashville. George Beverly Shea, the 100-year-old singer from the Billy Graham organization, is slated to join Skaggs for a new recording of &quot;I'd Rather Have Jesus&quot; for the set.\n\nThe full track listing for &quot;Ricky Skaggs Solo (Songs My Dad Loved)&quot; includes:\n\n&quot;Foggy River&quot;                     \n&quot;What Is A Home Without Love&quot;            \n&quot;Colonel Printess&quot;                    \n&quot;City That Lies Foursquare&quot;                \n&quot;Little Maggie&quot;                    \n&quot;Sinner You'd Better Get Ready&quot;            \n&quot;Pickin' In Caroline&quot;                        \n&quot;I Had But 50 Cents&quot;                    \n&quot;Green Pastures In The Sky&quot;                \n&quot;Calloway&quot;                        \n&quot;This World Is Not My Home&quot;            \n&quot;Branded Wherever I Go&quot;                \n&quot;God Holds The Future In His Hands&quot; ","torrent":{"xt":"urn:btih:6583e327096127dc9cc4da97ca91de88347810f3","amp;dn":"Ricky+Skaggs+-+Ricky+Skaggs+Solo+Songs+My+Dad+Loved","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6583e327096127dc9cc4da97ca91de88347810f3","infoHashBuffer":{"type":"Buffer","data":[101,131,227,39,9,97,39,220,156,196,218,151,202,145,222,136,52,120,16,243]},"announce":[],"urlList":[]}}