{"title":"Coast to Coast AM - Aug 31 2009 - State of the Future","uid":5075884,"size":55898894,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:66577feb3b4e24fb375f3f3517466fe3b080e553&amp;dn=Coast+to+Coast+AM+-+Aug+31+2009+-+State+of+the+Future&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1251832670,"description":"State of the Future\n\nDate: 08-31-09\nHost: George Noory\nGuests: Jerome Glenn\n\nAppearing during the first three hours, director of the Millennium Project, Jerome Glenn discussed their annual &quot;State of the Future&quot; reports which outline the challenges we face as a planet, juggling technology, population and the delicate balance of nature. The Millennium Project, he explained, works as a &quot;globally distributed think tank,&quot; incorporating diverse points of view, via regional nodes or groups.\n\nNo single issue can be viewed as the &quot;biggest problem,&quot; rather it's a series of interconnecting global challenges facing humanity that need to be addressed, he said. One such challenge deals with water resources, and he suggested that agricultural needs could be switched to saltwater, which would free up freshwater to be used in urban centers. If water issues aren't worked out, countries like China and India could become unstable, he added. A lot of water and energy goes into the raising of farm animals and their feeding, but he noted that a type of meat, made without animals, could be ready as early as 2012.\n\nBy enlarge, most of the problems troubling humanity have answers, said Glenn-- but the question is, how do we get the right solutions to be adopted by the right people? Transnational organized crime, for instance, could be greatly reduced by cutting off money laundering, he commented. This could be accomplished by getting banks to all agree to the same regulations, and deputizing courts for individual countries to go after the launderers. One of the best ways to control or reduce overpopulation is to make people more financially secure or successful, said Glenn, explaining that in the poorest countries parents have more kids to ensure that someone will take care of them in their old age. \n\nThe last hour of the show featured Open Lines, with a special hotline for callers affected by the Southern California fires.\n\nWebsite(s): millennium-project.org\nBook(s): 2009: State of the Future\n &lt;a href=&quot;\nhttp://www.coasttocoastam.com/show/2009/08/31&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.coasttocoastam.com/show/2009/08/31&lt;/a&gt;","torrent":{"xt":"urn:btih:66577feb3b4e24fb375f3f3517466fe3b080e553","amp;dn":"Coast+to+Coast+AM+-+Aug+31+2009+-+State+of+the+Future","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66577feb3b4e24fb375f3f3517466fe3b080e553","infoHashBuffer":{"type":"Buffer","data":[102,87,127,235,59,78,36,251,55,95,63,53,23,70,111,227,176,128,229,83]},"announce":[],"urlList":[]}}