{"title":"The Genius of Charles Darwin (Part 3 of 3)","uid":5024808,"size":366960640,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:666eeb0d27f111957fac1ed2430978749ba80cc1&amp;dn=The+Genius+of+Charles+Darwin+%28Part+3+of+3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ILKnight","files":1,"time":1248640413,"description":"The best quality available in internet. Previous uploaded torrents have defects in the picture so I find it from other source and upload it again here.\n\nGood quality and defects free!\n\n\nDOCUMENTARY DETAILS:\n\nThe Genius of Charles Darwin is a three-part television documentary, written and presented by evolutionary biologist Richard Dawkins.\n\nIt was first shown in August 2008 on Channel 4. It won Best TV Documentary Series 2008 at the British Broadcast Awards in January 2009.\n\n\nPart 3: God Strikes Back\nIn the third and final episode, Dawkins explains why Darwin's theory is one of history's most controversial ideas.\n\nAs Darwin set out on the voyage on the Beagle he still believed that god created the world and everything in it. But the evidence he discovered - fossils, patterns of anatomical resemblance, startling similarities of embryos and domestic breeding - demonstrated the truth: that all life forms vary and that some are more likely to reproduce, passing variations on. His wife Emma, however, was deeply religious and Darwin never criticised religion in public but he believed that &quot;science would bring about a gradual illumination of minds&quot;.\n\nToday, Dawkins argues, science has the evidence to prove that evolution is true. Modern discovery of the DNA code which links all life has added to the mountain of evidence showing that evolution is a fact. So why, he wonders as he meets creationists in America, is opposition to evolution more aggressive than ever?\n\n\nYou can find the other parts in here:\nThe Genius of Charles Darwin (Part 1 of 2): http://thepiratebay.se/torrent/5030451\nThe Genius of Charles Darwin (Part 2 of 3): http://thepiratebay.se/torrent/5024806","torrent":{"xt":"urn:btih:666eeb0d27f111957fac1ed2430978749ba80cc1","amp;dn":"The+Genius+of+Charles+Darwin+%28Part+3+of+3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"666eeb0d27f111957fac1ed2430978749ba80cc1","infoHashBuffer":{"type":"Buffer","data":[102,110,235,13,39,241,17,149,127,172,30,210,67,9,120,116,155,168,12,193]},"announce":[],"urlList":[]}}