{"title":"Coast to Coast AM - Aug 25 2009 - Interdimensional Phenomena &amp; t","uid":5069970,"size":55105902,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:66ef8ddc7141ba84f7b4d07d4c01d12b70c68795&amp;dn=Coast+to+Coast+AM+-+Aug+25+2009+-+Interdimensional+Phenomena+%26+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"0vercast","files":4,"time":1251313444,"description":"UFO investigator for over thirty years, Philip Imbrogno (book link) talked about how physical anomalies and interdimensional realities may connect various types of paranormal activity including UFOs, Shadow People, and EVP (Electronic Voice Phenomena--which some believe to be the voices of the deceased). In studying EVP, he found two different signals, one of which was piggybacked on the other. Such communications fade in and out, with various entities coming through. This suggests to him that the signal changes as different parts of the atmosphere become ionized; and we could be hearing evidence of a dimensional rift.\n\nOther dimensions are in our physical universe, but typically we can't perceive them, he explained, and these dimensions may be inhabited by beings of varying intelligences. The fleeting Shadow People phenomenon may be due to such beings pressing against their dimensional membrane, he theorized. Imbrogno believes that interdimensional contacts are on the rise, and as time goes on will become more commonplace. \nHe discovered that UFO sightings in the Hudson Valley of New York in the 1980s were clustered in specific areas which had magnetic anomalies. These areas showed a dramatic drop in the normal magnetic field, and may have been connected with their geologic make-up of quartzite and magnetite, he detailed. He also spoke about his investigation of underground tunnels in Brewster, New York. Apparitions were seen in the mines there, back in the 1800s, and more recently &quot;spook lights&quot; have been associated with the area, he said. \n&quot;Mexico's Roswell&quot;\nFirst hour guests, authors and researchers Ruben Uriarte and Noe Torres talked about a UFO crash case known as &quot;Mexico's Roswell,&quot; that occurred 35 years ago today. The incident, which took place near the Texas border town of Presidio, involved the crash of a UFO with a small airplane. The Mexican government sent a retrieval team, but 24 of their soldiers died after being exposed to an unknown chemical agent at the crash site, the authors reported. The wreckage was eventually picked up by a US military group from Fort Bliss, they noted.\n\n[This information has been shared to spread knowledge to those who otherwise would not have access to it.  If you can afford it please support www.coasttocoast.com]","torrent":{"xt":"urn:btih:66ef8ddc7141ba84f7b4d07d4c01d12b70c68795","amp;dn":"Coast+to+Coast+AM+-+Aug+25+2009+-+Interdimensional+Phenomena+%26+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66ef8ddc7141ba84f7b4d07d4c01d12b70c68795","infoHashBuffer":{"type":"Buffer","data":[102,239,141,220,113,65,186,132,247,180,208,125,76,1,209,43,112,198,135,149]},"announce":[],"urlList":[]}}