{"title":"No Self War Within EP","uid":5590698,"size":42140255,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:677c78e257a2c2bd89f15f3441fd7000d3ba3ee0&amp;dn=No+Self+War+Within+EP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"d4bn3y","files":9,"time":1274856485,"description":"Please SEED !!!!\n\n\nThis Nu-Metal monstrosity was originally crafted in 2002 by the creative minds of Dylan Hart (Vocals) and [J] (Bass). They quickly picked up local guitar player Justin Dabney, and for a brief period Brad Lovett for Drums. After writing a couple songs, Brad left, and Keith &quot;The Box&quot; Owens, stepped up to the plate. NoSelf had become complete.\n\nWith the addition of Box, the band began writing heavy yet catchy songs, filled with tons of energy and emotion. After practicing for months, and sharing a storage unit with the band ScAreB, NoSelf had truely found their sound.\n\n-I'd like to take a side note and give a shout out to all the dudes from Scareb/Anew, for their continued support over the years.\n\nAfter spending time perfecting their songs, and with the help of Matt Johnson and Casey Moore they recorded an unmastered 5 song demo. They also began to prepare for live shows.\n\nNoSelf played their first show on June 6th 2003 -at Fuel Entertainment Complex- in Daytona Beach, Florida. With supporting acts including: Lunatic Candy Creep, Order By Chaos, and Scareb. This show launched the band into overdrive booking many shows in the Central Florida area.\n\nNoSelf played out for over a solid year, always doing their best to provide an intense live show for their fans. The hardcore NoSelf fans also deserve a giant thank you for their continued support.\n\nUnfortuneatly in late 2004, due to personal differences, the band members decided to go their seperate ways, and NoSelf, was well, No more...\n\n--But wait, it's not over yet !--\n\nIn Late 2009, After developing the skills to record and produce music, Justin and Dylan decided to re-track some old songs for fun. Shortly after, Dylans current local project, KoIeL, broke up, and he was looking for work. So they united with former drummer, Box, to remake and modify some old songs for some live shows. Due to location differences NoSelf was un able to pick up their former bass player [J], so ex-Koiel member Dustin Warren stepped in to lay down the low end.\n\nCurrently NoSelf is working on re-writing and re-tracking many of their original songs, as well as wriritng some new hits for their first ever, mastered, full length album. As they write and record these new tracks, they are working on delivering the same intense live show they always offered, while mixing things up in the process.\n\nSo keep a look out for some exciting things to come from NoSelf, in Early 2010.\n\n--The train is coming, You got your ticket?--\n","torrent":{"xt":"urn:btih:677c78e257a2c2bd89f15f3441fd7000d3ba3ee0","amp;dn":"No+Self+War+Within+EP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"677c78e257a2c2bd89f15f3441fd7000d3ba3ee0","infoHashBuffer":{"type":"Buffer","data":[103,124,120,226,87,162,194,189,137,241,95,52,65,253,112,0,211,186,62,224]},"announce":[],"urlList":[]}}