{"title":"Supreme Commander 2","uid":5498863,"size":33481270,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:69cf119ac9e4b2ff7c5068ffba9ac1c9b71d9c95&amp;dn=Supreme+Commander+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Baietzelu","files":1,"time":1271430185,"description":"Visit : \n\nfor more details !\n\n\nEboy\n\nS  K  i  D  R  O  W\n\n-  T H E  L E A D i N G  F O R C E\n\nproudly presents\nSupreme Commander 2 Update 6\n\nRELEASE DATE : 16-04-2010              PROTECTION : Steam\nGAME TYPE    : Strategy                DISKS      : CRACKED UPDATE\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks.\nWe're a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We don't earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties.\n\nIf you think you got something to offer, then don't hold back\non contacting us as soon as possible.\n\n/\n/ / //          / / /  /\n/ / / / //      //// / / / / / /\n/      /      / / / // / /// /\n/// / //////\ntwice the fun  / double the trouble\n\nOn with the update release information:\n\nSupreme Commander 2 Update 6\n============================\n\nNew Features\n\nNew AI categories are now available via the Skirmish or\nMulti-player lobby menu:\n\nAir: Focuses on Air units.\n\nLand: Focuses on Land units.\n\nRush: Focuses on large amounts of land units and less on\ndefense.\n\nBalanced: Balanced between Land and Air.\n\nNaval: Focuses on Naval units.\n\nTurtle: Focuses on defenses and Experimentals.\n\nRandom: Chooses one of the above based on various factors.\n\nAdded the Steam avatar for each player on the multiplayer\nsummary screen: This will let players click on the avatar\nimage and access that player's Steam profile. From there, they\ncan add that player to their friends list if they've had a\ngood match\n\nAdded Mic Icons display in game when bringing up the in game\nscore menu (F2) allowing players to mute individual players\n\nImprovements\n\nAdded anti-cheating code that will detect modified lua files\nand prevent playing with unmodified users. This also prevents\nachievement and leaderboard updates. Still permits playing\nwith others who have identically modified their games.\n\nDisconnections in Ranked: The game now tracks the number of\ndisconnects a player has during Ranked 1v1 matches. If you\nexceed a certain percentage of disconnects to games played,\nthey will count as losses instead of wins.\n\nAI Improvements:\n\nThe AI will no longer get stuck in its startup build sequence\nif rushed or if there are build restrictions in place.\n\nThe AI will choose an appropriate archetype based on unit\nrestrictions.\n\nIf a unit type is restricted the AI will act as though the\nunit does not exist in the game.\n\nAI will now group units based on their target enemy's threat.\n\nAI will now group experimentals based on their target enemy's\nthreat.\n\nIf the victory condition is Assassination we are artificially\ninflating the Neural Net data to make attacking the ACU more\ndesirable for both Land and Air units.\n\nAI can now respond to being attacked my Nukes or Artillery,\neven if it cannot see where it is coming from.\n\nFixed a bug where threat build conditions were not being used.\n\nThe AI should no longer attempt to send attack platoons to\nunpathable areas.\n\nThe AI will hold back units until it thinks it has enough to\nmake a push based on defensive intelligence.\n\nFixed an issue where the AI would constantly pull units back\nto attack an expansion base instead of pushing forward.\n\nThe AI will no longer build more than 3 transports unless it\nhas land units and it is not a land map.\n\nAdded AI response to make a land AI get land unit AA upgrades\nif the enemy has air units.\n\nThe Naval AI will not build more than 3 subs unless the enemy\nhas Naval.\n\nIf Research is disabled the AI will not build research\nfacilities.\n\nThe AI will add a small amount of threat to all enemy start\nlocations so it knows where to find them.\n\nPlatoons will try to only attack areas where they think they\ncan do enough damage before dying.\n\nThe AI will react to enemy TML, artillery, or Experimentals by\nbuilding more shields and placing them closer together.\n\nThe AI should send a more appropriate number of units based on\nenemy threat.\n\nAI will build and use Mass Convertors.\n\nIf the closest enemy to the AI is a lot weaker than the other\nenemies the AI will focus on the weak enemy.\n\nThe AI's air units will wait longer before re-evaluating which\ntarget to attack.\n\nThe AI's NUC will now check for pathability before firing\nunits.\n\nThe AI's Nuke Launcher will now check for pathability before\nfiring.\n\nYou can now select which AI type you would like to play\nagainst from the dropdown in the game lobby (random is still\nan option).\n\nAI will build factory shield upgrades more often, not just\nwhen the enemy has air.\n\nFactory upgrades now have a threat value.\n\nAI should react better to an enemy having nukes.\n\nAI will not build research stations if it already has\neverything researched.\n\nAI will not build a mass convertor until it has enough energy\nto convert.\n\nAdded bigger Air and Land platoons.\n\nWhen a build item has a resource type of All the AI will use\nSlush first.\n\nAdded build conditions to check for current target enemy\nthreat.\n\nAI air scout platoons will now path around threat as much as\npossible.\n\nMass convertor research is now a higher priority for the\nTurtle AI.\n\nChanged some threat evaluation when deciding where to attack.\n\nAI will build fewer MMLs and Mobile Artillery.\n\nAdded a new function to store the victory condition for the\nAI.\n\nWhen an AI unit dies it will add threat to the instigator's\nlocation to warn other units.\n\nAdded some anti-turtle measures.\n\nFix for units that were built outside of the AIs base not\nbeing used.\n\nFix for AI not using its full base radius.\n\nLand AIs on Island maps should build Air factories to build\ntransports.\n\nAI should send platoons when it is at unit cap, no matter\nwhat.\n\nAI will space out naval factories more to prevent blockage.\n\nThe Ranked maps have been updated to\n\nMarkon Bridge\n\nClark Training Center\n\nCoalition Ship Yard\n\nArctic Refuge\n\nOpen Palms\n\nFinn's Revenge\n\nFixes\n\nFixed units arriving from Space Temple teleport immunity to\nMagnetron effects\n\nFixed Engineer pathfinding in crowded conditions\n\nFixes for occasional crash if Client disconnects at the same\nmoment Host launches Ranked game\n\nFix for Crash / Soft Locked: Players can get soft-locked in\nthe 'Starting Game' screen if other players disconnect when\nmatchmaking begins 'Starting Game'\n\nBackspace will reveal all characters in the edit box when you\nhave more characters than the visible section\n\nTuning and Balancing\n\nCapturing units now provides the same experience as killing\nthem\n\nInstall Notes:\n\n1. Unpack the included rar files.\n2. Run Supreme.Commander.2.Update.6.exe and install\n3. Copy the cracked content from SKIDROW directory to your\nmain installation directory and overwrite.\n4. Play the game\n\nGreetings:\n\nSalutes to our old Amiga friends from:\n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n\nSalutes to our new friends in:\n\nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS\n\nLogo and layout by: Eboy/SAE\nLast updated 21/07/2007 by XXX","torrent":{"xt":"urn:btih:69cf119ac9e4b2ff7c5068ffba9ac1c9b71d9c95","amp;dn":"Supreme+Commander+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69cf119ac9e4b2ff7c5068ffba9ac1c9b71d9c95","infoHashBuffer":{"type":"Buffer","data":[105,207,17,154,201,228,178,255,124,80,104,255,186,154,193,201,183,29,156,149]},"announce":[],"urlList":[]}}