{"title":"El Mundo De Los Perdidos DVD-Screener Spanish 2009","uid":5066069,"size":1459676326,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6a48f5ae0f5d9a04a8b2449b26a79f0c63c3016a&amp;dn=El+Mundo+De+Los+Perdidos+DVD-Screener+Spanish+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":2,"time":1251019980,"description":"Basada en la clasica serie de television creada por Sid y Marty Krofft. Los vortices espacio-temporales son una calamidad. Will Ferrell interpreta al Dr. Rick Marshall, un cientifico venido a menos, al que atrapa un vortice y le lanza a un pasado lejano. Muy lejano, incluso. El cientifico carece de armas, habilidades e inteligencia para sobrevivir en un universo alternativo plagado de dinosaurios al acecho y fantasticas criaturas de otro mundo. LAND OF THE LOST es un lugar espectacular hecho a medida para las situaciones comicas. Pero el Dr. Rick Marshall no esta solo en esta aventura. Le acompanan la superinteligente investigadora Holly (Anna Friel) y Will (Danny McBride), un forofo de la supervivencia. Perseguidos por T. Rex y acosados por reptiles de una lentitud que exacerbaria a cualquiera, los Sleestaks, los tres dependen de su unico aliado, un primate llamado Chaka (Jorma Taccone), para salir de esta dimension hibrida. Si consiguen escapar, seran heroes. Y si no, eternos refugiados en LAND OF THE LOST.","torrent":{"xt":"urn:btih:6a48f5ae0f5d9a04a8b2449b26a79f0c63c3016a","amp;dn":"El+Mundo+De+Los+Perdidos+DVD-Screener+Spanish+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a48f5ae0f5d9a04a8b2449b26a79f0c63c3016a","infoHashBuffer":{"type":"Buffer","data":[106,72,245,174,15,93,154,4,168,178,68,155,38,167,159,12,99,195,1,106]},"announce":[],"urlList":[]}}