{"title":"Modded cod 5","uid":5131072,"size":7835516928,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:6a4cf739d0bc1807e8bb3fad7ced7e0c620401d2&amp;dn=Modded+cod+5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"justeve","files":1,"time":1256070877,"description":"Game partition CRC does not match the verified ini! There are 4 possibilities:\n\n1. This is a bad rip (the most likely cause). If you're checking a DVD backup\nand have AnyDVD or a similar app installed, make absolutely sure the process is\nkilled! If this is a scene release, search for it on abgx.net and look at the\ncolumn &quot;Bad CRC or Needs Fixing&quot;. If you see a  icon, hover over it with\nyour mouse to read the alt text. If it says something like &quot;Bad game data CRC&quot;\nor gives the name of a fix (PPF patch), we already know about it. It's also\nhighly recommended to run abgx360 again with AutoFix set to level 3 if you\napplied a PPF to make sure stealth files haven't been corrupted. See &quot;What is\nAnyDVD style corruption?&quot; in the GUI Quickstart tab for more info on game data\ncorruption.\n\n2. Your CPU/RAM/HDD/data bus is unstable and corrupted the data during\nextraction/burning or while checking the CRC. Make sure to run the sfv and try\nextracting it again (assuming you have the sfv/rars) and recheck the ISO/DVD to\nsee if you get the same CRC.\n\n3. Game data was intentionally modified for some reason. Microsoft does not\ntake kindly to modifications for any purpose, and even benign changes to game\ndata or settings will get you banned from Xbox Live!\n\n4. The verified Game CRC in the database is wrong (very unlikely).\n\nStealth was verified but game data wasn't","torrent":{"xt":"urn:btih:6a4cf739d0bc1807e8bb3fad7ced7e0c620401d2","amp;dn":"Modded+cod+5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a4cf739d0bc1807e8bb3fad7ced7e0c620401d2","infoHashBuffer":{"type":"Buffer","data":[106,76,247,57,208,188,24,7,232,187,63,173,124,237,126,12,98,4,1,210]},"announce":[],"urlList":[]}}