{"title":"Alvin And The Chipmunks 2 por memitoxxx etorrents.org ( ingles -","uid":5676792,"size":4883906560,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6abe93ea06717856836218b49d0918144f5348a3&amp;dn=Alvin+And+The+Chipmunks+2+por+memitoxxx+etorrents.org+%28+ingles+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"memitoxxx","files":20,"time":1278571666,"description":"Alvin And The Chipmunks 2: The Squeakquel \nFamily (2009)\n88mins US\n\nStarring: Jason Lee, David Cross, Cameron Richardson, Matthew Gray Gubler, Christina Applegate, Justin Long, Jesse McCartney\nDirector: Betty Thomas\nWriter(s): Jon Vitti, Will McRobb, Chris Viscardi, Glenn Berger, Jonathan Aibel\nListings: London | Rest of UK and Ireland\n\nAlvin, Simon and Theodore struggle to survive in the cutthroat music business. After his disastrous handling of their affairs, Alvin and co decide to fire money-grabbing manager Ian Hawke. So they continue to rely on surrogate father Dave Seville. When he is badly injured and consigned to a hospital bed, the youngsters are forced to go and stay with Aunt Jackie and nephew Toby.\n\nLondonNet Film Review\nAlvin And The Chipmunks 2: The Squeakquel\n\nThey're not big, and the film's certainly not clever, but there is something oddly entertaining about singing chipmunks...\n\nAlvin and the Chipmunks: The Squeakquel. 20th Century FoxIn the same way that the helium-voiced mouse chorus was a delight in Babe, Alvin, Simon and Theodore's high-pitched renditions of &quot;Bad Day&quot; by Daniel Powter and &quot;Funkytown&quot; by Lipps Inc. in the first film had a certain cutesy charm. For the sequel, the diminutive trio meets its match in three feisty females, who trill with attitude through &quot;Single Ladies (Put A Ring On It)&quot; by Beyonce, &quot;Hot N Cold&quot; by Katy Perry, &quot;So What&quot; by P!nk and &quot;Put Your Records On&quot; by Corinne Bailey Rae. Girl power is alive and well in Alvin And The Chipmunks 2: The Squeakquel. Director Betty Thomas treads a familiar path, driving a wedge between the tiny heroes then reuniting them for a foot-stomping finale to the strains of &quot;We Are Family&quot; by Sister Sledge and &quot;Shake Your Groove Thing&quot; by Peaches &amp; Herb. The simplistic, linear plot holds no surprises, incorporating a boo-hiss, high school jock villain (who naturally gets his comeuppance), wholesome lessons about friendship and self-sacrifice, and chaste romance that nervously approaches the kissing stage. If you didn't like the original Alvin And The Chipmunks, it's safe to say that the follow-up won't shake your groove thing either.\n\nThe Squeakquel continues the story of singing critters Alvin (voiced by Justin Long), Simon (Matthew Gray Gubler) and Theodore (Jesse McCartney) in the cutthroat music business. When the boys' surrogate father Dave (Jason Lee) is consigned to a hospital bed, the youngsters stay with Aunt Jackie (Kathryn Joosten) and nephew Toby (Zachary Levi), who enrols the chipmunks at high school where the pop stars secure the nomination to represent their classmates at a battle of the bands. Aggrieved former manager Ian Hawke (David Cross) enrolls the Chipettes - aka Britney (Christina Applegate), Eleanor (Amy Poehler) and Jeanette (Anna Faris) - at the very same school, then petitions headmistress Dr Rubin (Wendie Malick) to give the final vote to the student body.\n\nAlvin and the Chipmunks: The Squeakquel. 20th Century FoxThe battles of the rodent sexes, Chipmunks versus Chipettes, tests friendships to the limit. Opening with a high-pitched &quot;We're back!&quot; over the credits, Alvin And The Chipmunks 2: The Squeakquel takes the secondhand plot of Bratz: The Movie and adorns it with computer generated mayhem. Kevin J Schmidt's hunky jock attempts to put the chipmunks in their place but fails miserably, suffering a wedgie during a chaotic chase sequence. Youngsters will love the silliness of it all - the chipmunks whooping &quot;You Spin Me Round (Like A Record)&quot; by Dead Or Alive as they take a high-speed turn in a food mixer - with the odd concession to older viewers, like the opening musical gambit, &quot;You Really Got Me&quot; by The Kinks. Sadly, the chipmunks really didn't get us.\n\nIMAGENES\n &lt;a href=&quot;\nhttp://img36.imageshack.us/img36/277/alvinandthechipmunks2po.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img36.imageshack.us/img36/277/alvinandthechipmunks2po.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img38.imageshack.us/img38/2343/32913419.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img38.imageshack.us/img38/2343/32913419.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img17.imageshack.us/img17/1392/15714666.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img17.imageshack.us/img17/1392/15714666.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img824.imageshack.us/img824/1889/75901376.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img824.imageshack.us/img824/1889/75901376.png&lt;/a&gt;","torrent":{"xt":"urn:btih:6abe93ea06717856836218b49d0918144f5348a3","amp;dn":"Alvin+And+The+Chipmunks+2+por+memitoxxx+etorrents.org+%28+ingles+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6abe93ea06717856836218b49d0918144f5348a3","infoHashBuffer":{"type":"Buffer","data":[106,190,147,234,6,113,120,86,131,98,24,180,157,9,24,20,79,83,72,163]},"announce":[],"urlList":[]}}