{"title":"Fireworks","uid":5052211,"size":214890094,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6ac59af320cea6c9f2a39332b46411c45b0c7ead&amp;dn=Fireworks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"freedomp","files":32,"time":1250221213,"description":"\nFireworks \n\n\nFireworks originally consisted of Marty McCall, Gary Pigg, Gwen Moore, Lanny Avery, and Chris Harris. Marty and Gary had been closely associated with the album productions of Chris Christian. As back-up vocalists, they were featured on David Meece's I JUST CALL ON YOU and B. J. Thomas' HOME WHERE I BELONG. \n\nFireworks was born when Marty and Gary met at a church in Nashville. They knew each other casually, but it wasn't until they discovered their common interest in music that they were drawn close together. After awhile, the duo was introduced to Chris Christian, who liked their smooth harmonies and invited them to work for his recording company as back-up vocalists on albums. \n\n\nLater Cindy joined the group and Fireworks was band. At first, the three played mainly in local churches and fellowships around Nashville. Initially, the group's performances consisted of the three voices accompanied by just a piano. This arrangement continued for several months until they decided to add a fuller sound to their performances with the drumming of Chris Harris and bass rhythms of Lanny Avery. Highlighted by exceptional vocals and a driving spirit, their music releases as much musical energy as their name Fireworks implies. \n\nFireworks Myrrh 1977\nNew Day\nCarrying On\nDon't Look Back\nPrior to becoming a fairly competent rock outfit, Marty McCall's band existed as a guy/gal trio churning out adequate poprock numbers during Myrrh's mellowing-out phase as their debut attests. A McCall composition is easily recognized by the rhythmic pounding 16th-note chords emanating from his piano. The ballads are radio-ready and may appeal to fans of Keith Green, 2nd Chapter of Acts, and Nutshell. KS \n\nShatter The Darkness Myrrh 1979\nChange My Heart\nRock Band\nShatter The Darkness\nShatter The Darkness is a major step forward. Comparisons elude me - Fireworks has succeeded in crafting their own unique brand of hard-edged poprock. Bigger sound overall with McCall's highly emotive vocals perfectly suited to slow intense rockers like 'Change My World' and the title cut as well as somber ballads like 'The World'. KS \n\nA Quick History of FIREWORKS \nIt's 1976, the heat of our nation's Bicentennial summer still upon us, and three young people all of whom have moved recently to Nashville, TN receive a phone call from a mutual friend asking them to report to a basement out in the countryside to sing on a &quot;jingle&quot;. Marty McCall of Easley, South Carolina, by way of Boston, Mass.; Gary Pigg, raised in Detroit, Michigan, lately of Abilene, Texas; and Gwen Moore, of Malibu, California--all in their mid-twenties, all with dreams involving music and the music business, they sang together that night for the first time and the producer, Chris Christian, liked the sound. He called them back for more sessions, including Amy Grant's first album and B. J. Thomas' first Christian album, &quot;Home Where I Belong&quot;. \n\nThe following spring, Buddy Huey of Word Records was in town and met with the three. The contemporary Christian rock group Second Chapter of Acts, he reported, had just left Word and they were looking for a group to fill that void. Would the three of us like to become that group? \n\nBy the time the band had formed, adding Chris Harris on bass and Lanny Avery on drums, and found a name, Fireworks, and made a self-titled album, and traveled around Nashville and environs, singing in a few churches and coffee houses and one showcase, it was time to sign with a booking agent. Wes Yoder of Dharma Artists Agency said the contracts would be individual, rather than with the group. Gwen Moore felt it was best for her not to continue...she did not feel God's peace about signing. A friend of the group, Cindy Lipford, took Gwen's place, and the band proceeded to travel the United States, making a unique and joyful noise unto the Lord. Contributed by Gwen Moore 2000 ","torrent":{"xt":"urn:btih:6ac59af320cea6c9f2a39332b46411c45b0c7ead","amp;dn":"Fireworks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ac59af320cea6c9f2a39332b46411c45b0c7ead","infoHashBuffer":{"type":"Buffer","data":[106,197,154,243,32,206,166,201,242,163,147,50,180,100,17,196,91,12,126,173]},"announce":[],"urlList":[]}}