{"title":"Historical Tunes of the Irish &amp; Others","uid":5568650,"size":232620955,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6b01c2841210beb1415ff6e8a3cd1ef5aad7c7f7&amp;dn=Historical+Tunes+of+the+Irish+%26+Others&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Bonesaw14","files":48,"time":1274073081,"description":"A collection of songs, jiggs, and marches from Ireland (including many a diddy of the Irish Republican Army), England, Nazi Germany, and the United States (Civil War).\nMy personal favorites are the &quot;Irish Volunteers&quot; tunes from the American Civil War.\n\nMy name is Tim McDonald, I'm a native of the Isle,\nI was born among old Erin's bogs when I was but a child.\nMy father fought in &quot; 'Ninety-eight,&quot; for liberty so dear;\nHe fell upon old Vinegar Hill, like and Irish volunteer.\nThen raise the harp of Erin, boys, the flag we all revere--\nWe'll fight and fall beneath its folds, like Irish volunteers!\nThen raise the harp of Erin, boys, the flag we all revere--\nWe'll fight and fall beneath its folds, like Irish volunteers!\n\nWhen I was driven form my home by an oppressor's hand,\nI cut my sticks and greased my brogues, and came o'er to this land.\nI found a home an many friends, and some that I love dear;\nBe jabbers! I'll stick to them like bricks and an Irish volunteer.\nThen fill your glasses up, my boys, and drink a hearty cheer,\nTo the land of our adoption and the Irish volunteer!\nThen fill your glasses up, my boys, and drink a hearty cheer,\nTo the land of our adoption and the Irish volunteer!\n\nNow when the traitors in the south commenced a warlike raid,\nI quickly then laid down my hod, to the devil went my spade!\nTo a recruiting-office then I went, that happened to be near,\nAnd joined the good old &quot;Sixty-ninth,&quot; like and Irish volunteer.\nThen fill the ranks and march away!--no traitors do we fear;\nWe'll drive them all to blazes, says the Irish volunteer.\n\nWhen the Prince of Wales came over here, and made a hubbaboo,\nOh, everybody turned out, you know, in gold and tinsel too;\nBut then the good old Sixty-ninth didn't like these lords or peers--\nThey wouldn't give a d--n for kings, the Irish volunteers!\nWe love the land of Liberty, its laws we will revere,\n&quot;But the divil take nobility!&quot; says the Irish volunteer!\n\nNow if the traitors in the South should ever cross our roads,\nWe'll drive them to the divil, as Saint Patrick did the toads;\nWe'll give them all short nooses that come just below the ears,\nMade strong and good of Irish hemp by Irish volunteers.\nThen here's to brave McClellan, whom the army now reveres--\nHe'll lead us on to victory, the Irish volunteers.\n\nNow fill your glasses up, my boys, a toast come drink with me,\nMay Erin's Harp and the Starry Flag united ever be;\nMay traitors quake, and rebels shake, and tremble in their fears,\nWhen next they meet the Yankee boys and Irish volunteers!\nGod bless the name of Washington! that name this land reveres;\nSuccess to Meagher and Nugent, and their Irish volunteers!","torrent":{"xt":"urn:btih:6b01c2841210beb1415ff6e8a3cd1ef5aad7c7f7","amp;dn":"Historical+Tunes+of+the+Irish+%26+Others","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b01c2841210beb1415ff6e8a3cd1ef5aad7c7f7","infoHashBuffer":{"type":"Buffer","data":[107,1,194,132,18,16,190,177,65,95,246,232,163,205,30,245,170,215,199,247]},"announce":[],"urlList":[]}}