{"title":"Fantastic Flame Screensaver [nico1899]","uid":5093176,"size":8957255,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6b1f92d63f55e9273cc96598da77f65e4e94f736&amp;dn=Fantastic+Flame+Screensaver+%5Bnico1899%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nico1899","files":-1,"time":1253318283,"description":"How to install?\n\n1-Install Fantastic Flame Screensaver.exe\n2-Open &quot;Configure Fantastic Flame Screensaver&quot; (the icon on your desktop)\n3-Go to &quot;About&quot; and copy/paste the name and key from &quot;Name and Key.txt&quot; \n4-Enjoy this amazing Screensaver\n\n\nWhat is it - Fantastic Flame Screensaver?\n\nThis award-winning screensaver generates a realistic fire effect. \nThe flame is sensitive to the background, \nso each item on your desktop - including icons and all open windows - \nwill appear to catch on fire, glowing and emitting a smoke effect. \n\nFeatures of the screensaver\nFantastic Flame Screensaver Burning Fire Screenshot\n'Aquarius' background with 'Wood' fire style\n\nFantastic Flame Screensaver Burning Fire Screenshot\n'Alien' background with 'Hot Fire' fire style\n\nFantastic Flame Screensaver Burning Fire Screenshot\n'Skull and Snakes' background with 'Sea and Spindrift' fire style\n\n\n    * True mathematical algorithm of the screensaver generates a very realistic real-time fire effects.\n    * Unlimited number of color combinations of the fire. Really FANTASTIC flame! Additional fire parameters such as wind gust speed and direction and burning intensity.\n    * Flexible presets system. A lot of ready fire styles comes included.\n    * The screensaver includes a comfortable fire effects editor with a real-time flame preview.\n    * 'Random' fire style. You never get tired of watching!\n    * Lots of awesome fire backgrounds!\n    * Changing the flame styles and background images periodically in the full-screen mode. A pretty fine effect - burning images to another ones!\n    * Nice fire sound. There are 9 different fire sounds to choose from. Be aware! Your guests can think you have a big camp fire in your house! (Of course, you're able to mute the sound!).\n    * Ability to choose any music for playing while the screensaver is running full-screen. Listen your favorite music with the sound of fire in the background! Just watch and relax! Some music titles come included.\n    * You can take snapshots of your burning desktop anytime. Get fire screenshots with one key press!\n    * Controlling the screensaver in the full-screen mode. Turning fire sound and music on/off, loading next flame styles and backgrounds, and even changing the fire intensity and wind direction available!\n    * Full dual monitor support. Danger! Fire around!\n    * A special feature which allows to launch Fantastic Flame Screensaver anytime you want by pressing a hotkey. Let's scare your friend!\n    * And at last, Fantastic Flame Screensaver loads your system less than most of animated 3D screensavers.","torrent":{"xt":"urn:btih:6b1f92d63f55e9273cc96598da77f65e4e94f736","amp;dn":"Fantastic+Flame+Screensaver+%5Bnico1899%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b1f92d63f55e9273cc96598da77f65e4e94f736","infoHashBuffer":{"type":"Buffer","data":[107,31,146,214,63,85,233,39,60,201,101,152,218,119,246,94,78,148,247,54]},"announce":[],"urlList":[]}}