{"title":"Two Pints of Lager and a Packet of crisps Series 1 -(LGLuX)","uid":5068786,"size":942981090,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6b6fe53478169a7171dfb3a9684a1000c9b125d8&amp;dn=Two+Pints+of+Lager+and+a+Packet+of+crisps+Series+1+-%28LGLuX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LGLuX","files":6,"time":1251227533,"description":"Files: Two Pints of Lager and a Packet of Crisps Series 1\nType: Avi\nCodec: Xvid\nAudio: LAME MP3 192\nSize by episode: 149MB Approx.\n\n\n**********First of all i bid you a great big Comeback Welcome The Pirate Bay. Im glad you are back and i hope you all scallywags and swashbucklers out there are glad i am Back too\n\nHere is a little something i ripped quite a while back , but didnt have the time to up the Torrent so i hope you all enjoy one of the funniest British Comedy Shows ever*******\n\n\nIMDB REVIEW:\n\nOne of the reasons the show is so funny is that most people can identify with the basic situations the writer, Susan Nickson, looks at. In addition, the characters are all human, complete with some pretty awful flaws. Even the actors fit their parts perfectly. They're not all staggeringly beautiful and they're not the world's greatest thespians - most of them are newcomers to TV or have relatively little experience. Having said that, the main characters Donna (Natalie Casey), Janet (Sheridan Smith), Johnny (Ralf Little) and Gaz (Will Mellor) are all played brilliantly ...with perfect delivery and comic timing.\n\nThe humour is often very crude (lots of jokes about &quot;bum love&quot;) and some of the &quot;issues&quot; looked at are a little tasteless (one of the newest characters has learning difficulties) but isn't this how real life is? How likely is the man in the pub - who's just sunk six pints - to hold back from telling a joke that is a little racist or sexist? How many people do we meet day-to-day that have old-fashioned views about people with learning difficulties, or hold weird misconceptions? The important thing to remember is that the show always treats its characters/situations affectionately in the end. The character with learning difficulties (Munch), for example, always ends up on top or always gets the care and attention he needs from his brother (Gaz) or other people.\n\nIf you're not easily offended and are reasonably up to date with youth culture, give it a try!\n","torrent":{"xt":"urn:btih:6b6fe53478169a7171dfb3a9684a1000c9b125d8","amp;dn":"Two+Pints+of+Lager+and+a+Packet+of+crisps+Series+1+-%28LGLuX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b6fe53478169a7171dfb3a9684a1000c9b125d8","infoHashBuffer":{"type":"Buffer","data":[107,111,229,52,120,22,154,113,113,223,179,169,104,74,16,0,201,177,37,216]},"announce":[],"urlList":[]}}