{"title":"Coast to Coast AM - Aug 23 2009 - Ufology in the Cold War Era","uid":5068917,"size":55732783,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:6c806c6871472078a79c2cf47976d925997b0f8c&amp;dn=Coast+to+Coast+AM+-+Aug+23+2009+-+Ufology+in+the+Cold+War+Era&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"0vercast","files":4,"time":1251233389,"description":"George Knapp was joined by acclaimed UFO historian Richard Dolan, who discussed his exhaustive research into the UFO phenomenon during the Cold War, as well as the national security state and cover-ups. &quot;I did not appreciate it until I truly started digging into it, myself, and then I had these 'wow' moments like every single day,&quot; Dolan said of the 1973 to 1991 era in Ufology which is chronicled in his recently released, and eagerly anticipated, new book.\n\nSome of the many landscape altering changes to the field of UFO studies that he covered included: the strengthened Freedom of Information Act in 1974, the emergence of Roswell research in the late 1970's, and the schism that developed within Ufology over topics like MJ-12 in the mid-1980's. On the subject of US Presidents from that era and what they may have known about UFOs, Dolan revealed that a high level source told him that Jimmy Carter received a briefing on UFOs in June of 1977. According to this source, Dolan said, Carter was seen &quot;with his head in his hands and he had apparently been very, very upset about whatever he was told.&quot;\n\nDolan also spoke candidly about the challenges of covering such an era of Ufology fraught with hotly debated figures and events. &quot;In the eighteen years that this book covers, there are probably about a hundred minefields that I had to walk through to do this and none of them were topics that I really wanted to do,&quot; Dolan conceded. To that end, he stressed that his goal in profiling some of the more controversial researchers and stories was to provide insight into their role in shaping the history of UFO studies. &quot;These topics need to be handled with an even hand,&quot; Dolan contended, saying that to judge their veracity is &quot;not my obligation or even my duty.&quot;\n\n[This information has been shared to spread knowledge to those who otherwise would not have access to it.  If you can afford it please support www.coasttocoast.com]","torrent":{"xt":"urn:btih:6c806c6871472078a79c2cf47976d925997b0f8c","amp;dn":"Coast+to+Coast+AM+-+Aug+23+2009+-+Ufology+in+the+Cold+War+Era","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c806c6871472078a79c2cf47976d925997b0f8c","infoHashBuffer":{"type":"Buffer","data":[108,128,108,104,113,71,32,120,167,156,44,244,121,118,217,37,153,123,15,140]},"announce":[],"urlList":[]}}