{"title":"Katy Perry - UR So Gay","uid":5086419,"size":132390916,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6cf2f55738e724efb2b04fcaadbaf773a5b7527e&amp;dn=Katy+Perry+-+UR+So+Gay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1252754091,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nSome lyrics are censored in this video.\n\n\n&quot;Ur So Gay&quot; is the debut single released by pop rock singer Katy Perry. The song was Perry's first major label release, and was later placed on her major label album, One of the Boys. The single was released digitally as well as an 12&quot; EP. Capitol Records offered this song as a free download on her website.\n\nThe video was directed by Walter May. In the video, Perry plays the song in front of a bright cartoon-like background. The video mocks aspects of modern culture including Myspace and Emo culture. The characters in the video are played by plastic dolls.\n\nOne of the Boys is the official debut album by American singer-songwriter Katy Perry and her major-label debut. Her change in record label and adoption of a pseudonymious surname accompanies a notable shift from the Christian gospel rock of her self-titled debut album: Katy Hudson.  The album was released in the United States and Canada on June 17, 2008. The album features the hit singles &quot;I Kissed a Girl,&quot; &quot;Waking Up In Vegas,&quot; and &quot;Hot N Cold,&quot; the first of which reached number one on the Billboard Hot 100. The album has been certified platinum by the RIAA. The album has sold over 2.5 million copies worldwide.\n\nOne of the Boys debuted at number 9 on the US Billboard 200. The album has shipped and sold over one million copies, earning a platinum certification from the Recording Industry Association of America. The album has been on the chart for 60 weeks.\n\nIn the United Kingdom, the album debuted and peaked at number 11 on the UK Albums Chart. It has since been certified Platinum. In Australia debuted at number 11 , the album has been certified platinum by the Australian Recording Industry Association, denoting over 80,000 copies sold.\n\nIn Italy, debuted at number 15. The album has been certified Gold with more than 55,000 copies sold.\n\nIn New Zealand, the album debuted and peaked at number seventeen. It has since been certified Gold, shipping over 7,500 copies.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:6cf2f55738e724efb2b04fcaadbaf773a5b7527e","amp;dn":"Katy+Perry+-+UR+So+Gay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cf2f55738e724efb2b04fcaadbaf773a5b7527e","infoHashBuffer":{"type":"Buffer","data":[108,242,245,87,56,231,36,239,178,176,79,202,173,186,247,115,165,183,82,126]},"announce":[],"urlList":[]}}