{"title":"DriverGenius v9.0.0.190 Portable","uid":5559008,"size":26077154,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6d8152788abea18a5ba057b21ffdfe0fda57fd7f&amp;dn=DriverGenius+v9.0.0.190+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoExcuses","files":4,"time":1273768703,"description":"DriverGenius Pro 9.0.0.190 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Serial are included...\n\nDriver Genius Professional can manage your PC to get 100% up to date Drivers and optimize PC performance. Driver Genius Professional is a powerful driver manager for Windows that can backup, restore ,search and update your drivers automatically with only a couple of mouse clicks!\n\n1. Quickly backup device drivers for your computer. Free to backup all drivers now!\n2. Easy to get the most recent drivers for your computer. Guides you to install drivers.\n3. Enhanced driver detection and faster download speed by New Driver Download Manager.\n4.Just one click restores all your drivers at once. Now supports Windows 7!\n5.Backup all drivers to an EXE auto-installer. Easy to install drivers machines with the same model.\n6. Remove invalid or useless drivers, improve system performance and stability.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.driver-soft.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.driver-soft.com/&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built up on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. It's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:6d8152788abea18a5ba057b21ffdfe0fda57fd7f","amp;dn":"DriverGenius+v9.0.0.190+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d8152788abea18a5ba057b21ffdfe0fda57fd7f","infoHashBuffer":{"type":"Buffer","data":[109,129,82,120,138,190,161,138,91,160,87,178,31,253,254,15,218,87,253,127]},"announce":[],"urlList":[]}}