{"title":"The Horizon Project (Ep 1) - TPTB","uid":5124726,"size":734471944,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6dad2ef77131a3e29cc12e40b19aedf010eab419&amp;dn=The+Horizon+Project+%28Ep+1%29+-+TPTB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"chatbars","files":-1,"time":1255549846,"description":"THE HORIZON PROJECT\n\nThe Horizon Project uses an unprecedented approach to deciphering the answers \nbehind life's most puzzling questions; breaking through the flawed explanations \nof fragmented modern theory that compound each year to further mask the truth. \nSee the overwhelming scientific evidence previously lost and re-discover the \nshocking answers that have been under our noses all along.\nNo matter your belief system or your professional background; The Horizon \nProject will change the way you look at everything!\n\nEpisode 01 of The Horizon Project begins with a frightening bang. Newly \ndiscovered scientific evidence shows that the world as we know it is about to \ncome to an unexpected end; however, knowing what's coming over the horizon is \nonly the tip of the iceberg; understanding WHY presents a picture far greater \nthan you could have imagined.\n\nGlobal catastrophic events throughout our past have severed the flow of \ninformation from one generation to the next, creating permanent gaps in history \nand knowledge. Civilizations that came before us knew of the upcoming \ninevitable catastrophe, leaving behind major clues that have just been recently \ndiscovered. The knowledge that was once lost is the missing link that provides \na clear understanding of how our world truly operates. Ironically, these clues \nalso inform us that time is running out; sooner than you may believe.\n\nUnderstand what is about to happen but more importantly HOW and WHY. In Episode \n01, The Horizon Project Research Team will identify some of the signs that are \nscattered all over our planet and reveal a shocking truth!\n\nThe Horizon Project's charter is to gather and cross-check vast amounts of \nknowledge in many dozen specialized fields from scientists and researchers \naround the globe in addition to studying hundreds of historical documents \nspanning back to the dawn of history. These fields include archeology, geology, \nastro, geo &amp; quantum physics, ancient languages &amp; civilizations, paleontology, \nancient history, genetics and others.\n\nThe emphasis is on solving the puzzles that each field is unable to solve \nindividually because of overspecialization and their focus to advance their own \nspecialized knowledge. The knowledge to explain many of these anomalies had \nbeen unknowingly found by other fields of study, but the very nature of most \ncommercial research today does not support the unlimited exchange of \ninformation between fields since there is no overtly apparent connection \nbetween most of them. As a result, these anomalies remain unsolved until now.\n\nBy better understanding a much broader scope of scientific research covering \nmany fields of study, and our own history from multiple vantage points, we are \nable to derive an overall picture of our past. This goal is monumental in scope \nand ongoing; however, the research has uncovered an unnerving understanding \nthat the world as we know it is about to come to an unexpected end in our near \nfuture. The findings will not only shock you, but will change the way you look \nat life forever!\n\nTHIS IS A MUST SEE, EVERYONE SHOULD WATCH!\n\n\n\nSign up @ www.teamtptb(.)com","torrent":{"xt":"urn:btih:6dad2ef77131a3e29cc12e40b19aedf010eab419","amp;dn":"The+Horizon+Project+%28Ep+1%29+-+TPTB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dad2ef77131a3e29cc12e40b19aedf010eab419","infoHashBuffer":{"type":"Buffer","data":[109,173,46,247,113,49,163,226,156,193,46,64,177,154,237,240,16,234,180,25]},"announce":[],"urlList":[]}}