{"title":"IcyScreen 3.20-serials incl","uid":5023617,"size":4806001,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6e0c9d6598ae3fb78cd719481047a84fcca86b7b&amp;dn=IcyScreen+3.20-serials+incl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jmb2012","files":2,"time":1248592890,"description":"Automatic screenshots. See them anywhere.\n\nIcyScreen is an automatic screenshot taker. But it's much more than just that.\n\nIt can take screenshots -- &quot;snapshots&quot; of your computer screen, also known as screen captures -- as often as you'd like, and not only save them to disk, but also...\n\n    * E-mail each screenshot to an unlimited number of recipients, including yourself\n    * Upload each screenshot to your web server, via FTP\n    * Upload each screenshot to the free ImageShack hosting service\n\nConfiguration is quick and easy. Just set it once and forget it!\n\nProtect. Document. Monitor. So many uses.\n\n    * Keep track of how time is being spent on the computer\n    * Monitor the computing habits of your employees, students, or children\n    * Take action against cyber-bullying -- see what they're doing on:\n          o MySpace\n          o Facebook\n          o Instant-messenger (AIM, MSN, Yahoo!, etc)\n    * Share information with your customers, co-workers, and friends\n    * Document intensive tasks and your daily activities\n\n... the possibilities are endless!\n\nFeatures. Lots of features.\n\nIcyScreen has enough features to satisfy even the most demanding of users, yet it's still easy to use.\n\nBesides configuring the locations you'd like each screenshot to be saved, e-mailed, and/or uploaded to (see above), you can:\n\n    * Configure exactly how often a screenshot is taken\n    * Customize nearly every single aspect of the screenshot, including:\n          o The file name (use format codes to make organization a breeze)\n          o The dimensions\n          o The image format/quality\n    * Choose exactly what to take a screenshot of:\n          o The entire screen -- you can even select which monitors to include in the screenshot, as well as the areas that are extracted from each monitor\n          o The active window\n    * Easily manage settings for multiple user accounts with the built-in central management capabilities\n    * Configure it to not take a screenshot if the computer is inactive or the screensaver is running\n    * Prevent screenshots from being saved if the screen has not changed\n    * Enable audible/visual warnings, so you know exactly when a screenshot is about to be taken\n    * Have IcyScreen detect and take action whenever the Print Screen key is pressed\n    * Have IcyScreen hide itself, as well as protect functionality with a password\n","torrent":{"xt":"urn:btih:6e0c9d6598ae3fb78cd719481047a84fcca86b7b","amp;dn":"IcyScreen+3.20-serials+incl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e0c9d6598ae3fb78cd719481047a84fcca86b7b","infoHashBuffer":{"type":"Buffer","data":[110,12,157,101,152,174,63,183,140,215,25,72,16,71,168,79,204,168,107,123]},"announce":[],"urlList":[]}}