{"title":"Susans Radio Show Online (SRS-O) Shows 21 - 25","uid":5086643,"size":149385982,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6e1fb439cf946d50927f971d2b39ccfb3fd4c0f4&amp;dn=Susans+Radio+Show+Online+%28SRS-O%29+Shows+21+-+25&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TheHawksNest","files":1,"time":1252771267,"description":"SRS-Online #21 Arlene Lafferty\n\nThis week's featured interview is with &quot;Ar&quot;lene Lafferty, a one-of-a-kind professional in the field of electrology and related professional cosmetic services. &quot;Ar&quot;lene is the first known post-op to be licensed as an electrologist in the nation, possible the world. She transitioned and had her surgery in 1975 and has been heavily involved in the community since.\n\n\n\nSRS-Online #22 Pam Bennett\n\nThis week's featured interview is with Pam Bennett, an out and proud trans woman running for a seat on the Aurora, Colorado City Council. Pam currently serves as a commissioner with both the Aurora Veterans Affairs and Cultural Affairs commissions and holds a Bachelors degree in Resource Management. Since her transition in 2003, she has actively worked to support the local transgender community through her work with Equal Rights Colorado and numerous speaking engagements and panels at area colleges.\n\n\nSRS-Online #23 California Dreamin' in review\n\nWe don't have a guest this week, so we just talk about out time at the California Dreamin' Convention.\n\n\nSRS-Online #24 - Dr. Richard/Alice Novic\n\nThis week, SRS-O interviewed Richard/Alice Novic, M.D., psychiatrist and crossdresser. Dr. Novic joined Susan in person at her home in Orange County to discuss her book Alice in Genderland: A Crossdresser Comes of Age along with her medical practice and life in general. If you are interested in the subtleties differentiating crossdressers from other members of the transgender community check this interview out!\n\n\nSRS-Online #25 Roundtable with Rebecca Nay\n\nWe get Rebecca Nay of TrannyWreck to join us for some news and chat.","torrent":{"xt":"urn:btih:6e1fb439cf946d50927f971d2b39ccfb3fd4c0f4","amp;dn":"Susans+Radio+Show+Online+%28SRS-O%29+Shows+21+-+25","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e1fb439cf946d50927f971d2b39ccfb3fd4c0f4","infoHashBuffer":{"type":"Buffer","data":[110,31,180,57,207,148,109,80,146,127,151,29,43,57,204,251,63,212,192,244]},"announce":[],"urlList":[]}}