{"title":"Penis Your Majesty Robot Spank Party-Discography","uid":5114597,"size":136382440,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6e59f43c1bc5b7d42f3fff4f58a40ea6d55b1ecc&amp;dn=Penis+Your+Majesty+Robot+Spank+Party-Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"penisyourmajesty","files":-1,"time":1254996828,"description":"PENIS YOUR MAJESTY: ROBOT SPANK PARTY / Automatic For the Penis (live 1992) / TWELVE INCHES OF PENIS (remixes)\nAll songs Ã‚Â©1992 Daddy Uh-Oh inc.\n \n \n\nTracks:\n03 March of the Corporate Monkeys.mp3\n04 Take it All the Way!.mp3\n05 Daddy Uh-oh!.mp3\n07 PLASTIC DOLL! (Real Doll demo).mp3\n07 Rollio's Cream Dream.mp3\n08 It's Your Bithday Jesus christ.mp3\n08 Mister Fister.mp3\n08 Red Tail Spankin'.mp3\n09 Colonel Lingus.mp3\n09 Electric Rectum.mp3\n10 Piss Puppet For Jesus.mp3\n11 You're an Asshole.mp3\n13 Big Baby.mp3\n15 Temporary Turd Converter.mp3\n18 Peeping Tom.mp3\n19 Ape in My Head (demo).mp3\n21 Santa's Cummin'.mp3\n21 Wet Spot!.mp3\n26 Barb E. Boy (demo).mp3\n27 Watching Machines Work.mp3\n28 In a Glass Cage.mp3\n29 2000 Flushes.mp3\n22 Rubber Rodeo.mp3\n23 Rinse Dream.mp3\n23 Wig Wag.mp3\n24 Uh-Oh in NYC.mp3\n25 Wet Panties_Suck the christ Child.mp3\n34 Praying For a Sticky (original).mp3\n03 Daddy Uh-oh (Oh, No Slow mix).mp3\n05 Plastic Doll! (Industrial strength).mp3\n06 Praying For a Sticky (Situation mix featuring MC Poop).mp3\n09 Corporate Monkey March Outro.mp3\n10 Colonel Lingus (lapdance mix).mp3\n15 Red Tail Spankin' (Rollio Cream Dream mix).mp3\n18 Mister Fister (original mix).mp3\n31 Praying For a Sticky (Night Version).mp3\n32 Monkey Love.mp3\n33 Daddy Uh-oh! (Bedpan mix).mp3\n\n01 Joy of the Twitch.mp3\n12 Crackerjackass (live).mp3\n15 Big Baby (live).mp3\n20 Ape in My Head (WRFL live).mp3\n21 Plastic Doll! (live last show).mp3\n22 Dogs (live improv).mp3\n30 I've Got the Mama Hole!.mp3\n32 Wet Spot (live).mp3\n33 Electric Rectum (live).mp3\n\nFour-track Home Demos recorded between 1991-1993 Live recording at The Wroklage and Virtual Gallery. Praying for a Sticky (Situation) mixed by MC POOP (courtesy of U-Bitch) at WRFL studios.\nTransmission: operating instructions from the lap of Daddy Uh-Oh,\nSalutations Uh-Oh drones. Stiffy to be here reporting on the progress of Uh-Oh's continuing subsonic experiments. Today several top stars in music and the fuck film industry are working with Uh-Oh co. to enhance the full frontal lobes of the masses. The sudo-scientific term &quot;Gendernetics&quot; was coined in the early 90's to describe experiments leading to the propaganda tool, Penis, Your Majesty. At that time music was at an all time low after years of conservative, corporate kiddy-pop and the budding hard core rap reaction had humans choosing sides in the ongoing clichÃƒÂ© wars. Unnatural selection and dissatisfaction lead Daddy Uh-Oh to plan the most offensive multi-media sex show he could think of.\nOne night while engorged and groping his latex lover he heard uncharacteristically cool music cumming from the porno film Party Doll a Go-Go . &quot;That's it!&quot;, he yelled running to the toilet. While on the shit box he placed an add for freaks with &quot;special talents&quot;. Days later Penis, Your Majesty were locked away practicing in an asbestos infested, 120 degree loft. What they lacked in talent they made up for in excitement and excremental references. Uh-Oh premiered this new combo at an all ages talent show he called the Daddy Rally. Plastic Doll allowed herself to be eaten out as band mates sang her praises and the mutant spokes pervert Vaseline insulted and disturbed the audience. Meant as an assault on the senseless, instead the crowed got so over zealous in there praise of Penis that the University of Kentucky signed them to play an outdoor concert. While arranging the details Plastic Doll was fisted fucked to death by Anti-Uh-Oh Conspirator with a bull whip. This ugly event gave a new focus to the band, a political agenda to disturb and corrupt the sons and daughters of the accused killers.\nDaddy Uh-Oh would like to spank: our fans, the late great inflate-o-mate Plastic &quot;Luv Luv&quot; Doll, Rinse Dream (for inspirational films Party Doll A Go-Go &amp; Cafe Flesh), Reverend Brownmouth, Colonel Lingus, Commander Clitoris, Captain Beefheart, Glory Noel, MC Poop, Pelce, Pain Teens, uncircumcised masses, Mary Burt, Zinc, WRFL, the P.I.S.S. Army, Something Weird Video, Mark II A.K.A. Devo Boy, Retro Virus and Opportunistic Infection, Wayland Flowers and Madame X, Larry Flint, and God.\n!991-1993 Penis took America by storm and were suddenly silenced by the untimely death of Plastic &quot;Luv Luv&quot; Doll and over differences with right wing manager Daddy Uh-oh. Kennedy, MTV VJ, reported Penis, Your Majesty were one of Kentucky's hottest bands which lead to a lengthy legal battle with MTV over the bands ruined &quot;Street Creed&quot;. Band member Bonkers and spokes mutant &quot;Vaseline&quot; have been picked up several times by police for lude behavior and prostitution charges. Double the Stuff disappeared for years but has resurfaced in a cult of UFO followers.","torrent":{"xt":"urn:btih:6e59f43c1bc5b7d42f3fff4f58a40ea6d55b1ecc","amp;dn":"Penis+Your+Majesty+Robot+Spank+Party-Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e59f43c1bc5b7d42f3fff4f58a40ea6d55b1ecc","infoHashBuffer":{"type":"Buffer","data":[110,89,244,60,27,197,183,212,47,63,255,79,88,164,14,166,213,91,30,204]},"announce":[],"urlList":[]}}