{"title":"Mary J. Blige - Stronger","uid":5125368,"size":159369220,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6ea1c68c627c170d65d664020800f89fbc9f31a4&amp;dn=Mary+J.+Blige+-+Stronger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1255584230,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Stronger&quot; the name of a song performed by American R&amp;B singer Mary J. Blige and is the title track from her ninth studio album, &quot;Stronger&quot;. It also features on the soundtrack for the film More Than a Game.\n\nIt released as the second single from the album to iTunes and Amazon on August 18, 2009. Additionally it was sent to US radio on September 8, 2009.\n\nThe music video, which premiered on August 21, 2009,features Blige singing in a quarry and amidst clouds. Footage from the film is interspersed throughout, and the video begins and ends with quotations by LeBron James. The video was directed by Anthony Mandler.\n\nThe song deals with issues surrounding people standing by one another through the difficult times. Blige sings &quot;Now we're stronger... stronger... stronger...&quot; referencing that relationships have more strength once they have been tested and people stand by each other. The song was produced by Polow da Don and Hit-Boy especially for the Music Inspired by More Than a Game which is the official soundtrack album to the film More Than a Game. &quot;Stronger&quot; was first released as the lead single from the soundtrack album on August 4, 2009 to iTunes as a digital download.\n\nOn August 18, 2009 it was released to other outlets making it the second single to be released from Blige's ninth studio album of the same name. The video premiered several days later.\n\nBlige performed the song on Good Morning America on September 11, 2009. She also performed it on The Late Show With David Letterman on September 23, 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:6ea1c68c627c170d65d664020800f89fbc9f31a4","amp;dn":"Mary+J.+Blige+-+Stronger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ea1c68c627c170d65d664020800f89fbc9f31a4","infoHashBuffer":{"type":"Buffer","data":[110,161,198,140,98,124,23,13,101,214,100,2,8,0,248,159,188,159,49,164]},"announce":[],"urlList":[]}}