{"title":"YEAR-ONE..DVDrip[vice]","uid":5093713,"size":488250331,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6f68ecbb75f12cf0230d71a6a639d3eb9e83eb67&amp;dn=YEAR-ONE..DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vicerock","files":-1,"time":1253369096,"description":"YEAR ONE DVDrip\n\nVIDEO CODEC     Xvid\nformat          avi\nsize/res        480x272[wide screen]\nruntime         99:33mins\nvideo bitrate   512\nvideo framerate 25\n\nAUDIO CODEC     mp3\naudio bitrate   128\nsample rate     44100\ninfo     123kb/s joint stereo\n\nCast\n\n    * Jack Black as Zed\n    * Michael Cera as Oh\n    * Olivia Wilde as Princess Inanna[3]\n    * June Raphael as Maya\n    * David Cross as Cain\n    * Paul Rudd as Abel[4]\n    * Juno Temple as Eema\n    * Oliver Platt as High Priest\n    * Christopher Mintz-Plasse as Isaac\n    * Eden Riegel as Lilith\n    * Hank Azaria as Abraham\n    * Bill Hader as The Shaman\n    * Vinnie Jones as Sargon\n    * Harold Ramis as Adam\n    * Rhoda Griffis as Eve\n    * Xander Berkeley as The King\n    * Gia Carides as The Queen\n    * James B. McDaniel as Sodom Buyer[5]\n    * Paul Scheer as Bricklayer\n    * David Pasquesi as Prime Minister\n    * Kyle Gass as Zaftig the Eunuch\n    * Gabriel Sunday as Seth\n\n  Plot\n\nZed (Jack Black) is a hunter and Oh (Michael Cera) is a gatherer. After being informed that Zed ate from the Tree of Knowledge of Good and Evil, the shaman banishes him from the tribe. Oh decides to go with Zed on his journey to find the end of the Earth. Along the way, they encounter Cain and Abel (David Cross and Paul Rudd). Cain kills Abel and informs Zed and Oh that they must escape with him or else be accused of killing Abel.[2]\n\nAfterwards, Zed and Oh find that the girls they wanted to &quot;lay with&quot; (Maya and Eema) from their former tribe, have been captured and are being sold into slavery. They try to buy the girls' freedom, but Cain ends up selling Zed and Oh. While being taken to a village by the owner with all the other slaves from their tribe, Sodomites attack and take the slaves prisoner, though Zed and Oh escape and hide in the desert, watching the Sodomites.\n\nThe next morning, Zed and Oh discover that the Sodomites have left with the slaves. They head off to save the slaves. They come to a mountain and find Abraham (Hank Azaria) about to kill his son Isaac (Christopher Mintz-Plasse). Zed stops them, claiming that the Lord sent him to do so. Abraham takes them to his Hebrew village and tells them about the cities of Sodom and Gomorrah.\n\nZed and Oh head off for Sodom after Abraham offers to circumcise them. As they arrive in Sodom, they are captured. Cain, now a Sodomite soldier, saves them from being tortured, calling them &quot;his brothers.&quot; The two recalled that they were sold by Cain as slaves and Cain apologizes and offers them food. While being given a tour of the city by Cain, Zed and Oh see the princess, who is starving herself because she feels guilty that everyone else in the city is starving. That night, at a party, Zed is invited by the princess to talk with her.\n\nInside the palace, Zed sees Maya and Eema serving as slaves, while Oh is forced to follow the very effeminate high priest around the palace. Zed meets the princess and she asks him to enter the Holy of Holies and tell her what it is like, thinking that Zed is the &quot;Chosen One.&quot; Inside the temple, Zed encounters Oh, who is hiding from the high priest. There, they get into a heated argument and are then imprisoned for going inside the temple. The two are sentenced to be stoned to death but Zed convinces the Sodomites to have mercy, so they are instead sentenced to hard labor until they die from work. The king then announces that he will be sacrificing his daughter and two virgins (Maya and Eema) as a gift to the gods.\n\nZed goes and interrupts the ceremony, claiming he is the &quot;Chosen One.&quot; A riot starts and Oh saves Eema. The two have sex inside the palace in order that Eema would not be sacrificed and then come out to help Zed fight the soldiers (including Cain). The crowd kills all the leaders and proclaim Zed as the Leader being the &quot;Chosen One&quot;. Zed turns this down and instead becomes an explorer with Maya. Oh becomes the leader of the village where the whole adventure started. The two say their goodbyes and head their separate ways. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1045778/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1045778/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY","torrent":{"xt":"urn:btih:6f68ecbb75f12cf0230d71a6a639d3eb9e83eb67","amp;dn":"YEAR-ONE..DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f68ecbb75f12cf0230d71a6a639d3eb9e83eb67","infoHashBuffer":{"type":"Buffer","data":[111,104,236,187,117,241,44,240,35,13,113,166,166,57,211,235,158,131,235,103]},"announce":[],"urlList":[]}}