{"title":"Ashampoo Burning Studio 2010 Portable","uid":5109417,"size":39040948,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:701fbdb417730d254e3052bf23011daf9a39bf57&amp;dn=Ashampoo+Burning+Studio+2010+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoExcuses","files":1,"time":1254646568,"description":"Ashampoo Burning Studio 2010 made Portable.\n\nNo need to install it!\nOr, if you want to, this is just the nightissuchproximity's upload made Portable. Get it here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5109316/Ashampoo_Burning_Studio_2010&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5109316/Ashampoo_Burning_Studio_2010&lt;/a&gt;\n\nThanks Nightie... :o)\n\nThe program is free, and you can request your personal license during installation.\n\n\nMulti-disc file backup and restore on CDs, DVDs and Blu-ray discs; create compressed backup archives with powerful password protection; split archives automatically across multiple CDs, DVDs or Blu-ray discs; restore archive contents to their original locations; integrated Audio CD ripper store your audio tracks as WMA or WAV files; new option for setting the number of copies you want to burn (available for all disc formats); discs can now be verified immediately without being ejected first (if the drive supports this feature); numerous other small improvements that make the program easier to use and more effective; burn files and folders on data CDs/DVDs/Blu-ray discs; burn Audio CDs from WAV, MP3, FLAC, WMA and Ogg Vorbis files; burn MP3-CDs from your MP3 files; burn Video DVD, Video CD (VCD) or Super Video CD (S-VCD); create and burn CD/DVD/Blu-ray disc images; burn speed and other options can all be set automatically.\n\nVersion 6.76 may include unspecified updates, enhancements, or bug fixes.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www2.ashampoo.com/webcache/html/1/home_2_EUR.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www2.ashampoo.com/webcache/html/1/home_2_EUR.htm&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:701fbdb417730d254e3052bf23011daf9a39bf57","amp;dn":"Ashampoo+Burning+Studio+2010+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"701fbdb417730d254e3052bf23011daf9a39bf57","infoHashBuffer":{"type":"Buffer","data":[112,31,189,180,23,115,13,37,78,48,82,191,35,1,29,175,154,57,191,87]},"announce":[],"urlList":[]}}