{"title":"POP Peeper (E-mail Notificator)","uid":5086940,"size":1121999,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:704271c2bdbb244bb3a8b1e8af692048cecf15a0&amp;dn=POP+Peeper+%28E-mail+Notificator%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Harrewho","files":1,"time":1252791139,"description":"Tired of having tons of mail everytime you check it? How often do you really check your mail?\n\nWith this free software you can get a 'New Mail' notification right from your desktop. You can also reply to your mail, you can activate 'autocheck' wich will check your mail automaticly(every 5th min for example), you can also have sevral accounts, type new mails and read them(ofc).\n\nI'm not an expert on this program, but I'll tell you what I can about it :)\n\nIt's alittle bit of a mess to create an account in POP Peeper, but when you're done it's great. It could have looked better though :P\n\nYou have to create an account to be able to check your mail. Just click on the 'Accounts' button in the very top of the window after you've installed it. Then click 'Add...'  'Create single account'  type your mail adress. Type Nickname and select server type (Hotmail, yahoo, Gmail etc) then read all the instructions that I'm too lazy to type here :P \nNow you're done :\n\nI know it's alittle bit stupid to put up a such small torrent, but alot of ppl look here on TPB. So I figured that if I put this up here I might save some time for some ppl :P\nToo bad most of u will think this is a virus :(","torrent":{"xt":"urn:btih:704271c2bdbb244bb3a8b1e8af692048cecf15a0","amp;dn":"POP+Peeper+%28E-mail+Notificator%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"704271c2bdbb244bb3a8b1e8af692048cecf15a0","infoHashBuffer":{"type":"Buffer","data":[112,66,113,194,189,187,36,75,179,168,177,232,175,105,32,72,206,207,21,160]},"announce":[],"urlList":[]}}