{"title":"For Liberty:A Grassroots Documentary  (DVDRip XviD)","uid":5119444,"size":1416950368,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:70f1e814cf8d374722adb894bf525878f1c22323&amp;dn=For+Liberty%3AA+Grassroots+Documentary++%28DVDRip+XviD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"brainphreak","files":3,"time":1255249824,"description":"How the Ron Paul rEVOLution Watered the Withered Tree of Liberty\n\nAs the 2007-08 presidential campaign cycle offered up the usual slate of Washington insiders, Ron Paul, an obscure Congressman from Texas brought an alternative voice that challenged the political establishment.\n\nAdvocating a philosophy of sound money, a non-interventionist foreign policy, strict Constitutionalism, and individual liberty, Dr. Paul inspired a unique grassroots movement unmatched in American history - the repercussions of which continue to reverberate today and into the future of the American psyche.\n\nFor Liberty: How the Ron Paul Revolution Watered the Withered Tree of Liberty follows this historic campaign from the perspective of grassroots activists, and showcases the unique, often bizarre, yet groundbreaking projects they undertook as they brushed aside traditional campaign methodology.\n\n-----\n\nAs always be sure you buy these documentaries if you truly appreciate them and wish the author/creator to make more fine quality films. This is a great documentary for anyone interested in the Freedom movement even if not a Ron Paul fan. Anyone interested in any sort of activism may find this film interesting.\n\nEnjoy! And be sure to drop by  www.theblackpacket.com and say hi!","torrent":{"xt":"urn:btih:70f1e814cf8d374722adb894bf525878f1c22323","amp;dn":"For+Liberty%3AA+Grassroots+Documentary++%28DVDRip+XviD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70f1e814cf8d374722adb894bf525878f1c22323","infoHashBuffer":{"type":"Buffer","data":[112,241,232,20,207,141,55,71,34,173,184,148,191,82,88,120,241,194,35,35]},"announce":[],"urlList":[]}}