{"title":"Coast to Coast AM July 30th 2009 - Crop Circles &amp; Anomalies","uid":5037035,"size":41451202,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:71429b0b3acc82926111a3d7f0f73c685485bfef&amp;dn=Coast+to+Coast+AM+July+30th+2009+-+Crop+Circles+%26+Anomalies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ufonut","files":4,"time":1249169268,"description":"Coast to Coast AM July 30th 2009 - Crop Circles &amp; Anomalies\n\nCrop Circles &amp; Anomalies\n\nDate:\n07-30-09\n\nHost:\nGeorge Noory\n\nGuests:\nLinda Moulton Howe, \n\nLive from the U.K., investigative reporter Linda Moulton Howe and various witnesses and researchers, shared news about recent crop formations and associated anomalies in the Wiltshire, England area. She spoke with Paul Jones and Andrew Pyrka, two crop circle enthusiasts who'd caught an unidentified aerial object on videotape when they visited the 'Aztec Bird' formation near Barbury Castle on June 14, 2009. A silver disc-shaped object hovered without moving for a time, vanished, and then reappeared again. According to Charles Mallett, Director of the Silent Circle Research Center, other witnesses reported seeing UFOs in this area. Photos and further details here.\n\nOn July 14, 2009, Yorkshire engineer Winston Keech set up infrared cameras on a pole overlooking East Field and was able to capture unexplained flashes of light, followed by two large dark spots that moved around in the wheat. At the time these images were recorded there was no sign of a crop circle formation, yet after the sun rose, an unusual 'basket weave' pattern with two arcs extending from it was spotted in the field. For more, including video footage, see Linda's full report.\n\nAnother witness, Ryan O'Hara, part of a documentary production team, said they were camped out on top of Silbury Hill on the night of July 4th, 2009, and they heard no disturbances. Yet in the morning, a spectacular &quot;Quetzalcoatl Headdress&quot; formation was present only a quarter mile away. Longtime crop circle investigator/documentarian Lucy Pringle joined Linda to talk about unusual effects people feel when visiting the formations. In some 700 reports she has gathered, visitors report a variety of symptoms from healing episodes to severe headaches, and these reactions may be related to changed frequencies within the formations, Pringle believes.\n","torrent":{"xt":"urn:btih:71429b0b3acc82926111a3d7f0f73c685485bfef","amp;dn":"Coast+to+Coast+AM+July+30th+2009+-+Crop+Circles+%26+Anomalies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71429b0b3acc82926111a3d7f0f73c685485bfef","infoHashBuffer":{"type":"Buffer","data":[113,66,155,11,58,204,130,146,97,17,163,215,240,247,60,104,84,133,191,239]},"announce":[],"urlList":[]}}