{"title":"Coast To Coast Am - 06-06-2003 - Extraordinary Evidence","uid":5588265,"size":30858373,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:71d386b510c4dd7dbbaed629fa6fd2f6ec4483cb&amp;dn=Coast+To+Coast+Am+-+06-06-2003+-+Extraordinary+Evidence&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Lyrian","files":2,"time":1274771865,"description":"Extraordinary Evidence\n\nDate:\n\t\n\n06-06-03\n\nHost:\n\t\n\nGeorge Noory\n\nGuests:\n\t\n\nLinda Moulton Howe\n\nWe may be dealing with &quot;an energy interaction that no one understands,&quot; said investigator Linda Moulton Howe when she appeared on the first half of Friday's show. She was presenting the latest scientific findings from the Urandir Oliveira alien abduction case, in which materials (a scorched bedspread and disc-shaped rocks) had been gathered from the event site in Corguinho, Brazil and analyzed.\n\nWhile Oliveira was allegedly being floated through his bedroom ceiling into an alien craft, a rain of small round rocks was reported to fall in the immediate vicinity. Tests revealed the rocks contained a rare earth material called cubanite which has been associated with magnetism. &quot;You have presented us with objects that are well outside the things we have encountered before,&quot; geologist Art Johnson Ph.D., told Linda.\n\nAn examination of Oliveira's bedsheet which Linda called a &quot;unique and extraordinary&quot; piece of evidence, was conducted by textile expert, Prof. Herbert J. Barndt, who was perplexed as to what type of energy source could have created the burn pattern. &quot;I would be at a loss to explain how a body could have been present in the amount of heat that was required to do the damage that you see here and not suffer serious burns,&quot; Barndt said. (Oliveira was not injured during the episode). An in-depth report with photographs is currently available on Linda's website, covering tests on both the rocks and the bedspread.\nNight Terrors\n\nDuring the second half of Friday's show, George opened up a special Night Terrors line. Tales included an old lady taking the place of a man's wife in his bed, hauntings in a house in Salt Lake City where murders were committed, and phantoms appearing in a former funeral home.\n\n&quot;I've got a real horror story for you,&quot; said a first-time caller, who related how he was lying in bed one night, when a cloud appeared over his bed. From out of it, appeared a shadowy entity with claws that began to attack him. As if that wasn't bad enough a canine-like creature &quot;came out of the wall,&quot; and joined in the assault. But the caller said he began to pray, and then a beam of light materialized that vanquished the beings, and filled him with a sense of love. ","torrent":{"xt":"urn:btih:71d386b510c4dd7dbbaed629fa6fd2f6ec4483cb","amp;dn":"Coast+To+Coast+Am+-+06-06-2003+-+Extraordinary+Evidence","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71d386b510c4dd7dbbaed629fa6fd2f6ec4483cb","infoHashBuffer":{"type":"Buffer","data":[113,211,134,181,16,196,221,125,187,174,214,41,250,111,210,246,236,68,131,203]},"announce":[],"urlList":[]}}