{"title":"Lotus Symphony 1.3 (.deb x86)","uid":5080904,"size":188759922,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:7232c16f6ccda329224a5dc39f2667753406fc47&amp;dn=Lotus+Symphony+1.3+%28.deb+x86%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1252279918,"description":"IBM Lotus Symphony 1.3\n======================\n \nA suite of applications for creating, editing and sharing text\n\nIBM Lotus Symphony is a feature-rich set of office tools that are free and easy to use. There are three applications that make up Lotus Symphony: Lotus Symphony Documents, Lotus Symphony Spreadsheets, Lotus Symphony Presentations. \n\nWhat's New in This Release:\n===========================\nFunctional enhancements:\n\nÃ‚Â· Enabled MicrosoftÃ‚Â® Office 2007 files import support.\nÃ‚Â· Significant enhancements in DataPilot in spreadsheets, including show/hide field items panel, drill down to details, DataPilot cache support, and default styles.\nÃ‚Â· Numbering enhancement in documents to improve interoperability with Microsoft Word.\nÃ‚Â· Enabled Microsoft Office and IBM Lotus SmartSuiteÃ‚Â® password protection support for spreadsheets.\nÃ‚Â· Enabled network URI access and hyperlink support that allows you to create network connection hyperlinks for URI protocols including FTP, MailTo, and SMB.\nÃ‚Â· Enabled envelope support which allows you to create an envelope, set envelope properties, and set printing options.\nÃ‚Â· Enabled Widgets Catalog server support.\nÃ‚Â· Improved print performance.\nÃ‚Â· Enabled Sumproduct's ForceArray formula support in spreadsheets.\n\nUsability enhancements:\n=======================\nÃ‚Â· In presentations, page layout is more visible by locating the Properties sidebar in the right panel.\nÃ‚Â· Provided better animation effects interoperability with Microsoft PowerPoint on font-relative effects, fade-exit effects, and multiple motion paths; and enabled the animation play at automatic page transitions.\nÃ‚Â· Provided an automatic cursor in presentation screen shows as a default option.\nÃ‚Â· Presentation pages can be deleted continuously without any prompt.\nÃ‚Â· Provided new graphic bullets and clip art.\nÃ‚Â· Provided enhanced color pallette in color picker.\nÃ‚Â· Enhancements in live text.\nÃ‚Â· Enabled support that allows you to open a file by dragging and dropping a file to the home page or the New.\nÃ‚Â· A continuous improvement in mail merge in documents.\nÃ‚Â· Default font is changed to Arial in presentations and documents.\nÃ‚Â· Enlarged the pull-down list length upper limit to 20 items to make more options visible.\nÃ‚Â· Enabled Ctrl+left Shift and Ctrl+right Shift hotkey support to switch BIDI layout.\nÃ‚Â· Enhanced toolbar and main menu usability.\n\nProgrammability enhancements:\n=============================\nÃ‚Â· Provided rich Lotus Symphony document model APIs for Spreadsheets and Documents.\n\nOnline help enhancements:\n=========================\nÃ‚Â· Enhanced help content for spreadsheets, common, and preferences topics.\n\nWeb site:\n=========\nÃ‚Â· Added drag-to-install function in the Plug-ins section.\nÃ‚Â· Added support for multiple downloads and enabled Atom feeds for clip art and templates in the Gallery section.\nÃ‚Â· Expanded search function for the Forum.\nÃ‚Â· Rotated announcements on the Home page. \n\n\n\nMore info : http://symphony.lotus.com/software/lotus/symphony/home.nsf/home","torrent":{"xt":"urn:btih:7232c16f6ccda329224a5dc39f2667753406fc47","amp;dn":"Lotus+Symphony+1.3+%28.deb+x86%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7232c16f6ccda329224a5dc39f2667753406fc47","infoHashBuffer":{"type":"Buffer","data":[114,50,193,111,108,205,163,41,34,74,93,195,159,38,103,117,52,6,252,71]},"announce":[],"urlList":[]}}