{"title":"Coast to Coast AM - Aug 12 2009 - Einstein, Physics, &amp; the Unive","uid":5063043,"size":56048806,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:72f2bb082490d3cc6c63212142b75653b59552a4&amp;dn=Coast+to+Coast+AM+-+Aug+12+2009+-+Einstein%2C+Physics%2C+%26+the+Unive&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1250796014,"description":"With a PhD from Stanford, and a BS from Caltech where he studied under famous physicist Richard Feynman, Dr. Robert Piccioni discussed the life and work of Albert Einstein, as well as the Big Bang, dark matter, and cosmology. Einstein initially struggled with school and couldn't find employment. Eventually though, he landed a job, and married Maleva Maric, a physics student who helped him in his work. In 1905, as an unknown clerk, he published five extraordinary papers that revolutionized science, and changed our understanding of atoms, light, gravity, mass, space, time, and the universe, itself, said Piccioni. His discoveries, which were made without a laboratory, paved the way for the technology we see in products such as DVDs, iPods, GPS, bar code scanners, computers and many others, he added.\n\nPicciini shared a fascinating theory about the origin of the universe from physicist Lee Smolin, who postulated a kind of &quot;cosmological natural selection.&quot; In the event of a star collapse or black hole formation, in which matter is tightly condensed, that matter could be blown out to create a new universe, similar yet separate from its parent universe. And like living creatures, universes could adapt over time to enhance their &quot;reproductive potential.&quot;\n\nPiccioni touched on dark matter, the invisible and mysterious substance that holds galaxies together, yet doesn't interact with visible matter. He also spoke about efforts to launch cold fusion, a safe way to harness nuclear power for clean, abundant energy. Many such claims about cold fusion have not panned out, but an offshoot known as LENR, Low Energy Nuclear Reactions, shows promise. &quot;I think it has a real shot, and deserves to be supported,&quot; he said.\n\nSwine Flu Vaccine Update\nFirst hour guest, Dr. Sherri Tenpenny shared concerns regarding the upcoming Swine Flu shot, which may be made mandatory in schools. Self-quarantine will hopefully be an option for those who don't wish to take the vaccination, she said. The recent hysteria over the Healthcare Bill is really a cover-up/distraction for issues around the vaccine, she suggested.\n\n[This information has been shared to spread knowledge to those who otherwise would not have access to it.  If you can afford it please support www.coasttocoast.com]","torrent":{"xt":"urn:btih:72f2bb082490d3cc6c63212142b75653b59552a4","amp;dn":"Coast+to+Coast+AM+-+Aug+12+2009+-+Einstein%2C+Physics%2C+%26+the+Unive","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72f2bb082490d3cc6c63212142b75653b59552a4","infoHashBuffer":{"type":"Buffer","data":[114,242,187,8,36,144,211,204,108,99,33,33,66,183,86,83,181,149,82,164]},"announce":[],"urlList":[]}}