{"title":"Plain, Honest Men: The Making of The American Constitution","uid":5100626,"size":327679642,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:730cd3f42b6327f3ad627f66726886a2bebca4cc&amp;dn=Plain%2C+Honest+Men%3A+The+Making+of+The+American+Constitution&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1253956275,"description":"Audiobook, originally 19h21m, duration reduced 30% (or tempo increased 42.7%) to 13h33m. Unabridged.\n\n2009\n\nFrom distinguished historian Richard Beeman comes a dramatic and engrossing account of the men who met in Philadelphia during the summer of 1787 to design a radically new form of government. /Plain, Honest Men/ takes listeners behind the scenes to show how the world's most enduring constitution was forged through conflict, compromise, and fragile consensus.\n\nBeeman captures as never before the dynamic of the debate and the characters of the men who labored that summer in Philadelphia, among them James Madison, as brilliant as he was unprepossessing; Roger Sherman, the straightforward Connecticut delegate who helped broker some of the key compromises of the Convention; and General George Washington, whose quiet dignity and forceful presence helped keep under control the clash of egos and words among the delegates.\n\n/Plain, Honest Men/ is a fascinating portrait of another time and place, a bold and unprecedented book about men, both grand and humble, who wrote a document that would live longer than they ever imagined. This is an indispensable work for our own time, in which debate about the Constitution's meaning still rages.\n\nBook written by Richard Beeman, audiobook performed by Michael Prichard.\nIncludes cover art.\n","torrent":{"xt":"urn:btih:730cd3f42b6327f3ad627f66726886a2bebca4cc","amp;dn":"Plain%2C+Honest+Men%3A+The+Making+of+The+American+Constitution","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"730cd3f42b6327f3ad627f66726886a2bebca4cc","infoHashBuffer":{"type":"Buffer","data":[115,12,211,244,43,99,39,243,173,98,127,102,114,104,134,162,190,188,164,204]},"announce":[],"urlList":[]}}