{"title":"Sothink Video Encoder For Adobe Flash v2.5.","uid":5075908,"size":17171413,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:738920a3ea0750edf9ae78d241b7a1a0fffca0be&amp;dn=Sothink+Video+Encoder+For+Adobe+Flash+v2.5.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"adjinpiva","files":3,"time":1251834294,"description":"Sothink Video Encoder for Adobe Flash Features:\n\nEasy and Powerful\n\n* Work as a wizard, and guide you to make conversion step by step.\n* Support almost all video formats including: avi, mpeg, mpg, mpe, dat, vob, wmv, asf, asx, mp4, mov, 3gp, 3g2, 3gpp, dv, qt, rm, rmvb, etc.\n* Can help you generate and customize a HTML page for the created SWF file.\n* Provide various pre-designed payback control skins for the SWF file.\n\nComprehensive Performance\n\n* Its conversion speed is much faster than other software.\n* You can get better quality Flash Videos using Sothink Video Encoder for Adobe Flash.\n* Create auto-sizing SWF player. The created Flash video player can auto-adapt to different video dimension.\nDemo &gt;&gt;\n* Provide different playback control styles (Full, Compact, Minimal) for different video dimension. And you can choose a color scheme you like for the playback control.\n* Provide you different pre-defined profiles for the conversion settings, which can make the created Flash Video suitable for different network band width.\n\nAdvanced Functions\n\n* Embedded FLV in SWF, or let the SWF player load external FLV file progressively.\n* Set the frame rate and key frame interval for the conversion.\n* Set a URL for the browser to visit when the Flash Video is clicked or the playback is finished\n* Help you generate and customize a HTML page for the SWF file.\n* Support loading external subtitles. For example, you can create Flash video from the video file which uses vsFilter to load external subtitle.\n* Use it with Sothink DVD Ripper, then you can convert a whole movie DVD into a Flash video.","torrent":{"xt":"urn:btih:738920a3ea0750edf9ae78d241b7a1a0fffca0be","amp;dn":"Sothink+Video+Encoder+For+Adobe+Flash+v2.5.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"738920a3ea0750edf9ae78d241b7a1a0fffca0be","infoHashBuffer":{"type":"Buffer","data":[115,137,32,163,234,7,80,237,249,174,120,210,65,183,161,160,255,252,160,190]},"announce":[],"urlList":[]}}