{"title":"Souvenir - The OMD Story DVD","uid":5093246,"size":4207052842,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7490891d8bae6e87b1a13b3086f37dc64bf70cf2&amp;dn=Souvenir+-+The+OMD+Story+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"white_arcades","files":14,"time":1253325060,"description":"Phew, this is my first big torrent, so please help to seed if you're downloading, my connection is a little slow.\n\nSo, what we have here is a fantastic documentary lasting just over one and a half hours, detailing the history of the iconic 80s synth act, OMD. This DVD was released in very limited quantities to fans which is why I'm uploading it here. The albums you should go out and buy!\n\nI know 80s legend John Hughes (RIP) had a soft spot for OMD, and the inclusion of their music in many of his movies meant the band were able to enjoy a degree of Stateside success they otherwise may not have had, but for me, they'll always be the band from my hometown who tuned these ears to electronic music from the earliest age.\n\nHaving heard the heartbreak in the soulful strains of 'Sealand' and ached in the sadness of &quot;Of All The Things We've Made&quot; i feel confident in saying that OMD were a truly special band who transended the genre they helped define. Their crowning achievement, the album &quot;Architecture &amp; Morality&quot; is a brooding piece of synthpop perfection and this DVD provides absolutely fascinating insight into how it was put together by the people involved. \n\n\nEnjoy!!\n\n","torrent":{"xt":"urn:btih:7490891d8bae6e87b1a13b3086f37dc64bf70cf2","amp;dn":"Souvenir+-+The+OMD+Story+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7490891d8bae6e87b1a13b3086f37dc64bf70cf2","infoHashBuffer":{"type":"Buffer","data":[116,144,137,29,139,174,110,135,177,161,59,48,134,243,125,198,75,247,12,242]},"announce":[],"urlList":[]}}