{"title":"Elastianet - S01 - Audio Comedy - MP3 - Slimoo","uid":5569411,"size":82124365,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:74af7ebca695a2fb68e41a8e0971ce4fed1326ce&amp;dn=Elastianet+-+S01+-+Audio+Comedy+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"_Slimoo_","files":6,"time":1274215763,"description":"Elastic Planet - Series 01 - Audio Comedy - BBC7 via DVB-T \n6 x 15 minute episodes - 128Kbps - Mp3 - Slimoo\n\n\n'Ours is an elastic planet. Things bounce. Things cohere. And things snap.'\n\n\n\nThe series was by Ben Moore and narrated by Oliver Postgate\n\n\nSix episodes were made and overall the show went down very well. This was mainly thanks to the wonderful narration by Oliver Postgate who made the utter nonsense written comprehensible and entertaining. \n\nBen Moore: Being a child at the time of Bagpuss, Ivor the Engine and Noggin the Nog, his is a voice I instantly trust. I could listen to him read bus timetables all day. Not that he would, I'm sure, but if he did, I would listen to him.\n\nElastic Planet is a very gentle show, nothing too challenging and fairly meandering in its style. \n\n--------------------------------------------------------------------------------\nEpisode 1 - THE BABIES\n\nTwo babies are born simultaneously in Northampton General Hospital on 8th July 1955 - Pamela Chetney a cheese sculptor and Genghis Trevelayan, a politician of Mongolian/Cornish descent - and we follow their intertwining lives through the following forty years.\n\nThe story involves dust factories, bad spelling rings, verb designing, knitting reform, and renumbering Britain's motorways.\n\nWith Miriam Margolyes, Gary Waldhorn, Michael Simkins, Dan Strauss, Kerry Shale, Alan Dedicoat, Hugh Scully and James Naughtie.\n-------------------------------------------------------------------------------\nEpisode 2 - THE TRAIN\n\nYou and five other passengers are sitting in a carriage on a train to Whittleble in 1947 - a child genius, a government minister, a man with the head of a fish, an opera singer and a chef. All their stories interrelate but none of them quite realise this before they leave the train.\n\nCursed Swedish operas, the elite Mime Squad from the Second World War, Methodist pirates and primitve restaurants all come into the tale.\n\nWith Miriam Margolyes, Dan Strauss, Michael Troughton, Neil Mullarkey, Ben Moor, Patrick Moore, Richard Baker and Sir Robert Stephens.\n--------------------------------------------------------------------------------\nEpisode 3 - THE SHAPE\n\nJohnny Ball on 'Think of a Number' draws an odd shape with four and a half equal sides on a blackboard. The show is 'lost' by the BBC and reporter Eric Poems follows the conspiracy that has suppressed the truth about the 'Ballagon' ever since.\n\nSpanning the sinking of the Titanic using artificial icebergs, Practical Home Voodoo magazine , drugged electricity, in-utero advertising and rearrangement engineering, the truth is a shocking one. . .\n\nWith Michael Troughton, Dan Strauss, Neil Mullarkey, Kerry Shale, Siriol Jenkins, Jamie Owen, Ben Moor, Johnny Ball and Henry Cooper.\n--------------------------------------------------------------------------------\nEpsiode 4 - THE LIFE\n\nFollowing the story of Hamilton Pramden, who was born literally with a silver spoon in his mouth, a whole range of facts about the natural world emerge. He translated the rude songs of birds into English in the Nineteenth century and we meet people developing sharper grass, hurdling cattle trainers and proponents of ant prisons. Along the way the beauty of nature is everywhere, from gong beetles to the carpenter elephants of Africa who toil in the elephants' lumberyard.\n\nWith Dan Strauss, Kerry Shale, Geoff McGivern, Fiona Allen, Ben Moor, Brian Hayes and Julian Pettifer.\n--------------------------------------------------------------------------------\nEpisode 5 - THE OBJECTS\n\nA chest washes ashore on an island in the Indian Ocean. What connects the objects within and what is the history of the man who owned them? And how does a piece of flamenco guitar music fit in?\n\nSiren writers, spoon designers, the tactical paint deposit, and the invention of washing up liquid all contribute to the strange tale. And the flamenco guitar music. . .?\n\nWith Rebecca Front, Geoff McGivern, Dan Strauss, Kerry Shale, Ben Moor, Caren Keating and Raymond Baxter.\n--------------------------------------------------------------------------------\nEpisode 6 - THE TRAVEL\n\nThe World Unfurled, a travel radio series presented by Warren Spurgeon is previewed in this story. We follow Spurgeon as he travels around this elastic planet and wonder just why he's doing it.\n\nHe visits the doubting monks of St Thomas the Disciple, the original location of the White Cliffs of Dover before they were brought to Britain as spoils of empire and Pennsylvania where too much gravity has been dug up along with the coal.\n\nWith Dan Strauss, Michael Troughton, Doon MacKichan, Kerry Shale, Alexander Armstrong and Ben Moor.\n--------------------------------------------------------------------------------\n\n\n\nElastic Planet - S01 - E01 - The Babies\nElastic Planet - S01 - E02 - The Train\nElastic Planet - S01 - E03 - The Shape\nElastic Planet - S01 - E04 - The Life\nElastic Planet - S01 - E05 - The Objects\nElastic Planet - S01 - E06 - The Travel\n\n\n\nAudio Format : MP3\nDuration : 14mn 1s\nBit rate mode : Constant\nBit rate : 128 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nResolution : 16 bits\n\n\n.\n[","torrent":{"xt":"urn:btih:74af7ebca695a2fb68e41a8e0971ce4fed1326ce","amp;dn":"Elastianet+-+S01+-+Audio+Comedy+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74af7ebca695a2fb68e41a8e0971ce4fed1326ce","infoHashBuffer":{"type":"Buffer","data":[116,175,126,188,166,149,162,251,104,228,26,142,9,113,206,79,237,19,38,206]},"announce":[],"urlList":[]}}