{"title":"Viv Thomas - Club Girls Hardcore 2 (2009)","uid":5095684,"size":745800572,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:74cc140c5a3d383e024c43bda5ec4c6af74ef0a9&amp;dn=Viv+Thomas+-+Club+Girls+Hardcore+2+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pure_screens","files":3,"time":1253546700,"description":"Club Girls Hardcore 2\n\n\n\nscreens (+ DVD-covers): &lt;a href=&quot;\nhttp://www.cmylink.com/ClubGirlsHardcore2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cmylink.com/ClubGirlsHardcore2&lt;/a&gt;\n\n\n\n\nThe girls return in Club Girls Hardcore 2 and they are still as stunning as ever! \nDebbie White and James  Brossman make a beautiful couple as they cavort on a king-sized bed. He slowly drives her insane with an expert tongue and probing fingers, before she feasts on his equally king-sized dick! James spears her perfect pussy and cute brown rosebud with his oversized shaft and, once she is on cloud nine, he unleashes a thick wad of warm juice onto his perfect fuck partner! \nSera is a young, fresh-faced cutie who opens herself up to Nick Lang. She closes her eyes as he gently suckles her small titties and edges his hand between her legs to deflower her soft wet folds. Sera straddles his upright cock, moaning with sheer desire as he plunders her hole! \nRoxy Rocket takes on Ricardo Bell in this continuing saga of hot love and even hotter desire. Roxy's slim figure is in contrast to Ricardo's muscled physique, but the two mould together perfectly as they make love with fevered passion. \nThe stunning Linda Shane entertainsbuff Coky Ice in the bedroom. She has a craving to taste his hardness before she feels him filling her up with his impressive cock! \nJasmine Rouge is eager to please - and Titus is the lucky man who gets her full attention. He laps at her sweet smelling pussy before she releases his manhood and sinks her pink lips around his shaft. Her trimmed pussy is an invitation that Titus cannot ignore and he is soon making her cry out for more as he pushes his big cock into her juiced-up hole. \nClub Girls Hardcore 2 is a concept in erotica that will turn you on and drive you wild with lust!  \n\n\nStarring:\nJasmine Rouge, Roxy Rocket, Sera, Nick Lang, Linda Shane, Debbi White\n\n\nStudio:          Viv Thomas\nReleased:        09/2009\nFormat:          Xvid\nLanguage:        English\n\n512 x 384\nXvid\n01:40:41\n\n\n3,500+ torrents: \n(ALWAYS with honest screens &amp; detailed info)\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/pure_screens&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pure_screens&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:74cc140c5a3d383e024c43bda5ec4c6af74ef0a9","amp;dn":"Viv+Thomas+-+Club+Girls+Hardcore+2+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74cc140c5a3d383e024c43bda5ec4c6af74ef0a9","infoHashBuffer":{"type":"Buffer","data":[116,204,20,12,90,61,56,62,2,76,67,189,165,236,76,106,247,78,240,169]},"announce":[],"urlList":[]}}