{"title":"Murderers' row -NTSC-Audio Eng+Subs Eng+Spa+Jap-F","uid":5068515,"size":4111560704,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:74cf6ab357ebf941ad08957cd8b33ec8cf8c6b1a&amp;dn=Murderers%5C%27+row+-NTSC-Audio+Eng%2BSubs+Eng%2BSpa%2BJap-F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kaminer","files":43,"time":1251216724,"description":"Murderers' row - 1966    &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0060728/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0060728/&lt;/a&gt;\n\nOriginal DVD full rip\nAudio - Eng\nSubs - Eng+Spa+Jap\nNTSC\nGenre: Comedy / Action\n\nThe handsome top agent Matt dies a tragic death in his bath tub - the women mourn about the loss. However it's just faked for his latest top-secret mission: He shall find Dr. Solaris, inventor of the Helium laser beam, powerful enough to destroy a whole continent. It seems Dr. Solaris has been kidnapped by a criminal organization. The trace leads to the Cote D'Azur... (imdb.com)\n\nMurderers' Row, the second of the Matt Helm films that starred Dean Martin has the distinction of being the one that actually gave old Dino a hit record. Martin never sang directly on the screen, but his voice was heard on the soundtrack during soliloquy sequences and in background music. I'm Not The Marrying Kind was the only written for a Matt Helm feature that he's heard singing over the action, especially during the final scene.\nFans of the books that James Bond and Matt Helm were taken from have always said that Hollywood ruined the character. It's probably more true for Matt Helm because Dino doesn't play it for anything other than laughs. James Bond would never talk about sexual escapades, but with Dino as Matt Helm, you know this is all locker room fodder.\nDr. Richard Eastham has invented a solar ray which evil master criminal Karl Malden wants to subvert for his own use. He's planning for a death ray to wipe out Washington, DC. Both Martin and Eastham's daughter Ann-Margret are searching for Eastham, reputed to be with Malden on his private island off the Riviera where with mistress Carmilla Sparv, Malden's planning all kinds of dastardly deeds.\nDino who also produced the Helm series, gave a guest shot to Dino, Desi, and Billy who were a bubblegum band sensation around that time.\nMalden looks like he's having a good old blast overacting outrageously as the master criminal. Dino as he is in all the Matt Helm is just Dean Martin as a secret agent. Just giving the public what they wanted at the time which was probably the height of his career.\nBut whatever you do, don't look at the title Murderers' Row and think it's about the 1927 New York Yankees. The sports are indoors in this film. (a reviewer at imdb.com)\n\nAmazing comedy full of hilarious 60's humor in a series of movies that proved the popularity of Martin already in his sixties but still a major sex symbol. A rare gem. More movies in the series to come soon.\n\n=================================================================================\n\nOn peut violer les lois sans qu'elles crient. (Talleyrand)\n\n=================================================================================\nIf anyone needs me to re-seed any of my old torrents - please leave a comment on my latest torrent. And remember: sharing is caring.","torrent":{"xt":"urn:btih:74cf6ab357ebf941ad08957cd8b33ec8cf8c6b1a","amp;dn":"Murderers%5C%27+row+-NTSC-Audio+Eng%2BSubs+Eng%2BSpa%2BJap-F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74cf6ab357ebf941ad08957cd8b33ec8cf8c6b1a","infoHashBuffer":{"type":"Buffer","data":[116,207,106,179,87,235,249,65,173,8,149,124,216,179,62,200,207,140,107,26]},"announce":[],"urlList":[]}}