{"title":"Coast to Coast AM - Sep 13 2009 - Minnesota Ghost Stories","uid":5099878,"size":56800478,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:74eebdb72e05d4e718a8a12ceb51e1f301122b68&amp;dn=Coast+to+Coast+AM+-+Sep+13+2009+-+Minnesota+Ghost+Stories&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"0vercast","files":4,"time":1253889133,"description":"Minnesota Ghost Stories\n\nDate: 09-13-09\nHost: Ian Punnett\nGuests: Michael Norman\n\nDuring the first half of the program, Ian Punnett welcomed author Michael Norman, who shared ghost stories from Minnesota. &quot;I really prefer to find first hand accounts from credible witnesses,&quot; the former journalism instructor said, &quot;in fact, if they're a little reluctant to tell me the story then that's even better.&quot; Norman shared tales from the &quot;Land of 10,000 Lakes&quot; that included a mysterious pair of shoes inside a museum that changed location overnight as well as a series of sightings in the Fitzgerald Theater, made famous by Minnesota native Garrison Keillor.\n\nNorman also reflected on what set the region's ghost stories apart from average tales of spirit encounters. He noted that people in the area tended to be &quot;a little more guarded&quot; and, when they do confide in others, the accounts take a more direct approach unlike the colorful campfire fare one would normally find in a ghost story. On the nature of the spirits witnessed, he observed that a recurring trend amongst the stories is that the ghosts often appear as three-dimensional beings rather than the traditional ethereal entity. It is only after the slightly askew encounter that the observer realizes &quot;this could not have been a real person.&quot; \nOne witness that Norman discussed was a woman, whom he called &quot;Sylvia,&quot; that has had so many strange experiences that she &quot;keeps lists of things that go on in the house.&quot; Over the years, he said, Sylvia has repeatedly seen the figure of a young girl dressed like someone from Little House on the Prairie. Perhaps the most unique encounter she had with the entity was on a bright Saturday morning when it suddenly skipped into her dining room. In the tale, the ghost child &quot;looks at her, smiles, turns away, and skips off into the kitchen.&quot; When Sylvia followed the little girl into the other room, she found that her visitor was &quot;nowhere to be seen.&quot;\n\nThe remainder of the program featured Open Lines and included a number of callers discussing the pros and cons of immunizations and one caller who had developed a growing fear of bed bugs based on last week's show. Another caller, Marty in Wisconsin, who put forward his theory that President Obama's campaign mantra of &quot;Yes, we can&quot; sounds like &quot;Thank you, Satan&quot; when played backwards. If true, Marty said, &quot;it's literally one of the largest spells, if you will, ever perpetrated on the human race.&quot;\n\nPreviously scheduled guest, Trevor Hobley, will be rescheduled for a future date.\n\nWebsite(s):\nmichaelnorman.us\n\nBook(s):\nThe Nearly Departed: Minnesota Ghost Stories and Legends\nHaunted Homeland\nHaunted Heritage\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224","torrent":{"xt":"urn:btih:74eebdb72e05d4e718a8a12ceb51e1f301122b68","amp;dn":"Coast+to+Coast+AM+-+Sep+13+2009+-+Minnesota+Ghost+Stories","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74eebdb72e05d4e718a8a12ceb51e1f301122b68","infoHashBuffer":{"type":"Buffer","data":[116,238,189,183,46,5,212,231,24,168,161,44,235,81,225,243,1,18,43,104]},"announce":[],"urlList":[]}}