{"title":"EYE OF THE PHOENIX - History of USA Part 3 [2009] - DivX","uid":5067438,"size":1712910834,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:753c1d296cb3caa5a4006077e78fec446f73de8d&amp;dn=EYE+OF+THE+PHOENIX+-+History+of+USA+Part+3+%5B2009%5D+-+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"verifire","files":-1,"time":1251078506,"description":"Hi there..\n\nThen it finally happened. TPB's trackers are down. But I've been anticipating something like this for a while. So for those who'll want to download torrents I've made and will make in the future, I'm moving nearly all of them to another torrent-site, maybe two. I guess it'll be at least:\n &lt;a href=&quot;\nhttp://www.torrentbox.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentbox.com&lt;/a&gt;\n\nJust browse for the torrents on that site, and all uploads will come up, just give me some days.. :-)\n\nAnd you can still start your download from this site!! Just add these trackers to the torrent, and we'll find each other again.\n &lt;a href=&quot;\nhttp://tracker.publicbt.com:80/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.publicbt.com:80/announce&lt;/a&gt;\n &lt;a href=&quot;\nhttp://tracker.torrentbox.com:2710/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.torrentbox.com:2710/announce&lt;/a&gt;\n \nNow don't click on the &quot;links&quot; above, that won't work. Copy and paste them to add them to your trackers in the torrent-file.\n\nAnd be sure to enable DHT. It tracks too..\n  \nAnyway, they should also all be available by search on my alias, verifire, on for instance: &lt;a href=&quot;\nhttp://www.isoHunt.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.isoHunt.com&lt;/a&gt;\n \n- because they search the contents and comments on the upload for tags as well as the title of the torrent.. Just give me some time..\n\nSee you later, when things are settled and (maybe) there's a working tracker on the site again, and I'll miss it terribly, but I hope for, and guess this isn't the last word on the matter. I'll upload stuff here anyway, as well as on the other sites...\n\nTPB WILL ALWAYS RULE!! THANK YOU, GUYS. YOU'VE BEEN A PLEASURE TO BE SHIPWRECKED WITH. IT'S AN HONOUR...\n\nVerifire.\n\n____________________________________________________________________________\n \nPlease; bear with me when I beg of you to leave this stuff seeding on your machine for the benefit of others, who just like you, would like to watch this stuff. My machine is being hindered by &quot;someone&quot; closing ports for me, so I have to monitor and change ports constantly, just so that YOU will get a copy.. Please help me. Thank you. Just be patient, and then, after a while seeding from more than just me, it'll be alive. IF you help keeping it alive of course.. Thank you.\n \nWell. This is the third part in the series of America's secret beginnings, and maybe the best of them all in a way, because it ties together all the background material from the previous two movies quite well with additional, up to date information. It's said to deal with the Dollar bill. On it is, amongst other, &quot;the seal of the USA&quot;, which is not really the seal of the USA at all, but the seal of another organization, formed back in 1776, on the 1st of May.\n \nNo, not on the American National day, the Fourth of July. The Fourth of July is actually the one day of the year when the &quot;dog-star&quot;, Sirius is in alignment with the sun as it rises in the east, in perfect line with (in turn) Robert F. Kennedy Stadium, Lincoln Park, Capitol Hill, The Washington Monument (the gigantic Obelisk), The Constitution Gardens (incidentally eye-shaped b.t.w.) and finally The Lincoln National Memorial, then comes the Boundary Channel.. Pretty impressive pathway, don't you think..?\n \nBut on the First day of May, which is probably the &quot;biggest&quot; Witch-sabbath of the year, the Illuminati was formally made &quot;official&quot;, and the organization's agenda was ready and was signed. Three thing were on that agenda, from what I know, and one of them is very simple: &quot;To take control of the world&quot;. It's their seal that has found it's way onto the Dollar bill somehow..\n \nThese are just a couple of hints of what the makers of these movies reveal in this series, and I more than suspect that the makers/financial supporters are members of certain secret societies, because now is the time to make known to the world what they've been lured into, and now are buying into. Or not. Cause you actually have a choice to make.\n \nPart 1: &quot;The New Atlantis&quot;, can be downloaded from here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5060188/THE_NEW_ATLANTIS_-_History_of_USA_Part_1_%5B2006%5D_-_DivX&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5060188/THE_NEW_ATLANTIS_-_History_of_USA_Part_1_%5B2006%5D_-_DivX&lt;/a&gt;\n \nAnd Part 2: &quot;Riddles In Stone&quot; from here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5060200/RIDDLES_IN_STONE_-_History_of_USA_Part_2_%5B2007%5D_-_DivX&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5060200/RIDDLES_IN_STONE_-_History_of_USA_Part_2_%5B2007%5D_-_DivX&lt;/a&gt;\n \nI do of course upload this material to make people, and Christians in particular, aware of how bad the situation is, and how true the words of the Bible are.\nIf you're feeling afraid or down after viewing these documentaries, I strongly suggest that you pray to Jesus and read your Bible. He'll come to your aid. After all; You are the reason He died on that cross - To save you.\nThe enemy roars and will try to overcome us by fear, but remember: Even if we have to fight fear and all other weapons thrown at us by standing firmly on the Word in faith, the old serpent is already defeated. Jesus did that when they nailed Him to that cross, and we are now admitted to partake in that victory.. Faith and trust and knowledge of the Words of the Bible and a disciple's fully pledged life is the key..\n\nHe'll be back to get those who await Him in the sky, eager to see Him, and those He'll gather unto Himself in the sky..\n\nBut before that, we must prepare ourselves. There are no need to be afraid, but we must be ready, come what may, until that day arrives. And that day will not come until there is a great apostasy and the man of sin is revealed.. But we've got eternal promises going for us if we don't succumb to his will and bidding, even if it results in death or prison. We'll be risen from the dead, all those who have not worshiped the Beast and have not taken the Mark.. Just read it for yourselves if you won't take my word for it. It's all in the Bible.. :-)\n\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;5e283b2c3738372c3b333f37321e39333f3732703d3133&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:753c1d296cb3caa5a4006077e78fec446f73de8d","amp;dn":"EYE+OF+THE+PHOENIX+-+History+of+USA+Part+3+%5B2009%5D+-+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"753c1d296cb3caa5a4006077e78fec446f73de8d","infoHashBuffer":{"type":"Buffer","data":[117,60,29,41,108,179,202,165,164,0,96,119,231,143,236,68,111,115,222,141]},"announce":[],"urlList":[]}}