{"title":"Muramasa The Demon Blade [USA][Wii][ojuegos.eu]","uid":5080418,"size":4621363083,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:7641247fc909ac048e7bb8e6f82ebb924822d9f5&amp;dn=Muramasa+The+Demon+Blade+%5BUSA%5D%5BWii%5D%5Bojuegos.eu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Morck22","files":95,"time":1252246596,"description":"A number of cursed blades exist throughout the world. Blades that thirst for\nblood the moment they're drawn. Even those blades thought to be holy slowly\nbecome corrupted over time as they are used in hatred and drenched in blood.\nThose who wield these blades slowly become homicidal. The curses laid on these\nblades are said to condemn those who use them to tragic and untimely deaths.\nIt is in the Genroki era, a period of time in which the shogun Tsumayoshi\nTokogawa reigned, that the force of the damned began to emerge, threatening\nthe peace and prosperity that had long existed in the world. The cursed blades\nbecame the focus of the greed, self-righteousness, and arrogance of those\nwho'd gain possession of them, and inevitably it was these conflicting desires\nthat led to war. As the flames of chaos and disaster spread, denizens from the\nnetherworld were dragged into the confusion as not only the evil spirits were\nsummoned by the swords, but the Dragon and Demon Gods as well. How will the\ndestinies of those drawn to these cursed blades unfold?\n\n   * From the subtle movements of a character's hair and clothes to their\n     explosive battle animations, every detail is expertly animated by hand\n     for amazing visuals that cannot be mimicked with 3D polygons\n   * Playing as a male ninja or female kunoichi, you have a wide variety of\n     ninja skills at your disposal as you progress through the levels in not\n     only side-scrolling fashion, but vertical progression elements as well\n   * Gameplay transitions seamlessly from player-controlled elements to story\n     sequences to keep the player engaged within the world\n   * Rather than the often told fables of Greek and Norse mythology, take an\n     adventure through less commercialized, but equally rich and mysterious,\n     Japanese mythology\n","torrent":{"xt":"urn:btih:7641247fc909ac048e7bb8e6f82ebb924822d9f5","amp;dn":"Muramasa+The+Demon+Blade+%5BUSA%5D%5BWii%5D%5Bojuegos.eu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7641247fc909ac048e7bb8e6f82ebb924822d9f5","infoHashBuffer":{"type":"Buffer","data":[118,65,36,127,201,9,172,4,142,123,184,230,248,46,187,146,72,34,217,245]},"announce":[],"urlList":[]}}