{"title":"012-Coast to Coast-Ian Punett and Dr.Louann Brizendine-4 Apr 10","uid":5506231,"size":111888851,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7648c83f1beca039fecf2fab5ebf6cbe7757bd2c&amp;dn=012-Coast+to+Coast-Ian+Punett+and+Dr.Louann+Brizendine-4+Apr+10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"panzerfaust69","files":1,"time":1271823521,"description":"Why Men Think &amp; Act Like They Do\nDate:04-03-10\n\nHost:Ian Punnett\n\nGuests:Dr. Louann Brizendine\n\nJoining Ian Punnett, neurobiologist and author Dr. Louann Brizendine shared her research into the male brain, and discussed why men think and act like they do. According to Brizendine, male embryos have female-type brain circuitry until testosterone production kicks in after the 8th week and changes the brain circuits into male. The hormone causes certain parts of the male brain, such as the area for sexual pursuit, to grow much larger than the corresponding region of the female brain, she added.\n\nBetween ages nine through fifteen male sexual circuits are being fueled by increasingly high levels of testosterone, Brizendine continued, noting how this makes it nearly impossible for them to stop thinking about sex. This is the period when future pedophiles develop their perverse sexual attraction to children as well, she suggested. Brizendine also commented on the male propensity to physical aggression -- 20-fold more than females.\n\nBrizendine talked about a possible genetic component involved in male fidelity. She cited research in which promiscuous meadow voles were made to behave like their monogamous cousins, prairie voles, simply by manipulating a single gene. The male brain can be rewired by exposure to pheromones too, Brizendine said. Pheromones given off by a man's pregnant mate will both lower his testosterone levels and increase his ability to hear a crying infant, she explained.\n\nThe last hour was devoted to Open Lines.\nWebsite(s):\n# louannbrizendine.com\nBook(s):\n# The Male Brain\n# The Female Brain\n","torrent":{"xt":"urn:btih:7648c83f1beca039fecf2fab5ebf6cbe7757bd2c","amp;dn":"012-Coast+to+Coast-Ian+Punett+and+Dr.Louann+Brizendine-4+Apr+10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7648c83f1beca039fecf2fab5ebf6cbe7757bd2c","infoHashBuffer":{"type":"Buffer","data":[118,72,200,63,27,236,160,57,254,207,47,171,94,191,108,190,119,87,189,44]},"announce":[],"urlList":[]}}