{"title":"Atmospheric Disturbances","uid":5035382,"size":221061038,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:76744952c5ac5aa6d7838c677bd0f1fd20d62558&amp;dn=Atmospheric+Disturbances&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"arzendiq","files":158,"time":1249089253,"description":"Atmospheric Disturbances\nby Rivka Galchen\n\nAtmospheric Disturbances takes place in the twilight zone of Leo Liebenstein's highly rational but utterly deluded mind. He's a middle-aged psychiatrist confounded by a strange problem: &quot;A woman entered my apartment who looked exactly like my wife,&quot; he tells us on the opening page. &quot;Same everything, but it wasn't Rema.&quot; This &quot;impostress&quot; or &quot;simulacrum,&quot; as he refers to her throughout the novel, looks exactly like his young wife, imitates her Argentine accent perfectly and possesses all her memories and attitudes. But he knows she isn't Rema. &quot;Something was extraordinarily wrong,&quot; he explains. &quot;It was just a feeling, that's how I knew.&quot; Because he loves her, &quot;obviously and entirely and singularly,&quot; he tells us, &quot;I had to go and search for the real Rema.&quot;\n\nThis sounds weird, of course, and it is -- deliciously so -- but on another level, it's common: After all, lots of people eventually conclude that their spouse isn't the person they once married. What husband, in a petty moment, hasn't shared Leo's cruel appraisal: &quot;It would seem Rema was being played by someone older, or who at least looked older. Someone pretty, but not as pretty.&quot; What Galchen has done is play out that sad realization in the mind of a psychotic psychiatrist, a man thoroughly versed in others' delusions but unable to perceive his own.\n\nThe result is a steady descent into madness confidently reinforced by the methods and language of science. There are a few diagrams, a formula now and then, and some references that will remind you of things you've forgotten from high school. In fact, if you plot Atmospheric Disturbances on a piece of graph paper -- the kind of pseudo-scientific approach Leo would recommend -- you'll notice a trend line running through recent novels such as Marisha Pessl's Special Topics in Calamity Physics and Samantha Hunt's  &lt;a href=&quot;http://thepiratebay.se/torrent/4787333/The_Invention_of_Everything_Else_-_Samantha_Hunt&quot;&gt;The Invention of Everything Else&lt;/a&gt;.  These brilliant young women infuse their stories with the language and tropes of scientific disciplines. They manage to appropriate the mystique of science, producing novels that seem somehow grounded in fundamental laws, even while satirizing the confident function that science plays in modern life.\n\nGalchen received a medical degree with an emphasis in psychiatry at Mount Sinai School of Medicine, a background that allows her to describe Leo's professional life as convincingly as she describes his descent into psychosis. Wandering around New York looking for his &quot;real&quot; wife, Leo challenges our objections in the most self-assured but absurd ways: &quot;Why should I believe, just by fiat, that this woman was Rema, when that ran contrary to the phenomenology?&quot; True to his academic training, he throws himself into systematic research with appropriate &quot;experimental controls.&quot; This amounts to sitting in the library and writing random words on notecards: &quot;HERONS,&quot; &quot;WOOL PROCESSING,&quot; &quot;HERMOCHROMATOSIS.&quot; Guffaw if you will, but he won't be dissuaded: &quot;The way I proceeded with my investigation might cause me to lose credibility before mediocre minds,&quot; he admits. &quot;I wasn't actually developing the detachment of a disordered psychotic -- I just wanted to concentrate, to stick to the business at hand.&quot;\n\nWhat remains so unsettling, and often funny, about Leo is the way his intelligent observations slip into looniness. This tendency is most dramatically on display during his psychological treatment of a young man with &quot;a fixed magical belief that he had special skills for controlling weather phenomena.&quot; In a misguided attempt to limit the man's dangerous behavior, Leo poses as a meteorologist -- Tzvi Gal-Chen, chosen at random from a list of leading scientists. This unorthodox technique appears to work at first, but very quickly Leo is caught in his patient's fantasy and becomes convinced that the real Gal-Chen must have something to do with the disappearance of his wife.\n\n7 houra, 40 minutes. Unabridged. 64 kbps mp3.","torrent":{"xt":"urn:btih:76744952c5ac5aa6d7838c677bd0f1fd20d62558","amp;dn":"Atmospheric+Disturbances","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76744952c5ac5aa6d7838c677bd0f1fd20d62558","infoHashBuffer":{"type":"Buffer","data":[118,116,73,82,197,172,90,166,215,131,140,103,123,208,241,253,32,214,37,88]},"announce":[],"urlList":[]}}