{"title":"Nuance Dragon Naturally Speaking v10.1 PREFERRED","uid":5666077,"size":1385310979,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:76bce3a45a5b594bb7cc52b13ceab32212d8ea87&amp;dn=Nuance+Dragon+Naturally+Speaking+v10.1+PREFERRED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxOrestxxx","files":1,"time":1278148910,"description":"Dragon Naturally Speaking 10.1 Preferred 32/64\n \nI load and test all my softwareWorking \n\nAdvanced features for small business users or PC enthusiasts \nAll of the features of the Standard edition PLUS \nCreate time-saving shortcuts with simple voice commands \nControl virtually every Windows application on your PC by voice \nUse with Nuance-approved Blutooth headsets, handheld recorders or Pocket PC's \nOpen and close applications, even control the mouse and the entire desktop-all by speaking \n\nDragon NaturallySpeaking 10 - Turn Talk into Type \nMost people speak over 120 words per minute but type less than 40 words per minute. What if you could create email, documents and spreadsheets simply by speaking? What if you could control your PC just by talking to it, starting programs, using menus, surfing the web?\n\n\n(The Installation directions are included in the torrent) \n\n\n1) Disconnect from the network/internet \n\n2) Explore/open disk and copy the folder &quot;Key-Act&quot; to your desktop.\n \n3) Open the folder and minimize, you will use the folder thru out the installation process\n \n4) Install using the supplied KeyMaker,inside the folder called &quot;Key-Act&quot;. \n(Keep the keygen open during the whole install process) \nOpen KeyGen,at the top is a drop down arrow. Select Nuance Dragon Naturally Speaking v10.x \n\n5) Hit generate Serial \nEnter serial and click next \nClick install\n \n!! DO NOT HAVE ANY PART OF THE PROGRAM RUNNING DURING THE REGISTER.BAT OPTION !! \n\n6) Close Register Today, do not activate, Uncheck, check for updates \n\n7) Inside the &quot;Key-Act&quot; folder you will find register.bat \nCopy/paste register.bat to your installation folder most often it will be in C:Program FilesNuanceNaturallySpeaking10Program \nor w/e you installed the program \n\n8)Double click register.bat \nA CMD window will open as will another box called &quot;Enter key&quot; \n\n9) Take the Hardware ID, from the &quot;Enter key&quot; box, and Paste it into the keygen under Hardware ID \n\nFor the serial number you will need to hand type the serial number, from the Key Gen, into the serial number field on the &quot;Enter key&quot; box. \nIf you try to copy paste it will always fill in the key box for some reason. \n\n10) Use the KeyMaker to generate a valid Authentication Code, click generate a authentication code, \ncopy that long number into the &quot;Enter key&quot; box in the key section. \n\nYou may have to enter a new Authentication Code a few times, all along keeping the same serial number. I had to do it 5 times ","torrent":{"xt":"urn:btih:76bce3a45a5b594bb7cc52b13ceab32212d8ea87","amp;dn":"Nuance+Dragon+Naturally+Speaking+v10.1+PREFERRED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76bce3a45a5b594bb7cc52b13ceab32212d8ea87","infoHashBuffer":{"type":"Buffer","data":[118,188,227,164,90,91,89,75,183,204,82,177,60,234,179,34,18,216,234,135]},"announce":[],"urlList":[]}}