{"title":"Coast to Coast AM July 31st 2009 - Maitreya Update &amp; Open Lines","uid":5037233,"size":55279703,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7722c584aa6fde9157ad446fff6d2133ea745fe3&amp;dn=Coast+to+Coast+AM+July+31st+2009+-+Maitreya+Update+%26+Open+Lines&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jeffchil","files":6,"time":1249178431,"description":"Maitreya Update &amp; Open Lines\n\nDate:\n07-31-09\n\nHost:\nGeorge Noory\n\nGuests:\nOpen Lines, Benjamin Creme\n\nBenjamin Creme, the official spokesperson for the &quot;world teacher&quot; Maitreya, appeared in the first hour of the program to provide an update on the alleged spiritual leader's &quot;imminent&quot; arrival. Creme proclaimed that Maitreya will make himself known to the world &quot;anytime in the immediate future.&quot; He also noted that interest in the Maitreya story is growing, particularly in Japan, where two thousand people attended Creme's lecture in Tokyo this past May.\n\nCreme asserted that Maitreya is preparing the world for his arrival with &quot;a whole series of extraordinary signs, miracle happenings by the score.&quot; He claimed that the latest such sign is a set of four spaceships hovering over the Earth that appear to be stars. According to Creme, each of the ships are &quot;about the size of five football fields put together&quot; and derive energy from the sun in order to appear as if they are stars to those observing on Earth. He declared that these ships are fulfilling a similar role as the Star of Bethlehem, which he also said was a spacecraft.\n\nOpen Lines\n\nDuring Open Lines, topics included a man's encounter with an aggressive shadow person as well as a theory on how advancing the human lifespan may affect our culture. One particularly remarkable story came from Tyler, who recounted speeding down a road on a foggy night and seeing two seven-foot-tall, glowing figures hovering above the ground. The entities lunged at him as he approached, so he swerved to the opposite side of the road and slowed down. As he passed where the entities were, he saw two children standing in the road. He mused, &quot;I would have smashed right into them,&quot; if not for the intervention of those glowing figures.\n\n&quot;A dream saved my life,&quot; declared Roger in California, who shared his eerie tale of cheating death. In this dream, he explained, someone pulled a gun on him and a woman yelled &quot;never stand in front of a loaded gun,&quot; so he jumped out of the way, heard a shot fire, and woke up. Later, when this same scenario took place in his real life, he recalled the advice from his dream and leaped out of the way at the last moment. When the police found him hiding an hour later, they were stunned to see him unharmed, since the gunman had fired directly at him and they were sure he'd been shot and crawled off to die.\n\nThe final half hour of the show featured a portion of George's interview with Dr. Larry Dossey on premonitions from the 5.13.2009 edition of Coast. ","torrent":{"xt":"urn:btih:7722c584aa6fde9157ad446fff6d2133ea745fe3","amp;dn":"Coast+to+Coast+AM+July+31st+2009+-+Maitreya+Update+%26+Open+Lines","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7722c584aa6fde9157ad446fff6d2133ea745fe3","infoHashBuffer":{"type":"Buffer","data":[119,34,197,132,170,111,222,145,87,173,68,111,255,109,33,51,234,116,95,227]},"announce":[],"urlList":[]}}