{"title":"DVD KidsCrew Disney/Pixar Deel 7 (disney) (dutch) 2Lions-Team","uid":5040029,"size":4322072964,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7779ede9a1a8fbaa42a1457d2af2ddce3b9a35e0&amp;dn=DVD+KidsCrew+Disney%2FPixar+Deel+7+%28disney%29+%28dutch%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pioen","files":-1,"time":1249328039,"description":"DVD KidsCrew Disney/Pixar Deel 7 - 9\n\nCars\n\n\nVerenigde Staten\nAnimatie / Familie\n116 minuten\n\ngeregisseerd door John Lasseter\nmet de stemmen van Owen Wilson, Paul Newman en Bonnie Hunt\n\nLightning McQueen is een ambitieuze nieuweling in de racewereld die onderweg is naar de finale\nvan de Pistons Cup in California. Wanneer hij onverwachts een omweg moet maken door het slaperige\nRoute 66 stadje: Radiator Springs, ontdekt hij dat het leven niet om de finishlijn gaat maar om de\nreis. Onderweg leert hij ongewone karakters kennen; Sally, een chique Porsche uit 2002, Doc Hudson\n(een Hudson Hornet uit 1951 met een mysterieus verleden) en Mater, een roestige maar betrouwbare\nsleepwagen. Zij helpen Lighting McQueen te realiseren dat er belangrijkere dingen in het leven zijn\ndan prijzen, reputatie, roem en sponsors.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/23133&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/23133&lt;/a&gt;\n\n\nChicken Little\n\nVerenigde Staten\nAnimatie / Familie\n77 minuten\n\ngeregisseerd door Mark Dindal\nmet de stemmen van Zach Braff, Joan Cusack en Katie Finneran\n\nIn een wereld vol pratende dieren leeft ook &quot;Chicken Little&quot;. Nadat hij bijna z'n stad vernietigt met\neen vals alarm, wordt hij door de gehele bevolking met de nek aangekeken. Totdat de Aarde daadwerkelijk\nwordt overvallen door een invasie van buitenaardse wezens en het aan de kleine kip en zijn vriendjes is\nom deze te redden...\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/19982&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/19982&lt;/a&gt;\n\nRobin Hood\n\nVerenigde Staten\nAnimatie / Avontuur\n83 minuten\n\ngeregisseerd door Wolfgang Reitherman\nmet de stemmen van Brian Bedford, Peter Ustinov en Phil Harris\n\nDe film vertelt de legende van Robin Hood met dieren als personages. Robin Hood is een outlaw die een\nbende start in Sherwood Forest. Hij wil het onrecht van de plaatselijk Sheriff bestrijden, die de bevol-\nking grote bedragen belasting laat betalen.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/1594&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/1594&lt;/a&gt;\n\n\nTarzan\n\n\nVerenigde Staten\nAnimatie / Avontuur\n88 minuten\n\ngeregisseerd door Chris Buck en Kevin Lima\nmet de stemmen van Tony Goldwyn, Minnie Driver en Glenn Close\n\nDiep in de Afrikaanse jungle geeft een gorillamoeder een achtergelaten baby de naam Tarzan en neemt hem\naan als haar eigen zoon, ook al schuwt de leider, de zilverrug Kerchak, dit onbehaarde wonder. Tarzan\ngroeit op met zijn bijdehante apevriendje Terk en zijn neurotische kameraad, de olifant Tantor. Zo ont-\nwikkelt hij alle instincten van een dier en leert hij alles over de jungle, terwijl hij razendsnel door\nde bomen zweeft en zwaait. Maar als plotseling zijn soortgenoten verschijnen, waaronder de beeldschone\nJane, staan twee werelden op het punt een te worden.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/9&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/9&lt;/a&gt;\n\n\nAtlantis\n\n\nVerenigde Staten\nAnimatie\n95 minuten\n\ngeregisseerd door Gary Trousdale en Kirk Wise\nmet de stemmen van Michael J. Fox, James Garner en Leonard Nimoy\n\n1914: Milo Tatch denkt dat hij de locatie heeft gevonden van het legandarische Verloren Continent.\nEen excentrieke miljonair geeft Milo een crew zodat hij zijn theorie kan testen. Wanneer ze Atlantis\nvinden blijkt dat de cultuur langzaam uitsterft omdat de bewoners hun oude geschriften, waarin hun\nmysterieuze krachtbron wordt beschreven, niet meer kunnen lezen. De nieuwste Disney, die dit keer\nwat serieuzer is dan normaal.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/693&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/693&lt;/a&gt;\n\n\nCategorie : Beeld\nFormaat : DVD5\nBron : Retail\nOndertitels : Geen\nGenre : Animatie\n\n\nAlle films zijn van sublieme kwalteit en hebben allen Nederlandse audio.\n\nIn deze fantastische collectie zijn de volgende films megenomen:\n\nAssepoester, Finding Nemo, Pinokkio, Sneeuwwitje, Brother Bear, Bambi, Pocahontas, De reddertjes, De Kleine Zeemeermin, Lion King, Belle en het Beest, De Klokkenluider van de Notre Dame, Mulan, Hercules, The Incredibles, Dombo, Fantasia, Peter Pan, Piratenplaneet, Taran en de Toverketel, 101 Dalmatiers, Aladin, Frank en Frey, Ichabod en Meneer Pad, Paniek op de Prairie, Dinosaur, Pooh's Lolifanten Film, Monster en Co, Lady en de Vagebond, Vrij en Vrolijk, Cars, Chicken Little, Robin Hood, Tarzan, Atlantis, Bee Movie, Jungle Boek, Toy Story, Meet the Robinsons, Teigetjes Film, Fantasia 2000, Een Luizenleven, Keizer Kuzco, Ratatouille, The Wild\n\nThanks : Coolkidweb\n\n*****************************************\n\nBrought to you by\nPioen\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum\n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n\n******************************************","torrent":{"xt":"urn:btih:7779ede9a1a8fbaa42a1457d2af2ddce3b9a35e0","amp;dn":"DVD+KidsCrew+Disney%2FPixar+Deel+7+%28disney%29+%28dutch%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7779ede9a1a8fbaa42a1457d2af2ddce3b9a35e0","infoHashBuffer":{"type":"Buffer","data":[119,121,237,233,161,168,251,170,66,161,69,125,42,242,221,206,59,154,53,224]},"announce":[],"urlList":[]}}