{"title":"Movie Label 2010 v5.1.1.964 -iNV [mattlb0619]","uid":5023482,"size":25467135,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:77b024f4ebf7fc07c89ae83ebf2fec57592a6686&amp;dn=Movie+Label+2010+v5.1.1.964+-iNV+%5Bmattlb0619%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mattlb0619","files":5,"time":1248583415,"description":"Movie Label 2010\n-Rediscover Your Movie Collection\n\nOfficial Webpage: http://www.codeaero.com/movie-label/\n\n\nDo you have a collection of movies and look for the most efficient way to manage it?\nLook no further.. Movie Label 2010 is the answer to your problems. \n\nWhat can Movie Label do for you ?\n\n    * Get your whole collection organized in no time. Simply type titles or scan barcodes and all information about your movies and TV-series is automatically downloaded.\n    * Find those golden oldies with the powerful yet easy-to-use search engine.\n    * Save money by not purchasing duplicate movies and by keeping track of DVDs on loan.\n    * Get the full picture of your collection with statistics and reports.\n    * Catalog any kind of media ranging from DVD and Blu-ray to Divx movies on your hard drive, or even VHS if you still have those. You can even add your own media types, making Movie Label future proof.\n    * See your collection with whole new eyes and learn new things about your movies by reading the downloaded trivia.\n    * Export your collection and save it on your mobile device to carry it along at all times. Movie Label exports to a variety of formats.\n\nWhat information is downloaded ?\n\nThe following info is downloaded when available:\n\n    * Media: Cover Art, Trailer link\n    * Lists: Cast, Crew, Genres, Audio Formats, Languages, Subtitles, Aspect Ratios, TV-series episodes (including plot etc for each episode)\n    * Info: Title, Original Title, Plot, Tagline, Studio, Release Date, Certification, Country, Rating, Trivia (fun facts), etc..\n    * The above and more is downloaded. Apart from the downloaded information you can add a lot of info: Last Watched, Special Features, Rating, Price,       Location, Website, etc..\n\nQuick Facts\n\n    * Quickly get your movie library organized by typing the title or barcode.\n    * Catalog any type of media (DVD, Blu-ray, VHS, LD, Divx, etc).\n    * Scan your hard drive to find movie files and add them to your collection.\n    * Keep track of movies on loan with the built-in loan manager.\n    * Search and sort your collection with one click.\n    * Print reports and watch a variety of statistics.\n    * Export to various formats (HTML, XML, PDF, Excel, etc)\n    * Keep a list of wanted and ordered items.\n    * Create any number of databases of any size.\n\n\n\nTestimonials\n\n&quot;Just wanted to tell you that I am always excited to get home to Movie Label when new DVD films arrive in my mailbox. I actually learn a lot reading the information downloaded for each movie! It's also nice to watch my collection growing in the graphs :) Letting friends browse the collection for movies to watch\n is also fantastic! Thank you.&quot;\n\nKen Lowe\nMiami, FL\n\n\n&quot;Perfecto!! I can now show my friends the width of my collection and I can a list of them borrowing my DVD. I also know now when I last watched a movie. And the trivia while downloading is genius! Last thing: The support you have given me has always been quick and on target. Nice weekend to you and you may quote me on this.&quot;\n\nJ. Pablo\nSpain\n\n\n\n* *  ** Installation **  * *\n\n1. Install with 'mol2010_setup.exe'.\n2. Copy crack from 'crackMovieLabel.exe' to install\n   directory and overwrite. (ie. 'C:Program FilesMovie Label 2010')\n3. Enjoy and seed!\n\nNote: Was found to be clean with both NOD32 and KAV. I dont care if you found malware with anything else.\n\n-mattlb0619","torrent":{"xt":"urn:btih:77b024f4ebf7fc07c89ae83ebf2fec57592a6686","amp;dn":"Movie+Label+2010+v5.1.1.964+-iNV+%5Bmattlb0619%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77b024f4ebf7fc07c89ae83ebf2fec57592a6686","infoHashBuffer":{"type":"Buffer","data":[119,176,36,244,235,247,252,7,200,154,232,62,191,47,236,87,89,42,102,134]},"announce":[],"urlList":[]}}