{"title":"Flyleaf - Red Sam (Acoustic)  (2nafish)","uid":5580096,"size":119289860,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:77b62047d0cc4310f1f35a182f3f5c537bca06ae&amp;dn=Flyleaf+-+Red+Sam+%28Acoustic%29++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1274509164,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nFlyleaf is the Texas alternative metal band Flyleaf's debut full-length album. It was released on October 4, 2005, debuting at #88 on the Billboard 200.\n\nThe album was released on October 4, 2005. On October 30, 2007, the band re-released this album repackaged as a CD/DVD version. The album has the same tracks on it, but acoustic versions of &quot;Cassie&quot;, &quot;Fully Alive&quot;, &quot;I'm So Sick&quot; and more. The DVD has exclusive interviews with Flyleaf and music videos of &quot;All Around Me&quot;, &quot;I'm So Sick&quot; and &quot;Fully Alive&quot;. It also came with a free ringtone of &quot;All Around Me&quot; and a locker poster. The album was re-released in the UK on January 14, 2008, with only 3 additional acoustic tracks on the CD. For this release, the album was released on Polydor which is a Major Record Label in the UK.\n\nWhen A&amp;M teamed up with Octone records, the album was re-printed to show the new label. This version had Fully Alive at a length of 2:34 replacing the 2:48 version, and a different back artwork.\n\nThe album was hugely publicised on the website Purevolume. &quot;I'm So Sick&quot; appears in the game Rock Band, and &quot;Perfect&quot; appears on in the PC/Mac video game Guitar Praise. According to Rolling Stone Magazine, the band along with Paramore, are the 2008 breakout bands.\n\nFlyleaf sold over 13,000 copies of the Special Edition CD/DVD in the first week. They jumped 59 spots on the Billboard Top 200 chart up to #62. In the second week of sales for the Special Edition CD/DVD, Flyleaf  sold over 10,100 copies. To date, it has sold over 1,000,000 copies in the U.S. certifying it as platinum.\n\nAccording to Billboard, the album was the 9th best selling Christian album between the years 2000 and 2009.\n\nFlyleaf is an American rock  band, formed in the Belton and Temple, Texas regions in 2000. They performed around the United States in 2003 until releasing their eponymous debut album, Flyleaf, in 2005. The album went platinum after selling more than one million copies. The band won an online poll on yahoo.com and was named Yahoo!'s Who's Next band of the month in March 2006 and they were named MTV's artist of the week on December 24, 2007. Flyleaf released their second album Memento Mori on November 10, 2009 debuting #8 on the Billboard charts.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:77b62047d0cc4310f1f35a182f3f5c537bca06ae","amp;dn":"Flyleaf+-+Red+Sam+%28Acoustic%29++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77b62047d0cc4310f1f35a182f3f5c537bca06ae","infoHashBuffer":{"type":"Buffer","data":[119,182,32,71,208,204,67,16,241,243,90,24,47,63,92,83,123,202,6,174]},"announce":[],"urlList":[]}}