{"title":"Battlefield 2 Total War Realism Mod v3.0","uid":5073476,"size":1490001074,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:77b6329bd8c10ac1a17d16d84799ce36ac6ae65c&amp;dn=Battlefield+2+Total+War+Realism+Mod+v3.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Greensauce","files":1,"time":1251604058,"description":"This mod was made by sw33tspot I take no credit for mod. You need to have a copy of Battlefield 2 to play this mod, it is single player only.\n\nPer the developer:\n\nPrepare to be engaged in Full Single Player Realistic Combat. Mod is for Single Player only. Mod is made to make the game extremely realistic, also has blood. Also its awesome!\n\n\nhere is a changelog:\n\nV 1.0\n---------------------------------------------------------------\n\nFirst release, Some kit modifications etc..\n\nDamage and Recoil Tweaks for all Weps\n\nBlood Puffs\n\nRotating Maplist\n\nCustom Real Weapon Sounds\n\n\n\n\nV 2.0\n----------------------------------------------------------------\n\nFixed Profile Overwriting Bug, now installer will create new profile named &quot;BF2TotalWarPlayer1&quot; for Full Experience\n\nTweaked LMG Recoil. they now are deadly just like in real life.\n\nTweaked Ammo Loadouts, (GL no longer has 12 203's + More)\n\nMade all rockets More Deadly, (a rocket can take out a APC 1 hit, and a Chopper 2 hits) for realistic purposes. Rockets also take down infantry now.\n\nSniper Rifles are more Accurate now, and M82A1 Is VERY accurate and has a longer hit range, can also damage/take down light armor, helos, and aircraft with the appropriate amount of shots.\n\nAdjusted Zoom properties on M82A1 and other Sniper Rifles, m82 has a much better scope zoom now, other was too much zoom.\n\nAdjusted Ticket Ratio so Rounds dont last so long.\n\nAdjusted view distance on some maps for Long-Range-Sniping.\n\nIncluded a Bot Changer if 64 Per team was too much for you, or your comp. also has a difficulty slider.\n\nTweaked alot of weapons Accuracy, They are much more Accurate now.\n\nChina SpecOps no longer has ****ty type 95 spec ops gun, they now get G36C.\n\n\nV 3.0\n-------------------------------------------------------------- \nadded a ton of more new maps for SP.\n\nfixed pistol damage so their deadly now, no more 6 shot kills with pistol.\n\ninstead of Bizon AT wep MEC now gets AK101.\n\nAdded Smoke grenades to assault and support classes.\n\nTweaked Support Ammo kit number, now instead of 10 boxes of ammo there is only 2 for more realistic purposes.\n\nMade all original maps thier largest size (except Dragon Valley, wouldnt work), \n64 Size original maps now for &quot;total war&quot;  ! Be sure to Adjust your Bot Slider to ALOT of bots for these huge maps! hopefully your comp can run it!\n\nAdded a Anti-Personell .50 Cal rifle to US Snipers loadout, antitank rifle was kind of silly for hitting people with, but now he has both.\n\nAdded PKM to MEC Support Class Loudout.\n\nReplaced China Ak-47 Medic Gun with G36e.\n\nEdited the medkits to heal a less rapidly for a more realistic effect.\n\nEdited the Ammo kits to not replinish, they only get 2 ammo kits now, make them last.\n\nGreatly Increased .50 Cal AT M82A1's damage against helicopters/jets and other small vehicles. (for christ sake its an exploding round!)\n\nGreatly tweaked the damage on the weapons, now they will most always be a 2 shot kill, or when placed right 1 shot\n(AK is still slightly more powerful than the M16, LMG's are more powerful than both of these).\n\nHad to take out the Rotating Maplist, for some reason its not compatible with the new 64 size maps. \nBut, I did edit the map tickets to be larger (600) for large scale longer single battles.\n\n----------------------------------------------------------------------------------\n\nVersion 4.0 is currently being worked on with these fixes/changes:\n\nV 4.0\n-----------------------------------------------------------\n\nMade Opposing AI (MEC/China) better AI strategies, which means they are on the same pace with USMC. (Smarter AI)\n\nAdded 1 more smoke grenade to smoke grenade loadout.\n\nLowered ak74u and ak47 recoil just a tid bit. Before recoil was so much you\ncould not hit anything on full auto..\n\nAdjusted Scar-L recoil to be a bit higher, before it was hardly no recoil, China G-Series rifles still have little recoil.\n\nMade all rifle ammo loadouts the standard rifle loadout for infantry (6 clips of 30) what effected this was the M4","torrent":{"xt":"urn:btih:77b6329bd8c10ac1a17d16d84799ce36ac6ae65c","amp;dn":"Battlefield+2+Total+War+Realism+Mod+v3.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77b6329bd8c10ac1a17d16d84799ce36ac6ae65c","infoHashBuffer":{"type":"Buffer","data":[119,182,50,155,216,193,10,193,161,125,22,216,71,153,206,54,172,106,230,92]},"announce":[],"urlList":[]}}