{"title":"Paramore - Ignorance","uid":5109350,"size":133314564,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:77cd78c3f1cdc54b48eb5597ac4ea417e2cf54f0&amp;dn=Paramore+-+Ignorance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1254644673,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Ignorance&quot; is the first single from Paramore's third album, Brand New Eyes. It is Paramore's eighth US single and ninth UK single. The song was made available for digital download on July 7, 2009, but was shown on paramore.net the day before. &quot;Ignorance&quot; is the band's highest peaking single in the UK at Number 14#.\n\nThe music video was filmed on July 23rd, 2009 and directed by Honey. It was released to the public Thursday, August 13th, 2009 at 7:00 AM on AMTV, as well as all MTV platforms, networks, and websites. The full video leaked at midnight on August 13th, 2009. The video shows Williams being singled out and ignored by the other members of the band. She shines a light bulb directly in their faces, whilst describing how they ignore her and treat her like just another stranger in the lyrics. The cramped and bare setting emphasises the inescapable, rising tensions between the band members. The video cuts between the band performing in a cramped little room, a larger performance area and Williams being laid bare in white clothes, hair pulled back etc. The video ends with the other members of the band being able to wrap the light bulb wire around Williams, possibly showing how the spotlight is only on her and never on the other band members.\n\nHitFix gave the song a positive review, saying &quot;While &quot;Ignorance&quot; breaks no new ground for Paramore, the performance shows an increased level of confidence&quot; and ending with &quot;older Paramore fans will be happy to hear the Evanescence influence seems to be gone&quot;.\n\nBrand New Eyes (Typeset 'brand new eyes') is the third studio album by American rock band Paramore, released through Fueled by Ramen on September 29, 2009 in the United States and Canada. The album was produced by Rob Cavallo and recorded in Hidden Hills, California from January to March, 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:77cd78c3f1cdc54b48eb5597ac4ea417e2cf54f0","amp;dn":"Paramore+-+Ignorance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77cd78c3f1cdc54b48eb5597ac4ea417e2cf54f0","infoHashBuffer":{"type":"Buffer","data":[119,205,120,195,241,205,197,75,72,235,85,151,172,78,164,23,226,207,84,240]},"announce":[],"urlList":[]}}