{"title":"V.A. - Napoleon Complex (They're Coming To Take Me Away, Ha-H","uid":5578818,"size":93741642,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:78c18bad48a89c8e0e99fd18cb91f24e2746c404&amp;dn=V.A.+-+Napoleon+Complex+%28They%5C%27re+Coming+To+Take+Me+Away%2C+Ha-H&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Iron_Horse","files":25,"time":1274465451,"description":"V.A. - Napoleon Complex (They're Coming To Take Me Away, Ha-Haaa!)\nCD (1998) To MP3 192 Kbit/s.\nIncluded CD Covers &amp; This Info.\n\nReview  by Jason Ankeny  allmusic.com\nFew novelty records are as bizarre or downright annoying as Napoleon XIV's 1966 smash &quot;They're Coming to Take Me Away, Ha-Haaa!&quot; A music-free hit detailing its narrator's trip to the loony bin, it delivers the kind of cringe-worthy forced frivolity that gives strange and unusual music a bad name. Remarkably, the song also generated a staggering number of answer records, 20 of which are compiled on the excruciating but well-executed Napoleon Complex. Efforts like Josephine XV's &quot;I'm Happy They Took You Away, Ha-Haaa!&quot; and Henry the IX's &quot;Don't Take Me Back, Oh-Nooo!&quot; virtually write themselves, and indeed, this is paint-by-numbers stuff. Marginally more interesting are the foreign-language versions, including renditions in German, Spanish, Italian and Dutch. And of course, no bandwagon would be complete without Kim Fowley, who contributes his own cover of the original. Painful listening, although your mileage may vary. \n\nTracklist:\n01. Napoleon XIV - They're Coming To Take Me Away, Ha-Haaa!  (1966)\n02. Josephine XV - I'm Happy They Took You Away, Ha-Haaa!  (1966)\n03. Henry The IX - Don't Take Me Back, Oh-Nooo!  (?)\n04. The Emperor -  I'm Normal  (1966)\n05. Napoleon XIV - The Place Where The Nuts Hunt The Squirrels  (?)\n06. Malepartus II - Ich Glaub' Die Hole' Mich Ab  (1966)\n07. Josephine XIII - Down On The Funny Farm (Oy Vey)  (1966)\n08. Napoleon Puppy - Ellos Me Quieren Lievar  (?)\n09. Floris VI - Ze Nemen Me Eindelijk Mee Ha-Haa!  (1966)\n10. Kim Fowley - They're Coming To Take Me Away, Ha-Haaa!  (1966)\n11. Rose Brooks - They're Coming To Take Me Away, Ha-Haaa!  (1967)\n12. Teddy &amp; Darryl - They Took You Away, I'm Glad I'm Glad  (1966)\n13. I Balordi -  Venqono A Portarci Via Ah, Aah!  (1966)\n14. Los Ovnis -  Napoleon XIV  (?)\n15. Hugo De Groot - Ze Nemen Me Eindelijk Mee Haha  (1966)\n16. Napoleon XIV - They're Coming To Get Me Again, Ha-Haaa!  (?)\n17. Mad Dog Society - They're Coming To Take Me Away, Ha-Haaa!  (?)\n18. Inhuman Orchestra - They're Coming To Take Me Away, Ha-Haaa!  (?)\n19. Snopek &amp; The Unexploded Bomb - They're Coming To Take Me Away, Ha-Haaa!  (?)\n20. Lard - They're Coming To Take Me Away, Ha-Haaa!  (1996)\n21. Napoleon XIV - !aaaH-aH ,yawA eM ekaT oT gnimoC er'yehT","torrent":{"xt":"urn:btih:78c18bad48a89c8e0e99fd18cb91f24e2746c404","amp;dn":"V.A.+-+Napoleon+Complex+%28They%5C%27re+Coming+To+Take+Me+Away%2C+Ha-H","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78c18bad48a89c8e0e99fd18cb91f24e2746c404","infoHashBuffer":{"type":"Buffer","data":[120,193,139,173,72,168,156,142,14,153,253,24,203,145,242,78,39,70,196,4]},"announce":[],"urlList":[]}}