{"title":"uTorrent 1.8.5 RC1 (build 16977)","uid":5133222,"size":289584,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:795ac0b56716b1d441ccaf573ded2f87aa05ed43&amp;dn=uTorrent+1.8.5+RC1+%28build+16977%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"olofolleola4","files":-1,"time":1256310915,"description":"Copied from Ã‚ÂµTorrent Homepage:\n\n\nWhat Is Ã‚ÂµTorrent?\n\n\nMicro-Sized Yet Feature Filled\n\nÃ‚ÂµTorrent is the world's most popular BitTorrent client.\nMost of the features present in other BitTorrent clients are present in Ã‚ÂµTorrent, including bandwidth prioritization, scheduling, RSS auto-downloading and Mainline DHT (compatible with BitComet). Additionally, Ã‚ÂµTorrent supports the Protocol Encryption joint specification (compatible with Azureus 2.4.0.0 and above, BitComet 0.63 and above) and peer exchange.\n\n\nResource-Friendly\n\nÃ‚ÂµTorrent was written with efficiency in mind.\nUnlike many torrent clients, it does not hog valuable system resources - typically using less than 6MB of memory, allowing you to use the computer as if it weren't there at all. Additionally, the program itself is contained within a single executable less than 220 KB in size.\n\n\nSkinnable and Localized\n\nVarious icon, toolbar graphic and status icon replacements are available, and creating your own is very simple. Ã‚ÂµTorrent also has support for localization, and with a language file present, will automatically switch to your system language. If your language isn't available, you can easily add your own, or edit other existing translations to improve them!\n\n\nActively Developed and Improved\n\nThe development team puts in a lot of time working on features and making things more user-friendly. Releases only come out when they're ready, with no schedule pressures, so the few bugs that appear are quickly addressed and fixed.\n\n\nChangelog:\n\nHere's a new release for the 1.8.x line with some additional bugfixes.\nThe 1.8 line is stable, so only fixes and minor tweaks will be added from here on out. All new features will go into 2.0.\n\nThis is a release candidate build for 1.8.5 with some important fixes.\nThe main fix is with halfopen connection problems while using HTTPS trackers.\n\n\n\n2009-10-21: Version 1.8.5 (build 16977)\n\nChange: Add an upgrade message if a buggy version of nvLsp is detected\n\n\nFix: Don't take the total number of connections into account when connecting to trackers\n\nFix: Accounting of halfopen https connections would cause uT to stop making new connections\n\n\nED2K Link:\ned2k://|file|utorrent-1.8.5-rc1.exe|289584|40E9858A4D0C498C233400F79B357ED6|h=YRSCLRUB7KIR6JGMG7W5D6BU2XQDBREK|/","torrent":{"xt":"urn:btih:795ac0b56716b1d441ccaf573ded2f87aa05ed43","amp;dn":"uTorrent+1.8.5+RC1+%28build+16977%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"795ac0b56716b1d441ccaf573ded2f87aa05ed43","infoHashBuffer":{"type":"Buffer","data":[121,90,192,181,103,22,177,212,65,204,175,87,61,237,47,135,170,5,237,67]},"announce":[],"urlList":[]}}