{"title":"Ashampoo ClipFinder HD Multi 2,06","uid":5129849,"size":12325454,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:795c2e71c18a37bc20517bde9b952c4f4f786568&amp;dn=Ashampoo+ClipFinder+HD+Multi+2%2C06&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nahla","files":5,"time":1255997868,"description":"Ashampoo ClipFinder HD Multi 2,06 | 11,75 Mb\n\n\nEncontrar, ver, guardar y convertir vÃƒÂ­deos web en HD o SD. El nuevo Ashampoo ClipFinder HD te ofrece la web de vÃƒÂ­deo de la manera en que deberÃƒÂ­a ser. Buscar en hasta quince portales de vÃƒÂ­deo a la vez o en algunos portales, ver vÃƒÂ­deos directamente y convertir y guardarlos en su disco duro con un solo clic.\n\nNada hace encontrar, viendo, el ahorro y la gestiÃƒÂ³n de la web de videos mÃƒÂ¡s fÃƒÂ¡cil. Ashampoo ClipFinder y HD no es sÃƒÂ³lo mejor, es tambiÃƒÂ©n totalmente gratis. CNET de los encuestados pidiÃƒÂ³ el original ClipFinder &quot;un soplo de aire fresco&quot; entre los programas de este tipo y el nuevo ClipFinder HD es aÃƒÂºn mejor y mÃƒÂ¡s potente.\nÃ‚Â¿CÃƒÂ³mo funciona?\nClipFinder HD es un 3D como un navegador web. Usted sÃƒÂ³lo tendrÃƒÂ¡ que introducir palabras de bÃƒÂºsqueda en la barra de bÃƒÂºsqueda y los resultados de la bÃƒÂºsqueda de un mÃƒÂ¡ximo de 15 portales de vÃƒÂ­deo se muestran como miniaturas en el clip de vÃƒÂ­deo 3D muro. Usted puede buscar selectivamente en algunos portales, o simplemente un portal de todos los portales. Usted elige. TambiÃƒÂ©n puede crear mÃƒÂºltiples bÃƒÂºsquedas en diferentes pestaÃƒÂ±as y cambiar entre los resultados.\n\nHaga clic sobre un clip para jugar, haga clic de nuevo para guardarlo en el disco duro y la conversiÃƒÂ³n, mientras que su ahorro. Zoom de vÃƒÂ­deo mientras estÃƒÂ¡ jugando girando la rueda del ratÃƒÂ³n, haga clic en otro juega en modo de pantalla completa con controles popup.\n\nNavegando en la pared de video 3D es increÃƒÂ­ble: Zoom previstas en el clip con la rueda del ratÃƒÂ³n, arrastre para desplazarse hacia arriba y hacia abajo y de lado a lado, apuntan a un clip para ver la informaciÃƒÂ³n, cambiar el orden y el diseÃƒÂ±o arrastrando. En el muro de la interfaz de vÃƒÂ­deo 3D es como caminar en su propia tienda llena de vÃƒÂ­deos. Los usuarios que prefieren el clÃƒÂ¡sico interfaz de desplazamiento puede activarlo si quieren, por supuesto.\n\nLa organizaciÃƒÂ³n de tus clips es tan fÃƒÂ¡cil. SÃƒÂ³lo definir las categorÃƒÂ­as, que en sus clips y navegar en el Muro de vÃƒÂ­deo 3D y organizarlos arrastrando con el ratÃƒÂ³n.\n\nGran nuevas funciones\nRevolucionario 3D Video Wall\nHace que navegar por los resultados de su bÃƒÂºsqueda y colecciones de clips increÃƒÂ­blemente fÃƒÂ¡cil. Personas, desplazarse, ver, seleccionar y reproducir clips en un mundo 3D con los movimientos naturales del ratÃƒÂ³n y la rueda de desplazamiento. Organice su muro arrastrando vÃƒÂ­deo, pantalla Detalles del clip con el ratÃƒÂ³n.\nUn clic en descargar y convertir\nClipFinder HD descargas en los clips de flash (*. flv) el formato y si es necesario convierte directamente a formato MP3 en un proceso fÃƒÂ¡cil.\nClips de HD y HD de filtrado\nBuscar todos los videoclips o clips de HD. Viendo, el ahorro y la conversiÃƒÂ³n de clips de HD es tan fÃƒÂ¡cil como regular los clips.\nMucho mÃƒÂ¡s metadatos\nToda la informaciÃƒÂ³n que necesita acerca de cada clip: HD o SD, la duraciÃƒÂ³n, valoraciÃƒÂ³n, fecha, descripciÃƒÂ³n, etiquetas y mÃƒÂ¡s.\nVimeo portal de apoyo\nAdemÃƒÂ¡s de los 14 portales existentes ClipFinder HD ahora tambiÃƒÂ©n apoya el popular portal Vimeo HD con una gran cantidad de clips. Ahora puede buscar y mostrar los clips deVimeo, Spike, Veoh, Google Video, LiveVideo, Dailymotion, blip.tv, Yahoo! Video, Metacafe, MySpace, Sevenload, MyVideo, ClipFish y videu.\nMejor las listas de reproducciÃƒÂ³n\nCrear listas de reproducciÃƒÂ³n de video clip de la misma manera de hacer las listas de reproducciÃƒÂ³n de mÃƒÂºsica. La nueva funciÃƒÂ³n de reproducciÃƒÂ³n a Enqueue aÃƒÂ±ade nuevos clips a la lista de reproducciÃƒÂ³n sobre la marcha sin tener que jugar primero. Listas de reproducciÃƒÂ³n son compartidos en el formato estÃƒÂ¡ndar M3U y compatible con otros reproductores multimedia.\nFresco nuevo jugador con el modo de pantalla completa\nModerno reproductor de video HD para regular y super-vÃƒÂ­deos con controles intuitivos. En modo de pantalla completa te popup controles que deben mostrarse cuando el ratÃƒÂ³n sobre ellos.\nOtras divertidas\nPestaÃƒÂ±as de bÃƒÂºsqueda\nBasta con hacer clic en el botÃƒÂ³n o pulse Ctrl + T para crear una nueva pestaÃƒÂ±a de bÃƒÂºsqueda, que funciona como una pestaÃƒÂ±a del navegador. Llevar una bÃƒÂºsqueda en cada ficha y cambiar entre ellas.\nÃƒÅ¡nica funciÃƒÂ³n de reproducciÃƒÂ³n continua\nConjunto los resultados de la bÃƒÂºsqueda, recolecciÃƒÂ³n o clip para reproducir listas de reproducciÃƒÂ³n continua. Ninguna otra utilidad de la web de vÃƒÂ­deo puede hacer esto.\n\nGrandes caracterÃƒÂ­sticas\n* AÃƒÂºn completamente libre\n* IncreÃƒÂ­bles 3D Video Wall clip navegador\n* 1-haga clic en descargar y convertir\n* Vimeo portal aÃƒÂ±adido (lotes de HD clips)\n* BÃƒÂºsqueda de hasta 15 portales de vÃƒÂ­deo a la vez\n* Buscar en algunos portales de vÃƒÂ­deo\n* Filtro de vÃƒÂ­deo HD - sÃƒÂ³lo encontrar vÃƒÂ­deos HD\n* Nuevo reproductor de vÃƒÂ­deo con modo de pantalla completa\n* Mejora de las listas de reproducciÃƒÂ³n de vÃƒÂ­deo\n* NavegaciÃƒÂ³n por pestaÃƒÂ±as","torrent":{"xt":"urn:btih:795c2e71c18a37bc20517bde9b952c4f4f786568","amp;dn":"Ashampoo+ClipFinder+HD+Multi+2%2C06","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"795c2e71c18a37bc20517bde9b952c4f4f786568","infoHashBuffer":{"type":"Buffer","data":[121,92,46,113,193,138,55,188,32,81,123,222,155,149,44,79,79,120,101,104]},"announce":[],"urlList":[]}}