{"title":"Jobshare Mobile Phone Video Converter 2.7.6","uid":5674696,"size":5466607,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7a5793f3749beeeaa07b9d6ed958ff1b2aa0886c&amp;dn=Jobshare+Mobile+Phone+Video+Converter+2.7.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BLACKTROY","files":1,"time":1278475745,"description":"                   Mobile Phone Video Converter \n\nJoboshare Mobile Phone Video Converter is a professional video to Mobile Phone converter that helps you fast convert video to Mobile Phone video formats like 3GP, 3GPP, MP4, WMV, AVI and extract audio from video to Mobile Phone audio formats like MP3, AAC, M4A, WAV for enjoy your movie on Apple iPhone, iPod, Sony PSP, Palm, Pocket PC, and various brands of cell video phones including Motorola, Nokia, Samsung, and Sony Ericsson and so on. \n\nJoboshare Mobile Phone Video Converter comes with powerful options that let you convert multiple files at a time, trim file length, set video and audio encoding settings, preview before conversion, batch conversion, and so on. \n\nConvert video to Mobile Phone 3GP, 3GPP, MP4, AVI, WMV videos\nConvert video to Mobile Phone MP3, AAC, M4A, WAV audios\nSupport various Mobile devices: iPhone, BlackBerry, LG, Samsung, Motorola\nEnjoy your favorite video on your mobile phones and players with Joboshare Mobile Phone Video Converter right now!\n\n Key Functions \n\nConvert all popular video formats to Mobile Phone\nJoboshare Mobile Phone Video Converter can convert all popular video files to Mobile Phone video formats like 3GP, 3GPP, MP4, WMV, AVI video with very high output quality.\nExtract audio from video files to Mobile Phone\nJoboshare Mobile Phone Video Converter can Convert audio from video files to Mobile Phone MP3, AAC, M4A, WAV audio formats.\nSupport various Mobile devices\nYou can enjoy your movie on Apple iPhone, iPod, Sony PSP, Palm, Pocket PC, and various brands of cell video phones including Motorola, Nokia, Samsung, and Sony Ericsson and so on.\n Key Features \n\nSuper fast conversion speed\nSuper fast conversion speed provided as it full supports Intel Pentium D Dual-Core Processor and AMD Athlon 64 X 2 Dual-Core Processor which ensures full use of your CPU.\nPowerful video and audio settings\nJoboshare Mobile Phone Video Converter allows you to adjust so many settings such as video size, bit rate, frame rate, and so on. and supports preview, zoom and split features for Mobile Phone video conversion.\nTrim movie length\nJoboshare Mobile Phone Video Converter can trim the length of any added video files to capture your favorite clips.\nEasy to use\nJoboshare Mobile Phone Video Converter has a very easy interface that guides you to convert video to Mobile Phone with just a few intuitive clicks.\nView the information of the original files\nJoboshare Mobile Phone Video Converter can view the detail information about video codec, video bit rate, frame rate, audio codec, audio bit rate, sample rate etc. of a video file with all file formats.\nMulti-language support including Simplified Chinese and English.\nSupport skins change.\nWindows 7 compatible","torrent":{"xt":"urn:btih:7a5793f3749beeeaa07b9d6ed958ff1b2aa0886c","amp;dn":"Jobshare+Mobile+Phone+Video+Converter+2.7.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a5793f3749beeeaa07b9d6ed958ff1b2aa0886c","infoHashBuffer":{"type":"Buffer","data":[122,87,147,243,116,155,238,234,160,123,157,110,217,88,255,27,42,160,136,108]},"announce":[],"urlList":[]}}