{"title":"WinRAR 3.80 Pro","uid":5115159,"size":1315685,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7abff1abc10fa2229b77063a757cffd6aefd5ed3&amp;dn=WinRAR+3.80+Pro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"djscoobydoo","files":-1,"time":1255023794,"description":"toolkit. The application not only includes support for extracting virtually any kind of file compression format, it also boasts a no-nonsense approach to reducing file sizes.\n\nSome will argue that the application is not as quick as WinZip at compressing files. However, for the small lag in time difference, you end up with a significantly smaller archived file at the end of the process with WinRAR.the application allows you to save files into both ZIP and RAR formats, with a multitude of options for speeding up compression times, or reducing file sizes at the expense of a few more seconds.\n\nAlthough many newcomers might be put off by the sheer range of features and settings within the program, the interface doesnot take long to get accustomed to, and if youre still really stuck there is a simple wizard-based system that walks you through the process of extracting or compressing. All this adds up to make WinRAR a dependable utility that performs better than any other tool in its class.\n\n\nWinRAR supports the following formats:\n\nRAR, ZIP, CAB, ARJ, LZH, ACE, TAR, GZip, UUE, ISO, BZIP2, Z, 7-Zip\n\nRecent changes in WinRAR:\n\n    * Added support for ZIP archives containing Unicode file names in UTF-8 format.\n    * Added decompression support for WinZip AES encrypted ZIP archives.\n    * Improved Unicode support for RAR and ZIP archive names.\n    * &quot;Ask before overwrite&quot; and &quot;Skip existing files&quot; update modes are now available in archiving dialog\n    * New &quot;Add to context menu&quot; option in &quot;Profile parameters&quot; dialog.\n    * New -cp switch allows to select a compression profile in command line mode.\n    * New &quot;Options&quot; page of archiving dialog contains the group of settings modifying the behavior of &quot;Delete files after archiving&quot; option from &quot;General&quot; page.\n    * WinRAR &quot;Extraction path and options&quot; dialog is now resizable.\n    * New &quot;Update&quot; SFX script command and &quot;Update mode&quot; group of options in &quot;Update&quot; page of &quot;Advanced SFX options&quot; dialog.\n    * SFX script &quot;Shortcut&quot; command and &quot;Add shortcut...&quot; command in &quot;Advanced SFX options&quot; dialog now allow to specify an icon file containing an icon associated with shortcut.\n    * New &quot;Wipe temporary files&quot; option in &quot;Settings/Security&quot; dialog provides more secure, though slower, way to delete temporary WinRAR files.\n    * WinRAR and RAR display the total progress bar when unpacking a multivolume RAR archive if all volumes are present in the same folder.\n    * WinRAR and RAR automatically expand names of environment variables in list files.\n    * Added support of TAR archives with non-zero &quot;extra field&quot; data.\n    * Added support of TAR archives, which does not contain the end of archive entry consisting of 512 zero bytes.\n    * Improved Unicode support when dragging files from WinRAR window.\n    * Shift+Tab key combination can be used in main WinRAR window to\n    * switch the input focus between interface elements (files, comment,\n    * tree, address) in reverse order.\n    * Corrected a possible WinRAR crash when opening truncated UDF ISO files.\n\nOS requirements for WinRAR:\n\n    * OS: Win95/98/98SE/Me/2000/NT/XP/Vista/Windows7\t","torrent":{"xt":"urn:btih:7abff1abc10fa2229b77063a757cffd6aefd5ed3","amp;dn":"WinRAR+3.80+Pro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7abff1abc10fa2229b77063a757cffd6aefd5ed3","infoHashBuffer":{"type":"Buffer","data":[122,191,241,171,193,15,162,34,155,119,6,58,117,124,255,214,174,253,94,211]},"announce":[],"urlList":[]}}