{"title":"Strange Signs In The Sky - The Truth Behind Star Signs - Xvid","uid":5084620,"size":741969233,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7c3786948262b38334d945a32fe127653612bc7d&amp;dn=Strange+Signs+In+The+Sky+-+The+Truth+Behind+Star+Signs+-+Xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"verifire","files":-1,"time":1252616112,"description":"Hi there..\n\nUPDATE: Torrent Working properly now. Fixed!\n\nIt finally happened. TPB's trackers are down. But I've been anticipating something like this for a while. So for those who'll want to download torrents I've made and will make in the future, I'm moving nearly all of them to another torrent-site, maybe two. I guess it'll be at least: \n &lt;a href=&quot;\nhttp://www.torrentbox.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentbox.com&lt;/a&gt;\n \nand mini-nova\n \n(for some reason I cant get the link to that site working in this comment, and neither Tor-rentz. Just go there anyway, but remove the &quot;-&quot; in between the word(s).. \nJust browse for the torrents on those sites, and all uploads will come up, old and new.. :-)\n\nAND YOU CAN STILL START YOUR DOWNLOAD FROM TPB!! Just add these trackers to the torrent you're downloading, and we'll find each other again.\n &lt;a href=&quot;\nhttp://tracker.publicbt.com:80/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.publicbt.com:80/announce&lt;/a&gt;\n &lt;a href=&quot;\nhttp://tracker.torrentbox.com:2710/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.torrentbox.com:2710/announce&lt;/a&gt;\n \nNow don't click on the &quot;links&quot; above, that won't work. Copy and paste them to add them to your trackers in the torrent-file.\n\nAnd be sure to enable DHT. It tracks too..\n  \nAnyway, my uploads are all available by search on my alias, verifire, on for instance mini-nova or by torrent title on Tor-rentz..\n \nAnd don't trust the Seed/Leech figures on either site. Just hit &quot;download&quot; and the truth is that there are many downloading, and in time, hopefully, seeding..\n\nAnd I'm sorry to repeat myself, I really hate to do so because it may look like whining, but I have to say this once again:\n&quot;Somebody&quot; is tracking down my listening port and slows down my bandwidth to an extreme low, almost CONSTANTLY. It's a bit frustrating, and I'm actually working nearly day and night to change ports and try to outsmart &quot;them&quot;, but it's virtually impossible all the time. So PLEASE HELP ME TO SEED THIS ONCE YOU'VE GOT IT. Please..\nIf enough of us STOP being just consumers and start to share, things get a bit better, yeah? Love to you all..\n\nNOW TO THIS UPLOAD! I just had to let this one out too. I make the assumption based upon what I see before my very eyes and common reasoning that time is very short now, and I need to get this information out to as many as possible before it's too late. They'll soon close this window we call &quot;file-sharing&quot;, and it will re-emerge in quite other forms than the open exchange of information we are currently lucky enough to live under. This will change, and that soon.\n\nTherefore I make this upload of a movie by the Archaeologist Jonathan Gray, where he goes through the Zodiac and the names of the stars that make up the Zodiac and a whole lot more, and the conclusions you may reach by watching this could actually change your perspective on things and the world in general.\n\nThings are rarely what they seem, and almost never like we've been led to think by the mainstream media.. Be it TV or other &quot;scholars&quot; and &quot;teachers&quot; or &quot;gurus&quot;..\n\nThis one's a real goodie, although it's just a digitalized copy of a VHS with him and a silver screen, in all simplicity, but that is enough to get the message through. It will certainly shake the foundations whereupon the art of Astrology is built, and change the philosophical views behind it too.\nAnd J. Gray has a lot of other goodies in his storage chamber, so if you're financially able, you should really consider buying some of his books or DVD-sets. He's got some new ones out now, so I'm just uploading some of the old ones.\n\nJonathan Gray's website is at: &lt;a href=&quot;\nhttp://www.beforeus.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.beforeus.com&lt;/a&gt;\n\nand there you can prescribe to his newsletter, and with them come offers the general public has no access to. If you're financially able.\n\nJ. Gray is not a wealthy man. He has sold his house, and rents a house to live in with his wife, and all of his income are from selling his DVDs and books, and he uses it to go excavating and trying to get to the truth about Biblical accounts, and some of what he's found can only be described as no less than mind-blowing.\n\nI recommend strongly the book; &quot;Dead Mens Secrets&quot;. Evidence of an ancient, world wide and highly sophisticated civilization, which suddenly emerged and just as suddenly disappeared.\nThe Proof includes findings of the skeletons of giant Human beings, 6-10 meters tall, ancient intricate machinery, technology we haven't been able to duplicate or figure out still today.. So if you can afford it, buy something. If not, you can download this movie at least, from here, free.\nAnd maybe I'll let out some more in a while.. I said maybe.\nNo, I'm only kidding. I will in all probability upload some more soon.. :)\n\nDuration: 01:14:11\n\nWidth/Height: 704x576\n\nFrames: 25 fr.p/s\n\nSound: 128 KBPS MP3\n\nLove from Verifire.\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;a4d2c1d6cdc2cdd6c1c9c5cdc8e4c3c9c5cdc88ac7cbc9&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:7c3786948262b38334d945a32fe127653612bc7d","amp;dn":"Strange+Signs+In+The+Sky+-+The+Truth+Behind+Star+Signs+-+Xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c3786948262b38334d945a32fe127653612bc7d","infoHashBuffer":{"type":"Buffer","data":[124,55,134,148,130,98,179,131,52,217,69,163,47,225,39,101,54,18,188,125]},"announce":[],"urlList":[]}}