{"title":"Devil Worship: Exposing Satan's Underground","uid":5066891,"size":1268501971,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7d077fad3cfbba898cb2db9ba572f4735f86a2f3&amp;dn=Devil+Worship%3A+Exposing+Satan%5C%27s+Underground&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eddie1969","files":2,"time":1251057254,"description":"TV : Documentary : TV quality : English\n \n\n\n\nGeraldo Rivera's infamous October 1988 NBC News Special\n\nI post this as a gift (and a warning) to the younger members here. And also to say: look at the crap I had to deal with when I was in elementary school in the just-say-no, translucent protestant, big shoulder-pads and tiny bird brain days of Nancy and Ronnie and George and Barb! I'm also posting this to get back at NBC for their smug non-reportage of the Iranian election travesty, which I'm very, very angry about. They weren't a real news channel back then either, folks.\n\nThis is the special that officially launched the Satanic Panic throughout America. For two hours, Geraldo regaled NBC audiences with a histrionic stream of stories about &quot;ritualistic&quot; murders, &quot;recovered&quot; memories (http://en.wikipedia.org/wiki/Recovered_memory_therapy), heavy metal, and the Temple of Set. We're also treated to a quick, hateful stopover at gay S&amp;M culture featuring an audaciously cruel portrayal of small-town male prostitutes, and a charming conversation with women who claim to have chopped up their own babies and eaten them. Also, Ozzy Osbourne and Zeena Lavey are there...for some reason.\n\nI'd like to remind you that this was an NBC News Special that aired on Prime Time.\n\nThe stories are clearly unconnected, but Geraldo ties them all together into a conspiracy theory about an international Classical Satanic cult (i.e., Satanism as described in medieval Christian mythology) with millions of members, all engaged in raping and murdering children while spray-painting anarchist symbols in abandoned buildings and scrawling hackneyed lyrics for crappy Scandinavian metal bands.\n\nWatching it now, you'll want to laugh, and you will laugh. But then you'll remember that there are still people in prison, even on death row, convicted of Satanic crimes they never committed, and of hurting children they never even knew. And that kids like me had mothers who believed in this crap. And that this was a presentation of NBC News that aired on PRIME TIME.\n\nMake sure you watch the commercials. They're half the fun. My favorite moment while watching this? Right after Geraldo tells this whopper about an international conspiracy, they cut to a teaser for John Carpenter's They Live! &quot;They Control what you see!&quot; says the spooky announcer voice. He's not kidding.\n\nOnce again, NBC News was responsible for this. They Still Live!\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:7d077fad3cfbba898cb2db9ba572f4735f86a2f3","amp;dn":"Devil+Worship%3A+Exposing+Satan%5C%27s+Underground","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d077fad3cfbba898cb2db9ba572f4735f86a2f3","infoHashBuffer":{"type":"Buffer","data":[125,7,127,173,60,251,186,137,140,178,219,155,165,114,244,115,95,134,162,243]},"announce":[],"urlList":[]}}