{"title":"Harry Potter Y El Misterio Del Principe DVD-Screener Spanish Lin","uid":5119915,"size":1177126054,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7d187721b0c41340645cb1e9f6347ff42de6f314&amp;dn=Harry+Potter+Y+El+Misterio+Del+Principe+DVD-Screener+Spanish+Lin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":2,"time":1255276485,"description":"Voldemort va tomando control tanto del mundo Muggle como del mundo de la magia, y Hogwarts ya no es el lugar seguro que solÃƒÂ­a ser. Harry (Daniel Radcliffe) sospecha que tal vez hasta el castillo sea peligroso. Dumbledore (Michael Gambon) sabe que la batalla final se aproxima rÃƒÂ¡pidamente, y por eso se preocupa mucho mÃƒÂ¡s por preparar a Harry para ello. Trabajan juntos para encontrar la clave para destruir las defensas de Voldemort. Con ese fin, Dumbledore busca la ayuda de su viejo amigo y colega, el profesor Horace Slughorn (Jim Broadbent). Entre tanto, los estudiantes se encuentran afectados por algo muy diferente que siempre ataca a los adolescentes: las hormonas. Harry cada vez se siente mÃƒÂ¡s atraÃƒÂ­do por Ginny (Bonnie Wright), pero eso tambiÃƒÂ©n le pasa a Dean Thomas (Alfred Enoch). Por su parte, Lavender Brown (Jessie Cave) ha decidido que Ron (Rupert Grint) tiene que ser para ella, Ã‚Â¡lÃƒÂ¡stima que no contÃƒÂ³ con los chocolates de Romilda Vane (Anna Shaffer)! Y tambiÃƒÂ©n estÃƒÂ¡ Hermione (Emma Watson), hirviendo de celos, pero decidida a no mostrar sus sentimientos. Los romances florecen, pero uno de los estudiantes no se deja afectar por todo ello; estÃƒÂ¡ decidido a llevar a cabo su tenebroso plan. El amor estÃƒÂ¡ por todos lados, pero la tragedia se cierne sobre Hogwarts.","torrent":{"xt":"urn:btih:7d187721b0c41340645cb1e9f6347ff42de6f314","amp;dn":"Harry+Potter+Y+El+Misterio+Del+Principe+DVD-Screener+Spanish+Lin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d187721b0c41340645cb1e9f6347ff42de6f314","infoHashBuffer":{"type":"Buffer","data":[125,24,119,33,176,196,19,64,100,92,177,233,246,52,127,244,45,230,243,20]},"announce":[],"urlList":[]}}