{"title":"KeyLemon 2.0.1.","uid":5091421,"size":9136265,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7d19e98aa496f67d1f4ffe7ae2f77b002102c855&amp;dn=KeyLemon+2.0.1.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":2,"time":1253174415,"description":"Con solo Tu Webcam y Este software podrÃƒÂ¡s olvidarte de tus contraseÃƒÂ±as, con solo poner tu rostro en frente del computador, tendras acceso a tu Pc o Laptop.\n\nKeyLemon suministra una nueva experiencia para accesar su computador.\nEn vez de introducir su contraseÃƒÂ±a, usted solo necesita sonreÃƒÂ­rle a la cÃƒÂ¡mara web y KeyLemon le reconocerÃƒÂ¡.\n\nEn estos tiempos, nos encontramos continuamente interactuando con computadores e internet. Tenemos que crear numerosas cuentas personales para poder accesar computadores y servicios web, como redes sociales, blogs, foros, cuentas de correo electrÃƒÂ³nico o juegos en lÃƒÂ­nea.\n\nAparte del mal rato a causa de olvidar contraseÃƒÂ±as, y la usar la consiguiente funciÃƒÂ³n de recuperaciÃƒÂ³n de las mismas, introducir contraseÃƒÂ±as en repetidas ocasiones llega a ser algo tedioso al igual que un proceso consumidor de tiempo. MÃƒÂ¡s aun, Ã‚Â¿que pasarÃƒÂ­a si usted olvidara bloquear su computador antes de ir por un cafÃƒÂ©? ProtecciÃƒÂ³n mediante contraseÃƒÂ±a es un procedimiento de seguridad de una sola vez. DespuÃƒÂ©s del proceso de acceso, nada le asegura que la persona correcta aun se encuentra detrÃƒÂ¡s del computador, accesando los datos o servicios correctos. Para resolver este problema KeyLemon ofrece soluciones de acceso basados en autentificaciÃƒÂ³n biomÃƒÂ©trica personal.\n\nLa tecnologÃƒÂ­a de autentificaciÃƒÂ³n biomÃƒÂ©trica detrÃƒÂ¡s de los productos de KeyLemon son el resultado de 10 aÃƒÂ±os de investigaciÃƒÂ³n.\n\nCompatibilidad con Win XP, Vista y tambien en Win 7(Solo para 32 bits)\nFÃƒÂ¡cil de Usar y se Puede configurar para bloquear el sistema en una determinada cantidad de tiempo, al igual que la webcam. Lo podemos usar en forma automÃƒÂ¡tica o podemos bloquear el sistema en forma manual..","torrent":{"xt":"urn:btih:7d19e98aa496f67d1f4ffe7ae2f77b002102c855","amp;dn":"KeyLemon+2.0.1.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d19e98aa496f67d1f4ffe7ae2f77b002102c855","infoHashBuffer":{"type":"Buffer","data":[125,25,233,138,164,150,246,125,31,79,254,122,226,247,123,0,33,2,200,85]},"announce":[],"urlList":[]}}