{"title":"Assassin's Creed II White Edition by Spectator inc. [PL] [.is","uid":5556308,"size":5798131135,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7e1a580898c2ba0678228335cbcf28cb7ca3f7e5&amp;dn=Assassin%5C%27s+Creed+II+White+Edition+by+Spectator+inc.+%5BPL%5D+%5B.is&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"ByQQ","files":4,"time":1273695452,"description":"Ezio Auditore da Firenze is young Italian nobleman. He's a free spirit, impressing everyone and never shying away from the ladies. But his life is changed when his family is betrayed, he swears vengeance on those who have wronged him. Donning the now infamous hood, Ezio learns the way of the Assassin. Ezio's is consumed by vengeance and conspiracy in Assassins Creed II as you scale the heights of the beautiful, yet brutal, Renaissance Italy. Building on the original, Assassins Creed II will see you taking on smarter guards with better weapons in busier streets where you must use everything at your disposal to defeat your enemies. With new weapons such as the concealed gun and new sword types, you have so many different ways to incapacitate your enemies, but be warned, your enemies also have a few tricks up there sleeves too! * Ezio the Assassin - A new assassin for a new generation. Use the money that you earn in game to invest in better weapons and clothes to protect yourself. * Renaissance Italy - As you leap from roof to roof, you will see the Beauty of XVth Century Renaissance Italy. but below the the rooftops is a dark underworld of corruption, greed and Murder that you must penetrate to have your revenge. * Flight of Freedom - Perform the missions that you want when you want. Assassins Creed II is an open world experience for you to take on as you see fit. Not only can you free run to your next destination, but you can also swim and should the occasion call for it fly. * Hiding in plain sight - Use the crowds as your disguise to get to your target. hire people on the street to cause a distraction or just bolster your own pocket by stealing from the crowd, just make sure there are no witnesses as they will alert nearby guards. * From apprentice to master - Go from an unskilled noble man to a master assassin who can slip in to any crowd and take out any target with ease. All it takes is practise, whether the participants are willing or not!\n\nTorrent contains:\n-walktrough (polish language)\n-crack\n-iso image of the game\n\nWhite edition is extended one, contains two extra missions.\n\n\nPlease seed after download.","torrent":{"xt":"urn:btih:7e1a580898c2ba0678228335cbcf28cb7ca3f7e5","amp;dn":"Assassin%5C%27s+Creed+II+White+Edition+by+Spectator+inc.+%5BPL%5D+%5B.is","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e1a580898c2ba0678228335cbcf28cb7ca3f7e5","infoHashBuffer":{"type":"Buffer","data":[126,26,88,8,152,194,186,6,120,34,131,53,203,207,40,203,124,163,247,229]},"announce":[],"urlList":[]}}