{"title":"The Majestic (2001) PAL DVD9","uid":5119703,"size":7975403520,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7f044a66c3621ab00c11fe1809eeddeb41ea5286&amp;dn=The+Majestic+%282001%29+PAL+DVD9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ubehage","files":-1,"time":1255266151,"description":"The Majestic (2001)\n-------------------\n&quot;Sometimes your life comes into focus one frame at a time.&quot;\n\nIMDB: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0268995/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0268995/&lt;/a&gt;\n\nAudio: English, German, Catalan\n\nSubs: Danish, Swedish, Norwegian, Finnish, German, Catalan, Portuguese\n\nExtra Materials:\n- Cast &amp; Crew.\n- Additional Scenes.\n- More Within the Movie: &quot;Sand Pirates of Sahara&quot;, the Complete Sequence.\n- Trailer.\n\n\nPlot outline:\nPeter Appleton is an ambitious young screenwriter working for HHS Studios during Hollywood's Golden Age, 1951 in particular. &quot;Ashes to Ashes&quot; is about to be released, and he's dating the attractive movie star, Sandra Sinclair. Just when everything seems to be going his way, it is discovered he (unwittingly) attended a Communist meeting during college when pulled there by his girlfriend at the time, and thus heavy suspicion settles over him and he'll have to stand before Congress. Afraid of what might happen if they don't, HHS cancels Appleton's contract and aborts the release date of the film. Appleton promptly begins to wallow in self-pity and spends nearly an entire night at a bar, then drives intoxicated through the streets of the California course until plummeting into a stormy river and getting knocked unconscious. Washing up on the beaches of a small town called Lawson. Although the people there are pleasant and likeable, the town is depressed and lifeless due to having lost 62 of it's sons in World War II. One of them, Luke Trimble, was missing in action; and miraculously, Peter bears a striking resemblence to the black and white photos, close enough to fool even Luke's father, Harry. However, thanks to the blow to the head and the alcohol, Peter has suffered amnesia and decides he must be who they think he is. Besides, it's not a bad life: Luke's beautiful lover, lawyer Adele Stanton, is all over him, the town has suddenly come back to life with excitement, and he and his &quot;father&quot; rebuild a movie palace Harry used to run, the Majestic. Unfortunately, Peter's memory returns in time for G-men to track him down.","torrent":{"xt":"urn:btih:7f044a66c3621ab00c11fe1809eeddeb41ea5286","amp;dn":"The+Majestic+%282001%29+PAL+DVD9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f044a66c3621ab00c11fe1809eeddeb41ea5286","infoHashBuffer":{"type":"Buffer","data":[127,4,74,102,195,98,26,176,12,17,254,24,9,238,221,235,65,234,82,134]},"announce":[],"urlList":[]}}