{"title":"Rise of Mankind 2.91 + A New Dawn 1.73g|Mods for Civilization 4","uid":5572331,"size":604264339,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:80f3769e0ebd1050f6f2d3a0ac92dec3dea0954f&amp;dn=Rise+of+Mankind+2.91+%2B+A+New+Dawn+1.73g%7CMods+for+Civilization+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"patrioticparadox","files":5,"time":1274281796,"description":"Rise of Mankind is a mod for Civilization IV: Beyond the Sword and A New Dawn is a modmod that further expands on RoM's additions. \n\nFrom Zappara, creator of Rise of Mankind:\nRise of Mankind mod enhances Civilization 4 to a whole new level. This completely free &quot;Expansion pack&quot; keeps the basic Beyond the Sword game mechanics but converts them to much more complex systems which makes this modpack to feel like it's a completely new game. The mod works best on English language setting. Germany, Spanish, French and Italian work as well but translations for those are incomplete.\n\nFrom Afforess, creator of A New Dawn:\nRise of Mankind: A New Dawn picks up where the Rise of Mankind mod left off. It is a realistic mod, simulating the rise of civilizations from the immemorial times, past the current era, and far into the future.\nThe Trademark Feature of Rise of Mankind: A New Dawn is that you choose the new features. Every single addition is completely customizable, and can be enabled or disabled, to suit the user. You could choose to only take the speed optimizations and AI enhancements and leave all the new content. Or decide to use all the new content. Or anywhere in-between.\n\nRise of Mankind forum:\nhttp://forums.civfanatics.com/forumdisplay.php?f=269\n\nA New Dawn forum:\nhttp://forums.civfanatics.com/forumdisplay.php?f=369\n\nInstallation instructions are included in a text file\nPlease do not complain to Zappara, Afforess or myself about installation problems as the instructions I have included are thorough and accurate\nAny spamming, flaming or unnecessary complaining will be ignored.\nThat said, if you have a legitimate issue don't hesitate to ask . If it is reasonable I will do what I can to help.\n\nPlease leave comments and rate.","torrent":{"xt":"urn:btih:80f3769e0ebd1050f6f2d3a0ac92dec3dea0954f","amp;dn":"Rise+of+Mankind+2.91+%2B+A+New+Dawn+1.73g%7CMods+for+Civilization+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80f3769e0ebd1050f6f2d3a0ac92dec3dea0954f","infoHashBuffer":{"type":"Buffer","data":[128,243,118,158,14,189,16,80,246,242,211,160,172,146,222,195,222,160,149,79]},"announce":[],"urlList":[]}}