{"title":"Multi Password Recovery+Crack [US, CA, AU, GB, DE, FR]","uid":5654227,"size":1646096,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:81fa3ac76c3c62a22d3dc0c980005abad1a17a90&amp;dn=Multi+Password+Recovery%2BCrack+%5BUS%2C+CA%2C+AU%2C+GB%2C+DE%2C+FR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"haVenZz","files":1,"time":1277735342,"description":"Multi Password Recovery\n\nMulti Password Recovery (MPR) - multifunctional password recovery and auditing solution for Windows. MPR instantly finds and recovers passwords from more than 100 popular applications (FTP, E-mail clients, Instant Messengers, Browsers and so on). It also checks saved passwords for vulnerabilities, can delete lost and stored passwords, shows passwords hidden behind asterisks, copies SAM file, can generate new passwords. \n\nSupports decryption for the following applications:\n\nFTP clients\n\n    * Windows/Total Commander 4.x, 6.x, 7.x\n            Recovers Windows and Total Commander FTP passwords stored in wcx_ftp.ini. \n    * FAR Manager 1.6x, 1.7x, 2.x\n            Recovers FAR and FAR2 FTP Manager passwords stored in HKCUFarPluginsFTPHosts, HKCUFar2PluginsFTPHosts registry paths. \n    * WS_FTP 5, 6, 7, 8, 9, 10, 12 Home/Pro, 2007\n            Recovers WS_FTP FTP passwords stored in ws_ftp.ini and win.ini files. \n    * CuteFTP Home/Pro (mostly all versions)\n            Recovers Cute FTP Home, Pro and Lite version passwords stored in sm.dat, smdata.dat, tree.dat files.\n            Quick save passwords can be also decrypted. \n    * FlashFXP 1.x-3.x\n            Recovers FlashFXP passwords stored in Sites.dat, Quick.dat, History.dat files.\n            Quick save passwords can be also decrypted. \n    * FileZilla 2.x\n            Recovers FileZilla passwords stored in filezilla.xml, sitemanager.xml, recentservers.xml files.\n            Recent servers and Firewall (Proxy) passwords can be also decrypted. \n    * FTP Commander Pro/Deluxe (mostly all versions)\n            Recovers FTP Commander passwords, Pro and Deluxe versions aswell stored in ftplist.txt files. \n    * FTP Navigator (mostly all versions)\n            Recovers FTP Navigator passwords stored in ftplist.txt files. \n    * BulletProof FTP Client 1.x, 2.x\n            Recovers BulletProof FTP passwords stored in bpftp.dat files. \n    * SmartFTP 1.x, 2.x\n            Recovers SmartFTP passwords stored in Favorites.dat, History.dat and .xml files. \n    * TurboFTP 5\n            Recovers TurboFTP passwords stored in addrbk.dat files. \n    * FFFTP 1.x\n            Recovers FFFTP passwords stored in registry path HKCUSoftwareSotaFFFTPOptions. \n    * CoffeeCup FTP 3.x\n            Recovers CoffeeCup FTP passwords stored in registry path HKCUSoftwareCoffeeCup SoftwareInternetProfiles.\n            Firewall (Proxy) passwords can be also decrypted. \n    * Core FTP 2.x\n            Recovers Core FTP passwords stored in registry path HKCUSoftwareFTPWareCOREFTPSites. Firewall (Proxy) passwords can be also decrypted. \n    * FTPExplorer 7.x\n            Recovers FTPExplorer passwords stored in registry path HKCUSoftwareFTP ExplorerProfiles. \n    * Frigate3 FTP 3.x\n            Recovers Frigate3 FTP passwords stored in FtpSite.XML files. \n    * UltraFXP 1.x\n            Recovers UltraFXP FTP passwords stored in sites.xml files. \n    * FTPRush 1.x\n            Recovers FTPRush passwords stored in RushSite.xml files. \n    * SecureFX (mostly all versions)\n            Recovers SecureFX FTP passwords stored in .ini files \n    * Web Site Publisher 2.1.0\n            Recovers Web Site Publisher FTP passwords stored in registry path HKCUSoftwareCryerWebSitePublisher. \n    * BitKinex 3.0.8\n            Recovers BitKinex FTP passwords stored in bitkinex.ds files. \n    * ExpanDrive 1.8\n            Recovers ExpanDrive FTP passwords stored in registry path HKCUSoftwareExpanDriveSessions. \n    * Classic FTP PC (mostly all versions)\n            Recovers Classic FTP PC passwords stored in registry path HKCUSoftwareNCH SoftwareClassicFTPFTPAccounts. \n    * Fling (mostly all versions)\n            Recovers Fling FTP passwords stored in registry path HKCUSOFTWARENCH SoftwareFlingAccounts. \n    * SoftX FTP Client (mostly all versions)\n            Recovers SoftX FTP passwords stored in registry path HKEY_USERSSoftwareFTPClientSites. \n    * Directory Opus (mostly all versions)\n            Recovers Directory Opus FTP passwords stored in .oxc files \n    * FTP Uploader (mostly all versions)\n            Recovers FTP Uploader passwords stored in .exe files \n    * FreeFTP (mostly all versions)\n            Recovers FreeFTP passwords stored in SharedSettings.ccs files \n    * DirectFTP (mostly all versions)\n            Recovers DirectFTP passwords stored in SharedSettings.ccs files \n    * LeapFTP (mostly all versions)\n            Recovers LeapFTP passwords stored in sites.dat files \n    * WinSCP (mostly all versions)\n            Recovers WinSCP FTP saved passwords stored in registry path HKCUSoftwareMartin PrikrylWinSCP 2Sessions. \n    * 32bit FTP (mostly all versions)\n            Recovers 32bit FTP passwords stored in 32BitFtp.ini files. \n    * WebDrive (mostly all versions)\n            Recovers WebDrive FTP passwords stored in registry path HKCUSoftwareSouth River TechnologiesWebDriveConnections. \n    * FTP Control 4\n            Recovers FTP Control passwords stored in .prf files. \n\nE-mail clients\n\n    * Outlook Express 6.0\n            Recovers Outlook Express POP3, IMAP, NNTP (news), HTTP (hotmail.com), SMTP server passwords stored in registry.\n            Recovers Outlook Express Identity access password. \n    * Outlook 2000 (MSO 2000), 2002 (MSO XP), 2003 (MSO .NET), 2007\n            Recovers Outlook POP3, IMAP, NNTP (news), HTTP (hotmail.com), SMTP server passwords stored in registry and Protected Storage.\n            Recovers Outlook Identity access password.\n            Recovers Outlook PST (Outlook Personal Folders) access password stored in .pst files.\n    * Mozilla Thunderbird 1.0, 1.5.x, 2, 3.x\n            Recovers Mozilla Thunderbird POP3, IMAP, SMTP e-mail passwords stored in signons.txt, signons.sqlite and *.s files. \n    * The Bat! v. 1.x, 2.x, 3.x, 4.x\n            Recovers The Bat! POP3, IMAP, SMTP e-mail passwords stored in account.cfg and account.cfn files.\n            Dial-up and account access passwords stored by The Bat! are also decrypted. \n    * Becky 2.x\n            Recovers Becky POP3, IMAP, SMTP e-mail passwords stored in Mailbox.ini files.\n    * Eudora/Eudora Light (mostly all versions)\n            Recovers Eudora POP3, IMAP, SMTP e-mail passwords stored in Eudora.ini and signons.sqlite files. \n    * Gmail Notifier (mostly all versions)\n            Recovers Gmail Notifier application passwords stored in Protected Storage and Windows Credentials.\n    * Mail.Ru Agent 4.x, 5.x\n            Recovers Mail.Ru Agent client passwords stored in magent_logins, magent_logins2, mra_logins, mra_logins2 files.\n    * Opera Email Client\n            Recovers POP3, SMTP, IMAP passwords stored by Opera built-in e-mail client in accounts.ini and wand.dat files.\n    * IncrediMail (mostly all versions)\n            Recovers IncrediMail POP3 and SMTP passwords stored in HKCUSoftwareIncrediMailIdentities registry path.\n    * Group Mail Free (mostly all versions)\n            Recovers Group Mail Free POP3 and SMTP e-mail passwords stored in fb.dat files.\n    * Vypress Auvis 2.x\n            Recovers Vypress Auvis client passwords stored in HKCUSoftwareVypressAuvisSettings registry path.\n    * PocoMail 3.x, 4.x\n            Recovers PocoMail POP3 and SMTP e-mail passwords stored in poco.ini files.\n    * Forte Agent 3.x\n            Recovers Forte Agent POP3, SMTP, News (NNTP) passwords stored in agent.ini files.\n    * iScribe/nScribe 1.x\n            Recovers iScribe and nScribe POP3, SMTP, IMAP passwords stored in ScribeOptions.xml files.\n    * POP Peeper 3.x\n            Recovers POPPeeper POP3, SMTP and account access (admin) passwords stored in poppeeper.ini files.\n    * Mail Commander 8.x\n            Recovers Mail Commander POP3 and SMTP e-mail passwords stored in profiles.txt files.\n    * Windows Mail (mostly all versions)\n            Recovers Windows Mail POP3, SMTP, IMAP, NNTP (news), HTTP e-mail passwords stored in .oeaccount files.\n    * Windows Live Mail (mostly all versions)\n            Recovers Windows Live Mail POP3, SMTP, IMAP, NNTP (news), HTTP e-mail passwords stored in .oeaccount files.\n\nBrowsers\n\n    * Opera 6.x, 7.x, 8.x, 9.x, 10.x\n            Recovers Opera Browser auto complete form (wand) passwords stored in wand.dat files, encrypted wands with master password set (strong-protection) are not supported at the moment.\n            Also recovers basic-auth web and FTP passwords, passwords from Opera built-in e-mail client stored in accounts.ini file. \n    * Mozilla Browser 1.7.x\n            Recovers Mozilla Browser web form, http (basic-auth) and ftp passwords stored in signons.txt file. \n    * Internet Explorer 4, 5, 6, 7, 8\n            Automatically recovers all types of Internet Explorer passwords. MPR is able to decrypt passwords stored in Protected Storage and inside Windows Credentials file. Active Form passwords within current open Internet Explorer tabs and hidden behind asterisks are also decrypted using OLE (Object Linking and Embedding) technology.\n            Auto complete, Saved Form, Basic-auth (http and https) and FTP passwords are deciphered instantly. \n    * Mozilla Firefox (mostly all versions)\n            Automatically recovers all types of Mozilla Firefox passwords stored in signons.sqlite, signons.txt, signons2.txt, signons3.txt. Encrypted signons with master password set (strong-protection) are not supported at the moment.\n            Firefox must be installed in order to decrypt the passwords.\n            Autocomplete, Saved Form, Basic-auth (http and https) and FTP passwords are deciphered instantly. \n    * Google Chrome 1.0\n            Recovers Google Chrome saved form, basic-auth and FTP passwords stored in Web Data file.\n            You have to close the browser in order to decrypt all the passwords. \n    * Apple Safari 3.2\n            Recovers Apple Safari Browser saved form passwords stored in keychain.plist files. \n\nDialers\n\n    * Windows Remote Access Service (RAS), VPN and Dial-up passwords\n            Recovers Virtual Private Network (VPN) and Dial-up passwords stored by Windows Remote Access Service in rasphone.pbk files. \n    * EType Dialer 1.x\n            Recovers E-Type Dialer dial-up passwords stored in edialer.ini files. \n    * MuxaSoft Dialer 3.0, 4.0, 4.1\n            Recovers MuxaSoft Dialer dial-up passwords stored in mdialer.ini and *.mdp files. \n    * FlexibleSoft Dialer 2.x-4.x\n            Recovers FlexibleSoft Dialer dial-up passwords stored in *.set files. \n    * Advanced Dialer 2.x\n            Recovers Advanced Dialer dial-up passwords stored in HKCUSoftwarePySoftAutoConnect registry path.\n            Accounts with master password set (strong-protection) are not supported at the moment. \n    * Dialer Queen 1.x\n            Recovers Dialer Queen dial-up passwords stored in *.ini files. \n    * VDialer 3\n            Recovers VDialer dial-up passwords stored in Vd3User.dat files. \n\nDownload managers\n\n    * Download Master 4, 5\n            Recovers Download Master http, https and ftp download task passwords stored in *.xml and *.spl files.\n            Proxy passwords stored by Download Master can be also decrypted. \n    * GetRight 5\n            Recovers GetRight http, https and ftp download task passwords stored in *.inifiles. \n    * FlashGet (JetCar) 1.6, 1.71, 1.8\n            Recovers FlashGet http, https and ftp download task passwords stored in *.jcdfiles.\n            Proxy and dial-up passwords stored by FlashGet can be also decrypted. \n    * Internet Download Accelerator 5\n            Recovers Internet Download Accelerator (IDA) http, https and ftp download task passwords stored in plsf.dat, plsh.dat and *.spl files.\n            Proxy passwords stored by IDA can be also decrypted. \n\nInstant messengers\n\n    * QIP 2005a\n            Recovers QIP ICQ passwords stored in config.ini files.\n            QIP Infium password recovery is not supported at the moment. \n    * Miranda IM 0.2.x, 0.3.x, 0.4.x, 0.5.x, 0.6, 0.8\n            Recovers Miranda IM ICQ, AIM, MSN, Yahoo, MRA, Gadu-gadu, Jabber profile passwords stored in *.dat files. \n    * ICQ 99b-2003b, Lite 4, Lite 5\n            Recovers ICQ passwords stored in HKCUSOFTWAREMirabilisICQNewOwners registry path and *.dat files. \n    * MSN Messenger 1.x-7.x\n            Recovers MSN Messenger passwords stored in HKCUSoftwareMicrosoftMSNMessenger, HKCUSoftwareMicrosoftMessengerService registry keys and in Windows Credential Service. \n    * Windows Messenger\n            Recovers Windows Messenger passwords stored in HKCUSoftwareMicrosoftMessengerService registry path. \n    * Yahoo! Messenger 3.x-6.x\n            Recovers Yahoo! Messenger passwords stored in HKCUSoftwareYahooPager registry path. \n    * &amp;RQ 0.9\n            Recovers &amp;RQ ICQ passwords stored in andrq.ini files. \n    * Trillian 0.x, 2, 3\n            Recovers Trillian ICQ, AIM, MSN, Yahoo! and profile access passwords stored in aim.ini, msn.ini, yahoo.ini and profiles.ini files. \n    * AOL Instant Messenger (older versions)\n            Recovers AOL Instant Messenger (AIM) passwords stored in registry path HKCUSoftwareAmerica OnlineAOL Instant Messenger (TM)CurrentVersionUsers.\n            Note that versions above 6.1 are not supported. \n    * GAIM 1.x\n            Recovers GAIM ICQ, AIM, Gadu-Gadu, MSN, Jabber, IRC, Napster, Silc, Yahoo, QQ, Meanwhile, Simple, Novel, MySpace passwords stored in accounts.xml file. \n    * Odigo 4\n            Recovers Odigo passwords stored in *.odu file. \n    * IM2 (Messenger 2) 1.5.x\n            Recovers IM2 passwords stored in accounts.xml files. \n    * SIM 0.9\n            Recovers SIM UIN and E-mail passwords stored in clients.conf files. \n    * Google Talk (mostly all versions)\n            Recovers Google Talk client passwords stored in HKCUSoftwareGoogleGoogle TalkAccounts registry path, Windows Credentials or Protected Storage subsystems.\n            Firewall (Proxy) passwords can be also recovered. \n    * PSI (mostly all versions)\n            Recovers PSI passwords stored in config.xml files. \n    * Faim 0.1\n            Recovers Faim ICQ, AIM passwords stored in HKCUSoftwareFaim registry path. \n    * Windows Live Messenger\n            Recovers Windows Live Messenger passwords stored in Windows Credentials subsystem. \n    * Paltalk (mostly all versions)\n            Recovers Paltalk password stored in HKCUSoftwarePaltalk registry path. \n    * Excite Private Messenger 1.x\n            Recovers Excite Private Messenger passwords stored in HKCUSoftwareExcitePrivateMessenger and Windows Crdentials service. \n    * Gizmo Project (mostly all versions)\n            Recovers Gizmo passwords stored in HKCUSoftwareSipphoneGizmo ProjectAccounts registry path. \n    * Pidgin (mostly all versions)\n            Recovers Pidgin ICQ, AIM, Gadu-Gadu, MSN, Jabber, IRC, Napster, Silc, Yahoo, QQ, Meanwhile, Simple, Novel, MySpace passwords stored in accounts.xml file. \n    * AIM Pro (mostly all versions)\n            Recovers AIM Pro passwords stored in HKCUSoftwareAimg/IM/AIMPro registry path. \n    * MySpaceIM 1.0\n            Recovers MySpace IM passwords stored in users.txt files. \n    * Pandion 2.5\n            Recovers Pandion passwords stored in global.xml files. \n    * QIP.Online (mostly all versions)\n            Recovers QIP Online profile access passwords stored in HKCUSoftwareQIP.OnlineQIP.Onlineaccountsaccount registry path. \n    * JAJC (Just Another Jabber Client) (mostly all versions)\n            Recovers JAJC jabber passwords stored in HKCUSoftwareABstract SoftwareJAJCAccounts registry path. \n    * Digsby (build 19635)\n            Recovers Digsby passwords stored in Digsby.dat files. \n    * Trillian Astra (mostly all versions)\n            Recovers Trillian Astra passwords stored in accounts.ini files. \n\nOther\n\n    * Windows registration key\n            Recovers Windows CD-KEY stored in HKLMSOFTWAREMicrosoftWindows NTCurrentVersion registry path. \n    * ClubTimer 2.2-2.7\n            Recovers ClubTimer admin and client access passwords stored in clients.dat files. \n    * Punto Switcher 2.5-2.9\n            Recovers Punto Switcher diary access passwords stored in HKCUSoftwarePunto Switcher registry path. \n    * WinVNC 3.x\n            Recovers WinVNC client passwords stored in HKCUSoftwareORLWinVNC3 registry path. \n    * Screen Saver Win9x\n            Recovers Screen Saver password stored by Windows 95, 98 and ME in HKCUControl PanelDesktop registry path. \n    * ASP.NET Account\n            Recovers ASP.NET Account password stored by Windows. \n    * Remote Desktop Connection\n            Recovers Remote Desktop Connection passwords stored in Windows Credentials and Default.rdp files. \n    * The Bee 1.x\n            Recovers The Bee passwords stored in TheBee.ini files. \n    * FreeCall 3.x\n            Recovers FreeCall account login and passwords stored in HKCUSoftwareFreeCallFreeCallAccounts registry path. \n    * CamFrog 3.x\n            Recovers CamFrog password stored in HKCUSoftwareCamfrogClientProfileInfo registry path. \n    * PC Remote Control (mostly all versions)\n            Recovers PC Remote Control password stored in HKCUSoftwarePC Remote Control registry path. \n    * UPSMon 2.8\n            Recovers UPSMon access password stored in UPSMON.ini file. \n    * Cisco VPN Client 5\n            Recovers Cisco VPN client password stored in .pcf files. \n    * Microsoft Access .mdb password recovery\n            Unlocks password protected Microsoft Access .mdb files. \n    * Windows Cached Credentials (.NET Passport, Domain and Network passwords)\n            Recovers passwords stored using Windows Credential subsystem: .NET Passport, Windows Domain, Cached Network (LAN) passwords. \n    * Windows 9x Cached Network passwords\n            Recovers Windows 95, 98, ME Cached Network (LAN) passwords. ","torrent":{"xt":"urn:btih:81fa3ac76c3c62a22d3dc0c980005abad1a17a90","amp;dn":"Multi+Password+Recovery%2BCrack+%5BUS%2C+CA%2C+AU%2C+GB%2C+DE%2C+FR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81fa3ac76c3c62a22d3dc0c980005abad1a17a90","infoHashBuffer":{"type":"Buffer","data":[129,250,58,199,108,60,98,162,45,61,192,201,128,0,90,186,209,161,122,144]},"announce":[],"urlList":[]}}