{"title":"Brownsville Worship - Praise Unlimited - A Compilation","uid":5052826,"size":195491584,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:82196896006b5715845b635389f9ab6de3c87c19&amp;dn=Brownsville+Worship+-+Praise+Unlimited+-+A+Compilation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"verifire","files":-1,"time":1250255379,"description":"Hi there..\n\nThen it finally happened. TPB's trackers are down. But I've been anticipating something like this for a while. So for those who'll want to download torrents I've made and will make in the future, I'm moving nearly all of them to another torrent-site, maybe two. I guess it'll be at least: &lt;a href=&quot;\nhttp://www.torrentbox.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentbox.com&lt;/a&gt;\n\nJust browse for the torrents on that site, and all uploads will come up, just give me some days.. :-)\n\nAnd you can still start your download from this site!! Just add these trackers to the torrent, and we'll find each other again.\n &lt;a href=&quot;\nhttp://tracker.publicbt.com:80/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.publicbt.com:80/announce&lt;/a&gt;\n &lt;a href=&quot;\nhttp://tracker.torrentbox.com:2710/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.torrentbox.com:2710/announce&lt;/a&gt;\n \nNow don't click on the &quot;links&quot; above, that won't work. Copy and paste them to add them to your trackers in the torrent-file.\n\nAnd be sure to enable DHT. It tracks too..\n  \nAnyway, they should also all be available by search on my alias, verifire, on for instance: &lt;a href=&quot;\nhttp://www.isoHunt.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.isoHunt.com&lt;/a&gt;\n \n- because they search the contents and comments on the upload for tags as well as the title of the torrent.. Just give me some time..\n\nSee you later, when things are settled and (maybe) there's a working tracker on the site again, and I'll miss it terribly, but I hope for, and guess this isn't the last word on the matter. I'll upload stuff here anyway, as well as on the other sites...\n\nTPB WILL ALWAYS RULE!! THANK YOU, GUYS. YOU'VE BEEN A PLEASURE TO BE SHIPWRECKED WITH. IT'S AN HONOUR...\n\nVerifire.\n____________________________________________________________________________\n\n\nI'm at the moment being constantly monitored and hindered in sharing Christian material. For instance uTorrent shows that there's three(!) seeders on every torrent I upload when they've been published for a few minutes, and I have shared maybe 1% of the file. How's that possible? A month ago it showed &quot;only&quot; two.. The people who hate what I do block my listening port and slows down my bandwidth to an extreme low, and I'm being bombarded in comments on uploads and mails. The only thing I can do, is to appeal to you who are Christians, to help me seed these torrents, because I don't know how much longer I'm able to do this. Not for long, I fear. And I live in Norway, a so called &quot;free Nation&quot; of the western world..\nAnd then I'm accused of being a &quot;conspiracy-theorist&quot;.. :-)\n\nWell, I wanted to let you in on some encouraging stuff from the revival in Brownsville, Florida in the late 90's/early Millennium.\n\nA guy named Rodney Howard Browne caused division among the Assembly of God in Pensacola, and the whole thing got a bit confusing, but from the beginning, the Church down there were praying for hours upon hours on their knees for revival, and the Holy Spirit came down..\n\nHere's a link to a video of Mr. Browne and Kenneth Copeland, who so many are deceived by, amongst others, with their &quot;laughter in the spirit&quot; and &quot;prosperity gospel&quot;, because they are viciously sent to destroy every movement of God in peoples hearts with a false gospel, another Jesus, and another spirit.. Yes. I know what I am saying, and I will defend that stand before the throne of the All Mighty God and His Son, Jesus Christ, so help me God..\n &lt;a href=&quot;\nhttp://girdedwithtruth.org/2009/06/24/rodney-howard-browne-and-kenneth-copeland/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://girdedwithtruth.org/2009/06/24/rodney-howard-browne-and-kenneth-copeland/&lt;/a&gt;\n\nYou can also search on their names and find many, many strange things that they claim to be &quot;Biblical&quot;.. Like you can with the &quot;prophet of God&quot;, Benny Hinn and what he teaches.. Believe only in what the Lord gives YOU personally when you're praying and reading the Bible. Times are hard, because many deceivers have gone into the world..\n \nSo, I don't know how things are down in Pensacola now, but the faithful are still faithful, I know that much.. :-)\n\nNow, this upload is just a compilation I put together of tracks I had laying about, but if you long for some nice, strong and as far as a I can tell, REAL worship.. You know the kind where the musicians and singers actually lifts their whole hearts up to the Lord, in happiness and gratitude, this might be it.. :-)\n\nThey're all mp3's @ 320 Kb p/s constant bit rate, so the sound is OK..\n\nEnjoy, Jesus-people, enjoy..\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;5a2c3f28333c33283f373b33361a3d373b333674393537&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:82196896006b5715845b635389f9ab6de3c87c19","amp;dn":"Brownsville+Worship+-+Praise+Unlimited+-+A+Compilation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82196896006b5715845b635389f9ab6de3c87c19","infoHashBuffer":{"type":"Buffer","data":[130,25,104,150,0,107,87,21,132,91,99,83,137,249,171,109,227,200,124,25]},"announce":[],"urlList":[]}}