{"title":"[PSP-PSX]G-POLICE - WEAPONS OF JUSTICE","uid":5067320,"size":438287897,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:82545b3360f81b164b06b6ae1b843daf23982ee8&amp;dn=%5BPSP-PSX%5DG-POLICE+-+WEAPONS+OF+JUSTICE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FEARLESS1964","files":1,"time":1251073278,"description":"*******MUST HAVE CUSTOM FIRMWARE(M33 W/ POPS) INSTALLED ON PSP OR WONT WORK*****\n\n\n\n\n******\nPROPERLY CONVERTED TO EBOOT FORMAT.\n\nSIMPLY COPY G POLICE FOLDER TO PSP/GAME DIRECTORY\n\n\nAfter the corporation wars of the first game, Slater is now a veteran pilot within the G-Police. However, the gangs that lay dormant during the battles between Nanosoft and G-Police have now emerged once again, and the weakened G-Police are struggling to contain them. The United Earth Marine Corps has sent units to assist in enforcing peace upon Callisto, but until they arrive Slater has to do his best to fight the tide. And when the Marines do arrive, the trouble is only just beginning...\n\nAfter initially aiding the G-Police in their battles against the gangs, the Marines suddenly turn against them. Commander Grice of the Marines, now in control of his own army, attempts to quickly crush the G-Police and take over Callisto, and then move to attack Earth itself. Slater and the G-Police manage to resist and, with the help of Earth-loyal Marine defectors, then beat back his revolution. Grice sabotages the communication devices that allow the colony to communicate with Earth. Grice retreats from Callisto and heads for the safety of space, but Slater leads the assault of a small force of space-capable vessels, Corsairs stolen from the Marine bases, and attempts to destroy Grice's fleet as it retreats. However, despite capturing the Barrossa and using it to cripple the Talavera, G-Police are simply too few to prevent Grice from escaping on his third battleship, the Excelsior. The Marine force continue to head towards Earth - and the G-Police have no way of warning the homeworld in time. Despite the odds, Slater and his crew prepare to follow Grice and hope to delay or outrun him as they both race for Earth.\n\n\n\n\n","torrent":{"xt":"urn:btih:82545b3360f81b164b06b6ae1b843daf23982ee8","amp;dn":"%5BPSP-PSX%5DG-POLICE+-+WEAPONS+OF+JUSTICE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82545b3360f81b164b06b6ae1b843daf23982ee8","infoHashBuffer":{"type":"Buffer","data":[130,84,91,51,96,248,27,22,75,6,182,174,27,132,61,175,35,152,46,232]},"announce":[],"urlList":[]}}