{"title":"Nelson DeMille - The Gate House","uid":5058993,"size":1281612194,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:82c94b9fcd869a566c1199295b6608e0c845e937&amp;dn=Nelson+DeMille+-+The+Gate+House&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"g-roid","files":-1,"time":1250572701,"description":"Nelson DeMille\nThe Gate House\n\nAfter John Sutter's aristocratic wife killed her Mafia don lover, John left Amenca and set out in his sailboat on a three-year journey around the world, eventually settling in London. Now, ten years later, he has come home to the Gold Coast of Long Island-that stretch of land that once held the greatest concentration of wealth and power in America-to attend \nthe imminent funeral of an old family servant. Taking up residence in the gatehouse of Stanhope Hall, the family home of his ex-wife, Susan Stanhope Sutter, John finds himself living only a quarter of a mile from Susan, who has also returned to Long Island after living in Hilton Head for the past decade. \n\nBut Susan isn't the only person from John's past who has resurfaced. Though Frank Bellarosa, infamous Mafia don and Susan's ex-lover, is long dead, his son, Anthony, is alive and intent on two missions: drawing John back into the violent world of the Bellarosa family, and exacting revenge on his father's murderer-Susan Sutter. At the same time, John and Susan's mutual attraction reawakens and old passions begin to reignite--and John finds himself being pulled deeper and deeper into a web of seduction and betrayal. \n\nFilled with the same sharp humor and biting social satire that defined his iconic novel &quot;The Gold Coast&quot;, THE GATE HOUSE is a brilliant look at a changing society and proves once again that Nelson DeMille is a masterful author writing at the height of his craft.\n \nNELSON DeMILLE is the author of fourteen acclaimed novels. including the &quot;New York Times&quot; bestsellers &quot;Night Fall&quot;, &quot;Plum Island&quot;, &quot;Wild Fire&quot;, &quot;The Lion's Game&quot;, &quot;The Gold Coast&quot; and &quot;The General's Daughter&quot;.\n\nCHRISTIAN RUMMEL has recorded many audio books in a variety of genres. He has most recently worked with NYC companies Theatre For a New Audience and Clubbed Thumb. Christian has also appeared in several episodes of Law &amp; Order. He resides in Brooklyn, NY.\n\nApproximately 22 hours from 19 CDs at 128 kbps in MP3 format.\n","torrent":{"xt":"urn:btih:82c94b9fcd869a566c1199295b6608e0c845e937","amp;dn":"Nelson+DeMille+-+The+Gate+House","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82c94b9fcd869a566c1199295b6608e0c845e937","infoHashBuffer":{"type":"Buffer","data":[130,201,75,159,205,134,154,86,108,17,153,41,91,102,8,224,200,69,233,55]},"announce":[],"urlList":[]}}