{"title":"015-Coast to Coast-Ian Punett with  Zen DeBrucke 18 Apr 10 .m4a","uid":5516154,"size":102682677,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:82d042c91898c27e3d1a61aec7ae4bf598d1fef3&amp;dn=015-Coast+to+Coast-Ian+Punett+with++Zen+DeBrucke+18+Apr+10+.m4a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"panzerfaust69","files":1,"time":1272258718,"description":"Our Internal Guidance System\nDate:04-17-10\n\nHost:Ian Punnett\n\nGuests:Zen DeBruke, Nick Pope\n\nAuthor and inspirational teacher Zen DeBrucke explained how learning to recognize and interpret signals from the body's Internal Guidance System (IGS) can lead to greater success and fulfillment in life. According to DeBrucke, the IGS is a series of sensations that happen continually to people as they are having thoughts. When these sensations are correctly understood they can provide very accurate intuitive knowledge, she continued.\n\nDeBrucke outlined an exercise to assist listeners in feeling their IGS &quot;opening&quot; and &quot;closing.&quot; Begin by focusing on the bottom of your feet to become present with your body. Next, think about the following statements one at a time:\n\n1) I DO NOT have an Internal Guidance System.\n2) I DO have an Internal Guidance System.\n\nAs you reflect on the preceding thoughts, check between your throat and stomach area for sensations of expansion (opening) or tension (closing). Thought #1 may illicit an immediate gut reaction that something is wrong (as it did for Ian), while thought #2 may cause an open feeling in your chest. This expansive sensation is the IGS's way of letting you know that a particular thought is guiding you in the right direction for your life's purpose, she said.\n\nDeBrucke emphasized how the IGS acts more like a compass than a simple On/Off switch (do this, do not do that). When the needle metaphorically swings to the most open expansive position inside you, those are the thoughts that will create abundant health and harmony in your life -- what she calls your &quot;higher purpose.&quot; DeBrucke believes her goal is to be in symbiotic alignment with everything and everyone around her. Closed sensations, on the other hand, should be dispatched by admitting that what you are thinking is not true and not in alignment with your higher purpose, she added.\n\nUFO Update\n\nAppearing in the first half hour, Nick Pope reacted to a recently released video that shows two fighter jets chasing a UFO over Britain's M5 motorway. &quot;I'm afraid it is looking more and more likely that this is a CGI hoax,&quot; Pope said, noting the pristine condition of the trucks seen in the footage. If this had been a real sighting at a busy location, somebody else would have come forward by now, he added. Pope also commented on the rise in low quality UFO reports in the UK, attributing a vast proportion of these sightings to Chinese lanterns, and citing it as a reason the Ministry of Defence axed the UFO Project.\nWebsite(s):\n# smartsoulacademy.com\n# nickpope.net\nBook(s):\n# The Smart Soul\n# Open Skies, Closed Minds\n","torrent":{"xt":"urn:btih:82d042c91898c27e3d1a61aec7ae4bf598d1fef3","amp;dn":"015-Coast+to+Coast-Ian+Punett+with++Zen+DeBrucke+18+Apr+10+.m4a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82d042c91898c27e3d1a61aec7ae4bf598d1fef3","infoHashBuffer":{"type":"Buffer","data":[130,208,66,201,24,152,194,126,61,26,97,174,199,174,75,245,152,209,254,243]},"announce":[],"urlList":[]}}