{"title":"Gorillaz - Dirty Harry","uid":5063768,"size":176302084,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8313f0f4ca70e5dd170fafd98688e1e9b499b1a5&amp;dn=Gorillaz+-+Dirty+Harry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1250833855,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Dirty Harry&quot; is a song from Gorillaz' second album Demon Days. It was the third single from the album, released 21 November 2005. It peaked at #6 in the UK. It was also released as a promo and onto iTunes earlier that year. An early version of &quot;Dirty Harry&quot; titled &quot;I Need A Gun&quot; was included on Damon Albarn's album Democrazy. On 8 December 2005 it was announced that &quot;Dirty Harry&quot; had been nominated for a Grammy under the category &quot;Urban/Alternative Performance&quot;, but was beaten by Damian &quot;Jr. Gong&quot; Marley's &quot;Welcome to Jamrock&quot;.\n\nThe song's lyrics contain the line &quot;The war is over so says the speaker with the flight suit on&quot;, apparently referring to George W. Bush's &quot;Mission Accomplished&quot; televised speech.[who?]\n\nDirty Harry is also a 1971 film directed by Don Siegel. One of Gorillaz's earlier singles is also the name of this movie's actor, Clint Eastwood. The single cover is similar to that of the film Full Metal Jacket.\n\nThe video was first released on 25 October 2005 to subscribers of the Gorillaz website mailing list.\n\nLike the Gorillaz video Clint Eastwood, Dirty Harry is a reference to the Clint Eastwood movie of the same name.\n\nDirty Harry is the only Gorillaz music video to be filmed on-location. The band was going to use a computer animated desert, but it turned out simply flying the crew and band to the desert was cheaper and easier. Most of the video features shirtless 2-D and an animated version of the Children's Choir San Fernandez stranded in the middle of a desert, following what appears to have been a helicopter crash (which may be a relation to El MaÃƒÂ±ana, but most likely isn't, as Noodle is completely unharmed in the video and El Manana was created after Dirty Harry). The survivors keep themselves entertained with the song while awaiting the arrival of rescuers, portrayed by Noodle and Murdoc crewing a South African Defence Force Casspir mine-proof vehicle driven by Russel (who has grown a Fu Manchu). The song and video feature a guest appearance by Pharcyde rapper Bootie Brown, who leaps out of a sand dune in WW2 military fatigues to perform his verse of the song.\n\nIn the end of the video the Gorillaz, the children and Bootie Brown depart the crash site in the military vehicle, which unfortunately breaks down meters away.\n\nThe themes in the single, as well as the themes in the entire album are all based on Damon Albarn's observations on the state that the world is in today.\n\nThe helmet which appears on the single cover and the poster for the video (seen in the cinema section of the Gorillaz website) is reminiscent of the Full Metal Jacket movie poster, hinting that the album follows a story much like the movie. This song is the part in the story while the soldier (Bootie Brown) is being sent off to war unjustly, now separated from his lover at home. In the movie, the helmet has the words, &quot;Born to Kill&quot; written on it while in the Gorillaz video the words &quot;Yo&quot; and &quot;Ko&quot; appear on 2-D's helmet.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:8313f0f4ca70e5dd170fafd98688e1e9b499b1a5","amp;dn":"Gorillaz+-+Dirty+Harry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8313f0f4ca70e5dd170fafd98688e1e9b499b1a5","infoHashBuffer":{"type":"Buffer","data":[131,19,240,244,202,112,229,221,23,15,175,217,134,136,225,233,180,153,177,165]},"announce":[],"urlList":[]}}