{"title":"FileStreamÃ‚Â® Secure Disk 1.7-crack incl","uid":5046959,"size":19924685,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:83a616af5e0853fb92e4bd2f02c69aa1f46997a3&amp;dn=FileStream%C3%82%C2%AE+Secure+Disk+1.7-crack+incl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jmb2012","files":4,"time":1249685922,"description":"FileStreamÃ‚Â® Secure Disk\n  Secure, Store, and Share Your Digital Assets\n   Support English, (Simplified) Chinese, Dutch, and French\n   Compatibility: Windows XP/Vista\n   \n   What you can do:\n\nFileStreamÃ‚Â® Secure Disk is the perfect solution for protecting sensitive information from theft and other attacks. It makes a part or all of your hard disk, or removable drive, into a secure vault, which you can access just like accessing any other drives other than they require login passwords to open. All your private information stored on the Secure Disk are protected by Strong Encryption with options of 256-bit or 448-bit encryption. You can create as many vaults of any size as you like to compartmentalize data with the ability to move files from one vault to another.\n\nKey Features:\n\n    * Make your personal files and folders private without any hassle.\n    * Protect sensitive information on Laptop in case it is lost or stolen.\n    * Create multiple Secure Disks from hard disks or USB disks.\n    * Don't have to encrypt the entire drive to have security protection.\n    * Can still share computer but only you can see your Secure Disk. \n\nThe Secure Disk vaults on your computer and on removable storage devices can only be accessed with the right login ID and password. This solution is easier to use and more flexible than encrypting your entire hard drive. In case your computer is logged in and left unattended, no one can access your sensitive information without logging into your Secure Disks.","torrent":{"xt":"urn:btih:83a616af5e0853fb92e4bd2f02c69aa1f46997a3","amp;dn":"FileStream%C3%82%C2%AE+Secure+Disk+1.7-crack+incl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83a616af5e0853fb92e4bd2f02c69aa1f46997a3","infoHashBuffer":{"type":"Buffer","data":[131,166,22,175,94,8,83,251,146,228,189,47,2,198,154,161,244,105,151,163]},"announce":[],"urlList":[]}}