{"title":"(PSX-PSP) Crusader: No Remorse converted properly [ResourceRG Ga","uid":5028164,"size":596188007,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:842621ab462aaca07667ab54406eef9e1f8a89f7&amp;dn=%28PSX-PSP%29+Crusader%3A+No+Remorse+converted+properly+%5BResourceRG+Ga&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"toxicjuggalo","files":2,"time":1248794110,"description":"CRUSADER - NO REMORSE:\n\nThe PC hit CRUSADER: No Remorse makes its way to the PlayStation. You are a Silencer, an elite enforcer for the World Economic Consortium. The work you do is for the good of the world, or so you believe. You soon discover the corruption of the Consortium, and realize your only choice is to join the resistance. However, the members of the resistance do not trust you. Take on a wide variety of missions: help your new friends escape from prison before they are executed, cripple a city by destroying its power generators, or find a top-secret piece of intelligence to help plan the next attack. Thankfully, you have lots of guns and plenty of things to blow up in every mission. Will you be able to gain the trust of the resistance? Can you stop the evil plans of the World Economic Consortium? Play CRUSADER: No Remorse and find out.\n\nTested and working on all CFW's 5.00 m33 and above using the 500 popsloader pack set on 3.72 POPS... Like my work?? Please read the NFO and support me ;)\n\n\nHave you been looking for that classic PSX game but just can't seem to find it anywhere? How about those &quot;rare&quot; titles that were only released in certain regions? Better yet, would you like to be able to have those games playable on your PSP so you can play them anywhere you want? Want to get those conversions directly from the source instead of through &quot;unsafe&quot; torrent browsers? Come and request them at\n\n                         www.reputation-resource.com\n","torrent":{"xt":"urn:btih:842621ab462aaca07667ab54406eef9e1f8a89f7","amp;dn":"%28PSX-PSP%29+Crusader%3A+No+Remorse+converted+properly+%5BResourceRG+Ga","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"842621ab462aaca07667ab54406eef9e1f8a89f7","infoHashBuffer":{"type":"Buffer","data":[132,38,33,171,70,42,172,160,118,103,171,84,64,110,239,158,31,138,137,247]},"announce":[],"urlList":[]}}