{"title":"Alcohol 120% 5.0 Blu-ray","uid":5101684,"size":9464698,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8456bf9f0b512c9ea471b2387aa364c25244bf4f&amp;dn=Alcohol+120%25+5.0+Blu-ray&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"donnerstag","files":3,"time":1254037710,"description":"\nEndlich erhÃƒÂ¤ltlich! Alcohol 5.0 BluRay\n- Blu-ray-Disks kopieren und Daten bunt gemischt auf beliebige Rohlinge brennen.\n\nDas einfachste CD- und DVD-Brennprogramm wurde entscheidend erweitert und verbessert. Dateien beliebig zusammenstellen und brennen mit dem Xtra Assistenten.\n\nSo einfach soll Brennen sein!\nSie ziehen die Dateien in den Assistenten, und Alcohol 120% sagt Ihnen, ob Sie eine CD, eine DVD oder eine Blu-ray-Disk fuÃƒÂ¼r die Datenmenge benÃƒÂ¶tigen. Die erstellten Daten werden ÃƒÂ¼bersichtlich archiviert, falls Sie spÃƒÂ¤ter noch eine weitere Kopie brennen wollen. Diese Benutzerfreundlichkeit und Einfachheit ist ungeschlagen, auch von derhÃƒÂ¤rtesten Konkurrenz.\n\n* Erstellen Sie Medien mit Daten, Fotos und MP3s,ganz egal ob CD, DVD oder Blu-ray-Disk\n* Umfangreiche Backups endlich einfach zu erstellen - auf Blu-ray-Disk\n\nGanze Blu-rays, DVDs und CDs 1:1k opieren - so bequem geht es nur mit Alcohol 120%\nLegendÃƒÂ¤r, schnell, einfach ... und jetzt auch fÃƒÂ¼r Blu-ray-Disks. Mit dieser neuesten Version von Alcohol 120% lassen sich jetzt auch Blu-ray-Disks kopieren und auf der Festplatte archivieren.\n\n* Perfekte 1:1-Kopien von CDs, DVDs und Blu-ray-Disks\n* Kopiert Filme, Musik, Software und Games(PC, Playstation)\n* Brennt die Image-Formate ISO, BIN, NRG, MDS, CCD, CDI, BWT, BWI, BWA, B5T, B6T, ISZ, PDI\n\nHighlights:\n* Neu! Brennen beliebiger Datenzusammenstellungenmit dem Xtra Wizard\n* Neu! Foto- und MP3-Medien mit dem Xtra Wizard brennen\n* Neu! UnterstuÃ‚Â¨tzung fuÃ‚Â¨r die aktuellsten Brennertypen (Blu-ray, Single-, Double-, Dual-Layer-DVDs)\n* Neu! Schnellere und stabilere Reading/Writing Engine sowie Dumping/Burning Engine\n* Neu! VergrÃƒÂ¶ÃƒÅ¸erter Brennpuffer: 256 MB fuÃ‚Â¨r 32-Bit-Systeme, bis zu 1024 MB Puffer fuÃ‚Â¨r 64-Bit-Systeme\n* Testsieger! Bis zu 31 virtuelle CD-, DVD und Blu-ray-Laufwerke\n* Brennt mehr als ein Medium gleichzeitig: kopieren, was das Zeug hÃƒÂ¤lt!\n\nBackup: Kopieren Sie ganz einfach Ihre Dateien auf eine CD, DVD oder Blu-ray-Disk und erstellen Sie so in einem Schritt ein Backup auch umfangreicher Datenmengen.MP3-CDs: Stellen Sie Ihre Musiksammlung auf CD oder bis zu 54 GB Musikdaten auf einer Blu-ray-Disk zusammen!\n\nFotomedien: Auf eine Blu-ray-Disk passen 50.000 Fotos,so kÃƒÂ¶nnen Sie ganz einfach auch groÃƒÅ¸e Fotosammlungen\nsichern und auch weitergeben.\n\nVirtuelle Laufwerke - CDs einlegen ade! Vergessen Sie das lÃƒÂ¤stige Einlegen von CDs und DVDs! Einmal auf die Festplatte eingelesen, lassen sich die Daten von allen nicht kopiergeschuÃ‚Â¨tzten Medien einfach in virtuelle Laufwerke einbinden, die sich exakt so verhalten wie ein echtes Laufwerk.\n\n* Bis zu 31 virtuelle CD-, DVD- oder Blu-ray-Laufwerke fuÃ‚Â¨r maximale Spielepower\n* UnterstuÃ‚Â¨tzung fuÃ‚Â¨r noch mehr Images und ISO-File-Typen\n\nBitte beachten Sie: Nach dem novellierten Urheberrechtsgesetz (Ã‚Â§ 95a UrhG) kÃƒÂ¶nnen und duÃ‚Â¨rfen Sie mit Alcohol 120% nur CDs und DVDs ohne wirksame technische KopierschutzmaÃƒÅ¸nahmen kopieren.\n\nAlcohol 120%, hier ist der Name Programm. Denn hier brennt's!\nAlcohol 120% erstellt schnell und unkompliziert 1:1-Kopien von CD, DVD oder Blu-ray.\nEinlegen - kopieren - fertig.\nMit Alcohol 120% ist das VervielfÃƒÂ¤ltigen und Sichern kein Problem. Legen Sie einfach eine CD, DVD oder Blu-ray ein, den Rest uÃ‚Â¨bernimmt Alcohol 120% fuÃ‚Â¨r Sie. Wenn Sie Probleme hatten, mit anderen Programmen CD, DVD\noder Blu-ray zu kopieren, ist Alcohol 120% die LÃƒÂ¶sung, die Siesuchen. Es kopiert das, was andere oftmals nicht kÃƒÂ¶nnen.\n\nNeu!\nErstmals bietet Alcohol 120% neben der weltbesten Kopierfunktion auch das umfassende Brennen und Sichern von\nDaten, Videos und Musik. Mit dem neuen Xtra Assistenten stellen Ihre eigenen Disks und Medien zusammen und brennen\ndiese direkt auf den DatentrÃƒÂ¤ger Ihrer Wahl oder speichern sie als Image-Datei ab. Sie benÃƒÂ¶tigen also keine weitere Brennsoftware mehr. Alcohol 120% 5.0 - die komplette Brennsuite.\n\nAlcohol Virtual DVD/CD - Testsieger\nDie beste Software fuÃ‚Â¨r virtuelle Laufwerke -unabhÃƒÂ¤ngig vom DatentrÃƒÂ¤ger Software, Videos, Games und Musik genieÃƒÅ¸en! Mit der Virtual-Drive-FunktionalitÃƒÂ¤t von Alcohol 120% kÃƒÂ¶nnen Sie bis zu 31 virtuelle Laufwerke anlegen und Ihre wertvollen Original-CDs, DVDs oder Blu-rays zu Hause lassen. Die virtuellen Laufwerke binden alle gÃƒÂ¤ngigen Image-Formate ein. Egal ob diese mit Alcohol 120% selbst erstellt wurden, von anderen Brennsoftwareprodukten oder aus dem Internet stammen.\n\nSystemvoraussetzungen:\nMicrosoft Windows Vista/XP, Pentium 4, 1,8 GHz, mindestens 512 MB RAM, 400 MB freier Festplattenspeicher plus zusÃƒÂ¤tzlicher Speicher fuÃ‚Â¨r die Images, Grafikkarte mit mind. 1024 x 768 Pixeln AuflÃƒÂ¶sung, 16 Bit Farbtiefe (HighColor), CD-/DVD-Laufwerk, CD-/DVD-Brenner, unterstuÃ‚Â¨tzt auch Blu-ray-Laufwerke und Blu-ray-Brenner, Microsoft DirectX 9.0 oder hÃƒÂ¶her, fuÃ‚Â¨r Playstation-Spielekopien: Mod-Chip fuÃ‚Â¨r Playstationcjwer\n\n\n\nbitte was seeden\n\ngruss pier","torrent":{"xt":"urn:btih:8456bf9f0b512c9ea471b2387aa364c25244bf4f","amp;dn":"Alcohol+120%25+5.0+Blu-ray","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8456bf9f0b512c9ea471b2387aa364c25244bf4f","infoHashBuffer":{"type":"Buffer","data":[132,86,191,159,11,81,44,158,164,113,178,56,122,163,100,194,82,68,191,79]},"announce":[],"urlList":[]}}