{"title":"Faster Pussycat - House Of Pain","uid":5123792,"size":163465220,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:846f2c792caecf57ab3201df581501b0bd424d11&amp;dn=Faster+Pussycat+-+House+Of+Pain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1255499669,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nFaster Pussycat is an American hard rock band from Los Angeles, California formed in 1986.The group was most successful during the late 1980s with their self-titled debut album and their 1989 gold album Wake Me When It's Over.\n\nThe band released their debut album Faster Pussycat in 1987, the same year Guns N' Roses released Appetite for Destruction. Although Guns N' Roses would overshadow Faster Pussycat in album sales, the band managed to build a cult following and put out several promotional videos from the first album for songs such as &quot;Cathouse&quot;, &quot;Bathroom Wall&quot; and &quot;Don't Change That Song&quot;. In the United States the band toured with Alice Cooper, David Lee Roth, and MotÃƒÂ¶rhead in support of the album.\n\nAlso in 1987, Faster Pussycat appeared in the Rockumentary film, The Decline of Western Civilization part 2 - The Metal Years. The band was interviewed at some length and performed live versions of &quot;Cathouse&quot; and &quot;Bathroom Wall&quot;.\n\nTwo years later, Faster Pussycat would record their most successful album Wake Me When It's Over. The album received gold status; its sales being largely boosted by the hit single, &quot;House of Pain&quot;. While the band were touring for the album in 1990, drummer Mark Michals was arrested in Omaha, Nebraska for trying to mail heroin to his hotel room and was subsequently kicked out of the band. Frankie Banali of Quiet Riot filled in as drummer for the remainder of the tour, then Brett Bradshaw became Faster Pussycat's new long-term drummer. Tours with KISS and MÃƒÂ¶tley CrÃƒÂ¼e followed.\n\nWake Me When It's Over is Faster Pussycat's second album, moving from the glam rock sound of their first album to a blues-influenced sound.\n\nMusic videos were produced for &quot;Poison Ivy&quot; and &quot;House of Pain&quot;. &quot;House of Pain&quot; rose as far as #28 in the Billboard Hot 100 and the video was in rotation on MTV. The album itself peaked at #48 in the Billboard 200.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:846f2c792caecf57ab3201df581501b0bd424d11","amp;dn":"Faster+Pussycat+-+House+Of+Pain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"846f2c792caecf57ab3201df581501b0bd424d11","infoHashBuffer":{"type":"Buffer","data":[132,111,44,121,44,174,207,87,171,50,1,223,88,21,1,176,189,66,77,17]},"announce":[],"urlList":[]}}