{"title":"Asia - The DVD Collection  + Go","uid":5501372,"size":1516478294,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:84f2808cefef9c3e81aad49ce2b152897bb90354&amp;dn=Asia+-+The+DVD+Collection++%2B+Go&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rubusdemonoid","files":-1,"time":1271551379,"description":"Please help to seed this torrent when you are completed as my ISP has a monthly limit that I always max out on since I have over 50 torrents that I seed for you all. My ISP is going to terminate my service if I max out my monthly limit, so I just can't continue to seed all by myself so often. PLEASE help to seed. Thank you.  :)\n\n\n\nAfter grumbling that I couldn't find the music videos online by one of my FAVORITE bands, Asia, I went to their site and purchased the DVD.  :D \n\nI know there were others that were interested in these music videos, so HERE they ARE. Enjoy!  ;D \n\nThe music videos included are the only five available on DVD. They are:\n1 - Heat Of The Moment\n2 - Only Time Will Tell\n3 - Wildest Dreams\n4 - Don't Cry\n5 - The Smile Has Left Your Eyes\n*added a TV-rip (not the best quality, but only copy I've ever found) of the video for their song 'Go' from their Astra album. I don't recall where I got it, so thank you to the original uploader.\n\n\nP.S. - I noticed something odd - I clearly recall that in the video for 'Heat Of The Moment' that when John Wetton sings the lyrics &quot;You catch the pearl and ride the dragon's wings&quot;, that there was an animated video clip of the dragon from the cover of their first album of the dragon flying around a large, white globe (pearl) in the sea. However, in this version on the DVD, you can see how they inserted a second flashing of John Wetton's face singing. Hmm, why did they take out the animation of the dragon? I thought it was pretty cool.\n\n\n\nMore of my music &amp; movie downloads that you may find of interest are located here: &lt;a href=&quot; http://thepiratebay.se/user/rubusdemonoid/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/rubusdemonoid/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:84f2808cefef9c3e81aad49ce2b152897bb90354","amp;dn":"Asia+-+The+DVD+Collection++%2B+Go","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84f2808cefef9c3e81aad49ce2b152897bb90354","infoHashBuffer":{"type":"Buffer","data":[132,242,128,140,239,239,156,62,129,170,212,156,226,177,82,137,123,185,3,84]},"announce":[],"urlList":[]}}