{"title":"300 2006 ibarak","uid":5663301,"size":2246432887,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:85346875fe5d106a2b93d569505f6f500c8175b6&amp;dn=300+2006+ibarak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ibarak","files":4,"time":1278045449,"description":"Reparto:\n\nGerard Butler (Rey Leonidas)\nLena Headey (Reina Gorgo)\nDominic West (Theron)\nDavid Wenham (Dilios)\nVincent Regan (Capitan)\n\nDirector: Zack Snyder\nGuionista: Zack Snyder, Kurt Johnstad y Michael Gordon (Basada en la novela grÃƒÂ¡fica de Frank Miller y Lynn Varley)\n\n\nUna historia basada en hechos reales (segÃƒÂºn los asiÃƒÂ¡ticos, bastante tergiversados), trata sobre la invasiÃƒÂ³n Persa a tierras griegas y cÃƒÂ³mo estos se defendieron valientemente y honorablemente ante los depravados invasores...\n\nUna explosiÃƒÂ³n de imagen, acciÃƒÂ³n y violencia, con escenas de lucha magistralmente trabajadas... nada mÃƒÂ¡s que eso, la historia resulta demasiado llevada a los &quot;buenos&quot; contra los &quot;malos&quot;, mostrando a los buenos exageradamente buenos, correctos, hermosos, amigables, amorosos... y a los malos exageradamente horribles, perversos, feos... Por supuesto que se sabe que estas cosas nunca son asi, que esto de los buenos y malos es muy relativo, y de ahÃƒÂ­ el enojo razonable de los historiadores afganos y de la regiÃƒÂ³n que en su momento era el imperio Persa, por como mostraron a sus antepasados y a su cultura.\nMe parece que exageraron un poco mucho todo esto, sobre todo Frank Miller (creador del cÃƒÂ³mic), y en cierta forma es una falta de respeto para esa gente, me parece que de hacer algo asÃƒÂ­ habrÃƒÂ­a que limitarse a hacer todo ficticio, cambiando nombres, culturas, pueblos, para no ofender a nadie. Igualmente se sabe que Miller es un ultraconservador de derecha y cercano a ser un xenÃƒÂ³fobo racista, por lo cual no sorprende su visiÃƒÂ³n de la realidad, tambiÃƒÂ©n hay que tener en cuenta que esta pelÃƒÂ­cula saliÃƒÂ³ en el 2006, aÃƒÂ±o en el que hacÃƒÂ­a falta para EEUU fortalecer los valores bÃƒÂ©licos y seguir mostrando como seres horribles a sus enemigos de toda la vida (el medio oriente).\n\nLa pelÃƒÂ­cula es muy entretenida, con imÃƒÂ¡genes impactantes, personalmente la miro de vez en cuando porque es muy fÃƒÂ¡cil de mirar y, mÃƒÂ¡s allÃƒÂ¡ de la cierta indignaciÃƒÂ³n que me generan estas tergiversaciones de la historia, es una pelÃƒÂ­cula para disfrutar por otras cosas. Muy del estilo de Snyder, un director muy idÃƒÂ³neo para la acciÃƒÂ³n y entretenciÃƒÂ³n, un mago de la imagen.\n\n\n\n--------------------------------------------------------------------------------\n\n\nidioma: inglÃƒÂ©s   |    subs: espaÃƒÂ±ol (archivo aparte)\n\nduraciÃƒÂ³n: 1:56:32\n\nVideo\n\nBRRip \nformato: mp4\nresoluciÃƒÂ³n: 1280x544\nbitrate: 2565kbps\nfps: 23\n\nAudio\n\nbitrate: 432kbps\n48khz\n &lt;a href=&quot;\nhttp://ojo-al-cine.blogspot.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ojo-al-cine.blogspot.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:85346875fe5d106a2b93d569505f6f500c8175b6","amp;dn":"300+2006+ibarak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85346875fe5d106a2b93d569505f6f500c8175b6","infoHashBuffer":{"type":"Buffer","data":[133,52,104,117,254,93,16,106,43,147,213,105,80,95,111,80,12,129,117,182]},"announce":[],"urlList":[]}}