{"title":"Get Smart - Olho Vivo","uid":5058777,"size":732507343,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:85c9a97c1308d30f7521e501c7bb87d1bcb551e1&amp;dn=Get+Smart+-+Olho+Vivo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"OscarAlhoII","files":-1,"time":1250558680,"description":"SE AS LEGENDAS NÃƒÆ’O APARECEREM, INSTALA ISTO:  &lt;a href=&quot;\nhttp://www.codecguide.com/download_k-lite_codec_pack_basic.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.codecguide.com/download_k-lite_codec_pack_basic.htm&lt;/a&gt;\n\n\nMaxwell Smart works for a Government spy agency in an administrative capacity. When the agency's head office is attacked, the Chief decides to assign Maxwell as a spy and partners him with sexy Agent 99, much to her chagrin. The duo nevertheless set off to combat their attackers by first parachuting off an airplane and landing in Russian territory - followed closely by a over seven foot tall, 400 pound goon, known simply as Dalip. The duo, handicapped by Maxwell's antics, will eventually have their identities compromised, and may be chalked up as casualties while back in America their attackers have already planted a bomb that is set-up to explode in a concert.\n\n\n\nNa mais recente comÃƒÂ©dia de acÃƒÂ§ÃƒÂ£o &quot;Get Smart - Olho Vivo&quot;, Maxwell Smart (Steve Carell) tem como missÃƒÂ£o contrariar a ÃƒÂºltima tentativa de dominaÃƒÂ§ÃƒÂ£o mundial, levada a cabo pelo sindicato do crime conhecido como KAOS.\nQuando a sede da agÃƒÂªncia de espiÃƒÂµes dos E.U.A., Control, ÃƒÂ© atacada e as identidades dos seus agentes comprometidas, o Chefe (Alan Arkin) nÃƒÂ£o tem escolha a nÃƒÂ£o ser promover o seu analista ansioso, Maxwell Smart, que sempre sonhou em trabalhar no campo ao lado do famoso Agente 23 (Dwayne &quot;The Rock&quot; Johnson). No entanto, Smart vai ser parceiro do ÃƒÂºnico outro agente cuja identidade nÃƒÂ£o foi comprometida: a encantadora mas letal veterana Agente 99 (Anne Hathaway). Cada vaz mais prÃƒÂ³ximos da KAOS, Smart e 99 descobrem que o colaborados Siegfried (Terence Stamp) e o seu assistente Shtarker (Kenneth Davitan) estÃƒÂ£o a planear ganhar dinheiro com a sua rede de terror. Com a sua pouca experiÃƒÂªncia de campo, Smart - armado apenas com alguns spy-tech gadgets e seu entusiasmo desenfreado - tem de derotar a KAOS se quiser salvar o dia.\n\n\n\n\n Olho Vivo.avi\n698 Mb\n\n1:45:25\n126 Kb/s\n640x352\n25 fps\nAudio-126 Kb/s\n\n\n Olho Vivo.srt\n105 Kb/s","torrent":{"xt":"urn:btih:85c9a97c1308d30f7521e501c7bb87d1bcb551e1","amp;dn":"Get+Smart+-+Olho+Vivo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85c9a97c1308d30f7521e501c7bb87d1bcb551e1","infoHashBuffer":{"type":"Buffer","data":[133,201,169,124,19,8,211,15,117,33,229,1,199,187,135,209,188,181,81,225]},"announce":[],"urlList":[]}}