{"title":"Black Sabbath - Die Young","uid":5111076,"size":151992324,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:864241f50fd9407893f010d09781119f758cf1f7&amp;dn=Black+Sabbath+-+Die+Young&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1254740217,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Die Young&quot; is a single by British heavy metal band Black Sabbath from their 1980 album, Heaven and Hell.\n\nThe lyrics were written by Ronnie James Dio, and concern consumerism and the futility of life in the modern era- the song title comes from the expressed desire to 'die young'. The song is notable for its middle section which features keyboard and soft high-register vocals.\n\nIt was performed live during almost all Dio era concerts and later on sometimes with Ian Gillan and Tony Martin on vocals. Black Sabbath guitarist Tony Iommi customarily plays a lengthy instrumental introductory passage to the song when performing live with heavy atmospheric keyboard backing, a practice dating back to the Tony Martin era Sabbath. A live rendition can be heard on Live from Radio City Music Hall, recorded in 2007 by Heaven and Hell, a band formed of past members of Black Sabbath from the Mob Rules and Dehumaniser era lineups.\n\nHeaven and Hell is the ninth studio album by Black Sabbath, released in 1980. This is their first album featuring Ronnie James Dio, and first with producer Martin Birch.\n\nThis was the first album after singer Ozzy Osbourne was fired from the band and replaced with Ronnie James Dio. Geoff Nicholls of Quartz also joined the band as a possible replacement for Geezer Butler who had not been around through most of the writing sessions and was going through a divorce at the time. When Butler decided to stay with the group, Nicholls switched to keyboards. Nicholls remained as Black Sabbath's keyboard player for over twenty years, usually playing live shows from off-stage.\n\nDrummer Bill Ward completed this album, but drinking and other personal factors would eventually lead him to drop out of the subsequent tour. His mid-tour replacement Vinny Appice would become an official member.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:864241f50fd9407893f010d09781119f758cf1f7","amp;dn":"Black+Sabbath+-+Die+Young","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"864241f50fd9407893f010d09781119f758cf1f7","infoHashBuffer":{"type":"Buffer","data":[134,66,65,245,15,217,64,120,147,240,16,208,151,129,17,159,117,140,241,247]},"announce":[],"urlList":[]}}