{"title":"Silent.Hill.HDRip-AC3","uid":5049793,"size":2341199872,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:86866f816aa9297bb693fc710cfe4dc276a669db&amp;dn=Silent.Hill.HDRip-AC3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nahla","files":1,"time":1250044317,"description":"SILENT HILL\n\n\tDirecciÃƒÂ³n: Christophe Gans.\nPaÃƒÂ­ses: CanadÃƒÂ¡, Francia y JapÃƒÂ³n.\nAÃƒÂ±o: 2006.\nDuraciÃƒÂ³n: 127 min.\nGÃƒÂ©nero: Terror, acciÃƒÂ³n.\nInterpretaciÃƒÂ³n: Radha Mitchell (Rose DaSilva), Sean Bean (Christopher DaSilva), Laurie Holden (Cybil), Deborah Kara Unger (Dahlia), Kim Coates (Agente Gucci), Tanya Allen (Anna), Alice Krige (Cristabella), Jodelle Ferland (Sharon/Alessa/Oscura Alessa).\nGuiÃƒÂ³n: Roger Avary; basado en el juego creado por Konami.\nProducciÃƒÂ³n: Samuel Hadida y Don Carmody.\nMÃƒÂºsica: Jeff Danna.\nFotografÃƒÂ­a: Dan Laustsen.\nMontaje: SÃƒÂ©bastien PrangÃƒÂ¨re.\nDiseÃƒÂ±o de producciÃƒÂ³n: Carol Spier.\nVestuario: Wendy Partridge.\nEstreno en CanadÃƒÂ¡: 21 Abril 2006.\nEstreno en EspaÃƒÂ±a: 28 Julio 2006.\n\nSINOPSIS\n\nRose (Radha Mitchell), desesperada por encontrar una cura para la misteriosa enfermedad de su hija Sharon, rehÃƒÂºsa ingresar a la niÃƒÂ±a en una instituciÃƒÂ³n psiquiÃƒÂ¡trica a pesar de las recomendaciones de los mÃƒÂ©dicos, y decide huir a Silent Hill, un pueblo del que su hija habla constantemente en sueÃƒÂ±os. A pesar de que su marido Christopher (Sean Bean) se opone al viaje, Rose estÃƒÂ¡ convencida de que la respuesta se encuentra en ese misterioso lugar. Al aproximarse al pueblo desierto, una misteriosa figura se alza en medio de la carretera. Rose, por no atropellarla, tiene un accidente. Cuando vuelve en sÃƒÂ­, Sharon ha desaparecido. A partir de ese momento, acompaÃƒÂ±ada por una agente de policÃƒÂ­a (Laurie Holden), empieza una bÃƒÂºsqueda desesperada en Silent Hill para encontrar a su hija. Las dos mujeres no tardan en darse cuenta de que el pueblo, que quedÃƒÂ³ desierto despuÃƒÂ©s de ser devastado por unos terribles incendios, no se parece a ningÃƒÂºn otro. La niebla es parte ÃƒÂ­ntegra de un paisaje habitado por extraÃƒÂ±os seres. AdemÃƒÂ¡s, el lugar se ve invadido periÃƒÂ³dicamente por una oscuridad viviente que cambia todo lo que toca. Mientras Rose busca a su hija, empieza a conocer la historia de Silent Hill, su pasado violento y puritano, y los orÃƒÂ­genes de la maldiciÃƒÂ³n que sufre, y entiende que su hija forma parte de algo mucho mayor y aterrador.","torrent":{"xt":"urn:btih:86866f816aa9297bb693fc710cfe4dc276a669db","amp;dn":"Silent.Hill.HDRip-AC3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86866f816aa9297bb693fc710cfe4dc276a669db","infoHashBuffer":{"type":"Buffer","data":[134,134,111,129,106,169,41,123,182,147,252,113,12,254,77,194,118,166,105,219]},"announce":[],"urlList":[]}}