{"title":"Astronomers Find Hyperactive Galaxies in the Early Universe","uid":5043647,"size":10521616,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:8693e782fa4ed918a7f54b9d85fb0c97ec7c8e16&amp;dn=Astronomers+Find+Hyperactive+Galaxies+in+the+Early+Universe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"the_Phyrexian","files":5,"time":1249511584,"description":"Astronomers Find Hyperactive Galaxies in the Early Universe\n\nLooking almost 11 billion years into the past, astronomers have measured the motions of stars for the first time in a very distant galaxy and clocked speeds upwards of one million miles per hour, about twice the speed of our Sun through the Milky Way.\n\nThe fast-moving stars shed new light on how these distant galaxies, which are a fraction the size of our Milky Way, may have evolved into the full-grown galaxies seen around us today. The results will be published in the August 6, 2009 issue of the journal Nature, with a companion paper in the Astrophysical Journal.\n\n&quot;This galaxy is very small, but the stars are whizzing around as if they were in a giant galaxy that we would find closer to us and not so far back in time,&quot; says Pieter van Dokkum, professor of astronomy and physics at Yale University in New Haven, Conn., who led the study. It is still not understood how galaxies like these, with so much mass in such a small volume, can form in the early universe and then evolve into the galaxies we see in the more contemporary, nearby universe, which is about 13.7 billion years old.\n\nThe work by the international team combined data collected using NASA's Hubble Space Telescope with observations taken by the 8-meter Gemini South telescope in Chile. According to van Dokkum, &quot;The Hubble data, taken in 2007, confirmed that this galaxy was a fraction the size of most galaxies we see today in the more evolved, older universe. The giant, 8-meter mirror of the Gemini telescope then allowed us to collect enough light to determine the overall motions of the stars using a technique not very different from the way police use laser light to catch speeding cars.&quot; The Gemini near-infrared spectroscopic observations required an extensive 29 hours on the sky to collect the extremely faint light from the distant galaxy, which goes by the designation 1255-0.\n\n&quot;By looking at this galaxy we are able to look back in time and see what galaxies looked like in the distant past when the universe was very young,&quot; says team member Mariska Kriek of Princeton University in Princeton, N.J. 1255-0 is so far away that the universe was only about 3 billion years old when its light was emitted.\n\nAstronomers confess that it is a difficult riddle to explain how such compact, massive galaxies form, and why they are not seen in the current, local universe. &quot;One possibility is that we are looking at what will eventually be the dense central region of a very large galaxy,&quot; explains team member Marijn Franx of Leiden University in the Netherlands. &quot;The centers of big galaxies may have formed first, presumably together with the giant black holes that we know exist in today's large galaxies that we see nearby.&quot;\n\nTo witness the formation of these extreme galaxies astronomers plan to observe galaxies even farther back in time in great detail. By using the Wide Field Camera 3, which was recently installed on the Hubble Space Telescope, such objects should be detectable. &quot;The ancestors of these extreme galaxies should have quite spectacular properties as they probably formed a huge amount of stars, in addition to a massive black hole, in a relatively short amount of time,&quot; says van Dokkum.\n\nThis research follows recent studies revealing that the oldest, most luminous galaxies in the early universe are very compact yet surprisingly have stellar masses similar to those of present-day elliptical galaxies. The most massive galaxies we see in the local universe (where we don't look back in time significantly) that have a mass similar to 1255-0 are typically five times larger than the young compact galaxy. How galaxies grew so much in the past 10 billion years is an active area of research, and understanding the dynamics in these young compact galaxies is a key piece of evidence in eventually solving this puzzle.\n\nThe Hubble Space Telescope observations were made with the Near Infrared Camera and Multi-Object Spectrometer (NICMOS).\n\nThe Gemini observations were made using the Gemini Near Infrared Spectrograph (GNIRS), which is currently undergoing upgrades and will be reinstalled on the Gemini North telescope on Mauna Kea in 2010.\n\nFor illustrations and more information, visit: &lt;a href=&quot;\nhttp://hubblesite.org/news/2009/24&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hubblesite.org/news/2009/24&lt;/a&gt; &lt;a href=&quot;\nhttp://www.gemini.edu&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gemini.edu&lt;/a&gt;\nCONTACT\n\nRay Villard\nSpace Telescope Science Institute, Baltimore, Md.\n410-338-4514\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;9ee8f7f2f2ffecfadeedeaedfdf7b0fbfaeb&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nPeter Michaud\nGemini Observatory, Hilo, Hawaii\n808-974-2510\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;4f3f22262c272e3a2b0f282a22262126612a2b3a&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nAbout the Object\n\nObject Name: 1255-0 (1256-151, 1256-0)\nObject Description: Distant Galaxy\nPosition (J2000): R.A. 12h 54m 59s.59\nDec. +01Ã‚Â° 11' 29&quot;.7\n\nConstellation: Virgo\nDistance: 11 billion light-years or 3.4 billion parsecs\nRedshift z = 2.2\n\nAbout the HST Data\nData Description: Science results are from Hubble data from proposal 10808: P. van Dokkum and S. Toft (Yale University), M. Kriek (Princeton University), M. Franx (University of Leiden, Netherlands), R. Quadri (Yale University), G. Illingworth (University of California, Santa Cruz), D. Marchesini (Yale University), and G. Rudnick (University of Kansas).\n\nInstrument: NICMOS\nExposure Date(s): March 16, 2007\nExposure Time: 2.1 hours\nFilters: F160W (H)\n\nAbout the Gemini Data\nScience Team: The Gemini observations science team comprises: M. Kriek (Princeton University), P. van Dokkum (Yale University), I. LabbÃƒÂ© (Carnegie Observatories), M. Franx (University of Leiden, Netherlands), G. Illingworth (University of California, Santa Cruz), D. Marchesini (Yale University), and R. Quadri (University of Leiden, Netherlands).\n\nInstrument: Gemini Near Infrared Spectrograph (GNIRS)\n\nExposure Date(s): May 2005, February 2006, and March 2007\nExposure Time: 29 hours\nWavelengths: 3000-7500 angstroms\nAbout this Release\nCredit: NASA, ESA, and P. van Dokkum (Yale University)\nRelease Date: August 5, 2009","torrent":{"xt":"urn:btih:8693e782fa4ed918a7f54b9d85fb0c97ec7c8e16","amp;dn":"Astronomers+Find+Hyperactive+Galaxies+in+the+Early+Universe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8693e782fa4ed918a7f54b9d85fb0c97ec7c8e16","infoHashBuffer":{"type":"Buffer","data":[134,147,231,130,250,78,217,24,167,245,75,157,133,251,12,151,236,124,142,22]},"announce":[],"urlList":[]}}