{"title":"Inside the Mirrors","uid":5652879,"size":11609704,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86ad1201613e27ef35e4c52a9b5257a328673677&amp;dn=Inside+the+Mirrors&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FOFPub","files":3,"time":1277697346,"description":"Inside the Mirrors:\nStaring in the mirror you catch a shape moving out of the corner of your eye. The hairs rise on the back of your neck, you thought you were alone. A dark shape, you saw moving down the hallway behind you. You feel that unearthly chill down your back and work to control a slight shiver as you wonder if you are truly alone. Welcome to &quot;Inside the Mirrors,&quot; the first novel written by Jason R. Davis. &quot;Inside the Mirrors&quot; is about Rob Alleto, a Chicago cop who after being injured in a fire while in the line of duty, has moved to become a deputy in a small town. However an old American Indian evil spirit has started to take over, invading the minds of the men and woman of the street that Rob has moved onto. It enters in through their nightmares and speaks to them through their mirrors, driving the men to kill their family and then themselves. Rob thought he was moving to a safe, easy new life, but instead he put him and his family in a situation where he must now find a way to protect them. The evil is already starting to slip into his mind. He must now stop the Winago, before it overwhelms him and his wife. If Rob can't, his soul and that of his family will be lost forever inside the mirrors.\n\nThis book is posted by the Author, Jason R. Davis and I do hope that you enjoy it.  I spent a year writing and editing this book, I hope that if you enjoy this book that you will either recommend it and possibily even purchase it yourself as a Thank You.\n\nIt is available for:\nAmazon Print\n$13.99\n\nDigital\nKindle\n$.99\nItunes\n$1.99\n\n\n","torrent":{"xt":"urn:btih:86ad1201613e27ef35e4c52a9b5257a328673677","amp;dn":"Inside+the+Mirrors","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86ad1201613e27ef35e4c52a9b5257a328673677","infoHashBuffer":{"type":"Buffer","data":[134,173,18,1,97,62,39,239,53,228,197,42,155,82,87,163,40,103,54,119]},"announce":[],"urlList":[]}}