{"title":"[Z-Z] Code Geass 01 - 25 DVDRip (Dual Audio)","uid":5575733,"size":5756640917,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:878e8d2ff315ffc97cae6bc6a30156debcd27ab6&amp;dn=%5BZ-Z%5D+Code+Geass+01+-+25+DVDRip+%28Dual+Audio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"syedshah","files":33,"time":1274379789,"description":"The complete first season of Code Geass.\n\nVideo: 720x400, H.264, MKV, 23fps\nAudio: MP3 @ 192 kbps / 2CH Stereo (AC3 Stereo Eps. 18 - 25)\nLanguages: English &amp; Japanese\nSubtitles: English Text for Songs &amp; Signs and Japanese Audio\n\n\n\nOn August 10th of the year 2010 the Holy Empire of Britannia began a campaign of conquest, its sights set on Japan.\n\nPart #1 (Eps #1-9)\n\nOperations were completed in one month thanks to Britannia's deployment of new mobile humanoid armor vehicles dubbed Knightmare Frames. Japan's rights and identity were stripped away, the once proud nation now referred to as Area 11. Its citizens, Elevens, are forced to scratch out a living while the Britannian aristocracy lives comfortably within their settlements. Pockets of resistance appear throughout Area 11, working towards independence for Japan. Lelouch, an exiled Imperial Prince of Britannia posing as a student, finds himself in the heart of the ongoing conflict for the island nation. Through a chance meeting with a mysterious girl named C.C., Lelouch gains his Geass, the power of the king. Now endowed with absolute dominance over any person, Lelouch may finally realize his goal of bringing down Britannia from within!\n\n\n\nPart #2 (Eps #10-17)\n\nEmbarking on the path of carnage, Zero and his Order of Black Knights have begun operations in the mountainous region of Narita. Using the power of Kallen's Knightmare, the Guren MK-2, a land slide is triggered and a trap is set for the Imperial Princess Cornelia. Just as victory is within arms reach a white flash moves across the battlefield and Lelouch once again finds himself face to face with Suzaku. With Zero unable to escape the Lancelot, C.C. steps forward and unleashes a torrent of mental anguish upon the young Eleven pilot, but will this be enough to ensure escape? As the dust clears from the battle of Narita a number of casualties are revealed, amongst them the name of Shirley's father is revealed. A loathing soon blossoms within her as she sets out for vengeance against the Order of the Black Knights, but once Zero's identity is discovered will she be able to pull the trigger?\n\n\n\nPart #3 (Eps #18-25)\n\nDespite his status as an Eleven, Suzaku Kururugi has been granted the title &quot;Knight of Honor&quot; by Princess Euphemia. Fearing that others might follow Suzaku's example of living peacefully within the Empire, Zero and his Order of Black Knights devise a trap for the Lancelot. While Euphemia and her entourage attend a welcoming ceremony during the arrival of a Britannian aristocrat, the Black Knights stage a surprise attack. With the Lancelot surrounded by enemy forces, Suzaku receives an order from the arriving aristocrat to maintain position in an effort to trap Zero in a fiery barrage, at the risk of losing his own life. Will Suzaku sacrifice himself despite Euphemia's objections?\n\n\n","torrent":{"xt":"urn:btih:878e8d2ff315ffc97cae6bc6a30156debcd27ab6","amp;dn":"%5BZ-Z%5D+Code+Geass+01+-+25+DVDRip+%28Dual+Audio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"878e8d2ff315ffc97cae6bc6a30156debcd27ab6","infoHashBuffer":{"type":"Buffer","data":[135,142,141,47,243,21,255,201,124,174,107,198,163,1,86,222,188,210,122,182]},"announce":[],"urlList":[]}}