{"title":"GODZILLA..DVDrip[vice]","uid":5036727,"size":646885848,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8795f7b1898270c460d87b1b6b1823a3463f0291&amp;dn=GODZILLA..DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vicerock","files":-1,"time":1249157075,"description":"GODZILLA DVDrip\n\nVIDEO CODEC Xvid\nRUNTIME 133.07MINS\nVIDEO SIZE 480x272\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC MP3\nAUDIO BITRATE 128\nSAMPLE RATE 44100\nINFO 124 kb/s tot , Joint Stereo \na/v SYNC BASIC\n\nThe film's opening credits play over a montage of French nuclear tests in French Polynesia. A lizard nest is irradiated by the fallout.\n\nYears later, a Japanese fishing ship is attacked by an unseen, giant creature that attacks from below the water. Only one Japanese sailor survives. Traumatized, he is questioned by a french agent from the French Secret Service named Philippe Roache (Jean Reno)in a hospital. His only reply is &quot;Gojira&quot;.\n\nDr. Niko &quot;Nick&quot; Tatopoulos (Matthew Broderick), an NRC scientist, located in the Chernobyl Exclusion Zone researching the effects of radiation on wildlife, is interrupted by the arrival of an agent of the U.S. State Department. He is sent to Panama, escorted by the military, to observe the wreckage of the recovered Japanese fishing ship and a set of massive footprints in the grassy soil. The French agent is also there, observing the scene and introduces himself as an insurance agent. Aboard a military aircraft, Nick identifies skin samples he discovered as belonging to an unknown animal. He dismisses the military's theory that the creature is a reawakened dinosaur, theorising that its origins in French Polynesia make it a mutant animal created by nuclear testing.\n\nMeanwhile, Audrey Timmonds, Nicks ex-girlfriend, has a jerk of a boss and reporter Charles Caiman (Harry Shearer) at a job at WDIF news. She is also friends with Lucy (Arabella Field) and Victor &quot;Animal&quot; Palotti (Hank Azaria) who work at the same job. One day, at a diner, Audrey discovers Nick is on the news and steals Caimans badge so she can be a reporter and impress Nick.\n\nThe same day, a fish catches a big fish and loses his fishing pole. It is turned out to be &quot;Gojira&quot; who is really a two-hundred-foot-tall radioactive mutant marine iguana, then he travels to Manhattan and creates havoc in the city, then disappears. The city is evacuated and the military attempt to destroy Godzilla. Roache wants to find it to so he puts a chip on Mayor Ebert (Michael Lerner)so he can listen to what the military is saying. The military and Nick go into the sewer and finds fish, meaning that he likes fish. They send 12 trucks of fish so they can dump it. He takes the bait, but is scared off by small arms fire and retaliates by breathing strong gusts of combustible wind. After the battle, Nick collects a blood sample. While searching for pregnancy tests, he sees Audrey again. They learn that &quot;Gojira&quot; is pregnant and he reproduces asexually and is collecting food for his children.\n\nWhile Nick is gone, Audrey discovers a tape of the sailor replying &quot;Gojira&quot;. She steals it and turns it into a report but Caiman steals it in response for Audrey stealing his badge and Caiman misnames the creature &quot;Godzilla&quot;. The military is outraged by the broadcasting of the classified tape and Nick is thrown off the team. Nick is then kidnapped by Roache. He and his team have been keeping close watch on events, and now mean to confront Godzilla.\n\nThe military lures out Godzilla again, trying to trap him in the open ground of Central Park, but fail when he flees. Godzilla dives into the waters of the Hudson River, where he is attacked by three U.S. Navy nuclear submarines. Godzilla is shot and appears to be dead.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0120685/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0120685/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY\n\n\nSORRY ABOUT DANGEROUS MINDS DVDrip YESTERDAY I HAD TROUBLE WITH MY SYSTEM AND LOST ALL MY DATA I WILL RE-UP IT AFTER THIS SORRY FOR ANY TROUBLE CAUSED   ","torrent":{"xt":"urn:btih:8795f7b1898270c460d87b1b6b1823a3463f0291","amp;dn":"GODZILLA..DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8795f7b1898270c460d87b1b6b1823a3463f0291","infoHashBuffer":{"type":"Buffer","data":[135,149,247,177,137,130,112,196,96,216,123,27,107,24,35,163,70,63,2,145]},"announce":[],"urlList":[]}}