{"title":"LeToya - She Ain't Got  (Xvid-2nafish)","uid":5025955,"size":66989654,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:879a1a00dd6fc089d50fecd4ca46071b835c0672&amp;dn=LeToya+-+She+Ain%5C%27t+Got++%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1248653670,"description":"Source: TV\n\nFile Info:\n\nVideo: Xvid MPEG-4 Codec (XVID), 640x480, 29.97 fps\nAudio: Uncompressed PCM, 48000 Hz, 16 bit, 2 ch (stereo)\n\n\n&quot;She Ain't Got...&quot; is the second single from LeToya Luckett's second studio album Lady Love.  &quot;She Ain't Got...&quot; has been currently receiving airplay in Australia. As of June 9, &quot;She Ain't Got...&quot; has been the #1 most added song at Rhythmic radio.\n \nThe music video was shot on June 3, 2009. It was directed by Bryan Barber. The video features guest star Major League Baseball players Orlando Hudson and Matt Kemp of the Los Angeles Dodgers and Baseball Hall of Famer Dave Winfield. The video was released on June 30, 2009.\n\nShe is seen accidentally finding out through a short text message in her love interest's (played by Sean Newman) cell phone that he is cheating on her. Then, she is shown involved in a heated argument with him at a crowded nightclub where she is tapped to make a performance.\n\nLeToya Nicole Luckett (born March 11, 1981), known professionally as LeToya, is an American R&amp;B singer-songwriter and actress. She was a founding member of the R&amp;B female group Destiny's Child, with whom she won two Grammy Awards and released many successful commercial recordings and she was known as one of the best friend of the singer actress Beyonce Knowles.\n\nAfter signing a record deal with Capitol Records, she pursued a successful solo career. Her solo debut album, LeToya (2006), topped the U.S. Billboard 200 albums chart in July 2006 and was certified platinum by the RIAA in December 2006. The single, &quot;Torn&quot;, achieved records on BET's top ten countdown show 106 &amp; Park. She was also named &quot;One of the Best New Artists of 2006&quot; by AOL and the &quot;Top Songwriter of 2006&quot; by ASCAP. LeToya is releasing her sophomore album &quot;Lady Love&quot; in Summer 2009.\n\nLady Love is the second album set to be released by the American R&amp;B singer LeToya Luckett. It will be released by Capitol Music Group on August 25, 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:879a1a00dd6fc089d50fecd4ca46071b835c0672","amp;dn":"LeToya+-+She+Ain%5C%27t+Got++%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"879a1a00dd6fc089d50fecd4ca46071b835c0672","infoHashBuffer":{"type":"Buffer","data":[135,154,26,0,221,111,192,137,213,15,236,212,202,70,7,27,131,92,6,114]},"announce":[],"urlList":[]}}