{"title":"Ginuwine - Trouble","uid":5096334,"size":143740932,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:881be0adc8cec933c627801cfa9ed257b5851eef&amp;dn=Ginuwine+-+Trouble&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1253606315,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nA Man's Thoughts is the sixth studio album from American R&amp;B singer Ginuwine. It was set to be released June 2 but was pushed back to June 23, 2009. The album received average critical reception from pop critics.\n\nThe first single from the album is &quot;Last Chance&quot;, which was produced by Bryan-Michael Cox and written by Adonis Shropshire. The single speaks about a man's plea for one last chance to prove his love. &quot;'Last Chance' reflects the maturity of my personal growth over the last few years,&quot; explains the singer. A video for the single was recently shot in Los Angeles and will feature appearances from singer Tyrese and actress LisaRaye. It was directed by Juwan Lee, who has also done work with Mario, Nelly and Young Capone.\n\n&quot;Last Chance&quot; was released to Urban AC radio on March 3 and was released to mainstream urban markets on March 24. On March 26, on 106 &amp; Park Ginuwine stated that his second single will feature Missy Elliott and describe to album as a sort of reunion. He also stated that he had not spoken to Timbaland within 5 years, because they simply grew apart.\n\nDespite &quot;Get Involved&quot; being listed as the second single for the album, the track &quot;Trouble&quot; featuring Bun B was the second music video to be shot and released. The music video was done for the version of the track that did not feature Bun B.\n\nElgin Baylor Lumpkin (born October 15, 1975), better known by his stage name Ginuwine, is an American R&amp;B singer and performer. Signed to Epic Records since the mid-1990s, Ginuwine has released a number of multi-platinum and platinum-selling albums and singles, becoming one of R&amp;B's top artists during the 1990s heyday of hip-hop soul. \n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:881be0adc8cec933c627801cfa9ed257b5851eef","amp;dn":"Ginuwine+-+Trouble","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"881be0adc8cec933c627801cfa9ed257b5851eef","infoHashBuffer":{"type":"Buffer","data":[136,27,224,173,200,206,201,51,198,39,128,28,250,158,210,87,181,133,30,239]},"announce":[],"urlList":[]}}