{"title":"P32DASM","uid":5562276,"size":327967,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8885b5895f60523ceb500b621d24517a26e81943&amp;dn=P32DASM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ContraX","files":1,"time":1273870680,"description":"P32DASM\n\n\nP32Dasm is a VB PCode + Native code Decompiler. It can generate String, Numbers,\nObjects, Import and Export function listing. There is also PCode Jump calculator.\nYou can set shortcut to your favorite hex editor for fast patching. \n\nTips &amp; Tricks\n=============\n- You can edit output by pressing  button &quot;Edit&quot;.  Now you can color interesting\n  sections, write yours comments, etc ...\n- For fast moving you can use Position manager. Set cursor to some position click\n  in Position manager to  &quot;Add&quot; button and enter your description.  Any time you\n  need fast jump to your location just doubleclick to your list.\n- For VB Native code executables are generated only  MSVBVM,  External calls and\n  string references. Usefull for setting BPX, you don't need search  in debugger\n  where start some Command Button event etc ...\n- On BIG apps I don't recommend use option &quot;Use syntax highlight color&quot; - it's \n  slow, use normal mode\n- If you still need syntax highlighting you can use included Syntax highlighting\n  for UltraEdit. Just add it to the end of original &quot;wordfile.txt&quot;.\n- By some problems you can decompile only some parts with &quot;Decompile from offset&quot;\n  function. Experienced users only! or read below\n- Procedure window has two modes:\n  1) &quot;Full Decompiling&quot; ON - by DblClicking on procedure you can search it\n  2) &quot;Full Decompiling&quot; OFF - by DblClicking you can manually decompile selected\n  procedure. (you don't need decompile whole file, you can explore it on the fly,\n  fastest decompile solution!)\n- In Object list you can see Object Type displayed with appropriate Icon\n- At the beginning of  decompiled output you can see sometime original procedure\n  names - this helps you identify missing names for some procedures\n- vbCRLF, vbCR, vbLF, vbNullChar, vbTab - are VB constants not strings\n- You can easy search for Jumps  by clicking  on Offset and selecting from right\n  MouseClick Option &quot;Search:&quot; and you can continue search with F3 key\n- You can change Label of autogenerated Position with  &quot;Label&quot; button or current\n  Position in main Screen with &quot;Position&quot; Button. There is possibility also save\n  your own Position file.\n- You can easy jump to specified Offset by clicking on Offset and selecting from\n  right MouseClick Option &quot;Internal HexEditor Offset:&quot;. Immediately start editor\n  and you are on your offset so you can start patching.\n- If you want use also HIEW for direct jump, then in Options set in path %1 e.g.\n  &quot;your_pathhiew.exe %1&quot;  and in output click inside some offset and click run.\n  P32Dasm has algo to detect if it's offset  or memory address.  Address must be\n  in format XXXXXXXX:  (check if your HIEW version support jump from commandline\n  /O param)\n- You can generate  .map files which you can import to  DataRescue IDA  (LoadMap\n  plugin) or to Olly Debugger (MapConv plugin).\n","torrent":{"xt":"urn:btih:8885b5895f60523ceb500b621d24517a26e81943","amp;dn":"P32DASM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8885b5895f60523ceb500b621d24517a26e81943","infoHashBuffer":{"type":"Buffer","data":[136,133,181,137,95,96,82,60,235,80,11,98,29,36,81,122,38,232,25,67]},"announce":[],"urlList":[]}}