{"title":"Al Emmo and the Lost Dutchman's Mine","uid":5053691,"size":728979436,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8982f269a4d5592b6590a676bf04d007a00a3eca&amp;dn=Al+Emmo+and+the+Lost+Dutchman%5C%27s+Mine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Dark_Is_Rising","files":4,"time":1250292213,"description":"Al Emmo and the Lost Dutchman's Mine\n\nPublisher: Himalaya Studios, LLC\nDeveloper: Himalaya Studios, LLC\nCategory: Adventure\nMedia: Release Date\nN Amer: 09/06/2006 &lt;a href=&quot;\nhttp://www.himalayastudios.com/wq.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.himalayastudios.com/wq.htm&lt;/a&gt;\n\n========================================================================\n\nAl Emmo and the Lost Dutchman's Mine is an adventure game created by Himalaya Studios for the PC. It utilizes hand-painted backgrounds and pre-rendered 3D character animation frames. The game is designed to be a homage to the classic Sierra and Lucasarts style point and click classic adventure games of the 1980s and 1990s.\n\nThis game is the first original and commercial game created by Himalaya Studios, although the same team is also responsible for designing the King's Quest 1 and 2 remakes at AGD Interactive, and drew upon this experience to create Al Emmo. The game runs on the popular Adventure Game Studio engine, and shows off some of the engine's more versatile features such as fully lipsynched dialogue portraits and its ability to handle complex animations. The plot is based loosely around a well-known legend in Arizona, the Lost Dutchman's Gold Mine. \n\n&quot;Al Emmo and the Lost Dutchman's Mine&quot; is a classic-style graphical adventure game for the PC. In pursuit of unrequited love and inconceivable fortune, a feeble, middle-aged easterner named Al Emmo embarks on a perilous journey into the untamed desert valley of Anozira. Unprepared for the harsh elements (and even harsher residents) that await him, Al's only respite comes in the form of a beautiful local woman, Rita Peralto, who is also the object of every other man's affections. Al soon discovers that Rita is inexplicably linked to a centuries-old mystery involving an ancient gold mine--the location of which has been lost to the ages! There are also rumours of a horrific curse lingering within the mine's dank depths, waiting to lay claim to any mortal foolish enough to venture inside in search of its riches... \n\nWith imaginative and memorable characters, laugh-out-loud dialogue, a captivating storyline, and a breathtaking illustrated world, &quot;Al Emmo and the Lost Dutchman's Mine&quot; will enchant anyone longing for an adventure game reminiscent of the celebrated classics of yesteryear. We hope you enjoy it! \n========================================================================\n\nGAME FEATURES \n-------------\n\n# High-resolution, hand-painted 2D background illustrations\n# 3D pre-rendered character animations\n# Detailed dialogue portraits of over 24 interactive characters\n# Lip-synched voice pack\n# More than two hours of beautiful, original musical score\n# Much, much more...\n\nAl Emmo and the Lost Dutchman's Mine is a fictional comedy with emphasis on communication and exploration.\n\nFull screen dialogue pictures, beautifully illustrated by hand, allow deep interaction with all NPCs. High-color, hand painted backgrounds create a gaming world that is truly a work of art.\n\nBuilt on AGS, one of the most feature-intensive game development engines around, the game utilizes state-of-the-art prerendered 3D graphics, harnessing today's leading technology and submersing the player into a performance-rich world of sound and images.\n========================================================================\n\nREVIEWS\n------- &lt;a href=&quot;\nhttp://www.justadventure.com/reviews/AlEmmo/AlEmmo.shtm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.justadventure.com/reviews/AlEmmo/AlEmmo.shtm&lt;/a&gt; &lt;a href=&quot;\nhttp://www.adventuregamers.com/article/id,683&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.adventuregamers.com/article/id,683&lt;/a&gt;\n\n========================================================================\n\nSYSTEM REQUIREMENTS \n------------------- \nThis game is designed for the Windows operating system and should run correctly under Windows 95, Windows 98, Windows ME, Windows 2000, and Windows XP. \n\nFor optimal performance while playing &quot;Al Emmo and the Lost Dutchman's Mine&quot;, your PC must meet the following requirements: \n\n\n-DirectX-compatible video card which supports SVGA display and 32-bit graphics \n-1 MB Video RAM required (2 MB recommended) \n-Pentium or higher processor (800 Mhz or above required) \n-128 MB RAM \n-Windows 95 OSR2, 98, ME, 2000, or XP \n-DirectX 5 or above (DirectX 9.0c recommended) \n-Approximately 350 MB free disk space \n-DirectX-compatible digital sound card \n\n\nIf your system fails to meet the above requirements, you may experience general slowness and choppy gameplay. A Pentium (or equivalent) system above 800Mhz is recommended as a bare minimum. Obviously, a faster system with more RAM is recommended for an optimal gameplay experience. \n\n========================================================================\n\nSCREENSHOTS\n-----------\n\n\n========================================================================\nInstallation Read NFO!","torrent":{"xt":"urn:btih:8982f269a4d5592b6590a676bf04d007a00a3eca","amp;dn":"Al+Emmo+and+the+Lost+Dutchman%5C%27s+Mine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8982f269a4d5592b6590a676bf04d007a00a3eca","infoHashBuffer":{"type":"Buffer","data":[137,130,242,105,164,213,89,43,101,144,166,118,191,4,208,7,160,10,62,202]},"announce":[],"urlList":[]}}