{"title":"WinMend System Doctor 1.4.1 Portable","uid":5049212,"size":16869283,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:899858e85eaa45f1822e6682773038565ee2c2cd&amp;dn=WinMend+System+Doctor+1.4.1+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoExcuses","files":3,"time":1249815861,"description":"WinMend System Doctor v1.4.1 made Portable (Thinstalled).\n\nNo need to install it!\nOr, if you want to, Setup and Serials are included.\n\nWinMend System Doctor is a Windows-based security improvement. With its innovative and intelligent detection engine, WinMend System Doctor can effectively detect and fix security vulnerabilities in the system, fix software vulnerabilities in third-party applications, and prevent the running of malicious startup programs, Trojans, BHOs, processes and system services to significantly improve system security. It also provides an Expert level system scan option to scan potential security threats in the system, protects the system from the intrusion of spyware, adware, Trojans and viruses, and eliminates system security risks.\n\nFeatures\n\n1. Intelligent Scan Engine\nWinMend System Doctor is integrated with a brand-new scan engine that can intelligently detect system vulnerabilities in Windows, software vulnerabilities in third-party applications and problems corresponding security settings, and it can help users fix problems found. It simplifies user operation, and helps you solve security risks more promptly and efficiently.\n\n2. Unique System Security Rating System\nWinMend System Doctor can rate the security of your operating system for you to see the security status of the system more visually.\n\n3. Comprehensive and Detailed Security Report\nWinMend System Doctor can generate comprehensive security reports that elaborate all details about each single security vulnerability and potential security threat in your system, so you can understand the security problems in the system and how to fix them with improved clarity\n\n4. Expert-Level System Scan\nAn &quot;Expert&quot;-level system scan is offered by WinMend System Doctor. It scans potential security threats in the system, such as in shared resources, user privilege management, remote control, etc., that could be easily used by malicious programs (or hackers), and can guide you through the steps to fix vulnerabilities and eliminate security risks in the system\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.winmend.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.winmend.com/&lt;/a&gt;\n\n\n\nThis has been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=34&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=34&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:899858e85eaa45f1822e6682773038565ee2c2cd","amp;dn":"WinMend+System+Doctor+1.4.1+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"899858e85eaa45f1822e6682773038565ee2c2cd","infoHashBuffer":{"type":"Buffer","data":[137,152,88,232,94,170,69,241,130,46,102,130,119,48,56,86,94,226,194,205]},"announce":[],"urlList":[]}}