{"title":"Postcard Profits","uid":5132040,"size":280473564,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:89aca2deaecaa4d327d04674e942d1449e56ee62&amp;dn=Postcard+Profits&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"maxstarr","files":10,"time":1256142003,"description":"Don't you Dare put this amazing course on a shelf and forget about it.\n\nThank you for downloading Postcard Profits. Just downloading thie package puts you ahead of probably 85% of the people who order a course like this. Don't you dare give up now! You are only 8 simple steps from reaching your financial dreams! Congradulations on your choice to do more than just dream about making more money.\n\nI am not crazy! (Mostly)\nPeople think I'm Crazy when I tell them that you can make tones of money mailing cheap postcards and selling little information products and other products. But once I explain my methods, walk them through it and show them the numbers, they say, &quot;Wow, this is really an exciting business!&quot;\n\nWho the hell am I to be teaching a course like this?\nBefore I discovered all this stuff you're about to learn, I was a carpet cleaner. I'm telling you this because I want you to know where I came from. I wasn't some big corporate guy or even a college graduate from that matter. I came right out of high school trying to figure out how to start a better business and make more money.\n\nHere's why you should listen to me\nIN the last 7 years I've been directly responsible for over $35,000,000 in direct responce generated sales. Mostly from my own businesses but also from several businesses I worked closely with as a consultant.\n\nI will teach you exactly how to copy me\nI've personally taught overa dozen people my techniques before creating this course, and most of them were starting completely from scratch. They've gone on to have huge successes tehmselves. One of my coaching students who started last year is doing $75,000 a week in sales right now as I'm writing this. He had about $700 to his name, and reached that level in just over six months. No Kidding!\n\nI recomend that you go through all the information in order the first time through. Each disc is specifically designed to build on the last one and prepare you for the next. You will definitely miss something crucial by skipping around.\n\nThe simple little 8 step plan\nThe cool thing is you could be dead broke, living on welfare, and if you can scrape together a few bucks for a test, you can have a $1,000,000 a year project within a week. No Joke.\n\nThe Postcard Profits method is a business that you can start cheap, very cheap, compared to other businesses. You can test new ideas very quickly, and using my 8 step method, you can literlay know within 5 days whether of not you have a winner on your hands.\n\nNo more disapoinmtments\nIt's in your hands right now -- Yeah, this is it. The exact, easy to follow course you've been looking for to finally get your bank account in seriously great shape in a ver short time.","torrent":{"xt":"urn:btih:89aca2deaecaa4d327d04674e942d1449e56ee62","amp;dn":"Postcard+Profits","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89aca2deaecaa4d327d04674e942d1449e56ee62","infoHashBuffer":{"type":"Buffer","data":[137,172,162,222,174,202,164,211,39,208,70,116,233,66,209,68,158,86,238,98]},"announce":[],"urlList":[]}}