{"title":"Sanctum Alpha Version 3","uid":5089846,"size":154476134,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:8a927afd9adf5973ea7bb1aae7ee02b770ea0422&amp;dn=Sanctum+Alpha+Version+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Ni-Q","files":-1,"time":1253046373,"description":"===Getting started===\n\nSanctum is a total conversion mod for Unreal Tournament 3 and therefore requires Unreal Tournament 3 to work. It is advisable\nto have it updated to the most current version. (2.1)\n\nIn order to get Sanctum to work, you need to do the following:\n\n1. Extract the folder &quot;Sanctum&quot; and its contents to &quot;Documents and Settings/(Your user name)/My Documents/My Games/Unreal Tournament 3&quot;\n\n   Please note that the folder needs to be in the Unreal Tournament 3 folder, and not the subsequent UTGame folder.\n\n2. Right click on the shortcut file &quot;Sanctum&quot; inside of the Sanctum map and go into the Properties window.\n\n3. Replace the shortcut Target with the directory to your Unreal Tournament 3.exe (UT3.exe) file followed by: -mod=..Sanctum\n\n   For example:\n\n   &quot;C:GamesUnreal tournament 3BinariesUT3.exe&quot; -mod=..Sanctum\n\n   You also need to clear the &quot;Start in&quot; field in your &quot;Sanctum&quot; file properties in order to get it working.\n\n4. Execute the game using the Sanctum file\n\n5. Enjoy!\n\n===Key bindings===\n\nWASD - Movement\nE - Use (Hologram and buttons)\nSpace - Jump\nMouse - Look around and shoot \nMouse Scroll - Swap weapon\n\n===Description===\n\nSanctum is a total conversion mod for Unreal Tournament 3. \nIt is being developed by Coffee Stain Studios, a group consisting of eleven university students at HÃƒÂ¶gskolan i SkÃƒÂ¶vde, Sweden. \nSanctum is a first person tower defense game where you take on the role as Skye, a female elite soldier. \nYour sole purpose is to defend your hometown, Elysion One, from the invading force of mysterious alien creatures. \nChoose from different defensive formations and upgrade deadly turrets to aid you in the defense of the city. \nUse hand held weapons to give you an advantage.\n\nThe underlying reason for developing Sanctum was to take the popular tower defense game mode and get it\ninto a first person perspective. We also developed a quite unique and outstanding art style and feel of the game, \nbeing communicated through choice of colours, musical theme and design on world objects. \nThe style is in distinct contrast to the overall look and feel of Unreal Tournament 3 and thus proves that\nsomething very different can be produced by the popular engine.\n\nThe decision of making a total conversion was made so that we could produce all original\n content instead of re-using the content by Unreal Tournament 3. This means that all the models, \ntextures, sounds and music is or will be developed by us. We are planning on further developing Sanctum\n in a direction where we add Co-op, different game types and additional turret, enemy and weapon types.\n\n===Contact us===\n\nFor more information about Sanctum, visit www.sanctum-game.com","torrent":{"xt":"urn:btih:8a927afd9adf5973ea7bb1aae7ee02b770ea0422","amp;dn":"Sanctum+Alpha+Version+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a927afd9adf5973ea7bb1aae7ee02b770ea0422","infoHashBuffer":{"type":"Buffer","data":[138,146,122,253,154,223,89,115,234,123,177,170,231,238,2,183,112,234,4,34]},"announce":[],"urlList":[]}}