{"title":"Everclear - Heroin Girl  (2nafish)","uid":5675438,"size":98017284,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8b4e6a1424ef9aa2e74c6e6d4ea5ddfb31f65fc8&amp;dn=Everclear+-+Heroin+Girl++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1278460992,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Heroin Girl&quot; is a rock song by the band Everclear from their 1995  album Sparkle and Fade. This song is generally agreed to be about lead singer, Art Alexakis's girlfriend and brother overdosing on heroin; he heard the policeman say &quot;Just another overdose&quot; about his brother's death, a lyric used in the song.\n\nSparkle and Fade is the second album by Everclear, released on May 23, 1995. It was their first album to be released exclusively on Capitol Records; their previous effort, World of Noise, was re-released on Capitol after its introduction through the Portland, Oregon based label, Tim/Kerr Records.\n\nThe album's lead single, &quot;Heroin Girl,&quot; performed well on college radio but did not gain significant mainstream airplay. That would be granted to their follow up, &quot;Santa Monica,&quot; which effectively put Everclear on the map. The next two singles, &quot;Heartspark Dollarsign&quot; and &quot;You Make Me Feel Like A Whore,&quot; would have moderate rotation, but the band wouldn't gain major success again until their next album, So Much for the Afterglow.\n\nThe cover art to Sparkle and Fade features childhood pictures of the three members of the band, with bassist Craig Montoya on the left, guitarist/singer Art Alexakis in the middle, and drummer Greg Eklund on the right.\n\nThe album is Everclear's third best selling album to date with 1 million copies sold. It was dedicated to slain singer Mia Zapata of the Seattle punk rock band The Gits.\n\nEverclear is a rock band formed in Portland, Oregon in 1992 most well known for their radio hits spanning more than a decade. For most of its existence, Everclear has consisted of Art Alexakis (lead guitar, lead vocals), Craig Montoya (bass guitar, backing vocals), and Greg Eklund (drums, percussion, backing vocals). Eklund replaced original drummer Scott Cuthbert in 1994. Montoya and Eklund departed the band in 2003, but Alexakis continued the band with Dave &quot;Davey&quot; French (rhythm guitar), Josh Crawley (keyboards), Sam Hudson (bass guitar), and Tommy Stewart (drums, percussion). However all members except for Alexakis left the band in July 2009 to be replaced with a 3rd lineup of Everclear.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:8b4e6a1424ef9aa2e74c6e6d4ea5ddfb31f65fc8","amp;dn":"Everclear+-+Heroin+Girl++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b4e6a1424ef9aa2e74c6e6d4ea5ddfb31f65fc8","infoHashBuffer":{"type":"Buffer","data":[139,78,106,20,36,239,154,162,231,76,110,109,78,165,221,251,49,246,95,200]},"announce":[],"urlList":[]}}