{"title":"Police State 4, Rise of FEMA (Resized to fit to CD-R), .mp4","uid":5509322,"size":732350931,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8c1e83a3aa9fe40aa335197bfe84cb572548ce97&amp;dn=Police+State+4%2C+Rise+of+FEMA+%28Resized+to+fit+to+CD-R%29%2C+.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"7itanium","files":-1,"time":1271979723,"description":"I shrunk the size down from it's original 1.3GB, so you can download this faster (and so it can fit on a CD-R).  :)\n\nThis is so far the only sub 700MB torrent out there for this video.\n\n=================================\n\nApril 21, 2010\n\nPolice State 4 - The Rise Of FEMA\n\n=================================\n\nTyranny is HERE! The grim future foretold in 1984 has become reality. \n\nThe United States is now recognized globally as one of the most oppressive police states on earth. And it's only getting worse.\n\nPOLICE STATE 4 chronicles the sickening depths to which our republic has fallen. \nVeteran documentary filmmaker Alex Jones conclusively proves the existence of a secret network of FEMA camps, now being expanded nationwide. The military industrial complex is transforming our once free nation into a giant prison camp. A cashless society control grid, constructed in the name of fighting terrorism, was actually built to enslave the American people. Body scanners, sound cannons, citizen spies, staged terror and cameras on every street corner -- it's only the beginning of the New World Order's hellish plan.\n\nThis film exposes how the &quot;Continuity of Government&quot; program has established an all powerful shadow state. Prepare to enter the secretive world of emergency dictatorship, FEMA camps, and a shredded Constitution. Witness police and military savagely attacking innocent citizens as our own government unleashes false flag operations to justify its oppression. Then watch as Alex Jones takes on corrupt mercenary police and exposes mainstream media brainwashing.\n\nTHE POLICE STATE ISN'T COMING, IT'S HERE!\n\n~~~~~~~~~~~~~~~~~~\n\nWe want as many people as possible to view this file, so please seed this file as long as you can, even if you cap it at a certain speed while you use your computer.\n","torrent":{"xt":"urn:btih:8c1e83a3aa9fe40aa335197bfe84cb572548ce97","amp;dn":"Police+State+4%2C+Rise+of+FEMA+%28Resized+to+fit+to+CD-R%29%2C+.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c1e83a3aa9fe40aa335197bfe84cb572548ce97","infoHashBuffer":{"type":"Buffer","data":[140,30,131,163,170,159,228,10,163,53,25,123,254,132,203,87,37,72,206,151]},"announce":[],"urlList":[]}}