{"title":"wisbar advance 3.5b cab cracked","uid":5035359,"size":3100138,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:8d2a111b286acd347348a14c2d9a3cc2556e8a34&amp;dn=wisbar+advance+3.5b+cab+cracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"S3nd41","files":2,"time":1249088347,"description":"Overview\nWisBar Advance 3 expands upon the successful task management features found in the WisBar Advance 2.\n\nIncluded in WisBar Advance 3 is the ability to customize your running applications to a degree not seen in other programs.\n\nUtilizing a smaller memory footprint from previous versions, WisBar Advance 3 keeps your device running as fast as possible, leaving more memory available for any application you may use.\n\nWisBar Advance 3 also brings new life to your PocketPC with the ability to change the appearance of your system to a degree not matched in other software.\n\nYou can read information about WisBar Advance 3 in these languages (links supplied by PocketLand.com):\n (German)\n (Italian)\n (Dutch)\n (French)\n (Spanish)\n\n\n \n\nFeatures\nCompatible with WM2003, WM2003SE, WM5 and WM6 touchscreen devices \nUses a smaller memory footprint than WisBar Advance 2 \nCustomize the close button, the screen orientation and the SIP on a per-application basis \nSwitch between any application currently running on your device \nProvides a cascading start menu (as in the screenshot) \nTap and hold the OK button to cancel a dialog \nAdd or remove functions to the taskbar \nEach button on the taskbar can be assigned a tap and a tap-and-hold action \nPlace shortcuts in the system tray for easier access from the Today screen \nCustomize a &quot;User Menu&quot; with applications of your choosing \nChange the appearance of the taskbar, menubar, buttons and start menu in any program \nSupports QVGA and VGA devices \nCustomize the clock's appearance on the taskbar \nHear sounds for system events, just like on your desktop \nDownload and install themes created by other people\n","torrent":{"xt":"urn:btih:8d2a111b286acd347348a14c2d9a3cc2556e8a34","amp;dn":"wisbar+advance+3.5b+cab+cracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d2a111b286acd347348a14c2d9a3cc2556e8a34","infoHashBuffer":{"type":"Buffer","data":[141,42,17,27,40,106,205,52,115,72,161,76,45,154,60,194,85,110,138,52]},"announce":[],"urlList":[]}}