{"title":"House M.D. S3 disk 6 (dutch subs) 2Lions Team","uid":5027861,"size":4681178280,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8d3318783c4557cab4f0958a002f74d05bdf648d&amp;dn=House+M.D.+S3+disk+6+%28dutch+subs%29+2Lions+Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"filmfan84","files":-1,"time":1248741992,"description":"House M.D. Season 3 Disk 6\n\nWith: Hugh Laurie, Lisa Edelstein, Robert Sean Leonard\n\nDutch\nEpisodes:\nFamily: Een jongen die beenmerg wil doneren aan zijn oudere broer met leukemie, wordt plots zelf ook ziek. Om beide levens te redden zijn extreme maatregelen nodig...\nResignation: House houdt koppig vast aan izjn eerste diagnose van een ddozieke studente, ondanks symptomen die erop wijzen dat de oorzaak elders ligt.\nThe Jerk: Een arrogant schaakwonder wordt met vreemde symptomen in het ziekenhuis binnengebracht, maar het kereltje slaagt er voroal in om de voltallige staf tegen zich in het harnas te jagen.\nHuman Error: Een Cubaans koppel onderneemt een hachelijke oceaanreis om door House verzorg te worden.\n\nEnglish:\nFamily: Wilson prepares to transplant bone marrow from Matty to his brother Nick. But when Matty gets sick, the team must cure him as he's the only safe donor. Meanwhile Foreman deals with the consequences of his mistake and House has a battle of wills with his new pet Hector.\nResignation: The team deals with a 19-year-old college student, while Foreman suddenly and without a reason hands in his resignation. House seems to have already found Foreman's replacement, an attractive nutritionist named Honey.\nThe Jerk: House treats a 16-year-old chess prodigy who gets everyone on the team annoyed with his behavior. Foreman is upset with House because he thinks his boss sabotaged his job interview with another hospital. \nHuman Error: A Cuban couple attempt to get to America by raft... to see House about the wife's heart condition. But when she gets worse House wonders if someone on his staff messed up. Meanwhile Foreman prepares to leave and his departure threatens to shake up the entire team.\n\nGenre: TV Serie\nLanguages: English (5.1)\nSubtitels: Dutch\nFormat ..: PAL\nSource ..: DVD 9 \n \n*******************************************************************************\n\nBrought to you by \nfilmfan84\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n      &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nL&lt;/a&gt;\n\n*******************************************************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \nDon`t quit after you finished the download, but keep seeding.\n\n","torrent":{"xt":"urn:btih:8d3318783c4557cab4f0958a002f74d05bdf648d","amp;dn":"House+M.D.+S3+disk+6+%28dutch+subs%29+2Lions+Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d3318783c4557cab4f0958a002f74d05bdf648d","infoHashBuffer":{"type":"Buffer","data":[141,51,24,120,60,69,87,202,180,240,149,138,0,47,116,208,91,223,100,141]},"announce":[],"urlList":[]}}