{"title":"Corre Lola Corre.DVDrip.(spanish).","uid":5109088,"size":713912320,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8dcb76bd5561d894ae6553c9ad6a0cadf0423ef3&amp;dn=Corre+Lola+Corre.DVDrip.%28spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"zurera","files":1,"time":1254617160,"description":" DirecciÃƒÂ³n: Tom Tykwer\nIntÃƒÂ©rpretes: Franka Potente, Moritz Bleibtreu, Herbert Knaup, Nina Petri, Armin Rohde\nGuiÃƒÂ³n: Tom Tykwer\nMÃƒÂºsica: Reinhold Heil, Johnny Klimek, Tom Tykwer\nFotografÃƒÂ­a: Frank Griebe\nDistribuye en DVD: Walt Disney\nDuraciÃƒÂ³n: 80 min.\n\nGÃƒÂ©nero: AcciÃƒÂ³n\n\nContra el reloj\nFaltan veinte minutos para el mediodÃƒÂ­a. Lola recibe una llamada desesperada de Manni, su novio. Ha perdido 100.000 marcos que debÃƒÂ­a entregar a su turbio jefe a las doce. Manni puede darse por muerto si no entrega el dinero a la hora convenida. Lola piensa rÃƒÂ¡pido y, movida por el amor, corre, corre y corre, dispuesta a lo que sea para sacar a su novio de apuros.\n\nUna agradable sorpresa. Esta pelÃƒÂ­cula alemana del desconocido, fuera de su paÃƒÂ­s, Tom Tykwer, auna una historia universal -la chica que se sacrifica por amor a su chico- con un planteamiento y narraciÃƒÂ³n originales. Tykwer firma el guiÃƒÂ³n y dirige, ademÃƒÂ¡s de participar en la vibrante banda sonora, que se adecÃƒÂºa al ritmo frenÃƒÂ©tico de las imÃƒÂ¡genes.\n\nEl film, en lÃƒÂ­nea con tÃƒÂ­tulos como Atrapado en el tiempo, Dos vidas en un instante o el clÃƒÂ¡sico Ã‚Â¡QuÃƒÂ© bello es vivir!, presenta el discurrir de una misma situaciÃƒÂ³n de modos diversos, con variantes. Veinte minutos pueden ser muy distintos segÃƒÂºn a una le pongan una zancadilla, se produzca una colisiÃƒÂ³n automovilÃƒÂ­stica o se tope uno con cierto vagabundo que... Y, a la vez, Tykwer nos dice que, en el fondo pueden ser muy parecidos, pese a las distintas consecuencias, si el alma de las acciones lo constituye el amor por el otro. TambiÃƒÂ©n se dibuja con una perspectiva no exenta de acidez la actitud de ciertos padres irresponsables, incapaces de abrir los ojos a las necesidades de sus hijos.\n\nHay que aplaudir la meritoria puesta en escena. El director da con el timing perfecto para que admitamos que las distintas situaciones pueden acontecer en el escaso tiempo indicado. La combinaciÃƒÂ³n de diversos formatos de cine y vÃƒÂ­deo, junto a distintas velocidades de pelÃƒÂ­cula y ritmo de ediciÃƒÂ³n, lejos de convertirse en un caos caprichoso, exprime del mejor modo posible lo aportado por los videoclips musicales a la narraciÃƒÂ³n audiovisual, en la lÃƒÂ­nea de la reciente Matrix. Bienvenida sea Lola (muy bien interpretada por Franka Potente), con su estÃƒÂ©tica arriesgada y su interesante y bien hilada trama.\n","torrent":{"xt":"urn:btih:8dcb76bd5561d894ae6553c9ad6a0cadf0423ef3","amp;dn":"Corre+Lola+Corre.DVDrip.%28spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dcb76bd5561d894ae6553c9ad6a0cadf0423ef3","infoHashBuffer":{"type":"Buffer","data":[141,203,118,189,85,97,216,148,174,101,83,201,173,106,12,173,240,66,62,243]},"announce":[],"urlList":[]}}