{"title":"Coast to Coast AM - Sep 14 2009 - America's Occul","uid":5100018,"size":55172275,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:8f080d1a12c198ba9e2bf28b678ea355002b4c36&amp;dn=Coast+to+Coast+AM+-+Sep+14+2009+-+America%5C%27s+Occul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"0vercast","files":4,"time":1253899192,"description":"Date: 09-14-09\nHost: George Noory\nGuests: Mitch Horowitz, William Gladstone\n\nDuring the first three hours, well-known voice of occult and esoteric ideas, Mitch Horowitz discussed how the occult is very much part of American history. Though there are many different aspects to the occult, there's a shared belief in the idea that an invisible realm exists beside our own, he explained. Occultists in America, who got their start in the 1600s, differentiated themselves from their European counterparts, by using occult practices and ideas as tools of self-help, and to promote social progress. In fact, the American colonies quickly became known as a haven for the religiously liberal, and unorthodox, he detailed.\n\nThe spiritualism movement swept over the country in the mid 19th century, and seances were even held at the White House with President Lincoln. Spiritualism, with its emphasis on female mediums, helped foster the women's rights movement, Horowitz commented. Franklin Roosevelt's Vice President, Henry Wallace, had a heavy interest in the occult, and it was he that suggested the design of eye over the pyramid for the US currency, which first appeared on the dollar in 1935. Ronald and Nancy Reagan were known for their devotion to astrology, and under the advice of astrologer Carroll Righter, his inauguration in 1967 as California's governor took place at the odd time of 12:10 AM.\n\nThe 'positive thinking' philosophy is as &quot;American as apple pie,&quot; and was developed in the mid-19th century by Phineas Quimby, who believed that sickness and bad fortune could be related to one's thought process. Mary Baker Eddy, the founder of Christian Science, was said to be influenced by Quimby, Horowitz noted. He also talked about the Ouija Board, the &quot;game&quot; marketed by Parker Brothers. While there have been a lot of frightening tales associated with it, some have had positive experiences, such as the poet James Merrill who said his epic prize-winning poem, The Changing Light at Sandover, was channeled through the board.\n\n2012 &amp; Mayan Calendar\nLast hour guest, author William Gladstone talked about the meaning of 2012 and Mayan prophecy, which he's explored in his new novel The Twelve. The book incorporates some elements from his own life, such as a profound near-death experience.\n\nWebsite(s):\nmitchhorowitz.com\n12thebook.com\n\nBook(s):\nOccult America: The Secret History of How Mysticism Shaped Our Nation\nThe Twelve\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224","torrent":{"xt":"urn:btih:8f080d1a12c198ba9e2bf28b678ea355002b4c36","amp;dn":"Coast+to+Coast+AM+-+Sep+14+2009+-+America%5C%27s+Occul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f080d1a12c198ba9e2bf28b678ea355002b4c36","infoHashBuffer":{"type":"Buffer","data":[143,8,13,26,18,193,152,186,158,43,242,139,103,142,163,85,0,43,76,54]},"announce":[],"urlList":[]}}