{"title":"FantasyDVD Player Platinum 9.9.7 + Serial -TrT","uid":5570913,"size":8690702,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8f1f067b8ca4f3b44a75473aaebacf83ebfe509d&amp;dn=FantasyDVD+Player+Platinum+9.9.7+%2B+Serial+-TrT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bigwimpie","files":-1,"time":1274247214,"description":" FantasyDVD Player Platinum 9.9.7\n Full version with product key\n\nFantasyDVD is a exquisite and powerful software DVD player. Have with \nthe same features and controls of the living- room DVD player and \nsupport over 70 type video and audio media files. Support the ts, tp, \ntrp mpeg2 HDTV, wmv HDTV and mkv, mka, mks formats HDTV. Its advanced \nvideo and audio technologies deliver the highest quality viewing and \nlistening experience possible on the PC. FantasyDVD has a perfect DVD \nnavigation system, rich audio and video effects, is stable and easy use, \nand can meet all the demands of DVD playing. FantasyDVD automatically \ndetermines the type of disc in your DVD drive and uses the correct \nplayback method for DVD titles, video CDs, or audio CDs. Play at normal \nspeed, or fit the movie into the time you have available to watch it! \nTime stretching lets you decide how long the movie takes to view. If a \nDVD has it, FantasyDVD can handle it. FantasyDVD recognizes all of the \nauthor's DVD features and lets you access them through the FantasyDVD \nuser interface. \n\nWhether watching DVD movies on your laptop as you travel, using your \ncomputer as a second DVD player for your kids or watching a movie on \nyour desktop as you work, FantasyDVD lets you get the most out of any \ncomputer with a DVD drive. In addition to all the features you find in \nyour home entertainment DVD player, FantasyDVD gives you advanced \nfunctionality not possible on your living room DVD player, such as \ntime-stretching, zooming and panning and thumbnail bookmarks. FantasyDVD \nallows you to customize your video and audio preferences for a \npersonalized movie watching experience. Supports 2 - 7.1 channel audio \noutput, dolby ProLogic, Dolby ProLogicII and SRS TruSurround XT audio \noutput mode. Supports Low frequency effect (LFE), High frequency effect \n(HFE), 10 Band Equalizer, EchoDelay etc.s expansion function. \n\nFantasyDVD automatically determines the type of disc in your DVD drive \nand uses the correct playback method for DVD titles, video CDs, or audio \nCDs. Play at normal speed, or fit the movie into the time you have \navailable to watch it! Time stretching lets you decide how long the \nmovie takes to view. If a DVD has it, FantasyDVD can handle it. \nFantasyDVD recognizes all of the author's DVD features and lets you \naccess them through the FantasyDVD user interface. \n\nInstall Notes:\n1) Unpack Archive\n2) Run installer: FantasyDVDPlatinum.exe\n3) Start program and click on menu &gt; register\n4) Enter Name/email/id/license &amp; product key to register.\n   (see serial.txt for serial/key)\n   \nDone   ","torrent":{"xt":"urn:btih:8f1f067b8ca4f3b44a75473aaebacf83ebfe509d","amp;dn":"FantasyDVD+Player+Platinum+9.9.7+%2B+Serial+-TrT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f1f067b8ca4f3b44a75473aaebacf83ebfe509d","infoHashBuffer":{"type":"Buffer","data":[143,31,6,123,140,164,243,180,74,117,71,58,174,186,207,131,235,254,80,157]},"announce":[],"urlList":[]}}