{"title":"Focus Photoeditor 6.0.9.4-serial incl","uid":5045501,"size":11364743,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8f200714045f4ca410cc4847b450dda236195af7&amp;dn=Focus+Photoeditor+6.0.9.4-serial+incl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jmb2012","files":2,"time":1249605389,"description":"Focus Photoeditor is a powerful image and photo editor, picture retouching tool, web album creator, image browser and Photoshop Filters Host Application for Windows. Besides its excellent ability to correct digital photos, it has many rich tools and effects found in much more expensive professional tools. And there are also many tools you can hardly find elsewhere, such as Quick Fix Wizard, Effective and Intelligent Automatic Corrections, Smart Color Replacement and extras like a web-album builder, a batch processor and support for photoshop plugins. Focus Photoeditor has all the necessary tools for editing and adjusting digital images. Quick Fix Wizard, Adjusting levels, Gamma, RGB curves, Hue-Saturation, Brightness-Contrast, Shadows-Highlights, Histogram stretch and more. When coming to automatic corrections the software excells over any competitor: you will find Quick-Fix, Auto-Contrast, Auto-Stretch, Auto-Colors, Apply Smart Flash, Reduce Hilights and many others. Focus Photoeditor provides Layers that are very useful to create any kind of graphic project. Joining together different pictures and photos and combining them transparently and with different blend modes, you will be able to create easily professional looking greetings cards, calendars, business cards, web graphics and much more. Besides the many built-in filters, the program support thirdy parts plugins written with the adobe photoshop plugin standard.\n\n\nSupported operating systems:\nWin95, Win98, WinME, WinNT 4.x, Windows2000, WinXP, Windows2003, Vista 32-64bit,Windows 7 32-64bit","torrent":{"xt":"urn:btih:8f200714045f4ca410cc4847b450dda236195af7","amp;dn":"Focus+Photoeditor+6.0.9.4-serial+incl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f200714045f4ca410cc4847b450dda236195af7","infoHashBuffer":{"type":"Buffer","data":[143,32,7,20,4,95,76,164,16,204,72,71,180,80,221,162,54,25,90,247]},"announce":[],"urlList":[]}}