{"title":"Hardcore Gamer (World Mix)","uid":5121993,"size":103294971,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8f44ee64473142528eeb14ed4ef18f2eee69b8b0&amp;dn=Hardcore+Gamer+%28World+Mix%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Drakonas","files":22,"time":1255396921,"description":"Hardcore Gamer (World Mix) is my very own hardcore techno/trance mix for\ngamers, enough said. It includes original mixes from Hardcore Nation 2009,\nHardcore Euphoria, the Hardcore Heaven Series, and the Bonkers Series, along\nwith a few mixes I've found on my own. Various genres from Happy Hardcore to\nJ-Pop Dance remixes, to classic techno and trance. Plus, what would a gamer's\nmix be without video game remixes? Not only that, but various artists from\naround the world are used, making it the first universal mix in the world!\nI hope you will enjoy this long-worked masterpiece.\n\nBy uploading this, I do acknowledge that none of this music was originally\ncomposed by me. The original authors are included in the tags of each song.\n(except the 2nd track, which I could not find the artist for. Sry, I don't\nremember where I got the file)\n\nThe Reason this is ripped is because I unfortunately had a loss of data,\nso the original project file was unaccessible. Blame Windows. xD Anyways,\nI asure you that you can get a true gapless CD with this rip. I tested a burn\nmyself, and it is gapless. Just make sure you use a good program, and that your\nburner supports disc-at-once (DAO). Search Google. Foobar2000 (Nero 6.0 or\nlower required) is a good one. (choose default settings) Make sure to restart\nFoobar2000 after 1st run. And if Foobar2000 can't find your CD drive, create an\nNRG file, burn it with Nero. (default settings as well) Your other choice is\nNero by itself (6.0 or lower would be best) or CDBurnerXP. I believe that one\ncan do good gapless burns. Just make sure to choose Burn Disc at Once (Gapless)\nafter it ready's itself to burn.\n\nNote: I apologize to those that want me to seed, but due to me not being able to have my computer on at all times, I will not be able to have this seeded every day after this first week. Hopefully there are a few dedicated torrent seeders out there who will be willing to be my main uploaders. My desktop is very noisy, and everybody in my house can barely sleep with it on. The other thing is that I believe my ISP (AT&amp;T, Fastaccess DSL) apparently is not letting me forward ports. I have tried all possible explanations, but none prevail. I apologize for the slow uploads on my end which are the result of this. With that said, please seed this torrent! Thanks in advance to any who can help.\n\nThis is my first upload to the torrent universe, so thanks for downloading!\nAnd again, enjoy!","torrent":{"xt":"urn:btih:8f44ee64473142528eeb14ed4ef18f2eee69b8b0","amp;dn":"Hardcore+Gamer+%28World+Mix%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f44ee64473142528eeb14ed4ef18f2eee69b8b0","infoHashBuffer":{"type":"Buffer","data":[143,68,238,100,71,49,66,82,142,235,20,237,78,241,143,46,238,105,184,176]},"announce":[],"urlList":[]}}