{"title":"20.09.09_FC.St.Pauli-1.FC.Kaiserslautern_MP3[AFM-Webradio]","uid":5094945,"size":66316501,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8fecd0c957a5dc53d9b15c3fbe102615bef1e117&amp;dn=20.09.09_FC.St.Pauli-1.FC.Kaiserslautern_MP3%5BAFM-Webradio%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"paulifan","files":-1,"time":1253472818,"description":"Hallo! Bin aus dem Stadion direkt an den PC geeilt, um den Upload mÃƒÂ¶glichst schnell hinzubekommen. Um das Spiel zu beschreiben, heute mal ein paar Kurzinterviews von der St.-Pauli-Website:\n\n\nMarco Kurz, FCK-Coach: Unsere Mannschaft war sehr hungrig und gewillt. Von den Chancen und der Spielweise her war es ein verdienter Sieg fÃƒÂ¼r uns, auch wenn es ein hartes StÃƒÂ¼ck Arbeit war. Das sind drei wichtige Punkte fÃƒÂ¼r uns.\n\nHolger Stanislawski, FC St. Pauli-Coach: Wir konnten nur in den ersten 20 Minuten an unsere vorherigen Leistungen anknÃƒÂ¼pfen. Danach haben wir von Minute zu Minute fahriger agiert. Einen Punkt hÃƒÂ¤tten wir heute nicht verdient gehabt, der Sieg fÃƒÂ¼r Lautern geht absolut in Ordnung.\n\nMartin Amedick, FCK-KapitÃƒÂ¤n: Es war eine intensive und leidenschaftliche Partie. Wir hatten etwas mehr MÃƒÂ¶glichkeiten im Spiel als St. Pauli und ich denke, dass wir auch verdient gewonnen haben.\n\nCarsten Rothenbach, FC St. Pauli: Wir sind heute nicht ins Spiel gekommen. Wir hatten einfach zu viele FehlpÃƒÂ¤sse, was der FCK auch sehr gut ausgenutzt hat. Alles in allem haben wir verdient verloren. \n\nDeniz Naki, FC St. Pauli:Wir wollten heute gewinnen, haben uns aber nicht gut angestellt. Wir waren zu weit weg von den Gegnern, haben die ZweikÃƒÂ¤mpfe nicht gut angenommen und dann wird es eben schwer.\n\nFabio Morena, FC St. Pauli-KapitÃƒÂ¤n: Die Niederlage ist ÃƒÂ¤rgerlich, keine Frage. Wir haben aber keinen Grund jetzt die KÃƒÂ¶pfe hÃƒÂ¤ngen zu lassen. Jetzt steht das Spiel in Bremen bevor, dort haben wir nichts zu verlieren.\n\nFabian Boll, FC St. Pauli: Zur Halbzeit konnten wir schon froh sein, dass wir nur mit 0:1 in RÃƒÂ¼ckstand lagen. Wir waren heute das langsamere Team auf dem Platz. Die Niederlage wirft uns aber nicht aus der Bahn. \n\n\nIch habe ja den leisen Verdacht, dass unsere Jungs sich nur fÃƒÂ¼r das Pokalspiel am Mittwoch gegen Werder schonen wollten...\n\nIhr hÃƒÂ¶rt wieder einen Mitschnitt vom AFM-Webradio (www.fcstpauli.tv), diesmal mit Wolf Schmidt und Til Brauns.\n\nAm Mittwoch gibts dann schon den Mitschnitt von der Pokalsensation in Bremen (vielleicht auch erst am Donnerstag, je nachdem, wie duhn ich bin...)\n\nMerkt Euch bitte neben http://thepiratebay.se/user/paulifan auch die Adresse http://torrentbay.to/user/108919. Sobald ich Zeit dafÃƒÂ¼r habe, lade ich alle Mitschnitte und noch einiges anderes Zeugs dort hoch.\n\n\nFORZA ST. PAULI!!!\n\n","torrent":{"xt":"urn:btih:8fecd0c957a5dc53d9b15c3fbe102615bef1e117","amp;dn":"20.09.09_FC.St.Pauli-1.FC.Kaiserslautern_MP3%5BAFM-Webradio%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fecd0c957a5dc53d9b15c3fbe102615bef1e117","infoHashBuffer":{"type":"Buffer","data":[143,236,208,201,87,165,220,83,217,177,92,63,190,16,38,21,190,241,225,23]},"announce":[],"urlList":[]}}