{"title":"Dollhouse 1x01 DVD DVB Spanish","uid":5077955,"size":361378982,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:91900fd4d4776225e4aadb1b46e35c2f11aef728&amp;dn=Dollhouse+1x01+DVD+DVB+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":2,"time":1252025754,"description":"En Dollhouse, Eliza Dushku interpreta a una joven mujer llamada Echo, miembro de un grupo de personas denominadas &quot;Activos&quot; o &quot;MuÃƒÂ±ecos&quot; (Dolls) cuyas personalidades han sido eliminadas, para que de esa forma puedan ser receptores de cualquier nÃƒÂºmero de personalidades, incluyendo recuerdos, memoria muscular, habilidades, lenguaje, para diferentes misiones. Estos &quot;MuÃƒÂ±ecos&quot; son entonces contratados para cierto tipo de trabajos, crÃƒÂ­menes, fantasÃƒÂ­as y ocasionalmente buenas acciones. Una vez terminada su tarea, los &quot;muÃƒÂ±ecos&quot; son vaciados de nuevo, hasta un estado infantil y viven en un dormitorio/laboratorio de ÃƒÂºltima tecnologÃƒÂ­a, una instalaciÃƒÂ³n ultra secreta apodada &quot;La Casa de MuÃƒÂ±ecas&quot; (Dollhouse). La historia sigue a Echo, quien en su estado de vacÃƒÂ­o mental empieza a entender lo que sucede a su alrededor. Se ha reportado que el primer episodio se llama &quot;Echo&quot;, el nombre del personaje de Eliza Dushku. AdemÃƒÂ¡s del personaje de Dushku, la historia tambiÃƒÂ©n se enfoca en las personas que dirigen la misteriosa &quot;Casa de MuÃƒÂ±ecas&quot; y en dos &quot;muÃƒÂ±ecos&quot; mÃƒÂ¡s: VÃƒÂ­ctor y Sierra, quienes son amigos de Echo. Aunque los &quot;Activos&quot; parecen actuar de manera voluntaria, la operaciÃƒÂ³n es totalmente ilegal y estÃƒÂ¡ bajo la constante amenaza de Paul Smith, un insistente agente del FBI que ha escuchado rumores sobre los &quot;muÃƒÂ±ecos&quot;.","torrent":{"xt":"urn:btih:91900fd4d4776225e4aadb1b46e35c2f11aef728","amp;dn":"Dollhouse+1x01+DVD+DVB+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91900fd4d4776225e4aadb1b46e35c2f11aef728","infoHashBuffer":{"type":"Buffer","data":[145,144,15,212,212,119,98,37,228,170,219,27,70,227,92,47,17,174,247,40]},"announce":[],"urlList":[]}}