{"title":"WinSettings Pro 9.0 Portable","uid":5049489,"size":10723740,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:91b90d11af82fadf8bfccdf22071e8f0fea36b84&amp;dn=WinSettings+Pro+9.0+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoExcuses","files":4,"time":1249898444,"description":"WinSettings Pro 9.0 made Portable (Thinstalled).\n\nNo need to install it!\nOr, if you want to, Setup and Crack are included.\n\n\nSPEED UP STARTUP &amp; CLEAN UP TRACKS\nWinSettings Pro lets you review and remove unwanted programs from Windows Startup to keep them from slowing down Windows Startup. Online activities like surfing accumulates cookies, script, download graphics, music, and programs that can crimp the efficiency of even the fastest machines. Clean up Tracks, Remove Unregistered Programs, and Secure Delete will make your computer run better and protect your privacy.\n\n MINIMIZE CLUTTER &amp; REORGANIZE\nNeed more room on your drive? Use Junk and Duplicate Files Remover to scan your hard drives.  You will be surprised how much space you can reclaim.  Getting a new drive and need to move applications over?  Use WinSettings PRO to take care of all the work for you, move files, move folders, update registry, shortcuts, and other references.\n\n LOCK UP SECURITY SETTINGS\nYou can control what changes are allowed in your Windows and the Internet settings. For example, you can restrict others from changing your Internet security settings. Plus WinSetttings Pro tools can be password protected so that only authorized users can make the changes. \n\n CUSTOMIZE &amp; QUICK ACCESS DESKTOP\nWinSettings Pro lets you customize your Desktop with automated multimedia features like auto wallpaper changer, background music, and screensaver control. The WinSettings Pro customizable tray menu gives you quick access to useful system information and tools.\n\n MORE WAYS TO CAPTURE YOUR SCREENS\nWinSettings Pro offers you 16 ways to capture all or part of screen or just the application contents. You can save, print, email, and use them in other program.\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.filestream.com/winpro/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.filestream.com/winpro/&lt;/a&gt;\n\n\nThis has been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=34&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=34&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:91b90d11af82fadf8bfccdf22071e8f0fea36b84","amp;dn":"WinSettings+Pro+9.0+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91b90d11af82fadf8bfccdf22071e8f0fea36b84","infoHashBuffer":{"type":"Buffer","data":[145,185,13,17,175,130,250,223,139,252,205,242,32,113,232,240,254,163,107,132]},"announce":[],"urlList":[]}}