{"title":"Martyrs.(2009).iTALiAN.DVDRiP.XViD.HAVEN.avi","uid":5031906,"size":731821113,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:920461749e70365bcce2517fc6d4bea3e5503e89&amp;dn=Martyrs.%282009%29.iTALiAN.DVDRiP.XViD.HAVEN.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1248952508,"description":"Generale\nFormato                          : AVI\nDimensione                       : 698 Mb\nDurata                           : 1h 40min\n\nVideo\nFormato                          : MPEG-4 Visual\nProfilo del formato              : Simple@L3\nImpostazioni del formato, Matrix : Default (H.263)\nCodec ID                         : XVID\nDurata                           : 1h 40min\nBitRate                          : 762 Kbps\nLarghezza                        : 608 pixel\nAltezza                          : 272 pixel\nAspectRatio                      : 2.25\nFrameRate                        : 25,000 fps\n\nAudio\nFormato                          : MPEG Audio\nVersione del formato             : Version 1\nProfilo del formato              : Layer 3\nCodec ID/Consiglio               : MP3\nDurata                           : 1h 40min\nModalitÃƒÂ                          : Costante\nBitRate                          : 160 Kbps\nCanali                           : 2 canali\nSamplingRate                     : 48,0 KHz\nRisoluzione                      : 16 bits\n\n\nMartyrs ÃƒÂ¨ un film del 2008, scritto e diretto da Pascal Laugier. Appartiene al torture porn e, insieme ad Alta tensione, Frontiers - Ai confini dell'inferno e Ãƒâ‚¬ l'intÃƒÂ©rieur ha riportato in auge l'horror francese.\n\nTrama:\nUna bambina, scomparsa da un anno, viene ritrovata mentre corre seminuda, ferita e sconvolta lungo una strada. Portata in ospedale, la bambina, che si chiama Lucie, non ricorda nulla di quello che le ÃƒÂ¨ successo. Un'altra bambina, Anna, viene interrogata dai medici, mentre Lucie ÃƒÂ¨ tormentata dalle visioni di una mostruosa creatura.\n\nQuindici anni dopo, Lucie irrompe in una casa e uccide a colpi di fucile una famiglia che sta facendo colazione, quindi chiama Anna e le dice che finalmente ha ritrovato i suoi aguzzini. Anna si reca nell'appartamento e tenta di occultare i cadaveri, ma scopre che una donna ÃƒÂ¨ ancora viva e tenta di farla fuggire. Lucie se ne accorge e uccide la donna a martellate, quindi le appare la mostruosa creatura e Lucie inizia a procurarsi delle ferite con un coltello. Esasperata, alla fine Lucie si uccide, tagliandosi la gola, sotto gli occhi di Anna.\n\nMentre parla al telefono con sua madre, Anna scopre un passaggio segreto che conduce ai sotterranei della casa e trova una ragazza nuda e incatenata, con una sorta di maschera di ferro sulla faccia. Anna tenta di aiutare la ragazza e le toglie la maschera dal volto. Una volta lasciata sola, la ragazza tenta di uccidersi, quindi viene abbattuta a colpi di fucile da una donna, che ha fatto irruzione nella casa insieme a un gruppo di uomini. Anna viene ammanettata a una sedia e si trova davanti un'anziana signora, che le mostra alcune fotografie raffiguranti uomini e donne torturate e agonizzanti, ma ancora vive. La donna spiega ad Anna che il suo fine ÃƒÂ¨ torturare giovani ragazze per scoprire cosa c'ÃƒÂ¨ oltre la morte.\n\nAnna viene quindi incatenata a una sedia e lentamente torturata, fisicamente e psicologicamente, fino ad essere completamente scuoiata (le viene lasciata solo la pelle del viso). Tuttavia, Anna ÃƒÂ¨ ancora viva e la signora viene convocata per ottenere la risposta a quello che cerca. Anna sussurra qualcosa all'orecchio della signora, che successivamente convoca un gruppo di persone anziane per annunciare loro cosa ci sia dopo la morte. La signora perÃƒÂ² si chiude in una stanza e si suicida sparandosi in bocca, sostenendo che ÃƒÂ¨ meglio non sapere cosa ci sia dopo la morte.","torrent":{"xt":"urn:btih:920461749e70365bcce2517fc6d4bea3e5503e89","amp;dn":"Martyrs.%282009%29.iTALiAN.DVDRiP.XViD.HAVEN.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"920461749e70365bcce2517fc6d4bea3e5503e89","infoHashBuffer":{"type":"Buffer","data":[146,4,97,116,158,112,54,91,204,226,81,127,198,212,190,163,229,80,62,137]},"announce":[],"urlList":[]}}