{"title":"HBO HUNG S01E10 A DICK AND A DREAM - AAADICTEDONE HD 720P MP4 PS","uid":5089371,"size":768136300,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:93bf3b1e55fcd843e80e8148d9c0d791c1611f99&amp;dn=HBO+HUNG+S01E10+A+DICK+AND+A+DREAM+-+AAADICTEDONE+HD+720P+MP4+PS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"aaadicted","files":1,"time":1253008363,"description":"| a | a | a | d | i | c | t | e | d | o | n | e |==| H | D |==| M | P | 4 |\n\n\n-=- HBO -=-\n\nHUNG\n\nSeason 1\n\nEpisode 10\n\n&quot;A Dick and a Dream&quot; or &quot;Fight the Honey&quot; \n\n\n| a | a | a | d | i | c | t | e | d | o | n | e |==| H | D |==| M | P | 4 |\n\nTanya comes to Ray in the middle of the night for help when her apartment is infested with flies, concerned the universe is trying to tell her she's &quot;dead meat&quot; -- first Pierce disappears to Cuba, and now she's concerned Ray is going to disappear on her too. Ray assures her he's not going anywhere. However, when he meets Lenore for lunch and she points out the rich clientele she can line up for him, he suggests a partnership with Tanya. Lenore insists he has to choose just one pimp.\n\nAt school, Ray confronts Principal Rhonda about the rumored lay-offs and is stunned to learn that he is on the list of people being let go -- pending next year's budget.\n\nLenore and Jessica get Thai massages and Jessica confides that she feels powerless. Lenore convinces her that hiring a sex &quot;therapist&quot; is the only way to avoid another divorce. Meanwhile, Ronnie flirts with a patient and former high school classmate who has him look at a provocatively located mole.\n\nAt the movies, Damon breaks it off with Powell who storms out of the theater leaving Damon to seek comfort from Darby. When Ray is unable to dump Tanya, he demands Lenore do things his way. Lenore breaks the news to Tanya that Ray wants them to form a three-way partnership for Happiness Consultants. An enraged Tanya refuses but Lenore says she has no choice: Share Ray, or no Ray.\n\nMrs. Koontz stops by to refill her honey jar (from the honeycombs Ray has discovered in the walls of his house) and when Tanya interrupts Ray and Mrs. K screwing, she accuses him of already working with Lenore. She collapses in despair and Ray takes her for lunch. He explains he's being laid off and Tanya tries to convince him they can make the business work without Lenore, but Ray holds firm on needing a professional on board.\n\nAt an upscale hotel bar, Lenore fills Ray in on his next client and when he spots her in the lobby, he realizes it's Jessica. He calls his ex-wife on her cell on his way up to her hotel room, saying he's just calling to tell her the truth: that he thinks they're both pretty good parents. Spotting her reflection in the hotel room mirror, Jessica sadly tells him she has to go. As they hang up, Ray turns away from her door and heads home. Meanwhile, Tanya, reading 'Women Who Run With the Wolves,' swats a fly. Dead.\n\n| a | a | a | d | i | c | t | e | d | o | n | e |==| H | D |==| M | P | 4 |\n\n\nStats - http://bayimg.com/daDkDAaCo\n\nScreenshot - http://bayimg.com/DadkFaACo\n\n\n| a | a | a | d | i | c | t | e | d | o | n | e |==| H | D |==| M | P | 4 |\n","torrent":{"xt":"urn:btih:93bf3b1e55fcd843e80e8148d9c0d791c1611f99","amp;dn":"HBO+HUNG+S01E10+A+DICK+AND+A+DREAM+-+AAADICTEDONE+HD+720P+MP4+PS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93bf3b1e55fcd843e80e8148d9c0d791c1611f99","infoHashBuffer":{"type":"Buffer","data":[147,191,59,30,85,252,216,67,232,14,129,72,217,192,215,145,193,97,31,153]},"announce":[],"urlList":[]}}