{"title":"ITV Wormwood Scrubs 2of2 PDTV x264 AC3 MVGroup","uid":5573625,"size":715174469,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:93fa89693807650d2a8b2b36215bec5b64f11424&amp;dn=ITV+Wormwood+Scrubs+2of2+PDTV+x264+AC3+MVGroup&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BasilBrush","files":1,"time":1274320589,"description":"ITV Wormwood Scrubs 2of2 PDTV x264 AC3 MVGroup 2010\n\nWormwood Scrubs is a candid look at life behind the locked doors of one of Europe's largest and toughest prisons. With unprecedented access to the London jail, the two part documentary follows the lives of prisoners and prison officers who make up this complex, noisy and disturbed community. The documentary includes powerful accounts from them on the emotional turmoil, frustration and anger inside the prison. Wormwood Scrubs prison holds up to 1280 male inmates, from drug addicted petty villains to sophisticated thieves and violent disturbed criminals. Some wings can hold over 300 prisoners, many of whom are drug addicts and, with only 12 guards to keep order, bullying and violence is a daily occurrence. Up to 80 percent of the inmates have drug issues and many have mental health problems. Prison Governor Phil Taylor says life in the prison can be like a &quot;smouldering or erupting volcano&quot;, as tensions rise amongst prisoners. The films show how prison staff have to deal with disruptive prisoners as well as help them through tough times and keep them alive when they self harm or attempt suicide, often in the face of extreme provocation and violence.\n\nPart 2: A compelling and candid look at life behind the locked doors of one of Europe's largest prisons. Given unprecedented access to the London jail, this two-part documentary follows the frenetic lives of inmates and prison officers who make up this complex, noisy and disturbed community and includes powerful accounts from them on the emotional turmoil, frustration and anger felt inside. This second episode focuses on what life is like for the prisoners at Christmas, when they miss their families most.\n\nVideo Codec: x264 CABAC\nVideo Bitrate: 2000 KB/s\nVideo Aspect Ratio: 1.765:1\nVideo Resolution: 960 x 544\nAudio Codec: AC3\nAudio Bitrate: 128 Kb/s 48000Hz\nAudio Channels: 2\nRun-Time: 46 mins\nFramerate: 25FPS\nNumber of Parts: 2\nPart Size: 682 MB\nSubtitles: not available\nSource: DVB-S\n\nPart 1: http://thepiratebay.se/torrent/5573623\n","torrent":{"xt":"urn:btih:93fa89693807650d2a8b2b36215bec5b64f11424","amp;dn":"ITV+Wormwood+Scrubs+2of2+PDTV+x264+AC3+MVGroup","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93fa89693807650d2a8b2b36215bec5b64f11424","infoHashBuffer":{"type":"Buffer","data":[147,250,137,105,56,7,101,13,42,139,43,54,33,91,236,91,100,241,20,36]},"announce":[],"urlList":[]}}