{"title":"Batman Arkham Asylum [PCISO][ojuegos.eu]","uid":5077515,"size":8530560889,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9418080804ea8668bb752a3a63396786de033f00&amp;dn=Batman+Arkham+Asylum+%5BPCISO%5D%5Bojuegos.eu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Morck22","files":8,"time":1251994189,"description":"\nEn Batman: Arkham Asylum, el Caballero Oscuro se enfrenta a su mayor reto al quedarse atrapado junto a los villanos mÃƒÂ¡s peligrosos dentro del manicomio de Gotham City, conocido como Arkham Asylum.\nBatman: Arkham Asylum expone a los jugadores a una aventura ÃƒÂºnica, con una atmÃƒÂ³sfera siniestra, que les llevarÃƒÂ¡ a lo mÃƒÂ¡s profundo de Arkham Asylum, el hospital psiquiÃƒÂ¡trico de Gotham para criminales. El jugador se moverÃƒÂ¡ por las sombras, provocando el miedo entre sus enemigos y enfrentÃƒÂ¡ndose al Joker y los peores Villanos de Gotham City que han tomado al asalto el sanatorio mental.\nEl jugador se convertirÃƒÂ¡ en un depredador invisible utilizando los gadgets y habilidades de Batman para frustrar el enloquecido plan del Joker. Batman: Arkham Asylum cuenta una historia original escrita exclusivamente para el juego por el autor y ganador de cinco Emmys, Paul Dini. Con espectaculares grÃƒÂ¡ficos y un escenario envolvente y opresivo, Batman: Arkham Asylum ofrece una variedad de opciones de juego que abre el abanico para los juegos de acciÃƒÂ³n, aventura y superhÃƒÂ©roes.\nCaracterÃƒÂ­sticas:\nUtiliza el sistema de combate FreeFlow para encadenar combos sin lÃƒÂ­mite y enfrentarte a grandes grupos de secuaces del Joker, en brutales peleas tumultuosas.\nInvestiga como Batman, el mejor detective del mundo, al resolver intrincados puzzles con la ayuda de avanzadas herramientas forenses, incluyendo escÃƒÂ¡ner de rayos X, de huellas dactilares, el spray &quot;Amido Black&quot; y un rastreador de feromonas.\nEnfrÃƒÂ©ntate a los peores villanos de Gotham incluyendo el Joker, Harley Quinn, Victor Zsasz y Killer Croc.\nConviÃƒÂ©rtete en el Depredador Invisible (Invisible Predator) utilizando el miedo y su sistema de posiciÃƒÂ³n de ventaja para moverte sin ser detectado por tus enemigos.","torrent":{"xt":"urn:btih:9418080804ea8668bb752a3a63396786de033f00","amp;dn":"Batman+Arkham+Asylum+%5BPCISO%5D%5Bojuegos.eu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9418080804ea8668bb752a3a63396786de033f00","infoHashBuffer":{"type":"Buffer","data":[148,24,8,8,4,234,134,104,187,117,42,58,99,57,103,134,222,3,63,0]},"announce":[],"urlList":[]}}