{"title":"019-Coast to Coast-ian punett-Les Leopold-2 May 10.m4a","uid":5588038,"size":125355889,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:949d8a19038616c7485623ba202582213b5204bc&amp;dn=019-Coast+to+Coast-ian+punett-Les+Leopold-2+May+10.m4a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"panzerfaust69","files":1,"time":1274764868,"description":"Wall Street's Fantasy Finance Scheme\n\nDate:05-01-10\n\nHost:Ian Punnett\n\nGuests:Les Leopold\n\nDirector of two non-profits, Les Leopold returned to the show to explain how Wall Street's casino-style practices magnified the impact of the subprime mortgage crisis and profoundly damaged the U.S. economy. According to Leopold, banking firms, such as Goldman Sachs, wreaked havoc by selling incredibly complex investments known as synthetic collateralized debt obligations (CDOs). The banks packaged and repackaged the same risky debt bonds, which had no real underlying assets, into countless CDOs. Ultimately, this turned $300 billion of bad mortgages into several trillion dollars worth of losses to investors, he added.\n\nOne such investor, the School Board of Whitefish Bay, Wisconsin, lost roughly $200 million in this fantasy finance scheme. Large investment banks, on the other hand, were protected from substantial losses by AIG, which in turn was protected with taxpayer money, Leopold continued. The total cost (so far) to bailout Wall Street has reached $8 trillion, Leopold said, noting that this enormous amount benefits only a very small portion of the population. To avoid future financial crises, Leopold suggested breaking up 'too big to fail' banking firms, reducing the overall size of the financial sector through taxation, and imposing regulatory reform.\nWebsite(s):\n# lootingofamerica.org\nBook(s):\n# The Looting of America\n","torrent":{"xt":"urn:btih:949d8a19038616c7485623ba202582213b5204bc","amp;dn":"019-Coast+to+Coast-ian+punett-Les+Leopold-2+May+10.m4a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"949d8a19038616c7485623ba202582213b5204bc","infoHashBuffer":{"type":"Buffer","data":[148,157,138,25,3,134,22,199,72,86,35,186,32,37,130,33,59,82,4,188]},"announce":[],"urlList":[]}}