{"title":"Merlin Seizoen 1 DVD 2 (2008)(DVD)(Multi) 2Lions-Team","uid":5040970,"size":6786887295,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:95209ba54b0698c82dc55ec8b1b94248d088dbc3&amp;dn=Merlin+Seizoen+1+DVD+2+%282008%29%28DVD%29%28Multi%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pioen","files":-1,"time":1249373232,"description":"The Adventures Of Merlin seizoen 1 dvd 2         \n\n\n\nDutch\n\ncast:\n\nJohn Hurt, Colin Morgan, Bradley James, Anthony Head, Richard Wilson, Katie McGrath, Angel Coulby, Michelle Ryan, Caroline Faber, Michael Cronin\n\nDe mythische stad Camelot, in een tijd voor de geschiedenis begon. Een fantastisch rijk van legendarische schepsels en mysterieuze volkeren. Een gevaarlijke wereld waaruit de genadeloze tiran Uther Pendragon elke vorm van magie heeft verboden.\n\nWanneer Merlin, een jongeman met magische krachten, in het koninkrijk aankomt, maakt hij meteen heel wat vijanden. Dankzij zijn mentor Gaius, de wijze lijfarts van Uther, ontdekt Merlijn zijn talenten om de mystieke geheimen van Camelot te ontsluieren en daarmee te overleven. Zo ontdekt hij dat zijn lotsbestemming en die van Arthur, de volgende vorst van het koninkrijk, onlosmakelijk met elkaar verbonden zijn. \n\nEnglish   \n \nThe BBC\u0019s outstanding re-imagining of the Arthurian legend comes to DVD in this 3 disc set containing six episodes plus a superb package of bonus features: \u001cBehind the Magic\u001d feature, cast video diaries, audio commentaries and more.\n\nSet in the mythical city of Camelot, in a time before history began, this magical adaptation of the Arthurian legend follows Merlin\u0019s early adventures in the court of King Uther... and his enthralling encounters with the young Prince Arthur&amp; \n\nThe Kingdom of Camelot is a realm of legendary beasts and mysterious peoples. In this dangerous world, magic has been banned by the ruthless tyrant, Uther Pendragon. Merlin, a young man gifted with extraordinary powers, arrives at the gates of the city. Though bright-eyed with wonder, the young sorcerer quickly makes enemies, including the headstrong Prince Arthur. \n\nGuided by Gaius, the wise court physician, Merlin is soon using his talents to secretly defend the Kingdom and unlock Camelot's mystical secrets. Soon he discovers that his destiny and that of Arthur, the future King, are inextricably linked. Starring Colin Morgan, Bradley James, Anthony Head, Richard Wilson, Katie McGrath and Angel Coulby \n\nEpisode One - Merlin, a young country boy, arrives at the great city of Camelot just in time to witness an execution \u0013 the result of King Uther outlawing magic in his kingdom. As Merlin makes his way to find Gaius, the Court Physician, he begins to realise that the world he has entered is full of danger.\n\nEpisode Two - Valiant arrives in Camelot intent on winning its renowned sword tournament. As a disgruntled Merlin gets to grips with his arduous duties as Arthur\u0019s new servant, he notices the fighter has an unfair advantage. And, though Arthur is not exactly impressed with Merlin\u0019s talents, he might just need his help before taking on Valiant in the final...\n\nEpisode Three - As a magical plague brings death to Camelot, Merlin takes pity on Gwen, whose father is dying of the disease. Evading a curfew, Merlin risks his life by using magic to cure her father. However, his delight soon turns to shock as Gwen is arrested for sorcery&amp; \n\nEpisode Four - A mysterious servant girl tells Merlin that Arthur is about to be poisoned. Merlin seizes Arthur\u0019s cup and drinks it himself. He falls into a coma and can only be saved from certain death by a flower that grows deep within the forest of Balor. Arthur is ready to defy the King and embark on the quest, but is he prepared for the trials and danger he will encounter? \n\nEpisode Five - A great fighter by the name of Lancelot arrives in Camelot but, despite his bravery and skill, his ambition to be a knight is thwarted by his low birth \u0013 only Arthur and Merlin appear to recognise his true worth. Meanwhile a terrifying winged beast approaches Camelot leaving the kingdom in desperate need of a hero&amp; \n\nEpisode Six - When a new physician, the scarred Edwin, saves Morgana from a mysterious illness, Uther is impressed by his skills. Soon, Edwin is supplanting Gaius\u0019s position in the court. But Gaius makes a shocking discovery about this mysterious stranger. Can a weak old man and his young apprentice prevent Edwin from committing the ultimate crime? \n\nSet in the legendary city of Camelot, in a time before history began, this adaptation of the much loved tale focuses on Merlin as a young wizard on the cusp of adulthood\n\n\n\nbron : http://www.bbcshop.com/Childrens/Merlin-Vol-1-DVD/invt/bbcdvd2831\ndvd 2 van 4\n- Aantal DVD's: 4 x DVD9\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD9 \nBron : Retail (pal)\nAudio : English, French 5.1\nSubs: Dutch, french, Danish,  (instelbaar)\n\nUitvoering Dvd , 4 disks, speelduur 585:00 minuten \n\nGenre : TV Shows/Series\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1199099&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1199099&lt;/a&gt;\n\nWeblink : http://www.bbc.co.uk/merlin/episodes/#/episodes/  &lt;a href=&quot;\nhttp://www.bbc.co.uk/merlin/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/merlin/&lt;/a&gt;   &lt;a href=&quot;\nhttp://forum.fok.nl/topic/1202479&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.fok.nl/topic/1202479&lt;/a&gt;\n\n\n*****************************************\n\nBrought to you by\nPioen  \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n     &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n\n******************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding.","torrent":{"xt":"urn:btih:95209ba54b0698c82dc55ec8b1b94248d088dbc3","amp;dn":"Merlin+Seizoen+1+DVD+2+%282008%29%28DVD%29%28Multi%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95209ba54b0698c82dc55ec8b1b94248d088dbc3","infoHashBuffer":{"type":"Buffer","data":[149,32,155,165,75,6,152,200,45,197,94,200,177,185,66,72,208,136,219,195]},"announce":[],"urlList":[]}}