{"title":"28 Weeks Later (2007) [DVDRIP]-EcKstasyMEDIA","uid":5051873,"size":735145984,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:952a03bf4640c1cb8fa63c7af4dfa3feefcbace1&amp;dn=28+Weeks+Later+%282007%29+%5BDVDRIP%5D-EcKstasyMEDIA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"EcKstasyMEDIA","files":1,"time":1250204076,"description":"28 Weeks Later (2007) [DVDRIP] is brought to you by EcKstasyMEDIA.\n\nThe Plot\n\nIn the country nearby London, Don, his wife Alice and a few survivors live hidden in a farmhouse. When infected people break in the house, Dan panics and does not help his wife to escape, running away and leaving Alice trapped inside the room. Twenty eight weeks after the outbreak that annihilated the population of Great Britain, London is considered safe and the British survivors return under the coordination of the American Army, that keeps the city under permanent surveillance. The teenager Tammy and her younger brother Andy travel back from Spain to live with their father Don in London. They miss their mother and decide to escape to their old house to retrieve pictures and some other personal belongings. However, they find Alice surprisingly alive and the Army brings her to the base. After some blood test, the biologist Scarlet discovers that Alice is a carrier of the lethal virus and somehow has immunity to it. Meanwhile, Don sneaks through the facility to say how sorry he is to Alice, who forgives him. When he kisses her, he is immediately contaminated, spreading a new epidemic.\n\n-----\n\nAll EcKstasyMEDIA torrents can be downloaded from http://torrentbucket.org/\nFeel free to join us on TorrentBucket for chats and torrent requests. \n\nFor your own security, be aware of fake torrents uploaded by imitators.\nPlease seed once your download has completed. --EcKstasy\n\nHow to find me:\nE-mail: eckstasy[at]ymail.com\nIRC: irc.torrentbucket.org #TorrentBucket","torrent":{"xt":"urn:btih:952a03bf4640c1cb8fa63c7af4dfa3feefcbace1","amp;dn":"28+Weeks+Later+%282007%29+%5BDVDRIP%5D-EcKstasyMEDIA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"952a03bf4640c1cb8fa63c7af4dfa3feefcbace1","infoHashBuffer":{"type":"Buffer","data":[149,42,3,191,70,64,193,203,143,166,60,122,244,223,163,254,239,203,172,225]},"announce":[],"urlList":[]}}