{"title":"Atomix Virtual DJ v6.0.2 Professional + Key, 6PckOfAbs","uid":5661859,"size":21113944,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9533ade70e0999e1e65fef0570b11289226662c1&amp;dn=Atomix+Virtual+DJ+v6.0.2+Professional+%2B+Key%2C+6PckOfAbs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"6PckOfAbs","files":2,"time":1278003350,"description":"Atomix Virtual DJ v6.0.2 Professional + Key\n\n\n\nVirtualDJ is the hottest MP3 mixing software, targeting every DJ from bedroom DJs \nto professional superstars like Carl Cox. With its breakthrough BeatLock engine, \nyour songs will always stay in the beat, and you can work your mixes incredibly \nfaster than any other DJ could.\n\nAtomix VirtualDJ features a breakthrough BeatLock engine that will keep your songs\nin tune and let you work your mixes incredibly faster than any other DJ. \nThe automatic seamless loop engine and the new synchronized sampler will let you \nperform astounding remixes on the fly. VirtualDJ is compatible with timecoded \nvinyls that let you scratch your MP3s directly on a real turntable, and with many \nother DJ equipment. \n\nYou can use several interfaces to suit both beginners and professionals, record \nyour mixes and burn them on CD, rip DVD, rip vinyl, create your own Internet \nradio, automatically mix playlists, use VST effects, display karaoke, and play \nDRMed file. The automatic seamless loop engine and the brand new synchronised \nsampler will let you perform astounding remixes live, with no preparation at all. \n\nThe visual representation and the cues allow you to clearly see the songs \nstructure, and never be surprised by a break anymore. The vinyl controls will let \nyou scratch like on a real turntable, except that with the beatlock engine your \nscratches will never end out of the beat. Add to that an infinite number of cue \npoints you can save for each songs, a bunch of wonderful effects automatically \nbeat-synchronised.\n\n\n\nFeatures:\n\n* Breakthrough BeatLock engine: your tracks will always stay on time. \n  Create great mixes faster than ever!\n* Automatic seamless loop: perform astounding remixes live with no preparation \n  at all!\n* Synchronised sample machine: sample-and-play on the fly, and free your \n  creativity!\n* video mix: Mix and scratch your music videos in addition to the music!\n* Vinyl control: Spin your MP3s from a real turntable (and still use loops \n  and beatmatch)!\n* DVD Ripping\n* Vinyl Ripping\n* Infinite cue points saved per song, lots of great effects which are beat aware, \n  recording and broadcasting options, and much more?\n\n\n\nThis new version of VirtualDJ brings many new and exciting features. It greatly \nenhances the core values which made VirtualDJ so popular: accessibility, \nversatility and cutting-edge technology.\n\n\n* New script language\n\nBecause no two DJs are the same, we think that every DJ should have a custom-made, \ntailored software application. VirtualDJ 6 has been centered around a new language, \ncalled VDJscript, that really lets you take full control and full ownership of your\nsoftware, and tweak it to your perfect liking in a matter of minutes.\n\nWith VirtualDJ 6, all the commands used in skins, keyboard shortcuts, controllers'\nmappings, etc, now use VDJscript.\n\nVDJscript language has been designed to be both simple and complex, depending on \nhow you will use it.\n\nWhen used for your day to day needs, VDJscript is very simple, and look similar \nto the actions from VirtualDJ v5.x. You can write such commands as play, pause, \ncrossfader 50%, etc.\n\nBut if you have more complex needs, VDJscript can turn into a full scripting \nlanguage, complete with global variables, conditional branching, etc. You can \nwrite such commands as var $myvar ? pitch_range '10,16,50' : goto 400ms &amp; loop 4 \nwhile_pressed\n\nSee the full documentation on VDJscript on the wiki page.\n\n\n* New controller support\n\nIn VirtualDJ 6, we changed the approach we had on external controllers. \nIn VirtualDJ v5.x, and in many competitors software, the software was designed \naround a mouse-and-keyboard use, and as the market released new USB DJ controllers, \nthey were added one by one as emulation of the keyboard.\n\nWith Version 6, the controllers are now at the center of the software, and the \nkeyboard is seen as just another kind of controller.\n\nAny controller, be it HID or MIDI, can now be used with VirtualDJ, and every \nbuttons, jog wheels, sliders, LEDs, LCD displays, etc, can be assigned to \nVDJscript macros to make your controller react exactly as you want it to.\n\nBy default, VirtualDJ comes preinstalled with an impressive list of over 40 \ndifferent USB controllers, already fully mapped and ready to be used plug-and-play.\n\nBut if you have a controller that is not in the preinstalled list, you can easily \ncreate a &quot;definition&quot; file for it, using a simple XML syntax, for any HID or MIDI \ncontroller. Or, you can find on our website many user-submitted definition XMLs \nfor almost every controller available on the market.\n\n\n* NetSearch\n\nBecause the technicality of the mix is only half of DJing, VirtualDJ 6 puts a \nstrong focus on the other half: playing the right track at the right moment.\n\nTwo new features are there to bring you the tools to make the best musical \nselection. NetSearch is one of these new tools. Whenever you are looking for a \nsong but don't have it, NetSearch will automatically crawl the Internet to try to \nfind the song you're looking for. You can then instantly stream the song or video \ndirectly off the Internet. You will never again have to turn down a request \nbecause you don't have it, or be frustrated because you can't find a file.\n\nIf you don't have an Internet connection where you are DJing, do not worry. \nYou can search all the tracks you need at home where you have a connection, \nand cache all the songs on your local or external hard drive, then play them \noffline from your club.\n\nThe songs browsed by NetSearch are files which are freely available on the \nInternet, as found on promotional websites and free catalogs. That includes \nseveral millions of songs, mainstream music as well as underground tracks or \nspecific remixes. Atomix Productions is also working with selected content \nproviders to keep NetSearch catalog as extensive as possible.\n\n\n* MusicGroups\n\nNext is MusicGroups. MusicGroups is actually two features in one.\n\nFirst, MusicGroups let you show to the world what music you play.\n\nWhen you DJ with VirtualDJ, your playlist will automatically be sent, to your \nMusicGroup. Your friends and fans will be able to follow what you play, and vote \nfor you or leave comments.\n\nYou can also get together with other DJs who have the same musical style as you, \nand try to create one of the best generic MusicGroup, and become a reference.\n\nBut the true power of MusicGroups lies in the feedbacks it will give you. While \nyou are DJing with VirtualDJ, MusicGroups will constantly analyze what you are \nplaying, and will make suggestions of what other DJs would have played next. \nThe suggestion is based on what other DJs around the world play, with a stronger \nweight to the ones from the MusicGroups you subscribed to.\n\nUnlike existing music matching solutions, MusicGroups suggestions are not based \non automated music-likeness. MusicGroups gives you real advices, based on what \nmillions of real DJs are playing every day in clubs.\n\nYou will find out that MusicGroups is a very good way to discover new tracks, \nand expend your sets.\n\n\n* New Timecode Engine\n\nFor those of you who like the touch and feel of vinyls, you will love the new \nTimecode Engine of VirtualDJ 6. Rewritten from scratch, it brings a much better \naccuracy and responsiveness to timecodes.\n\nThe new Timecode Engine has been optimized with the traditional VirtualDJ v5 \nrecords, but can now also run in noisemap mode, and bring VirtualDJ's myriad \nof features while still using competitors' timecode solutions.\n\n\n* New skin engine\n\nVirtualDJ 6 got rid of one of the annoying limitation of VirtualDJ v5: You can \nnow resize your window on-the-fly, without worrying about which skin is in which \nresolution.\n\nThe Skin engine brings many new elements, like ScratchWaves, ResizeZones, etc.\n\nSee the wiki for more information on Skins.\n\n\n* Improved video engine\n\nMore and more video codecs are now being played by the internal video decoder.\n\nThe video engine has also been optimized and is now 15% faster than in version 5.\n\n\n* Unicode compatibility\n\nVirtualDJ 6 is now fully Unicode compatible.\n\nFrom USA to China, from France to Russia, all your files and songs written in \nforeign languages will now play and display flawlessly in VirtualDJ, both on PC \nand on Mac.\n\n\n* Various improvements and bug fixes\n\nVersion 6 also brings a long list of small improvements and bug fixes, thanks \nto the reports and help of hundreds of users who helped us to make it the most \nflawless software we ever released.\n\n\n\nMinimum Requirements: \n- PIII 850 MhZ computer \n- 1024x768 SVGA video \n- DirectX compatible soundcard \n- 512 MB RAM \n- 20 MB free on the hard-drive \n\n\nThe recommended configuration is:\n- PIV 3 GhZ computer \n- 1024x768 SVGA video \n- 4.1 DirectX compatible soundcard (with front and rear separate outputs) \n- 1024 MB RAM \n- 200 MB free on the hard-drive\n \n\nThe recommended configuration to mix video is:\n- Dual Core 2 GhZ CPU \n- dual output ATI or nVidia video card with 1Gb of on-board memory \n  (no integrated laptop videocard) \n- 2048 MB RAM \n\n\nEnJoY\n\n\nDownLoad,SEED,Comment:D\n\n\n&quot;6PckOfAbs&quot;","torrent":{"xt":"urn:btih:9533ade70e0999e1e65fef0570b11289226662c1","amp;dn":"Atomix+Virtual+DJ+v6.0.2+Professional+%2B+Key%2C+6PckOfAbs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9533ade70e0999e1e65fef0570b11289226662c1","infoHashBuffer":{"type":"Buffer","data":[149,51,173,231,14,9,153,225,230,95,239,5,112,177,18,137,34,102,98,193]},"announce":[],"urlList":[]}}