{"title":"Blacks - 1.5 - Promo *GrimesPromoMan*","uid":5109673,"size":77568001,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:958c599d3ed78a5b172f7463b24f784a9773809e&amp;dn=Blacks+-+1.5+-+Promo+%2AGrimesPromoMan%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GrimesPromoMan","files":11,"time":1254663007,"description":"Blacks 1.5 - Free Promo\n\nTrack Listing\n\n* 1. 1.5 Freestyle - produced by Nocturnal\n* 2. Final Lap feat Jammer - produced by Silencer\n* 3. Slump Man feat Kozzie &amp; Mischief - produced by Nocturnal\n* 4. Unforgiven feat Mischief - produced by SNK\n* 5. Can't Beat Me - produced by Maniac\n* 6. Say Something I Don't Like (Clip) feat P Money - produced by Shotz\n* 7. U Man R Dons feat Mischief - produced by SNK\n* 8. My Name feat Brags\n* 9. Is He Real\n* 10. Don't Chat My Name\n* 11. WW4 Freestyle feat Germz - produced by Silencer\n* 12. Logan Sama set\n\n______________________________________________________________________________\n\nBlacks, an MC from Blue Borough (South London), started his career in the crew Fatal Assassins in 2000, and participated in the release of two mixtapes, 2000 &amp; Fatal and The Roads Are Fatal. He was also associated with Neckle Camp when the crew were more active.\n\nHe is currently a member of the crew OGs and featured on their debut mixtape entitled OG Season. He also realeased his first solo mixtape, The Blackout, in April 2008 and it featured many top names in the scene like Jammer, P Money, Dot Rotten and Little Dee. He also concluded a very good 2008 for himself with his Free Xmas Download, a 10 track promo released on Christmas Eve.\n\nHe is well liked for the hype he brings to tracks and radio sets, as well as his greezy bars.\n\nBlacks' second mixtape, Sick Individual, is scheduled to be in stores in October 2009. He has shot a hood video for the tune Fuckery which features P Money and is taken from this project.\n\nIn anticipation for this cd, Blacks released a second free download in 2009, titled 1.5. This project features MC's such as Jammer, Mischief and P Money and producers such as Silencer, Maniac and Nocturnal.\n\nBlacks is seen as a very good example of the positive impact which attending pirate radio regularly can bring to an MC's popularity, as his many B2B sessions on Rinse FM with fellow OGs member P Money have noticeably increased his talent as well as his fanbase.\n\nBlacks can usually be heard on JJ's Rinse FM show on Monday mornings from 1-3 am.","torrent":{"xt":"urn:btih:958c599d3ed78a5b172f7463b24f784a9773809e","amp;dn":"Blacks+-+1.5+-+Promo+%2AGrimesPromoMan%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"958c599d3ed78a5b172f7463b24f784a9773809e","infoHashBuffer":{"type":"Buffer","data":[149,140,89,157,62,215,138,91,23,47,116,99,178,79,120,74,151,115,128,158]},"announce":[],"urlList":[]}}