{"title":"Big Boss 3 Episode 8 - 11 Oct 09 - MaDdY[TLrG]{}.wmv","uid":5122710,"size":249186293,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:96882abb2b148da1b00397b3425441a7c191a185&amp;dn=Big+Boss+3+Episode+8+-+11+Oct+09+-+MaDdY%5BTLrG%5D%7B%7D.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bindass","files":1,"time":1255443643,"description":"Kamaal relised what he was doing and Raju also made him understand not to behave like the same and He relised finally or hunger made him relize.. hehehhe..\n\nToday is the Nomination Day..\n\nRohit Nominated        :- Kamaal and Sherlyn\nBaktyaar Nominated  :- Kamaal and Sherlyn\nAaditi Nominated       :- Kamaal and Sherlyn\nVindu Nominated       :- Poonam and Tanaaz\nClaudia Nominated     :- Kamaal and Sherlyn\nTanaaz Nominated     :- Kamaal and Sherlyn\nIsmail Nominated       :- Tanaaz and Baktyaar\nShamita Nominated    :- Kamaal and Sherlyn\nRaju Nominated         :- Poonam and Baktyaar\nPoonam Nominated    :- Kamaal and Ismail\nSherlyn Nominated     :- Tanaaz and Baktyaar\nKamaal Nominated     :- Poonam and Baktyaar\n\n\nKamaal Confessed to Claudia and ask her to pardon Him..\n\nBig Boss announced 2 people who is nominated this Week .. Kamaal and Sherlyn... After the Announcement Kamaal looked Depressed..\n\nIsmail appreciated Claudia and her Dress and asked where she bought from. .. Any how Kamaal looks very depressed and He showed his depression  by showing Sympathy for Sherlyn. and trying to protect her by his shymaapathy..\n\nVindu and Raju taking together and Taking about Kamaal how he trying to Over react and showing his stupidity in the show,,\n\nIsmail teaching Song to Sushmita and asked her to sing like a baby and she was singing a song &quot; Kya yahi pyaar hai &quot; very sweetly.. aww She is really cute as well as her Sweet voice..\n\nTanaaz and Baktyaar had a Hubby wife discussion.. Again Tanaaz giving again Lesson to baktyaar how to behave with her wife..Tanaaz is behaving like stranger or trying to show is very educated or over confidence.\n\nBig Boss gave a tast to members..  Big Boss gave Relax to Female not to do any House Work and everyone have to sing song in the garden area wearing a Red T=shirt whenever Big Boss rang a Alarm. Song is &quot; ak Doosre se karte hai Pyaar him&quot; and another tast is Everymember have to eat together at the Dinning area.\n\nAwww they all looking so cute and singing song of Brotherhood right..\n\nkamaal Showing overconfidence and I feel he is a Syco or frustrated.\n\nPoor Sherlyn first time I seen her crying and taking like innocent in front of Poonam and claudia.\n\nRaju is playing smart as he trying to do bitching of both side,,. ..\n\nLets see what happend next....\n\nAahaa.. Look Big Boss teaching Brotherhood trough his Show to House members and too us also..\n\n\nThis Time Voting lines are closed means No Elimination this Week. ","torrent":{"xt":"urn:btih:96882abb2b148da1b00397b3425441a7c191a185","amp;dn":"Big+Boss+3+Episode+8+-+11+Oct+09+-+MaDdY%5BTLrG%5D%7B%7D.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96882abb2b148da1b00397b3425441a7c191a185","infoHashBuffer":{"type":"Buffer","data":[150,136,42,187,43,20,141,161,176,3,151,179,66,84,65,167,193,145,161,133]},"announce":[],"urlList":[]}}