{"title":"Coast to Coast AM - Aug 11 2009 - Ghosts &amp; Spirits","uid":5063036,"size":55995903,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:96e9a4a53a188f415d85f2ee2b2a2e423b53d396&amp;dn=Coast+to+Coast+AM+-+Aug+11+2009+-+Ghosts+%26+Spirits&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1250795918,"description":"Ghost hunter John Kachuba, who's investigated more than 100 haunted locations throughout the U.S., discussed his most recent work examining how various religions and cultures explain the ghostly realm, as well as some of his ghost hunts and theories. The Lakota Sioux Indians had an interesting concept regarding the afterlife-- they believed people have three elements: divine essence, personality, and a soul. When someone dies, their divine essence is reunited with the cosmos, but their personality survives in the ghost world of psychic phenomena and can drop in at will, he explained.\n\nIn Hindu belief, the spirit of a deceased person hovers for 11-12 days after their death, remaining with their family in a kind of &quot;liminal state of ghosthood,&quot; before eventually moving on to reincarnation, Kachuba noted. In Japan, ghost stories tend to be more violent, as depicted in movies like The Ring. In Malta, there's a tradition of a &quot;dwarf ghost&quot; who guards a family's wealth, he recounted.\n\nKachuba said he uses a dowsing rod at haunted locations to find areas with higher degrees of energy, and also taps into his meditation practice for insight. Institutions like prisons tend to be more haunted because of the tension and turmoil that is generated there, and possibly imprinted into the atmosphere. Some hauntings are of a residual type that are non-interactive and just play like a hologram, he detailed. For a look at one of his ghost hunts, check out this long-form video shot at the Cincinnati Observatory, in which he teamed up with a group of investigators called Spiritual HOPE.\n\nPerseids &amp; Space News\nFirst hour guest, astronomer Phil Plait shared updates on space-related topics. The Perseid meteor shower which is peaking Tuesday night (Aug. 12th) is composed of debris from the comet Swift-Tuttle that it sheds as it makes its yearly pass around the sun. The meteors, seen as often as once-per-minute, can be extremely tiny, like grains of sand, he said. Plait also addressed Buzz Aldrin's comment regarding the existence of a monolith on a Martian moon-- suggesting that it was probably a large boulder.\n\n[This information has been shared to spread knowledge to those who otherwise would not have access to it.  If you can afford it please support www.coasttocoast.com]","torrent":{"xt":"urn:btih:96e9a4a53a188f415d85f2ee2b2a2e423b53d396","amp;dn":"Coast+to+Coast+AM+-+Aug+11+2009+-+Ghosts+%26+Spirits","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96e9a4a53a188f415d85f2ee2b2a2e423b53d396","infoHashBuffer":{"type":"Buffer","data":[150,233,164,165,58,24,143,65,93,133,242,238,43,42,46,66,59,83,211,150]},"announce":[],"urlList":[]}}