{"title":"Angel_01x01 - Los.Angel[CR-Bt].avi","uid":5101363,"size":523814912,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:974db35fba301a9dd7b239306625d65b8b3b3c7d&amp;dn=Angel_01x01+-+Los.Angel%5BCR-Bt%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"CR-Bt","files":1,"time":1254003195,"description":"Maggiori informazioni su www.colombo-reloaded.org\n\nANGEL la serie completa\n\nAlla serie, concentrata sull'attivitÃƒÂ  di Angel a Los Angeles, ÃƒÂ¨ stato dato un tono piÃƒÂ¹ tetro rispetto a Buffy l'ammazzavampiri. Il telefilm tratta la storia di Angel, un vampiro che dopo una serie di aberranti omicidi e torture contro le sue vittime, ÃƒÂ¨ tormentato dal ritorno della sua anima. Durante le prime quattro stagioni ÃƒÂ¨ a capo di un'agenzia investigativa (la &quot;Angel Investigations&quot;); Angel lavora quindi come detective privato in una versione romanzata di Los Angeles, California, dove lui e i suoi collaboratori si impegnano ad &quot;aiutare gli indifesi&quot; e a &quot;salvare le anime&quot; di coloro che hanno perso la strada. In genere, questa missione comporta la lotta contro il Male o demoni alleati con l'uomo (in primo luogo lo studio legale Wolfram &amp; Hart). Come sfondo alla serie c'ÃƒÂ¨ la sfida che Angel deve affrontare: la consapevolezza della sua natura oscura (il suo alter-ego Angelus) e la possibilitÃƒÂ  di ridiventare umano grazie all'adempimento di un'antica \t\nprofezia (la Shanshu). Nella quinta stagione, i Soci Anziani della Wolfram &amp; Hart affidano ad Angel il controllo dello studio di Los Angeles della loro societÃƒÂ , nel tentativo di corrompere i suoi buoni propositi. Angel accetta, consapevole che l'accordo costituirÃƒÂ  un'opportunitÃƒÂ  per la lotta contro il male dal suo interno. Una scelta che avrÃƒÂ  perÃƒÂ² conseguenze catastrofiche per il suo gruppo, con la morte di alcuni dei suoi piÃƒÂ¹ cari amici e lo scontro finale con le Armate Infernali sullo sfondo di un mondo sul baratro dell'Apocalisse.In aggiunta all'attore David Boreanaz, la serie Angel ha ereditato da Buffy Charisma Carpenter che nella serie interpretava Cordelia Chase. Quando Glenn Quinn (Allen Francis Doyle) ha lasciato la serie nel corso della sua prima stagione, ha preso il suo posto Alexis Denisof (Wesley Wyndam-Pryce), altro personaggio di Buffy, presente negli ultimi nove episodi della terza stagione. Carpenter e Denisof sono stati seguiti piÃƒÂ¹ tardi da Mercedes McNab (Harmony Kendall) e James Marsters (Spike). Diversi attori, che a suo tempo hanno recitato in Buffy, sono ricomparsi nella serie spin-off, tra cui Seth Green (Oz), Sarah Michelle Gellar (Buffy Summers), Eliza Dushku (Faith Lehane), Tom Lenk (Andrew Wells), e Alyson Hannigan (Willow Rosenberg). Angel ha inoltre continuato a comparire occasionalmente in Buffy.","torrent":{"xt":"urn:btih:974db35fba301a9dd7b239306625d65b8b3b3c7d","amp;dn":"Angel_01x01+-+Los.Angel%5BCR-Bt%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"974db35fba301a9dd7b239306625d65b8b3b3c7d","infoHashBuffer":{"type":"Buffer","data":[151,77,179,95,186,48,26,157,215,178,57,48,102,37,214,91,139,59,60,125]},"announce":[],"urlList":[]}}