{"title":"S08 E13 FC de kampioenen - Spoorloos.avi","uid":5047905,"size":314591232,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:97b8ddf9221b98ab3a95595268ecec85b0db26a9&amp;dn=S08+E13+FC+de+kampioenen+-+Spoorloos.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xkissie","files":1,"time":1249739238,"description":"# Pascale wil bij Boma gaan wonen, tegen de zin van Bieke. Zij probeert haar moeder te koppelen aan haar baas bij Publitime: Jos Dobbelaere. Deze interpreteert dit verkeerd en denkt dat Bieke een relatie met hem wil.\n# Nu Pascale bij Boma wil gaan wonen, wil DDT het cafÃƒÂ© kopen. Hij maakt zijn moeder wijs dat hij er een woonst voor Pol en Doortje van wil maken om haar geld te ontfutselen. Ma DDT merkt echter op dat als Pol en Doortje verhuizen de loft vrijkomt en zij daar kan komen wonen.\n# Pascale trekt toch bij Boma in.\n# Carmen neemt tijdelijk het cafÃƒÂ© over van Pascale.\n# DDT wil concurreren met de Kampioenen en opent een eigen kantine.\n# Carmen wil passen op het hondje van de dokter. Ze is erg blij dat ze binnenkort een nieuw boeleke krijgt. Dit wordt verkeerd geÃƒÂ¯nterpreteerd door Xavier, die denkt dat hij vader wordt. Doortje wil hem voorbereiden op zijn vaderschap, maar dan denkt iedereen dat Xavier Doortje zwanger heeft gemaakt.\n# De Kampioenen zijn niet tevreden over Marc als keeper.\n# Marc heeft een zoekertje geplaats om werk te vinden als ober.\n# Wanneer er talentscouts opduiken in het cafÃƒÂ© denkt Marc dat ze hem werk komen aanbieden.\n# Xavier is het beu dat iedereen aan zijn hoofd zeurt. Hij is blij dat hij naar het leger kan omdat men hem daar tenminste met rust laat. Kolonel Vandesijpe wil echter dat Xavier, gekleed in tropenkostuum, komt opdienen bij een legerbijeenkomst. Met dit tropenkostuum doet Xavier alsof hij zijn tweelingbroer Roger is die al jaren in Congo woont.\n# DDT heeft een afspraakje met zijn droomvrouw. Pol heeft tegelijkertijd een afspraak met een lokale politica. De 2 vrouwen komen bij de verkeerde De Tremmerie terecht.\n# Een zekere Didier beweert dat hij de zoon is van DDT.\n# Boma zoekt een opvolger om zijn worstenfabriek over te nemen. Pascale stelt Bieke voor.\n# Boma logeert bij Pascale omdat zijn villa herschilderd wordt. DDT gebruikt ondertussen de villa om een potentiÃƒÂ«le klant te ontvangen.\n# Ben, een achterneefje van Pascale, logeert bij haar. De jongen kan goed voetballen Boma wil een jeugdploeg (F.C. De Kapoenen) oprichten, tegen de zin van DDT.\n# DDT wil zijn garage verkopen aan een varkenskweker. Bieke stelt de horoscopen samen voor Publitime en schrijft bij DDT's sterrenbeeld dat hem iets gruwelijks zal overkomen als hij zijn garage verkoopt. De andere kampioenen doen alsof hun horoscoop uitkomt.\n# Boma wil een clubblad beginnen.\n# Pol ontmoet een ex-vriendin (Chris De Man) die trainersstage doet bij de Kampioenen. Omdat Doortje bij haar zieke moeder logeert, trekt Chris bij Pol in.\n# Ma DDT neemt de taak van secretaresse waar tijdens Doortjes afwezigheid.\n# Kolonel Vandesijpe vraagt aan Boma om een goed woordje te doen voor hem bij Nicole op wie hij verliefd is. Nicole blijkt een nicht te zijn van Pascale. Zij vraagt aan Pascale juist hetzelfde. Door enkele misverstanden verdenken Boma en Pascale elkaar van ontrouw. DDT wil van deze situatie gebruik maken om het veld te kopen.\n# Xavier duikt onder in de villa van Boma opdat hij de grote kuis niet zou moeten doen. Boma is ondertussen enkele dagen naar een congres. Vanessa, een vriendin van Boma, duikt ook onder in de villa. Ze is op de vlucht voor haar opvliegende vriend.\n# DDT wil bij Radio Hallo een zonnebank winnen en speelt vals. Hij wordt beschuldigd van fraude en opgepakt","torrent":{"xt":"urn:btih:97b8ddf9221b98ab3a95595268ecec85b0db26a9","amp;dn":"S08+E13+FC+de+kampioenen+-+Spoorloos.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97b8ddf9221b98ab3a95595268ecec85b0db26a9","infoHashBuffer":{"type":"Buffer","data":[151,184,221,249,34,27,152,171,58,149,89,82,104,236,236,133,176,219,38,169]},"announce":[],"urlList":[]}}