{"title":"Jet - She's A Genius","uid":5075522,"size":119134212,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:97faaaad161b3cc3a6416b8edecb66defac977f9&amp;dn=Jet+-+She%5C%27s+A+Genius&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1251803050,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;She's a Genius&quot; is a song by Australian rock band Jet, scheduled to be released as the lead single off the band's upcoming third album Shaka Rock. The song was played at a secret show in Melbourne in November 2008 and was announced as the first single along with the album title and album artwork in April 2009. The song was made available for free download to US fans on 22 June 2009, at AOL Music for 24 hours.\n\nIt was also played live as part of their set at the Melbourne and Sydney Sound Relief concerts for the victims of the Black Saturday bushfires in March 2009.\n\nSubsequently, it was made available as a free playable track in the iPhone OS game Tap Tap Revenge 2 and as a downloadable playable song for Rock Band.\n\nShaka Rock is the third studio album by Australian rock band Jet, released on the 21st of August, 2009. The title, cover art, and release date of the album were revealed through an Electronic Press Kit to promote the album.\n\nIn an Interview with MTV's Ruby Rose on Channel 10's 7pm Project, It was said two of the tracks were recorded in Australia, 1 in Melbourne and 1 in Sydney. The Tracks were not named. They also stated it would be in stores on August 19th, 2009.\n\nThe album has been posted on August 20th, 2009 on the band's MySpace page.\n\nThe record has been made 'Entertainment Weekly's Picks of The Week' for August the 23rd.\n\nJet is a rock band from Melbourne, Australia composed of Cameron Muncey, Mark Wilson, and brothers Nic and Chris Cester. The group has sold 4 million records worldwide; with their debut album Get Born, released in 2003, accounting for about 3.5 million of that figure.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:97faaaad161b3cc3a6416b8edecb66defac977f9","amp;dn":"Jet+-+She%5C%27s+A+Genius","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97faaaad161b3cc3a6416b8edecb66defac977f9","infoHashBuffer":{"type":"Buffer","data":[151,250,170,173,22,27,60,195,166,65,107,142,222,203,102,222,250,201,119,249]},"announce":[],"urlList":[]}}