{"title":"The Radio Grifters - In A Poolside Cubicle  (2009) - mp3-320 kbp","uid":5127264,"size":120502641,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:98a5acad775fbeda95f48c955fd02e6c1db00aa5&amp;dn=The+Radio+Grifters+-+In+A+Poolside+Cubicle++%282009%29+-+mp3-320+kbp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bray4132","files":11,"time":1255743296,"description":"The Radio Grifters - In A Poolside Cubicle\nJune 16, 2009\nTRG 1001\n\n1. Intro\n2. Common Ground\n3. The Mule\n4. My Automobile\n5. Same Old Crowd\n6. Zen Cowboy\n7. I Tried To Warn You\n8. Letters In The Sand\n9. Needless\n\nwww.theradiogrifters.com\n\n----------------------------------\n\nThe Radio Grifters, a trio formed in South Korea, have let loose their collective energies for their first full-length album, In A Poolside Cubicle. I can truly say that this album gets your blood pumping, your body moving, and your head bobbing. From his thick-fuzzed riffs to twangy lead lines, Bryan's guitar cuts straight through right from the start. Couple his sound with Mike's apt bass lines and Matteo's widely varying and in-pocket drumming, and you have a sound that summons some legendary imagery; think of an amalgam of Hendrix, Vaughan, Zeppelin, Mayer (of the trio variety) and even shades of moe.'s rhythmic combinations.\n\nWhatever influences you might find while listening, you'll most certainly also realize this band is distinctly their own. There is blues, there is funk, there is in-your-face rock, and there is a soulful vocal exposition that weaves it all together.\n\nFrom the first solo section in 'Common Ground,' which is a monster, you'll get your kicks from Matteo's driving staccato drums as the guitar slowly builds thoughtfully, with both real feeling and grit.\n\n'Same Old Crowd' is in some ways the centerpiece of the album, written about Bryan's return to America from South Korea, to find it remains just as he left it. It also shows off his instinctive ability to arrange horns (after all, he is a bitchin' sax player) in a way that is potent and cohesive.\n\n'Zen Cowboy' propels you away from your standard blues-rock with its funky rhythmic structure into territory seldom covered by the genre.\n\nThe brooding melancholy intro of 'I Tried To Warn You' is balanced with a nasty-mean punch from the guitar, hard bass and crashing drums. There is a force behind this song and if you're not on your feet heading for the nearest bottle of Jack when this track comes on, I fear you may not have a soul.\n\nOverall, their effort has a feel that is familiar yet fresh and is, above all, music that will simply make you smile.\n\n- Steve Kemper","torrent":{"xt":"urn:btih:98a5acad775fbeda95f48c955fd02e6c1db00aa5","amp;dn":"The+Radio+Grifters+-+In+A+Poolside+Cubicle++%282009%29+-+mp3-320+kbp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98a5acad775fbeda95f48c955fd02e6c1db00aa5","infoHashBuffer":{"type":"Buffer","data":[152,165,172,173,119,95,190,218,149,244,140,149,95,208,46,108,29,176,10,165]},"announce":[],"urlList":[]}}