{"title":"Dead Space Extraction [PAL] [Wii][ojuegos.eu]","uid":5097104,"size":4623696880,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:98dc368b55b57c94ac740dc9f923d9df7c565ee0&amp;dn=Dead+Space+Extraction+%5BPAL%5D+%5BWii%5D%5Bojuegos.eu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Morck22","files":95,"time":1253661473,"description":"Hazte un camino luchando a travÃƒÂ©s de una batalla ÃƒÂ©pica por la supervivencia en Dead Space. El novedoso Dead Space Extraction te situa muerto en medio de la invasiÃƒÂ³n inicial de Necromorph que amenaza a la humanidad. Descubre como comenzÃƒÂ³ el terror en esta nueva experiencia de horror exclusiva para Wii.\n\nDead Space Extraction centra la historia desconocida del Aegi XII Colony a travÃƒÂ©s de una serie de supervivientes que tratan de llegar al USG Ishimura en medio de una horrible infecciÃƒÂ³n. A medida que sus aliados caen misteriosamente vÃƒÂ­ctimas de la demencia, deja claro que proteger a una joven para garantizarles una extraÃƒÂ±a inmunidad puede ser su ÃƒÂºltima esperanza para sobrevivir.\nEn cualquier sombra, tras cualquier esquina, se esconde el terror. Lucha contra el azote alienÃƒÂ­gena solo o con un amigo para destrozar a los amenazantes Necromorphs, resuelve misterios desafiantes y desafÃƒÂ­a todo para llegar a la salvaciÃƒÂ³n. Siente el terror como nunca antes en el juego de acciÃƒÂ³n mÃƒÂ¡s cinematogrÃƒÂ¡fico para Wii.\n\nCaracterÃƒÂ­sticas:\n# Nueva precuela exclusiva para Wii\nÃ‚Â· Sigue la vida de varios colonos del Aegis XII a medida que abren un sangriento camino hacia la supervivencia.\nÃ‚Â· Conoce un nuevo tipo de personajes, destruye nuevos enemigos y usa nuevas armas.\n# Terror real\nÃ‚Â· GrÃƒÂ¡ficos sorprendentes, audio terrorÃƒÂ­fico y una frenÃƒÂ©tica perspectiva en primera persona te empujan directo hacia el terror.\n# Controles intuitivos\nÃ‚Â· Descuartiza estratÃƒÂ©gicamente a tus enemigos con el Wii Remote.\nÃ‚Â· Maneja un poderoso arsenal de habilidades y armas para congelar a tus enemigos, manipular la gravedad con telekinesis, resuelve puzzles y lucha en gravedad cero.\n# Juego cooperativo\nÃ‚Â· Lucha con un amigo contra los invasores del USG Ishimura con un juego cooperativo.\nÃ‚Â· Combina esfuerzos para resolver problemas o determinar roles especÃƒÂ­ficos para crear una experiencia ÃƒÂºnica en cada sesiÃƒÂ³n de juego.","torrent":{"xt":"urn:btih:98dc368b55b57c94ac740dc9f923d9df7c565ee0","amp;dn":"Dead+Space+Extraction+%5BPAL%5D+%5BWii%5D%5Bojuegos.eu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98dc368b55b57c94ac740dc9f923d9df7c565ee0","infoHashBuffer":{"type":"Buffer","data":[152,220,54,139,85,181,124,148,172,116,13,201,249,35,217,223,124,86,94,224]},"announce":[],"urlList":[]}}