{"title":"HBO HUNG S01E08 YOU COME JUST RIGHT - AAADICTEDONE HD 720P MP4 P","uid":5069459,"size":768141929,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:98edb1f194588dca001843063403a3ee43a22424&amp;dn=HBO+HUNG+S01E08+YOU+COME+JUST+RIGHT+-+AAADICTEDONE+HD+720P+MP4+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"aaadicted","files":1,"time":1251273528,"description":"| a | a | a | d | i | c | t | e | d | o | n | e |==| H | D |==| M | P | 4 |\n\n\n-=- HBO -=-\n\nHUNG\n\nSeason 1\n\nEpisode 8\n\n&quot;Thith Ith a Prothetic&quot; or &quot;You Come Just Right&quot;\n\n\n| a | a | a | d | i | c | t | e | d | o | n | e |==| H | D |==| M | P | 4 |\n\nRay leaves another message for Jemma as he continues to wait on the dock for her. Finally, she calls to say she's not going to make it -- they need a break. Jilted, Ray shows up at Jessica's and Ronnie's for family dinner and after observing some tension, corners Ronnie and demands to know how he &quot;got the girl.&quot;\n\nTanya shows up at Ray's request and gets frustrated when she realizes he wants advice about Jemma. She shows him the new Happiness Consultants ad (with a phone number this time) and insists he needs to commit to being part of her winning team. Tanya's first response to the ad is from Lenore, who criticizes her marketing strategy.\n\nMeanwhile, Jessica confronts Ray, having learned he suggested to Ronnie that she married him for his money. &quot;I divorced a boy to marry a man,&quot; she corrects him.\n\nTanya takes Lenore's suggestion and approaches a fellow temp, &quot;Horny Sally,&quot; about Happiness Consultants (passing it off as Lenore's service). Sally bites, and during her session with Ray, she admits that she loves the fact that on this date, no matter what she does or says, Ray has to do what she wants.\n\nRay tracks Jemma down at work to give her a heartfelt letter, but she rejects him. Meanwhile Tanya is disturbed when Pierce announces he can't stay the night, and she realizes she hardly knows anything about him. Drowning his sorrows at the bar, Ray is heckled by a former high school classmate who drags Ray out to the ball field in the rain. The former pitcher hurls fastballs at Ray as he berates him for hitting a home run off him in the bottom of the last inning his senior year. Fending off the barrage, Ray continues to make &quot;contact.&quot; When he gets back to his tent, Tanya is waiting with a wad of cash from Jemma and an explanation: Jemma wanted to break up with a guy and hurt him, the way she'd been hurt. Tanya comforts him, gets him out of his wet clothes, and resists his advances. She asks why he never called her after their first night together, aside from the fact that he thinks she &quot;comes too much,&quot; and Ray assures her she comes just right...as he drifts off to sleep.\n\n| a | a | a | d | i | c | t | e | d | o | n | e |==| H | D |==| M | P | 4 |\n\n\nStats - http://bayimg.com/GaDOcAAch\n\nScreenshot - http://bayimg.com/gADoHaaCh\n\n\n| a | a | a | d | i | c | t | e | d | o | n | e |==| H | D |==| M | P | 4 |\n","torrent":{"xt":"urn:btih:98edb1f194588dca001843063403a3ee43a22424","amp;dn":"HBO+HUNG+S01E08+YOU+COME+JUST+RIGHT+-+AAADICTEDONE+HD+720P+MP4+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98edb1f194588dca001843063403a3ee43a22424","infoHashBuffer":{"type":"Buffer","data":[152,237,177,241,148,88,141,202,0,24,67,6,52,3,163,238,67,162,36,36]},"announce":[],"urlList":[]}}