{"title":"Coast to Coast AM - Aug 28 2009 - Death Premonitions &amp; Open Line","uid":5072868,"size":56506397,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:991d6618527485a0334c382580d9416436a8bd8c&amp;dn=Coast+to+Coast+AM+-+Aug+28+2009+-+Death+Premonitions+%26+Open+Line&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"0vercast","files":4,"time":1251563186,"description":"Death Premonitions &amp; Open Lines\n\nDate: 08-28-09\nHost: Ian Punnett\nGuests: Open Lines, Dr. Peter Fenwick\n\nIn the first half of the program, Ian Punnett welcomed neuropsychiatrist and world renowned expert on end of life phenomena, Dr. Peter Fenwick (email). According to Fenwick, the dying often receive visitations in their last few weeks from deceased relatives, who come to help them through the death process. These deathbed visions are not limited to religious people either, he added. Fenwick also pointed out that people who have attempted to kill themselves will sometimes attempt suicide again to recapture the power of a near death experience.\n\nFenwick is currently collecting accounts of premonitions of death. Writings of the Dalai Lama suggest that people know when they will die about two years before the event, he said. Fenwick shared a story about a 25-year-old man who told his wife that it was time for him to leave this life. He was killed in a plane crash soon thereafter, Fenwick said. People phoned in with their own death premonition stories during the second hour.\n\nThroughout Open Lines callers continued sharing stories about death-related experiences and premonitions. Colin in Kentucky talked about a premonition his father had after a surgery to deal with his bladder cancer. Despite being told that everything looked good and he would be released in a week, Colin remembered his father warning him that he wouldn't be there in the morning. Colin said the next day his father died after complications from a blood clot.\n\nCara in Phoenix told Ian she felt a &quot;ripping pain in [her] chest&quot; the morning her mother passed away. Six months later she felt the same chest pain and found out that her grandfather had died. John in Orlando recalled a recurring dream he had for almost a week about his mother in a casket wearing a particular dress. Two weeks later she died and was buried in the outfit John saw in his vision. Natalie said she predicted the death of a fellow soldier in her unit. Three months into their deployment he died, she noted.","torrent":{"xt":"urn:btih:991d6618527485a0334c382580d9416436a8bd8c","amp;dn":"Coast+to+Coast+AM+-+Aug+28+2009+-+Death+Premonitions+%26+Open+Line","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"991d6618527485a0334c382580d9416436a8bd8c","infoHashBuffer":{"type":"Buffer","data":[153,29,102,24,82,116,133,160,51,76,56,37,128,217,65,100,54,168,189,140]},"announce":[],"urlList":[]}}