{"title":"Def Leppard - Now  (Xvid-2nafish)","uid":5590954,"size":73687504,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9955522b4c7c86a07220e649168f870761824f4c&amp;dn=Def+Leppard+-+Now++%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1274865465,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:51\n\n[Video]\nResolution : 720x540\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 2225 Kbps\nQuality Factor : 0.20 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Now&quot; is a 2002 song by British hard rock band Def Leppard from their X album. \n\nThe music video focuses on a Def Leppard Union Jack T-shirt that finds its way through different owners for nearly two decades. It starts in the year 1983, where a teenage woman purchases the shirt from a music store. One day, as she is sleeping, her younger brother steals the shirt and rides off with his friend to sneak into a neighbour's backyard and use the swimming pool. They quickly run away when the homeowner spots them, leaving the shirt behind.\n\nIn 1985, a man buys the shirt at a garage sale. At a parking lot prior to a Def Leppard concert, he surrenders it to a female fan after she flashes him. When the band's tour bus arrives, the female fan has bassist Rick Savage autograph the shirt. Shortly after the concert, she meets a roadie and makes out with him in the bus, where he takes possession of the shirt.\n\nIn 1987, the roadie enters a coin-op laundromat to have the shirt and his laundry cleaned. As he sleeps while waiting for his laundry, a woman steals the shirt and slips it between her laundry in a cart.\n\nThe video ends in the year 2002, where a woman (presumably an older version of the teenager from the 1983 scene), buys the shirt from an online auction and shortly receives it in the mail.\n\nX is the eighth studio album by British rock  band Def Leppard, released in 2002. Much like 1996's Slang, it featured another departure from their signature sound by moving into the pop genre. Most of the album was produced by Pete Woodroffe and the band, with remaining tracks produced by either Marti Frederiksen or Per Aldeheim and Andreas Carlsson.\n\nThe album features the Roman numeral 'X', recognising it as their tenth album release, although the album is in fact only their eighth collection of all-new studio material. The other two albums released by the band prior to the release of X, Retro Active and Vault, were a rerecording of B-sides and rarities and a greatest hits set respectively.\n\nDespite the fact that it received generally positive reviews, the album did not sell to the standards of their previous releases and failed to earn any RIAA-certification. Nothing from this album has been performed live by the band since the conclusion of its supporting tour.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:9955522b4c7c86a07220e649168f870761824f4c","amp;dn":"Def+Leppard+-+Now++%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9955522b4c7c86a07220e649168f870761824f4c","infoHashBuffer":{"type":"Buffer","data":[153,85,82,43,76,124,134,160,114,32,230,73,22,143,135,7,97,130,79,76]},"announce":[],"urlList":[]}}