{"title":"ZEROCROP  Ain't No Wanker","uid":5114201,"size":26010501,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:998941797558495a6c2945f9774ad1105b68f45f&amp;dn=ZEROCROP++Ain%5C%27t+No+Wanker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TopsyCrett","files":-1,"time":1254973033,"description":"Zerocrop  AIN'T NO WANKER\n\n02.02.00: Music review: Fluid magazine\n\nDo you ever get sick of the bland diet of boy bands and sentimental girlies that ooze from \n\nthe charts and sound systems of gay venues? You're not alone. It was that banality and lack \n\nof music with any gay content that inspired a man known only as Zerocrop to produce his own \n\nsingle and multi-media experience, the subversive Ain't No W*nker. You can't really imagine \n\nWestlife doing a cover version of it, can you?\n\n\nZerocrop's sound is a fusion of pop, dance and electronica. He mixes his won voice with \n\nthose of guys on chatlines who were up for ruff fun. &quot;I'm fascinated by how people express \n\nthemselves when they're looking for sex in this way. Whether they're speaking or typing they \n\nsay such great things and I wanted to shine a light on that&quot; the enigmatic Zerocop explains \n\nvia email, which seems appropriate considering his multi-media approach. The CD single is \n\nactually a CD extra, with a full-length multi-media peepshow. Users can eavesdrop on the \n\ngenuine private conversations that 40 different guys had with Zerocrop, read the text that \n\neach guy typed and check out the phots they sent, albeit reproduced as minimalist modern \n\ngraphics.\n\n\n&quot;I think it's a bit more interesting than a pop video with me playing the guitar in the \n\nshower and all that crap.&quot; So what's the song about anyway? &quot;The song Ain't No W*nker is \n\nabout a kidnap scene with a top who, when he's got you tied-up and gagged-up, decides to \n\nkeep you prisoner forever. Mmmm nice.&quot; You said it. &quot;Ain't No W*nker really means &quot;I'm for \n\nreal, I'm not a time-waster&quot; and in a rough sex sense it means &quot;you can trust me, I'm safe \n\nand sane&quot;, and on a general level it means &quot;I'm not another boring tosser&quot;. \n\nAin't No W*nker is the first Zerocrop release, available on CDextra, from 1st January 2000, \n\nto coincide with the new millenium. Ain't No W*nker is a ground-breaking mashup of beats, \n\ntortured vinyl, guitars and voices recorded from gay telephone chatlines. The three music \n\ntracks are \n\nAin't No W*nker, \nSix Foot Blond Hair Smooth and \nInto Really Hot Horny Fucking Raunchy Times Mate. I Want To Meet You. &quot;\n\n &lt;a href=&quot;\nhttp://www.zerocrop.com/aintnowanker/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.zerocrop.com/aintnowanker/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.roberturban.com/GGWinterviewzerocrop.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.roberturban.com/GGWinterviewzerocrop.html&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:998941797558495a6c2945f9774ad1105b68f45f","amp;dn":"ZEROCROP++Ain%5C%27t+No+Wanker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"998941797558495a6c2945f9774ad1105b68f45f","infoHashBuffer":{"type":"Buffer","data":[153,137,65,121,117,88,73,90,108,41,69,249,119,74,209,16,91,104,244,95]},"announce":[],"urlList":[]}}