{"title":"Robert Klein Comedy Collection (HBO Specials, Comedy Albums)","uid":5660280,"size":2888012528,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:998d1cc811e1b80005d7a4767635883a590efbc7&amp;dn=Robert+Klein+Comedy+Collection+%28HBO+Specials%2C+Comedy+Albums%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"rambam1776","files":-1,"time":1277946846,"description":"AVI File Details\n========================================\nName.........: HBO Comedy Special - TYPICAL SHOW.avi\nFilesize.....: 231 MB (or 237,526 KB or 243,226,624 bytes)\nRuntime......: 00:58:48 (105,746 fr)\nVideo Codec..: XviD\nVideo Bitrate: 439 kb/s\nAudio Codec..: 0x0055(MP3) ID'd as MPEG-1 Layer 3\nAudio Bitrate: 104 kb/s (52/ch, stereo) VBR LAME3.97\nFrame Size...: 480x368 (1.30:1) [=30:23]\n\n**NOTE** - I've just gone ahead and lumped ALL of the HBO specials and comedy albums into one torrent.\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Robert_Klein&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Robert_Klein&lt;/a&gt;\n\nEarly life\n\nKlein was born in the Bronx, the son of Frieda (nÃƒÂ©e Moskowitz) and Benjamin Klein[4][5] and was raised in a &quot;prototypical 1950s Bronx Jewish&quot; environment.[6] After graduating from De Witt Clinton high school, Klein planned to study medicine. However, he changed his mind during his studies in university. After graduating from Alfred University, he studied at Yale Drama School[7] when he got wind of an opportunity to audition for The Second City. In a piece he wrote for the improvisational troupe's book, Klein recalled sitting in a room full of other hopefuls including Fred Willard. Klein's audition consisted of an improvisation set with Willard about two guys in a nightclub, which was successful enough to get Klein and Willard hired to join The Second City. Klein had said another young man, Billy Dee Williams, was invited to join the troupe but turned it down.\n\nCareer\n\nHis first major appearance was as host of the 1970 summer replacement television series Comedy Tonight, on which were introduced many of the routines that in the next few years would be released on record albums. His extensive routines about the Watergate scandal made him highly popular in the 1970s. He was one of the first observational comedians. Klein appeared in several stand-up comedy specials on HBO dating to its very early broadcast days. He has traditionally concluded these shows with his &quot;I can't stop my leg&quot; routine. In 1979, Klein was nominated for a Tony Award for Best Actor in a Musical for his role in They're Playing Our Song.\n\nHe has appeared in such movies as The Owl and the Pussycat, Primary Colors, Radioland Murders and The Safety of Objects. He had a recurring role in the TV drama series Sisters. In the 1970s, he hosted Saturday Night Live twice.\n\nKlein is the author of The Amorous Busboy of Decatur Avenue: A Child of the Fifties Looks Back, an autobiography published in 2006.\n\nIn March 2007 he starred with Adam Sandler in Reign Over Me, and in September 2007 released a new DVD compilation of his eight live HBO specials titled Robert Klein: The HBO specials 1975-2005\n\nAlbums\n\nKlein has made several albums, the most successful being his first two. In Child of the Fifties, Klein talks about his life as a child in the 1950s: about air raid drills, Johnny Mathis music, showing off condoms while at the high school dance, the high school lunch ladies, Senator Joseph McCarthy, Governor Averill Harriman (of New York), meeting Yankee stars, the Yankees losing the World Series, and much more. He also goes into other things that he has observed in his life, such as substitute teaching, FM radio disc jockeys (as they were in 1972, when the album came out), late night delis, and two songs that he wrote and sang himself: &quot;Fabulous 50's&quot;, and &quot;Middle Class, Educated Blues.&quot;\n\nMind Over Matter, his next album, included extensive discussion of the Watergate scandal and another song, the title track, about a kid who turned to humor to become popular.\n\t","torrent":{"xt":"urn:btih:998d1cc811e1b80005d7a4767635883a590efbc7","amp;dn":"Robert+Klein+Comedy+Collection+%28HBO+Specials%2C+Comedy+Albums%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"998d1cc811e1b80005d7a4767635883a590efbc7","infoHashBuffer":{"type":"Buffer","data":[153,141,28,200,17,225,184,0,5,215,164,118,118,53,136,58,89,14,251,199]},"announce":[],"urlList":[]}}