{"title":"10641 (working)","uid":5094027,"size":3598722,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:99ca986e2a5bf75a7d0e3648be609ef735c548ec&amp;dn=10641+%28working%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Goatmaster","files":2,"time":1253389148,"description":"Taken from original torrent http://thepiratebay.se/torrent/3411323/10641 which doesn't seem to be working anymore:\n\n&quot;These two short video clips, downloaded from the website www.10641.com (where they may or may not still be available), purport to be excerpts from a longer video of the harsh interrogation of a prisoner at an undisclosed location. &quot;10641&quot; is the number painted on the back of the prisoner's shirt. The interrogator speaks English with an American accent. The prisoner is not heard speaking in this video, but according to the webmaster of www.10641.com, who claims to have received the video on a DVD anonymously mailed, the prisoner is also American.&quot;\n\nCopy of text from the website 10641.com:\n\n    &quot;If you have any information regarding the following video clips please email me at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;0d64636b624d3c3d3b393c236e626023&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; References to the Patriot Act are made in other parts of the video. It is not stated in the video if the facility is either FBI, CIA, or Department of Homeland Security. The detainee is White (Anglo) and the Interrogator's accent appears to be Mid-West with a hint of Southern Drawl. There is a reference made to the detention center as being &quot;Whiskey 2&quot;.\n\n    I have 2 short video clips from the video posted here as MPEG's. 10641-33180746 MPG and 10641-33180779 MPG. The AVI's were posted at video.google.com; however, Google recently, under pressure from outside sources (The Government?), has decided to censor one of the videos and has removed it from public viewing. You can dowload the AVI versions of the two video clips at the links below. I didn't set these up so I don't control these sites:\n\n   &lt;a href=&quot; http://static.thepiratebay.se/downloadtorrent/3411323.torrent/10641.3411323.TPB.torrent&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://static.thepiratebay.se/downloadtorrent/3411323.torrent/10641.3411323.TPB.torrent&lt;/a&gt;\n\n    10641-33180746-58.avi hosted at NYUD.net or 10641-33180746-58.avi hosted at\n    10641-33180779-812.avi hosted at NYUD.net or 10641-3318779-812.avi at\n\n    If you want to host these 2 AVI clips on your own website, LimeWire or BitTorrent or another P2P that is fine. The other torrents that I am aware of are supposedly available from 10 PM EST to about 6 AM EST. Feel free to download and spread these video clips across the world.\n\n    The complete video is approximately 1 hour in length and appears to cover a period of interrogation from several weeks to months. The original disc was labelled &quot;Interrogation (10641)&quot;. The time and date of the video are unknown because there is no date (or time) ever indicated in the video. I do not declare that the video is real, only that it exists. I (pay attention) boosted (raised) the audio. I did this because it was hard to hear and understand what was being said.\n    I was provided with some Vinyl Die-Cut stickers with the numbers &quot;10641&quot;. These stickers are ideally placed in the rear-windshield of a car. If you want a free sticker then send a letter sized &quot;Self-Addressed Stamped Envelope&quot; (SASE) with current postage to &quot;10641 Sticker, PO Box 691785, San Antonio, Texas 78269&quot;. So, to recap - if you want a free vinyl die-cut sticker you MUST mail an empty letter sized envelope (not those little envelopes that only hold a check - the letter sized ones!). Make sure that your envelope (inside the other envelope) has the correct amount of postage for a first class letter. I only have a limited supply of stickers (about 1,000). As soon as I'm out of stickers I'll take this sticker offer down.\n\n    If you recognize either of these two people or know where Whiskey-2 is please email me.\n\n    I have received emails indicating:\n\n        Whiskey-2 is a code name for &quot;Camping Hill&quot; at the Groom Lake facility in Nevada. This facility allegedly holds a few dozen &quot;detainees&quot; and is not part of the Secret Research side of the base.\n\n        Detention Center W2 is a former military facility in the Kansas/Nebraska area that was affected by a BRAC.\n\n        Whiskey-2 is a detention center in Australia for &quot;violent&quot; immigrants.\n\n        There have been approximately 65,000 Patriot Act detainees in the US and throughout the world since 9/11/01.\n\n        W2 is a reference that pertains to civilian government contractors.\n\n        I have also received emails from people stating that they knew people that have been &quot;whisked&quot; away.\n\n        The company that created the Time-Coding Sequence (Sequential Logging System) was called VidSec Technology (GSA Contractor) was bought by one of the three major defense contractors. The Time-Coding Sequence only activates when the camera is set on.\n\n    Some people have emailed me accusing me of being a liberal ACLU puppet. I'm not a member of the ACLU or any liberal organization. Sure, I agree there are elements of the video that appear to be questionable. But I'm sure that Jose Padilla thought his situation was very surreal. I'm not interested in maintaining an email database but if you want to be notified about developments related to the video you can &quot;add&quot; me as a &quot;friend&quot; at\n\n\n\n\t","torrent":{"xt":"urn:btih:99ca986e2a5bf75a7d0e3648be609ef735c548ec","amp;dn":"10641+%28working%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99ca986e2a5bf75a7d0e3648be609ef735c548ec","infoHashBuffer":{"type":"Buffer","data":[153,202,152,110,42,91,247,90,125,14,54,72,190,96,158,247,53,197,72,236]},"announce":[],"urlList":[]}}