{"title":"Joan Red","uid":5069338,"size":27215804,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9a50390b9176a25ad6d12f51e942fcea7befe643&amp;dn=Joan+Red&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lizzyborden","files":6,"time":1251259111,"description":"With a sound all their own and a front man with the voice to carry it, Joan Red is re-defining modern rock... and the new definition rolls like this: \n\nrock- (noun)- pronounced (rok) -  JOAN RED; Powerful choruses and catchy hooks driven by thunderous guitars and driving beats. It's music that takes you to another place.  A place where fans push to the front of the stage decked out in black and red to pledge loyalty to a band that most have never heard of.  A place where fists pump in the air and the crowds know the words to every song.  This isn't just a band.  This isn't just a gig.  Welcome to a place where every show is an unforgettable &quot;rock experience&quot;. Welcome to JOAN RED. \n\nFormed in late 2006, the band wrote and recorded it's first EP &quot;Spread The Red&quot; at Paul Ebersold's 747 studios in 2007 and began playing local venues and building a buzz.  In September 2008, they completed their first, full length album and achieved notable regional success as well as radio airplay in markets from Missouri to Mississippi.  With 40,000 Myspace friends and over a million plays, Joan Red is currently one of the most sought after live acts in the Memphis area and boasts an impressive touring schedule with performances booked through March '09.  \n\nGenres colliding,  Joan Red has manipulated modern songwriting in the Rock/Alternative/Power Rock formats to feed their 'rock hungry' audience with limitless hooks and choruses.  Often described as &quot;Disturbed&quot; meets &quot;The Killers&quot; , they have shared the stage with national touring acts that include 3 Days Grace, Seether, One Less Reason, Taproot, Egypt Central, Saving Abel, Staind and Trust Co. \n\nWith their single &quot;You Be The Hero&quot; already impacting radio, their full length album set for release in Spring 2009,  and a non-stop touring schedule covering the Eastern half of the U.S, Joan Red is undeniably ready to take on the masses.","torrent":{"xt":"urn:btih:9a50390b9176a25ad6d12f51e942fcea7befe643","amp;dn":"Joan+Red","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a50390b9176a25ad6d12f51e942fcea7befe643","infoHashBuffer":{"type":"Buffer","data":[154,80,57,11,145,118,162,90,214,209,47,81,233,66,252,234,123,239,230,67]},"announce":[],"urlList":[]}}