{"title":"Big Boss 3 Episode 6 - 09 Oct 09 - MaDdY[TLrG]{}.wmv","uid":5122701,"size":242456586,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9ac3775f446430b7878d9d17c96c6c9807b8e456&amp;dn=Big+Boss+3+Episode+6+-+09+Oct+09+-+MaDdY%5BTLrG%5D%7B%7D.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bindass","files":1,"time":1255443480,"description":"Interview of Jaya Sawant taken by BIG B and  he asked spicy questions with Jaya and she replied it normally.\n\nJaya in the Interview with a TV channel talked much and pointed out every members as they not given her time and without understanding her they nominated her.\n\n.....\n\nIts shows Rohit feeling disturb as Jaya sawant's atom bomb ( as he cant spend time on make up and live simply for a week) any how he accepted.\n\nI think they forgot that in Big Boss house nomination should not be discussed. Group 2 Just sharing their feeling and taking about Kamal's Attitude .\n\nTanaaz and Baktyaar doing a prayer and Rohit joins them.\n\nSherlyn wanted to sleep in double bed as she cannot share it with others and Kamaal playing a role of air in the fire.\n\nBaktyaar teaching song or singing with Claudia ?? made confuse .. any ways its funny .. ya he is teaching and dancing with her.. Smiley\n\nBoys seating together and taking about the 'Disappear&quot; word act. and Raju bhaiya is terrific.. he doing a mimicry of actors how they will say disappear .. hahahahahha\n\nVindu and Ismail taking about them self and Ismail gave him his view not to change or act here and also showed sympathy for Jaya sawant.\n\nEach and Every One taking about Rakhi's Mom and showing sympathy . As showing Rakhi Mom already showed how she poor she is and she having 14 lakh debts .. every one including Shamita, Poonam, Rohit taking about to give support.\n\nKamaal trying to impress Claudia and is cleaned is mustache . ha ha ha ha .. Vindu helping Kamaal for the same.... I told you earlier also Kamaal is just another Rahul ...\n\nEveryone having dinner and Kamaal acting like a true lover .. ha Ha ha .. he  said he will not eat till than Claudia say I love you to him.. .. he said he will wait for long as much as he can ...\n\nIsmail , Raju, Rohit having fun after dinner and taking about Kamaal's stupid behavior .. yea now the interest of people is increasing... hahahhaa\n\nVindu trying to convince i mean impress Claudia ..Boys.. having fun and Raju doing a mimicry of Rakhi's Mom and its was terrific...\nall her emotional drama and Boys really having fun with her acting....... Really Raju Rocks...\n\nRaju is the guy who will go far in this game....\n\nnext episode... Raju's new hairstyle and Kamaal sang one song to impress her .. lets see waht will happened tomorrow...","torrent":{"xt":"urn:btih:9ac3775f446430b7878d9d17c96c6c9807b8e456","amp;dn":"Big+Boss+3+Episode+6+-+09+Oct+09+-+MaDdY%5BTLrG%5D%7B%7D.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ac3775f446430b7878d9d17c96c6c9807b8e456","infoHashBuffer":{"type":"Buffer","data":[154,195,119,95,68,100,48,183,135,141,157,23,201,108,108,152,7,184,228,86]},"announce":[],"urlList":[]}}