{"title":"Midsummer_Night's_Rave_MP4_ipod_portable-[GWZ]","uid":5074359,"size":731338712,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:9b88b2976aba64c1fd782ea3d63a39e327d82527&amp;dn=Midsummer_Night%5C%27s_Rave_MP4_ipod_portable-%5BGWZ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Genewitch","files":1,"time":1251687925,"description":"4/5 rating:\n\nBased loosely on Chaucer's &quot;a midsummer night's dream&quot; - this movie is updated for the crowd of kids that grew up in the 90s.\n\nThe reason i didn't give it an &quot;excellent&quot; rating is mostly because some of the dialogue/acting seemed a little rough around the edges, and probably could have been fixed with a re-take; although this is mostly at the beginning of the movie.\n\nBut barring that, this movie is excellent, from witty dialogue to good music, to showing what drug culture at raves is like, to what happens when someone who doesn't belong at a rave goes to a rave.\n\nOf course, Puck's character is the most memorable of the movie, and it was probably designed that way on purpose, as Puck is always a memorable character. The Nick character happens to be really insightful, i didn't realize it until several viewings later. Xander is an all around good guy, easily liked, he has some of all of us in him. Mia's actress tries a little too hard to be Drew Barrymore sometimes, and it was slightly distracting; but her character was probably the least believable until the very end. Elena vacillates between being homely and being really attractive and cute several times during the movie. The director and director of photography did an excellent job of showing what drugs can induce in both self-perception and the perception of others with just this character alone.\n\n**mild spoiler**\n\nThe story is believable, in that the &quot;plot&quot; of the jacket is a minor one, and the love quadrangle is the main idea behind the movie you're watching.\n\nAll in all it is worth renting or buying on ebay to own - especially if you like electronic music. \n\nEncoding: H.264, 2 pass, b frames, ipod compatible (including 5th gen)\nFramerate: 23.967\nResolution: Source 720x480, scaled to x366 16.5:9 aspect ratio\nAudio: 160kbit stereo\nSubtitles: none on source, none here.\nRipper: GW of GWZ\nEncoder: GW of GWZ with help by Onslaught for iphone compatibility settings.\nSoftware: DVDDecryptor and Handbrake\n\nAnother Quality release for handheld devices by Team GWZ!\nWill seed for 2 months, as with all of our releases!\n","torrent":{"xt":"urn:btih:9b88b2976aba64c1fd782ea3d63a39e327d82527","amp;dn":"Midsummer_Night%5C%27s_Rave_MP4_ipod_portable-%5BGWZ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b88b2976aba64c1fd782ea3d63a39e327d82527","infoHashBuffer":{"type":"Buffer","data":[155,136,178,151,106,186,100,193,253,120,46,163,214,58,57,227,39,216,37,39]},"announce":[],"urlList":[]}}