{"title":"Worlds Greatest Hoaxes-Secrets Finally Revealed-(WTC-SWE)","uid":5036171,"size":366698108,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9c1a3dcd3020a16e193f8568cedca35d59592081&amp;dn=Worlds+Greatest+Hoaxes-Secrets+Finally+Revealed-%28WTC-SWE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"WTC-SWE","files":-1,"time":1249133208,"description":"ITV4:\n-----\n\n\n                   WORLDS GREATEST HOAXES-SECRETS FINALLY REVEALED \n                  -------------------------------------------------\n\n                                 \n\n\nDocumentary which exposes the world's greatest myths. Lance Henriksen takes an\nin-depth look at Bigfoot, the Loch Ness monster and UFO sightings. \n\nLance Henriksen Narrates An In-Depth Look At Bigfoot,The Loch Ness Monster, The Alien Autopsy And UFO Sightings Never-before-seen footage and new technological evidence will expose the truths behind the most sensational of legends -- Bigfoot,the Loch Ness Monster, the Alien Autopsy and Flying Saucers -- in the original special.\n\nFor many years, believers and sceptics have debated the fact or fiction behind films and videos supposedly showing legendary beings and unexplained phenomena -- on earth and in space. This special details the who, why and how of the most sensational material ever caught on tape. In each case, informants, experts and modern technology expose the truths behind these myths.\n\n\n\n\nBigfoot -- for more than 30 years, this creature allegedly spotted in the Pacific Northwest has captivated the world. Sceptics, however, now believe that amazing footage of the seven foot-tall legendary beast caught disappearing into the woods in 1967 was actually created by a film company to gain interest in other nature movies it was making.In an exclusive interview, a man with inside knowledge breaks three decades of silence to reveal compelling reasons why this film is thought to be an elaborate hoax. In addition, experts also explain why two more recently shot Bigfoot videos are also blatant frauds.\n\n\nThe Loch Ness Monster -- a 1936 newsreel of a dinosaur-like creature seen in the\nwaters of Scotland started this legend and has held the world in fright for more than 60 years. In 1977, new pictures of the sea monster provided evidence of its existence that seemed too good to be true. The special reveals why these startling pictures are fake and offers insight on how easy it is to create a hoax,simulating a modern-day sea monster video. The Alien Autopsy -- In 1995, footage of an alien autopsy supposedly taken at Roswell in 1947 came to the public's eye and was showcased in the highly-rated FOX special ALIEN AUTOPSY: FACT OR FICTION? Now, for the first time anywhere, one of the actors who took part in staging the alien autopsy ruse steps forward, and all-new footage and NASA-type video enhancements shed new light on how one of the biggest hoaxes of all time was actually accomplished. Also, other inside sources and top professionals dispute the authenticity of the famed autopsy, exposing further secrets about the origin of the footage.\n\n\nThese are the most frequent and universally believed phenomenal occurrences. The special reveals how the most incredible footage of flying saucers ever shot filmed by Swiss farmer Billy Meier, the best-known advocate of the sightings constitutes the longest-running UFO hoax on record. Top experts, and Meier's own ex-wife, explain how the sharp, daylight films were created -- using models and everyday household items. Also featured is a rare interview with Meier himself, who defends his world-famous footage despite the massive evidence against him. Robert Kiviat, executive producer of ALIEN AUTOPSY: FACT OR FICTION?\n\n\n\n\nNarrated by: Lance Henriksen \n----------------------------\n\n\n\n\nTitle: Worlds Greatest Hoaxes-Secrets Finally Revealed\nYear:  1999\nFile Size: 349 MB \nFormat:AVI\nVideo Length: 00:41:39\nVideo Codec: XviD\nVideo Resolution: 576x432\nVIdeo Bitrate:  1174 kbit/s\nFPS:  25.000000\nAudio Bitrate: 130 kbit/s\nAudio Codec: MPEG Layer-3\nChannels:  2 \nSubtitles: (N/A)\n \nGenre: Documentary \n\n\nIMDB: &lt;a href=&quot; http://www.imdb.com/title/tt0222506/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0222506/&lt;/a&gt;\n\n\n\nENJOY:\n\n\n\n\nYOUR CHOICE\n\nWTC-SWE\n\n\n\n\n(Please seed so others can enjoy)\n\n\n\n\n\nFor further information and pictures of all my torrents visit&quot; Suprbay Forum&quot; at   \n\nthis link: --------&gt; &lt;a href=&quot; http://suprbay.org/showthread.php?t=38774&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/showthread.php?t=38774&lt;/a&gt;                 \n\n*** This information is also avaible on the &quot;nfo&quot; file that comes with all my uploads.)***   \n\n\nTips:For better background view chance the &quot;Style Chooser&quot; at the bottom left \ncorner to &quot;graphite_x&quot;.\n\n\n\n\n\n\n\n*** RECOMMENDED DOWNLOAD ***\n","torrent":{"xt":"urn:btih:9c1a3dcd3020a16e193f8568cedca35d59592081","amp;dn":"Worlds+Greatest+Hoaxes-Secrets+Finally+Revealed-%28WTC-SWE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c1a3dcd3020a16e193f8568cedca35d59592081","infoHashBuffer":{"type":"Buffer","data":[156,26,61,205,48,32,161,110,25,63,133,104,206,220,163,93,89,89,32,129]},"announce":[],"urlList":[]}}