{"title":"D2 Might Ducks (1994) DVD-R NTSC WS -eng- [TwiztidxxNinja]","uid":5073045,"size":4616393740,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9ca978dbfae50f7e9304efbb138d173f1c6d5f4e&amp;dn=D2+Might+Ducks+%281994%29+DVD-R+NTSC+WS+-eng-+%5BTwiztidxxNinja%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"twiztidxxninja","files":20,"time":1251570446,"description":"I'm Trying to help out djfred for all the wonderful movies he uploads\n\n\nM O V i E   i N F O R M A T i O N * * * &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0109520/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0109520/&lt;/a&gt;\n           \nIn this sequel to the kid-friendly sports comedy The Mighty Ducks, Gordon Bombay (Emilio Estevez) takes one more shot at a career as a professional hockey player, but a severe knee injury sidelines him for good. However, his success coaching a rag-tag pee-wee hockey team in Minneapolis (as chronicled in the first film) has attracted the attention of a major sportswear firm, which hires him to coach the United States team for the Junior Goodwill Games. Gordon reassembles most of the Mighty Ducks along with several new players, including a huge bully who is great on defense (if low on social skills), a figure skater who knows how to move on the ice, and a hotshot goalie who happens to be a girl. However, the excitement of a trip to Los Angeles and a large dose of overconfidence puts the team at a severe disadvantage when they're pitted against the top-ranked Icelandic team. D2: The Mighty Ducks features cameo appearances from hockey legend Wayne Gretzky, champion figure skater Kristi Yamaguchi, and Kareem Abdul-Jabbar, whose athletic career has never involved ice skating.\n\n\nM P A A  R A T I N G  * * *\n\nRated PG for some mild language and rough hockey action.\n\n\nR E L E A S E   D A T E  * * *\n\n25 March 1994\n\n\nD V D  C o n t e n t  * * *\n  \nMain Movie ******:\n* Video - UNTOUCHED - 5140 Kbps Widescreen\n* Audio - English\n* Subs  - English\n\nMenu ************:\n* Yes\n\nExtras **********:\n* All\n\nRipped **********:\n* Nothing\n\nChapters ********:\n\n1. Opening Titles/The Real Thing\n2. Back in the Game\n3. Team USA\n4. Junior Goodwill Games\n5. Image\n6. Stiff Competition\n7. Real Hockey\n8. Bombay vs. Stansson\n9. Ducks Fly Together\n10. Champions/End Credits\n\nUploader Info ***:\nThank you for choosing my release from others that are available on the internet already. I wanted to ask a small favor. After you have completly downloaded my release, please return back where you downloaded the movie and leave a comment. Let I know how the movie quality is others who are going to be downloading my release a better information about the upload. I actually do check the comments and i try to respond as much as possible. If you trully love this DVD, do actually buy and support the producers, writers, actors who made this movie possible.\n\nIf you would like to request a movie, please leave a comment on the latest upload.\n\tThank You  [TwiztidxxNinja]","torrent":{"xt":"urn:btih:9ca978dbfae50f7e9304efbb138d173f1c6d5f4e","amp;dn":"D2+Might+Ducks+%281994%29+DVD-R+NTSC+WS+-eng-+%5BTwiztidxxNinja%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ca978dbfae50f7e9304efbb138d173f1c6d5f4e","infoHashBuffer":{"type":"Buffer","data":[156,169,120,219,250,229,15,126,147,4,239,187,19,141,23,63,28,109,95,78]},"announce":[],"urlList":[]}}