{"title":"Motorhead - No Class (Live-Germany)","uid":5068062,"size":109166596,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9d78275e15708db65a388f0cfc27412975049ee3&amp;dn=Motorhead+-+No+Class+%28Live-Germany%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1251108775,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logo.\n\n\n&quot;No Class&quot; is a song by the heavy metal band MotÃƒÂ¶rhead. Released in 1979, in 7&quot; vinyl pressings. The song also appears on the Overkill album.\n\nIt was available in three different covers, with either a picture of Lemmy, &quot;Fast&quot; Eddie Clarke or Phil &quot;Philthy Animal&quot; Taylor. The single also contains the B-side &quot;Like a Nightmare&quot;, which can be found on the reissued versions of Overkill.\n\nIn 1982, as part of the Stand by Your Man EP collaboration with MotÃƒÂ¶rhead, punk / metal band The Plasmatics covered &quot;No Class&quot;.\n\nIn September 1982, Lemmy, Philthy and Brian Robertson were interviewed by Richard Skinner on BBC Radio 1's 'Saturday Live' show, &quot;Stand by Your Man&quot;, &quot;No Class&quot; and &quot;Go to Hell&quot; were played.\n\nOn MotÃƒÂ¶rhead's 1999 live album Everything Louder than Everyone Else, before playing &quot;No Class&quot; Lemmy states that he would officially like to dedicate the song to long-time friend Wendy O. Williams, who had committed suicide the previous month.\n\nThe song's riff bears resemblance to the riff from &quot;Tush&quot; by ZZ Top.\n\nOverkill is the second album released by MotÃƒÂ¶rhead, in 1979, and their first for Bronze Records. It peaked at number 24 on the UK charts.\n\nBronze Records signed the band in 1978 and gave them time in Wessex Studios in London to record Richard Berry's &quot;Louie Louie&quot; and a new song by the band, &quot;Tear Ya Down&quot;. The band toured to promote their single &quot;Louie Louie&quot; while Chiswick released the MotÃƒÂ¶rhead album in white vinyl, to keep the momentum going. Sales of the single brought the band their first appearance on BBC Television's Top of the Pops, which gave Bronze the confidence to get the band back into the studio to record a second album.\n\nThe first release from those sessions was the single release of &quot;Overkill&quot; backed with &quot;Too Late, Too Late&quot; in 7&quot; and 12&quot; pressings. The Chiswick album &quot;MotÃƒÂ¶rhead&quot; had been a hasty affair as was its production, although it had a sub-bootleg quality which may be appealing, Overkill had more spring and bounce, and a thundering title track that would become a show-stopper for years to come. Three weeks after the initial release of the album in black vinyl, the album was released in a limited edition of 15,000 in green vinyl.\n\nIn June 1979 &quot;No Class&quot; was lifted from the album as a follow-up single, backed with a previously unreleased song, &quot;Like a Nightmare&quot;. With a view to increasing the sales, the single was released in three different covers, one each of Lemmy, Clarke and Taylor.\n\nThe album was reissued on Cassette, CD and vinyl by Castle Communications in 1988, coupled with Another Perfect Day, Bronze having issued a cassette of the album covered with Bomber in 1980.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:9d78275e15708db65a388f0cfc27412975049ee3","amp;dn":"Motorhead+-+No+Class+%28Live-Germany%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d78275e15708db65a388f0cfc27412975049ee3","infoHashBuffer":{"type":"Buffer","data":[157,120,39,94,21,112,141,182,90,56,143,12,252,39,65,41,117,4,158,227]},"announce":[],"urlList":[]}}