{"title":"Cradle Of Filth - Honey And Sulphur","uid":5062238,"size":195440644,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9db56cce9a5eedab82cde7237bce463adc1598b6&amp;dn=Cradle+Of+Filth+-+Honey+And+Sulphur&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1250762216,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nHoney and Sulphur is the first single from the album Godspeed on the Devil's Thunder to have a music video. The music video was filmed at the Chislehurst Caves of Kent and directed by Michael Maxxis. the song is about the madness of Gilles de Rais.\n\nGodspeed on the Devil's Thunder (subtitled The Life and Crimes of Gilles de Rais) is the eighth studio album by English extreme metal band Cradle of Filth. It was released on October 27, 2008 by Roadrunner Records. A special edition containing bonus material was also released. Once again, Doug Bradley provides narration for the album (as with Midian, Nymphetamine and Thornography). The title of the album derives from a valediction vocalist Dani Filth once used to sign a letter.\n\nThe album debuted at #48 on the Billboard Top 200 chart with sales of a little over 11,000 copies.\n\nCradle of Filth are an English extreme metal band from Suffolk, formed in 1991. They have been embraced and disowned with equal fervour by various metal communities, and their particular subgenre has provoked a great deal of discussion.\n\nThe band's musical style evolved from black metal to a cleaner and more &quot;produced&quot; amalgam of gothic metal, symphonic black metal and other extreme metal styles, while their lyrical themes and imagery are heavily influenced by gothic literature, poetry, mythology and horror films. The band has successfully broken free from its original niche by courting mainstream publicity (often to the chagrin of its early fanbase), and this increased accessibility has brought coverage by the likes of Kerrang! and MTV, frequent main stage appearances at major festivals such as Ozzfest, Download and even the mainstream Sziget Festival, and in turn a more &quot;commercial&quot; image. They have sometimes been perceived as Satanic by casual observers, although their outright lyrical references to Satanism are few and far between, and use of Satanic imagery has arguably always had more to do with the shock value than any seriously-held beliefs. According to Metal Hammer magazine, Cradle of Filth are deemed as the most successful British heavy metal band since Iron Maiden.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:9db56cce9a5eedab82cde7237bce463adc1598b6","amp;dn":"Cradle+Of+Filth+-+Honey+And+Sulphur","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9db56cce9a5eedab82cde7237bce463adc1598b6","infoHashBuffer":{"type":"Buffer","data":[157,181,108,206,154,94,237,171,130,205,231,35,123,206,70,58,220,21,152,182]},"announce":[],"urlList":[]}}