{"title":"Austin Power Goldmember (2002) DVD-R NTSC FS -eng- [TwiztidxxNin","uid":5037128,"size":4687873666,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9ef59d96f528f2cb3d0376a587ed138ed2c3481b&amp;dn=Austin+Power+Goldmember+%282002%29+DVD-R+NTSC+FS+-eng-+%5BTwiztidxxNin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"twiztidxxninja","files":41,"time":1249172413,"description":"I'm Trying to help out djfred for all the wonderful movies he uploads\n\n\nM O V i E   i N F O R M A T i O N * * * &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0295178/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0295178/&lt;/a&gt;\n           \nMike Myers' phenomenally successful spy spoof gains a few more characters, a slew of celebrity cameos, and even more free-associative laughs in this third installment of the popular franchise. Austin Powers in Goldmember continues the exploits of the swinging-'60s leftover, who, as the film opens, is busy critiquing a big-budget Hollywood production of his life story, replete with a 20-million-dollar star in the lead role and a slew of John Woo-style action scenes. But not far from the soundstage lurks arch nemesis Dr. Evil (Myers), who has opened up a talent agency representing some of the industry's biggest stars -- all the while channeling their profits into a diabolical world-destruction plan with the unfortunate code name Preparation H. Dr. Evil presents a distraction to Austin by kidnapping his similarly swingin' father, Nigel Powers, and transporting him back in time to 1975. Travelling there to save his father -- and in turn win back his dad's sometimes-errant affection -- Austin comes across the alluring superspy Foxxy Cleopatra (Beyonce Knowles). The three of them travel back to the present day, where they join forces to battle Dr. Evil and his posse of nefarious evil-doers, including the trusty clone Mini-Me (Verne Troyer); his snotty son, Scott (Seth Green); the inimitable Fat Bastard (Myers); and the eponymous new addition to the fold: the epidermis-obsessed, precious-metal-fortified Dutchman called Goldmember (Myers).\n\n\nM P A A  R A T I N G  * * *\n\nRated PG-13 for sexual innuendo, crude humor and language.\n\n\nR E L E A S E   D A T E  * * *\n\n26 July 2002\n\n\nD V D  C o n t e n t  * * *\n  \nMain Movie ******:\n* Video - UNTOUCHED - 2175 Kbps Fullscreen\n* Audio - English\n* Subs  - English\n\nMenu ************:\n* Yes\n\nExtras **********:\n* All\n\nRipped **********:\n* Nothing\n\nChapters ********:\n\n1. Lights! Camera! Austin! [7:23]\n2. The Perfect Plan [5:38]\n3. Daddy Issues [10:38]\n4. Destination 1975 [10:02]\n5. Hard Knock Life [4:30]\n6. The Mole [2:37]\n7. Meet the Fahza [5:46]\n8. Tokyo Tangle [6:03]\n9. Son's Present [2:14]\n10. Mr. Roboto [8:37]\n11. Father Son Spat [1:52]\n12. Mini-Defector [4:07]\n13. Evil Demands [1:57]\n14. Clone of Burden [6:14]\n15. Sons of the Father [5:13]\n16. Goldmember Strikes [3:44]\n17. Epilogue [1:28]\n18. End Credits [6:26]\n\nUploader Info ***:\nThank you for choosing my release from others that are available on the internet already. I wanted to ask a small favor. After you have completly downloaded my release, please return back where you downloaded the movie and leave a comment. Let I know how the movie quality is others who are going to be downloading my release a better information about the upload. I actually do check the comments and i try to respond as much as possible. If you trully love this DVD, do actually buy and support the producers, writers, actors who made this movie possible.\n\nIf you would like to request a movie, please leave a comment on the latest upload.\n\tThank You  [TwiztidxxNinja]","torrent":{"xt":"urn:btih:9ef59d96f528f2cb3d0376a587ed138ed2c3481b","amp;dn":"Austin+Power+Goldmember+%282002%29+DVD-R+NTSC+FS+-eng-+%5BTwiztidxxNin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ef59d96f528f2cb3d0376a587ed138ed2c3481b","infoHashBuffer":{"type":"Buffer","data":[158,245,157,150,245,40,242,203,61,3,118,165,135,237,19,142,210,195,72,27]},"announce":[],"urlList":[]}}