{"title":"A History of Violence (2005) (NL SUBS) 2Lions-Team","uid":5567697,"size":4512069579,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9f06d001dce86b624a3d49ab89408c91f020f609&amp;dn=A+History+of+Violence+%282005%29+%28NL+SUBS%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pioen","files":-1,"time":1274042245,"description":" A History of Violence (2005)       \n \nVerenigde Staten\nThriller / Drama\n96 minuten\n\ngeregisseerd door David Cronenberg\nmet Viggo Mortensen, Ed Harris en Maria Bello\n\nTom Stall (Viggo Mortensen) leidt een rustig leventje met zijn echtgenote Edie (Maria Bello) en hun twee kinderen in een kleine stad in Amerika. Een onverwacht en bloederig incident in zijn restaurant zet hem plotseling in de schijnwerpers. Hij krijgt als &quot;held&quot; veel aandacht in de media en dat wekt de belangstelling van een aantal beruchte criminelen. Zij menen in hem een oude gangster te herkennen, die jaren geleden spoorloos verdween, en met wie ze nog een appeltje te schillen hebben. Tom zegt niet te weten waar ze het over hebben. Als de criminelen de druk opvoeren, stijgt de spanning, ook in Toms gezin. Is hij wel de vredelievende echtgenoot en vader die zij kennen?\n\n\nEnglish\n\nThis is the story of a mild-mannered man, named Tom Stall, who becomes a local hero through an act of violence, he lives a happy and quiet life with his lawyer wife and their two children in the small town of Millbrook, Indiana. But one night their idyllic existence is shattered when Tom foils a vicious attempted robbery in his diner. Sensing danger, he takes action and saves his customers and friends in the self-defense killings of two-sought-after criminals. Heralded as a hero, Tom's life is changed overnight, attracting a national media circus, which forces him into the spotlight. Uncomfortable with his newfound celebrity, Tom tries to return to the normalcy of his ordinary life only to be confronted by a mysterious and threatening man who arrives in town believing Tom is the man who wronged him in the past. As Tom and his family fight back against this case of mistaken identity and struggle to cope with their changed reality, they are forced to confront their relationships and the divisive issues which surface as a result. \n\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\nAudio : English\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Drama\nThriller\n \nWeblink : &lt;a href=&quot; http://www.moviemeter.nl/film/28106&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/28106&lt;/a&gt;\nWeblink : &lt;a href=&quot; http://www.imdb.com/title/tt0399146&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0399146&lt;/a&gt; \n\n*****************************************\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n\n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\nTo the fakers Get a Live","torrent":{"xt":"urn:btih:9f06d001dce86b624a3d49ab89408c91f020f609","amp;dn":"A+History+of+Violence+%282005%29+%28NL+SUBS%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f06d001dce86b624a3d49ab89408c91f020f609","infoHashBuffer":{"type":"Buffer","data":[159,6,208,1,220,232,107,98,74,61,73,171,137,64,140,145,240,32,246,9]},"announce":[],"urlList":[]}}