{"title":"Defying Hitler: A Memoir - Sebastian Haffner","uid":5028983,"size":240857532,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9f3c25280004da978f64027ba802f642781f3c0b&amp;dn=Defying+Hitler%3A+A+Memoir+-+Sebastian+Haffner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"captainelliotspencer","files":165,"time":1248823171,"description":"             Defying Hitler: A Memoir - Sebastian Haffner\n\nWhat was it about Germany that made the rise of Adolf Hitler and his murderous regime possible? \n\nThat troubling question has occupied many fine minds over the last six decades, few more lucid and thoughtful than the late historian and journalist Sebastian Haffner. In this book, drawn from a manuscript he did not live to complete, Haffner examines the social and cultural conditions that made Germany ill-equipped for democracy and ripe for totalitarianism. Among these, Haffner writes, were a generational war between an apathetic adult population and a youth &quot;familiar with nothing but political clamor, sensation, anarchy, and the dangerous lure of irresponsible numbers games&quot;; a fatal fondness for the winner-and-loser dichotomy of sports and a rage for spectacle and entertainment; a resignation through which ordinary people came to &quot;adapt to living with clenched teeth, in a manner of speaking,&quot; rather than stand up in protest. In that climate, Haffner--who left Germany just before World War II broke out--suggests, Nazism was almost an inevitability, against which he, too, tried to withdraw into &quot;a small, secure, private domain,&quot; like so many others of his time and place. An important eyewitness account, Haffner's book deepens our understanding of how small missteps can lead to tragic ends, and how nations can be led into chaos.\n\n\n----------------------------------------------------------------------------------\n\nPLEASE NOTE:\n\nRegardless of what happens to this great site (it is claimed this will be a pay site soon) you can still find all my audiobook uploads archived over on the website:\n\n\nwww.audiobook-vault.com\n\n\nIf you visit please take the time to click on a few ads. Thanks for your support!\n\n-----------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:9f3c25280004da978f64027ba802f642781f3c0b","amp;dn":"Defying+Hitler%3A+A+Memoir+-+Sebastian+Haffner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f3c25280004da978f64027ba802f642781f3c0b","infoHashBuffer":{"type":"Buffer","data":[159,60,37,40,0,4,218,151,143,100,2,123,168,2,246,66,120,31,60,11]},"announce":[],"urlList":[]}}