{"title":"Ultimate Alien - Duped(subbed)","uid":5572401,"size":130065100,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:9f591eb877f94e5030c772b5d1a1642c0c7324ea&amp;dn=Ultimate+Alien+-+Duped%28subbed%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zakwild","files":1,"time":1274283780,"description":"Ben needs to be in three places at once; he has to fight the Forever Knights with Kevin, go to Julie's tennis game, and see a Sumo Slammers movie. So Ben transforms into Echo Echo and divides in three and changes back to Ben, but this time there are three Bens with one part of his personality. One is the real Ben, the other is the honest, intimate Ben, and the last one is the immature Ben. The Honest Ben goes with Kevin to the museum, the Immature Ben stays to watch Julie's match, and the real Ben goes to see Sumo Slammers. Urien (a king of a fraction of Forever Knights) is after some strong suit of battle armor. When Honest Ben and Kevin are in danger, Urian is in the battle armor and attack Intimate Ben and Kevin, the real Ben and the immature Ben have to help them stop Urian. All the Bens go Echo Echo and change back into one. Ben later defeats Urian with Lodestar and heads back to the tennis match, where its revealed that his plan backfired and he is scolded by his friends for his foolish plan which ruins Julie's game (although she won) and causes Julie to angrily storm off. Gwen angrily storms off too, along with Kevin, leaving Ben all alone to repent for what he's done.","torrent":{"xt":"urn:btih:9f591eb877f94e5030c772b5d1a1642c0c7324ea","amp;dn":"Ultimate+Alien+-+Duped%28subbed%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f591eb877f94e5030c772b5d1a1642c0c7324ea","infoHashBuffer":{"type":"Buffer","data":[159,89,30,184,119,249,78,80,48,199,114,181,209,161,100,44,12,115,36,234]},"announce":[],"urlList":[]}}