{"title":"Trey Songz - I Need A Girl [HQ] [balleron24z]","uid":5101620,"size":79767552,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9f747830054dc173e7df2e2cb7bc533d6b3059ac&amp;dn=Trey+Songz+-+I+Need+A+Girl+%5BHQ%5D+%5Bballeron24z%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"balleron24z","files":-1,"time":1254026808,"description":"Hello again.  So yea, first let me start by saying that you assholes aren't nice enough to just say thanks for the upload or appreciate your work.  Instead you go and bitch about me having a watermark on my video....or rather a logo. A fucking logo, whoopteedoo.  MTV DOES THAT SHIT TOO YOU GONNA SUE EM?  NOPE  Go suck a fucking dick seriously.  Its a video.  Want a better version?  GO GET IT YOUR DAMN SELF!!!!\n\nThis is the HQ release of &quot;I Need A Girl&quot; by Trey Songz.  This is another overplayed song.  But, its good.  Really upbeat, deff a song for the ladies, and a few beautiful women in this video.  Overall, good video, and the song is good too.\n\nI ripped this from MTV (hehehe) so the quality is slightly better than an HQ YT video. Codec for video is DivX @ 2690kbps Reso: 624x344 and codec for audio is MP3 @ 192kbps 44100khz.  I initially captured the video with no audio (stupid Vista stereo mix lol) but that was good because it uses more cpu to capture audio in the process, resulting in jittery video capture.  I then used VirtualDubMod to add the MP3 stream to the file of the actual song, and re-rendered the file.  For some reason, this is one of the more crappy rips, I'm guessing because of all the motion and its a brighter video too.  Still good quality for an iPod or for DVD.  Not the best I've ripped, but hey, Its a video, a better version may come out soon.  Enjoy though :)","torrent":{"xt":"urn:btih:9f747830054dc173e7df2e2cb7bc533d6b3059ac","amp;dn":"Trey+Songz+-+I+Need+A+Girl+%5BHQ%5D+%5Bballeron24z%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f747830054dc173e7df2e2cb7bc533d6b3059ac","infoHashBuffer":{"type":"Buffer","data":[159,116,120,48,5,77,193,115,231,223,46,44,183,188,83,61,107,48,89,172]},"announce":[],"urlList":[]}}