{"title":"THC-HD The plague 720p x264 AC3 2.0.mkv","uid":5653544,"size":2830088383,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:9f7e188476d1049ad78364f565649bdf0c065a19&amp;dn=THC-HD+The+plague+720p+x264+AC3+2.0.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pharos2001","files":1,"time":1277714641,"description":"The Plague\n\nIt began almost like the common cold. Within a day, fever took over, black swellings the size of baseballs appeared on the neck, and then the coughing of blood. Few lived more than two days after infection began, and very quickly the simple disposal of the bodies became an overwhelming job.\n\nThe year was 1347. It was the worst biological disaster in the history of mankind, shaking the very foundations of human order. Almost half of the population of Europe died, and it brought out the best and the most terrible in the people caught up in it - savagery and panic, true heroism and self-sacrifice. Perhaps above all things the Black Death serves as a mirror for our own time, forcing us to question the stability of our own society should such a catastrophe strike again; our own vulnerability should some new killer microbe appear, whether through changes in the ecology or through bio terrorism.\n\nIt was said the Black Death began in the most remote regions of the Mongol empire, and spread along their trade routes to the Black Sea port of Caffa, from which it spread by ship to Italy and all of Europe. It was caused by a deadly microbe - Yersina Pestis - carried in the stomachs of fleas infecting the common rats which so heavily infested the towns of the Middle Ages. As the disease killed the rats, the fleas moved onto other hosts - human beings. Once the humans were infected, they themselves became highly contagious, spitting and coughing contaminated blood. In some cases, death came within a day, taking whole families between one morning and the next.\n\nSo how did Europe deal with an epidemic of this size? What led to its demise? More importantly still, could such an event happen again?\n\nIn this two-part documentary we adress all these questions, shedding light on one of the most infamous moments of the Middle Ages. \n \nDuration 1:28:53\nA/R Size: 1:1.78 (16/9) 1280*720p\nVcodec: x264\nAcodec: AC3 (2.0)","torrent":{"xt":"urn:btih:9f7e188476d1049ad78364f565649bdf0c065a19","amp;dn":"THC-HD+The+plague+720p+x264+AC3+2.0.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f7e188476d1049ad78364f565649bdf0c065a19","infoHashBuffer":{"type":"Buffer","data":[159,126,24,132,118,209,4,154,215,131,100,245,101,100,155,223,12,6,90,25]},"announce":[],"urlList":[]}}