{"title":"Sinterklaas Verdwaalt In Het Grote Bos  (06).DVDr.NLT-Release (D","uid":5123398,"size":596339515,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9f9d07db1d10cbf4498227d3e09d3979cabc2543&amp;dn=Sinterklaas+Verdwaalt+In+Het+Grote+Bos++%2806%29.DVDr.NLT-Release+%28D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"diddle783","files":-1,"time":1255474094,"description":"Nederland\nAvontuur / Familie\n119 minuten\n\nEen groep Volendammers die al ruim 35 jaar het Sinterklaas gebeuren verzorgt in Volendam, hebben een prachtige Sinterklaasfilm opgenomen. Een spannende film, begrijpelijk voor kinderen en voorzien van alle ingrediÃƒÂ«nten die nodig zijn en waar de kinderen van zullen smullen. \nO.a. een inbreker, politieagenten, politiehelikopter, een levendige vogelverschrikker, tot zelfs hilarische taferelen op de boerderij zijn in de film verwerkt. Verder zijn er prachtige opnamen van de Pieten in het wondermooie kasteel van Sinterklaas. Enkele bekende Volendammers zoals Ruud, de vader van Jan Smit, Simon Keizer bekend van het \nduo Nick &amp; Simon, alsmede de vriend van Jan Smit, Kees Tol spelen in dit spannende verhaal een rol. \n\n\nHET VERHAAL:\nSinterklaas maakt samen met Opperpiet een wandeling en verdwaalt in het grote bos. \n's Avonds vinden de vermoeide Sint en Piet een kapel waar zij willen slapen. \nAls Opperpiet op zoek gaat naar een lekker slaapplekje, \nvindt hij inbrekersspullen en een prachtig schilderij. \nEen dief heeft dit schilderij diezelfde dag gestolen \nuit het museum en verstopt in de kapel. \nSinterklaas en de Opperpiet blijven de hele nacht wakker om de dief te vangen. \nOp het kasteel van Sinterklaas zijn de pieten inmiddels radeloos. \nHoe kunnen de lieve kinderen van Nederland Sinterklaas vieren zonder de Sint? \nIn paniek bellen zij de politie op. \nEn hoe dit verder allemaal afloopt?..dat moet je zelf maar bekijken.\n\n\nDeze torrent wordt je aangeboden door NLT.ons-Forum \n\nHet forum met de nieuwste films en muziek en de meest uitgebreide\nCollectie DviX torrents.\n\nAl onze Film torrents hebben Nederlandse subs of zijn Nederlands Geproken\n\nTot ziens op het NLT.\n\nWe zijn te vinden op:\nwww.nlt.ons-forum.nl \t","torrent":{"xt":"urn:btih:9f9d07db1d10cbf4498227d3e09d3979cabc2543","amp;dn":"Sinterklaas+Verdwaalt+In+Het+Grote+Bos++%2806%29.DVDr.NLT-Release+%28D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f9d07db1d10cbf4498227d3e09d3979cabc2543","infoHashBuffer":{"type":"Buffer","data":[159,157,7,219,29,16,203,244,73,130,39,211,224,157,57,121,202,188,37,67]},"announce":[],"urlList":[]}}