{"title":"iamwhoiami - Singles [2010] [V0]","uid":5668229,"size":73387420,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a051e8e4b0b4d3e5238d121fbec7f531d8425907&amp;dn=iamwhoiami+-+Singles+%5B2010%5D+%5BV0%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"XaioSheen","files":-1,"time":1278230289,"description":"THIS IS SICK ASS SHIT!!!! Extremely glad to be able to bring this to ya'll!\n\niamamiwhoami is an electronic music project featuring a female vocalist and unknown producers. It was promoted through a viral campaign onOn 4 December 2009, a surreal clip less than a minute long appeared onsubmitted by iamamiwhoami. The clip was forwarded to several known blogger as well as music journalists. A second soon appeared and then a third. By then, Chris Cantalini and MTV writer James Montgomery picked up on the clips fueling speculation that had been building in blogs.\n\nTracklist:\n&quot;b&quot; \n&quot;o&quot; \n&quot;b -\n&quot;o \n&quot;u-1&quot; \n&quot;u-2&quot; \n&quot;n&quot; \n&quot;n -\n&quot;t&quot; \n\nTo date, iamamiwhoami has released twelve videos, and six music releases.\n\nThe first six videos are short &quot;teaser&quot; clips and feature an elusive female character, as MTV writer James Montgomery said, &quot;a dendrophiliac's wet dream, loaded with images of a mud-smeared woman licking a tree and some strangely sexualized sap&quot;[3].\n\nAs the video's story develops, the character is shown in a womb-like structure and then later in a snow-covered forest, before finally entering on a wooden cabin and appearing on the roof surrounded by leaves.\n\nThe videos can be clearly divided into two groups. The first six, bearing numeric titles, and the second group, bearing single-lettered titles. This second group of videos are full songs and feature other characters. The images are no longer distorted and lyrics can be clearly heard.\n\nThose clips continue to feature the same kind of folkloric elements presented on the first 6 teasers.\n\nThe music is a compelling mix of electronic, alternative rock and experimental music featuring eerie, heavily distorted and or muted female vocals at points in each video. They are believed to be part of a viral marketing campaign for a new music act.\n\n-http://en.wikipedia.org/wiki/Iamamiwhoami","torrent":{"xt":"urn:btih:a051e8e4b0b4d3e5238d121fbec7f531d8425907","amp;dn":"iamwhoiami+-+Singles+%5B2010%5D+%5BV0%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a051e8e4b0b4d3e5238d121fbec7f531d8425907","infoHashBuffer":{"type":"Buffer","data":[160,81,232,228,176,180,211,229,35,141,18,31,190,199,245,49,216,66,89,7]},"announce":[],"urlList":[]}}