{"title":"apex vcd ripper","uid":5672527,"size":15491158,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:a095ec4e730464e88d9cb25d2e93446513cbb99f&amp;dn=apex+vcd+ripper&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nightissuchproximity","files":2,"time":1278407755,"description":"Apex VCD Ripper convert VCD to any video as you like, It is designed to meet all your needs of convert file .It supports to convert your favorite VCD movies from dat, mpeg, mpg to AVI, MPEG, VCD, DVD, MOV, RM, RMVB, WMV, ASF, iPod, PSP, 3GP, Xbox, PPC, PMP, Flash SWF, Flash FLV,FLV, MP3 Audio, WMA Audio, WAV Audio, MP2 Audio, GIF Animation and GIF, BMP EPS, JPG, PCX, PSD, PDF, TIFF, WMF, EMF, PNG, J2K Picture formats. \n    Extremely fast conversion speed and friendly user interface let you convert VCD Video with ease. The powerful features and unbeatable price make Apex VCD Ripper an affordable and powerful video conversion solution on personal computer\n\n \n \n \n Free Trial          Download          Purchase     For:Windows 98/ME/2000/NT/XP  \norder with Apex VCD Ripper for only $25 \nKey Features of Apex VCD Ripper: \n \n \n\nSupport converting VCD video from dat, mpeg, mpg file to AVI, Divx, Xvid, MPEG, MOV, WMV, RM, RMVB etc. PC Video \nSupport converting VCD video from dat, mpeg, mpg file to Apple iPod, Sony PSP, Cell Phone 3GP, Microsoft Xbox, Pocket PC, Portable Media Player ect. Moblie video. \nSupport converting VCD video from dat, mpeg, mpg file to Flash SWF,FLV, Flash FLV ect. web video \nSupport converting VCD video from dat, mpeg, mpg file to MP3, WMA, WAV, MP2 Audio \n\nSupport converting VCD video from dat, mpeg, mpg file to Gif Animation and GIF, BMP, EPS, JPG, PCX, PSD, PDF, TIFF, WMF, EMF, PNG, J2K IMAGE \n \n \n \nWhy Choose Apex VCD Ripper?  \n \n Extreme fast Conversion speed; \nUser-friendly UI with &quot;easy&quot; procedures . \nSupport batch files conversion. \nSpecifies start and end position while convert \nSupport large video files, even large then 2GB. \nSelect to automatically shut down your PC after conversion. \nNo Technical Knowledge Required. \nLifetime FREE Technical Support and FREE upgrade Free trial download.30 day money back guarantee.\n \n \n \nRecommended software to use Apex VCD Ripper better: \n \n Divx 5.x Codec for DivX MPEG-4 format file  \nXvid Codec for Xvid MPEG-4 format file  \nWindows Media Format Runtime  \nQuickTime Player to support MOV, QT \nRealPlayer to support RM or Install Real Alternative to Play realmedia files in Window Media Player\n\nserial tested and working 5 minutes ago\n\naccording to the website, this is the latest version \n \n \n  \n","torrent":{"xt":"urn:btih:a095ec4e730464e88d9cb25d2e93446513cbb99f","amp;dn":"apex+vcd+ripper","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a095ec4e730464e88d9cb25d2e93446513cbb99f","infoHashBuffer":{"type":"Buffer","data":[160,149,236,78,115,4,100,232,141,156,178,93,46,147,68,101,19,203,185,159]},"announce":[],"urlList":[]}}