{"title":"Hito no sekkusu o warauna aka Don't Laugh at My Romance","uid":5078019,"size":1784058024,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a0eb1b3d06b5c0fb9f88f9ba85f952a16db48533&amp;dn=Hito+no+sekkusu+o+warauna+aka+Don%5C%27t+Laugh+at+My+Romance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lord_terabyte","files":-1,"time":1252032407,"description":"Nami Iguchi - Hito no sekkusu o warauna aka Don't Laugh at My Romance (2007)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0945550/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0945550/&lt;/a&gt;\n\nLanguage\tJapanese\nSubtitles\tincluded: English idx/sub\n &lt;a href=&quot;\nhttp://img.photobucket.com/albums/v326/theobviousguy/ss/ADC/hitonosekkusuwowarauna/hitonosekkusuwowaraunaposter.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img.photobucket.com/albums/v326/theobviousguy/ss/ADC/hitonosekkusuwowarauna/hitonosekkusuwowaraunaposter.jpg&lt;/a&gt;\n\n[QUOTE]Screen representations of relationships between a younger woman and an older man, like &quot;Last Tango in Paris,&quot; &quot;Stealing Beauty&quot; or &quot;Elegy,&quot; are often taken for granted and their massaging of male egos readily indulged. Second-time director Nami Iguchi offers a refreshingly moral-free alternative in &quot;Sex Is No Laughing Matter,&quot; in which an older woman is the elusive object of desire.\n\nWhen &quot;Sex&quot; had its domestic release in Japan earlier this year, it was highly regarded among critics and scored excellent boxoffice for an independent film of its kind. The universal appeal of sexy comedies and the casting of internationally known young stars Kenichi Matsuyama (&quot;Death Note I &amp; II,&quot; &quot;L:Change the World&quot;) and Yu Aoi (&quot;Hula Girls&quot;), the film has good prospects in selected overseas art house niches.\n\nThere's certainly a touch of Rohmer in this mischievous and observant sex comedy-drama, and some may even proclaim that Iguchi is Japan's answer to Hong Sang Soo, except that she choreographs amorous encounters from a sly female perspective. But anyone who's seen her award-winning debut feature, &quot;The Cat Leaves Home,&quot; will recognize a voice and film language all of her own -- a voice that's full of good-humored wisdom about the little ironies in life and a film language that elegantly expresses feelings and situations with quirky gestures and conversational dialogue. Her shooting style is a little detached, with longish takes and mostly medium shots that capture a politely distant suburban campus town.\n\nAfter two chance encounters, student Mirume begins a fling with Yuri, who teaches lithography at an art college. The rookie lover becomes putty in the hands of the self-assured and coltish woman of 40 in some marvelously wry and tastefully racy scenes, which combine refined skills of seduction with childish pranks. Iguchi even makes cavorting inside a canvas camper's sleeping bag on the hard wooden floor with no central heating look sensuous!\nJust when Mirume is beginning to find his sexual groove, Yuri does a disappearing act. When he looks up her permanent address, he receives a minor shock or two.\n\nA subplot that enhances the centerpiece is Mirume's classmate En's unrequited love for him. En, in turn, has a secret admirer in fellow student Domoto but he too is frustrated. Iguchi shows that personal ticks and mannerisms often achieve more dramatic effect and verbal outpouring, so she makes all of En's romantic frustrations quirkily physical -- like her nervous kicking about whenever Mirume's around, her thrashing him when she gets rejected inside the cable car, or jumping up and down the bed when he falls asleep next to her in the love hotel.\n\nWith red-hot idols Matsuyama and Yu at her disposal, Iguchi tones down their glamour and makes them adopt bashful, emotionally inarticulate personas. But it is Hiromi Nagasaku who offers a wonderfully upbeat image as a woman who knows what she wants and gets it with no consequences. Better still, she doesn't eat little boys for breakfast because of marital discord, family trauma, personal insecurity or even mid-life crisis. Best of all, contrary to the film's tongue-in-cheek title, she encourages everyone to laugh about sex. How else are you supposed to enjoy it?[/QUOTE]\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/d1.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/d1.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/d2-1.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/d2-1.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/d3-1.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/d3-1.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/d4-1.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/d4-1.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/d5.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/d5.png&lt;/a&gt;\n\n---------my rip-------\n\nADC Uploader's Comments:\n[QUOTE]Thanks go out to Tairo and Jisatsu from FSC for providing the subs and to famitsu1 for joining and spell checking them and for posting them in the custom subtitles project thread (otherwise I wouldn't have found out about them for quite some time).\n\nI made various minor changes to a few dozen lines, fixed some scene bleeds on signs, and positioned the signs, but that's about it.[/QUOTE]\n\n~~~~~~ Hito no Sekkusu wo Warauna.avi ~~~~~~                                     \n                                                               \nFile Size (in bytes):...........................1,781,235,712                     \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD ISO MPEG-4              \nDuration (hh:mm:ss):............................2:17:05                \nFrame Count:....................................197193             \nFrame Width (pixels):...........................704                  \nFrame Height (pixels):..........................368                  \nAspect Ratio:...................................1.913                     \nFrames Per Second:..............................23.976          \nVideo Bitrate (kbps):...........................1531                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.246&quot;                     \n                                                                                \n--- Audio Information ---                                                       \nAudio Codec:....................................0x2000 (Dolby AC3) AC3                   \nAudio Sample Rate (Hz):.........................48000             \nAudio Bitrate(kbps):............................192                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \nAudio Channel Count:............................2           \n\n\n********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com&lt;/a&gt;\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE","torrent":{"xt":"urn:btih:a0eb1b3d06b5c0fb9f88f9ba85f952a16db48533","amp;dn":"Hito+no+sekkusu+o+warauna+aka+Don%5C%27t+Laugh+at+My+Romance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0eb1b3d06b5c0fb9f88f9ba85f952a16db48533","infoHashBuffer":{"type":"Buffer","data":[160,235,27,61,6,181,192,251,159,136,249,186,133,249,82,161,109,180,133,51]},"announce":[],"urlList":[]}}