{"title":"Vinnie Vincent Invasion - Love Kills","uid":5125616,"size":178438148,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a1282772d46be8e37084fe5d8e29b3fd7cd39b7b&amp;dn=Vinnie+Vincent+Invasion+-+Love+Kills&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1255604071,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nAll Systems Go is a 1988 album by Vinnie Vincent Invasion. it is the band's second and last official studio album.\n\nWith new vocalist Mark Slaughter, All Systems Go peaked at No. 64 on the Billboard Top 100 Album Chart in 1988 although it failed to go Gold, selling around 450,000 copies. Two singles from the album, &quot;Love Kills&quot; and &quot;That Time of Year&quot; were released with corresponding music videos. The song &quot;Love Kills&quot; was also featured in the soundtrack for A Nightmare on Elm Street 4: The Dream Master, and the video features scenes from the film. MTV hosted an entire hour for the film A Nightmare on Elm Street 4: The Dream Master which featured Robert Englund as Freddy Krueger and guest Vinnie Vincent promoting the music video. A third track from the album, &quot;Ashes to Ashes&quot; also received some radio airplay.\n\nThe band opened for Iron Maiden on their massive Somewhere in Time tour to support the album but broke up after the completion of the tour.\n\nThe singles &quot;That Time of Year&quot; and &quot;Love Kills&quot; are 2 of 4 Vinnie Vincent Invasion songs featured on the 2008 tribute album &quot;KISS MY ANKH: A Tribute To Vinnie Vincent.&quot; &quot;That Time of Year&quot; features Sheldon Tarsha of Adler's Appetite, Ryan Roxie from the Alice Cooper band, Marko Pukkila of Altaria and Troy Patrick Farrell of White Lion. &quot;Love Kills&quot; was recorded by Vic Rivera and Kelli McCloud.\n\nVinnie Vincent Invasion was an American heavy metal/glam metal band formed in 1984 by former KISS guitarist Vinnie Vincent.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a1282772d46be8e37084fe5d8e29b3fd7cd39b7b","amp;dn":"Vinnie+Vincent+Invasion+-+Love+Kills","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1282772d46be8e37084fe5d8e29b3fd7cd39b7b","infoHashBuffer":{"type":"Buffer","data":[161,40,39,114,212,107,232,227,112,132,254,93,142,41,179,253,124,211,155,123]},"announce":[],"urlList":[]}}