{"title":"End Day-(WTC-SWE)","uid":5565132,"size":520089627,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a12c2312468e8073dd8663314ceacc8131c5768e&amp;dn=End+Day-%28WTC-SWE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"WTC-SWE","files":-1,"time":1273958408,"description":"BBC:\n----\n\n\n\n                                     END DAY\n                                    ---------\n\n\n\n\nEnd Day is a 2005  docu-drama produced by the BBC and aired on the National Geographic Channel, on the TV series, National Geographic Channel Presents, that depicts various doomsday scenarios. The documentary follows the fictional scientist Dr. Howell, played by Glenn Conroy, as he travels from his London hotel room to his laboratory in New York City, and shows how each scenario affects his journey as well as those around him, with various experts providing commentary on that specific disaster as it unfolds.\n\n\n\n\n                             &lt;&lt;&lt;&lt;&lt;-------------&gt;&gt;&gt;&gt;&gt;\n\nMega-Tsunami\n------------\n\nIn this scenario, a volcanic eruption on the island of La Palma triggers a massive landslide wherein a sizable portion of the island collapses into the sea, causing a massive mega-tsunami to race across the Atlantic ocean and strike the east coast of the United States, inundating most of New York City, but leaving many buildings intact.\n\n\n\n\n\nKiller Asteroid\n---------------\n\nThis scenario begins with a mysterious 'missile attack' in a remote area somewhere in the Middle East. The 'missiles' are soon revealed to be small asteroid fragments, the advance guard of a much larger asteroid on a collision course with Earth, threatening Berlin, Germany. The asteroid is located and an attempt is made to alter its course using nuclear ICBMs. The attempt fails, resulting in the asteroid being broken into hundreds of smaller pieces with the biggest piece then impacting and obliterating Berlin.\n\n\n\n\n\nGlobal Pandemic\n---------------\n\nIn this scenario, a mysterious virus similar to SARS or influenza is unleashed, wreaking havoc as it spreads at a phenomenal rate throughout Europe, the UK, and North America, prompting many countries to enact martial law and close their borders in a frantic attempt to quarantine the spread of the disease, but are unsuccessful.\n\n\n\n\n\nSupervolcano\n------------\n\nThis scenario is based on the supervolcano beneath Yellowstone National Park erupting, incinerating everything within 100 km and releasing ash into the atmosphere which cools the earth. This segment has only aired in the UK. This scenario was explored in depth in another BBC docudrama, Supervolcano.\n\n\n\n\nStrange Matter\n--------------\n\nThis is the only scenario in which Dr. Howell reaches his laboratory unhindered, with people protesting, and shouting,&quot;STOP THE EXPERIMENT!&quot; outside. Upon arrival, he and his colleagues initiate a highly controversial experiment using the world's largest particle accelerator. The experiment quickly goes out of control, resulting in the creation of a new type of matter called a strangelet, which begins to consume and destroy all matter around it, starting with New York City. The phenomenon wreaks havoc on Earth's weather systems and atmosphere, and eventually leads to Earth's off-screen destruction. \n\n\n\n\n\n\nWritten &amp; directed by :  Gareth Edwards\n---------------------------------------\n\n\n\n\n\nTitle: End Day\nYear: 2005\nFile Size: 495 MB\nFormat:AVI\nVideo Length: 00:55:52\nVideo Codec: DivX 5\nVideo Resolution: 704x384\nVIdeo Bitrate: 1211 kbit/s\nDisplay Aspect ratio: 16/9\nFPS: 25.000000\nAudio Bitrate: 128 kbit/s\nAudio Codec: MPEG Layer-3\nChannels: 2\nSubtitles: (N/A)\n\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0974962/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0974962/&lt;/a&gt; \n\n\n\n\n\nYOUR CHOICE\n\nWTC-SWE\n\n\n\n\n(Please seed so others can enjoy)\n\n\n\n\n\nFor further information and pictures/images of all my torrents visit&quot; Suprbay Forum&quot; at   \n\nthis link: --------&gt; &lt;a href=&quot; http://suprbay.org/showthread.php?t=38774&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/showthread.php?t=38774&lt;/a&gt;                 \n\n*** This information is also avaible on the &quot;nfo&quot; file that comes with all my uploads.)***   \n\n\n\n\n\n\n\n                         **** RECOMMENDED DOWNLOAD ****\n\n\n\n\n\n###################################################################################\n#                                                                                 #\n# SPECIAL NOTE: Now with very fast downloads speeds people so you can enjoy all   #\n#               my documentaries.If you want any of my old documentaries to be    #\n#               seeded,post on my latest upload and you will have it in notime.   #\n###################################################################################\n\n\n","torrent":{"xt":"urn:btih:a12c2312468e8073dd8663314ceacc8131c5768e","amp;dn":"End+Day-%28WTC-SWE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a12c2312468e8073dd8663314ceacc8131c5768e","infoHashBuffer":{"type":"Buffer","data":[161,44,35,18,70,142,128,115,221,134,99,49,76,234,204,129,49,197,118,142]},"announce":[],"urlList":[]}}