{"title":"Music And Lyrics (2007) (NTSC)","uid":5050313,"size":4557387043,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a211e13982d3d30130223655f6d2a8387773d2a9&amp;dn=Music+And+Lyrics+%282007%29+%28NTSC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rodrigofcap","files":-1,"time":1250163607,"description":"Title: Music And Lyrics\n\nSynopsis:\n\nA professional collaboration between a popular lyricist and a washed-up musician takes a decidedly personal turn as the pair gradually finds their relationship developing into something much deeper in a romantic comedy directed by Marc Lawrence and starring Drew Barrymore and Hugh Grant. Alex Fletcher (Grant) may have been all the rage in the 1980s, but these days he's lucky to get a gig playing at the local county fair. Just when it seems as if things couldn't get any more bleak for the dejected has-been rocker, reigning pop diva Cora Corman (Haley Bennett) offers Alex the opportunity of a lifetime -- write and record a duet to be sung with her and watch his career receive a much-needed boost as the nostalgia-crazed public laps it up. Little does Cora realize that not only has it been years since Alex has written a song, but he's never actually written a single lyric. Now, if he hopes to make the comeback needed to save him from a life of complete and utter obscurity, Alex will have to craft a radio-friendly hit in a matter of mere days. Luckily for Alex, his quirky plant-keeper Sophie Fisher (Barrymore) has quite a way with words and may possess just the kind of songwriting talent needed to make such a hit happen. Unfortunately the beguiling Sophie is still reeling from a recent break-up with newly famous novelist Sloan Cates (Campbell Scott), and she isn't quite sure if she's ready for any kind of collaboration right now -- romantic or otherwise. Despite Alex's hesitation to commit and Sophie's reluctance to collaborate, the pair quickly discovers that a little chemistry can go a long way in healing the wounds of the past and laying the foundation for a much-deserved future of happiness and success.\n\nCast: \n\nHugh Grant (Alex Fletcher)\nDrew Barrymore (Sophie Fisher)\nScott Porter (Colin Thompson)\nZak Orth (David Newbert)\nBrooke Tansley (Janice Stern)\nDaniel Stewart Sherman (Willy)\nBrad Garrett (Chris Riley)\nAasif Mandvi (Khan)\nHaley Bennet (Cora Corman)\nMatthew Morrison (Ray)\nJason Antoon (Greg Antonsky)\nJeremy Karson (Charlie)\nEmma Lesser (Lucy Fisher)\nKristen Johnston (Rhonda Fisher)\nAdam Grupper (Gary Fisher)\n\nYear: 2007\n\nDuration: 96 minutes\n\nGenre: Comedy / Romance\n\nFormat: DVD 5\n\nScreen: 16:9\n\nStandard: NTSC\n\nAudio: English (Dolby Digital 5.1 ) &amp; Portuguese (Dolby Digital 5.1) \n\nSubtitles: English &amp; Portuguese","torrent":{"xt":"urn:btih:a211e13982d3d30130223655f6d2a8387773d2a9","amp;dn":"Music+And+Lyrics+%282007%29+%28NTSC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a211e13982d3d30130223655f6d2a8387773d2a9","infoHashBuffer":{"type":"Buffer","data":[162,17,225,57,130,211,211,1,48,34,54,85,246,210,168,56,119,115,210,169]},"announce":[],"urlList":[]}}