{"title":"PeaZip 2.7 Portable (64-bit)","uid":5090665,"size":5938753,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a2249f7603ba640837861664e9e8a3f7a981fed8&amp;dn=PeaZip+2.7+Portable+%2864-bit%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"olofolleola4","files":-1,"time":1253115237,"description":"Copied from PeaZip Homepage:\n\n\nOpen source file and archive manager\nFlexibe, portable, secure, and free as in freedom\n\n\nWhy PeaZip\n\n\nFlexibility\n\nPeaZip can extract most of archive formats both from Windows and Unix worlds: currently 95 file extensions are supported ranging from mainstream 7Z, RAR, TAR and ZIP to experimental ones like PAQ/LPAQ family, currently the most powerful compressor available.\nFor archive creation, PeaZip suppors a wide range of compression and encryption standard, from fastes to most powerful ones, and allows to export job definition as scripts to bridge the gap between GUI and console applications, and let the user pick the best of the two worlds.\n\nPeaZip is a reliable solution for most of the archive types you may met,\nand will help you in finding the right tool for a wide range of specific needs\n\n\nPortability\n\nYou can use PeaZip on all Windows version and on Linux (PeaZip is a desktop neutral application) with the same features and look and feel; moreover, for both platforms, PeaZip is also available as standalone, portable application not needing installation.\n\nYou can bring PeaZip with you and rely on it on multiple platforms\n\n\nSecurity\n\nPeaZip has secure deletion feature, can verify file checksum and hash, and supports multiple strong encryption standards, optionally using two factor authentication (password and keyfile) for increased security:\n\n7Z's AES256 encryption\n\nZIP WinZip's AE encryption based on AES256 (and ZipCrypto for legacy compatibility); can decrypt PKZip's AES encryption\n\nFreeARC's ARC: AES256, Blowfish, Twofish256 and Serpent256 - this format is also capable to generate recovery records to protect data against corruption\n\nPEA: AES256 EAX authenticated encryption\n\n\nPeaZip is focused on security and supports multiple encryption standards\n\n\nFree as in freedom\n\nPeaZip is freeware, free of charge for any use, and is also free as in freedom since it's Open Source (LGPLv3)\n\nPeaZip contains exclusively Open Source components released under OSI approved licenses\n\n\nMain features\n\nPeaZip is an open source file and archive manager: cross platform, available as portable and installable software for 32 and 64 bit Windows (9x, 2k, XP, Vista) and Linux (PeaZip is a desktop neutral application).\n\n* Full support (read and write)\n\n7Z\n7Z-sfx\nARC/WRC\nBZ2/TBZ2\ncustom\nGZ/TGZ\nPAQ/LPAQ\nPEA\nQUAD/BALZ\nsplit\nTAR\nUPX\nZIP\n\n\n* Read only (browse, extract, test)\n\nACE\nARJ\nCAB\nCHM\nCOMPOUND (MSI, DOC, XLS, PPT)\nCPIO\nISO\nJava (JAR, EAR, WAR)\nLinux (DEB, PET/PUP, RPM, SLP)\nLHA/LZH\nLZMA\nMac (DMG/HFS)\nNSIS\nOpen Office files\nPAK/PK3/PK4\nRAR\nSMZIP\nU3P\nUDF\nVHD\nWIM\nXAR\nXPI\nXZ\nZ/TZ\n\n\n* Repair\n\nARC\n\n\nPeaZip allows to apply powerful multiple search filters to archive's content; create and extract multiple archives at once; create self-extracting archives; export job definition as command line; save archive's layouts; bookmark archives and folders; scan and open with custom applications compressed and uncompressed files etc...\n\nOther features: strong encryption, robust file copy, split/join files (file span), secure data deletion, compare, checksum and hash files, system benchmark, generate random passwords and keyfiles.\n\n\nLocalizations\nCzech, Dutch, English, French, Galitian, German, Hungarian, Italian, Polish, Portuguese, Russian, Simplified Chinese, Sinhala, Spanish, Swedish, Ukrainian.\n\n\nPeaZip portable\n\nYou can simply unpack PeaZip portable in the path you prefer and use it, even on the network or on removable devices as USB sticks; it will not modify the host system.\nA writeable path is recommended to allow updating the internal peristent randomness collector.\n\n\n64 bit versions\n\nWhile PeaZip's 64 bit packages are meant for 64 bit systems only, PeaZip's 32 bit packages can be used on 64 bit Windows or Linux systems; 32 bit backend binaries can be freely replaced with 64 bit counterparts (if available) for performance optimization.\n\n\nChangelog:\n\n\n2009 09 15\n\nWhat's new in PeaZip 2.7:\n\n\no BACKEND\n\n\n+ (Windows) Updated to 7z 9.07\n\n\n\no FILE MANAGER\n\n\n+ Fixed: issue in remembering last output path used for extraction\n\n\n+ Fixed: issue in dropping items to bookmarks (showing on Windows only)\n\n\n+ Fixed: incorrect size for files larger than 4GB (showing on Windows only) - to compile sources in Lazarus 0.9.26.2 the IDE needs to be patched: http://bugs.freepascal.org/view.php?id=14472\n\n\n+ Fixed: PeaLauncher issue in exploring output path, if it is a folder (showing on Windows only)\n\n\n+ Fixed: restored behaviour of ope","torrent":{"xt":"urn:btih:a2249f7603ba640837861664e9e8a3f7a981fed8","amp;dn":"PeaZip+2.7+Portable+%2864-bit%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2249f7603ba640837861664e9e8a3f7a981fed8","infoHashBuffer":{"type":"Buffer","data":[162,36,159,118,3,186,100,8,55,134,22,100,233,232,163,247,169,129,254,216]},"announce":[],"urlList":[]}}