{"title":"TVO - Big Ideas, December 2, 2002: Noam Chomsky on international","uid":5100279,"size":105746463,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a357ab926f8696e8879f0ae3003f22a07a9dba28&amp;dn=TVO+-+Big+Ideas%2C+December+2%2C+2002%3A+Noam+Chomsky+on+international&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Temptation","files":2,"time":1253915940,"description":"[b]TVO - Big Ideas, December 2, 2002: Noam Chomsky on international policy continuity in the wake of 9-11[/b]\n\nMIT professor of Linguistics, Noam Chomsky, delivers his 2002 lecture on international policy continuity in the wake of 9-11.\n\n-----\n\nNote:  This is an iPod video podcast that is available for free download from the website.  Quality is good.  Audio podcast (mp3 format) is also available for free download.  \n\nType: mp4 file\nSize: 100MB\nRuntime: 01:00:27\nVideo: MPEG4 Video (H264) 320x240 \nAudio: AAC 32000Hz mono 48Kbps \n\nDownload this episode using the attached torrent file or download it directly using this link: &lt;a href=&quot;\nhttp://feeds.tvo.org/~r/tvobigideasVideo/~5/OZCL5RnysHk/BI_Lecture_20021202_855330_NChomsky_320x240_304k.mp4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://feeds.tvo.org/~r/tvobigideasVideo/~5/OZCL5RnysHk/BI_Lecture_20021202_855330_NChomsky_320x240_304k.mp4&lt;/a&gt;\n\nYou can also watch a flash video of this lecture through your web-browser here: &lt;a href=&quot;\nhttp://www.tvo.org/TVO/WebObjects/TVO.woa?video?BI_Lecture_20021202_855330_NChomsky&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tvo.org/TVO/WebObjects/TVO.woa?video?BI_Lecture_20021202_855330_NChomsky&lt;/a&gt;\n\n-----\n\nPlease note I'm well aware that this is an older lecture from December 2002. My reasons for posting this are multi-purpose.\n\nFirst, although this lecture is from December 2002 and probably aired on TVO's Big Ideas program in early 2003, TVO only very recently made the video podcast available.\n\nSecondly, this is Chomsky, and Chomsky is always worth listening to.  If you're interested in this subject, you'll find this a worthwhile and informative lecture, not to mention incredibly prescient.  As usual, Chomsky demonstrates just how ahead of the curve he is of everyone else, which he is rewarded for by being slandered against and marginalized in the American mainstream media and the mainstream American intelligentsia, both liberal and of course conservative, even as establishment pundits and &quot;intellectuals&quot; on American mainstream media such as the [url=http://www.salon.com/opinion/greenwald/2009/09/25/brooks/]war-mongering, NeoCon propagandist David Brooks[/url] and thetruly vile, racist pompous-buffoon Tom Friedman[/url] with his [url=http://www.chris-floyd.com/component/content/article/3-articles/1484-reprising-the-genocidal-fury-of-thomas-friedman.html]racist, genocidal fever-dreams[/url], not to mention those endless number of American corporate-funded right-wingsuperstars like Bill Kristol[/url], continue to enjoy prominent positions in the media, and are even rewarded and promoted to higher positions and prestigious venues for being repeatedly, completely, and utterly wrong about everything.  \n\nIt is also quite telling that this discussion doesn't lose much from being a couple of years old.  The issue of American foreign policy continuity, only with better PR and a smarter, better managed form of imperialism that Obama, the Democrats and American liberals specialize in, remains relevant given &quot;the continu[url=http://chris-floyd.com/component/content/article/1-latest-news/1831-the-16th-term-obamas-new-betrayals-are-oldity that has become the hallmark of our so-called Age of Change,&quot; to quote the -old-hat.html]great Chris Floyd.[/url]  Of course, this was allpredictable[/url] to those like Chomsky who actually understand the operations of power in the real world that lie behind the facade of elections and politics, who actually understand the American imperial power-structure and the actual motivations behind, and the long bipartisan continuity of, American foreign policy, in the Middle-East and elsewhere; [url=http://stopmebeforeivoteagain.org/stopme/]to those who actually know and understand American political history, who know the long, sordid, war-mongering, murderous history of the Democratic party and its long track-record of betrayals of the left, and who understand how crucial and important bottom-up grass-roots activism, existence of third parties and pressure from a strong left were in bringing about civilizing, social progress like civil rights and in forcing the Democratic party to push through progressive policies like the New Deal and the Civil Rights Act[/url]; and to those [url=http://prorev.com/2008/11/can-we-talk-about-real-obama-now.html]who were actually paying attention to Obama's track record[/url] and [url=http://www.blackagendareport.com/?q=content/where-obamaism-seems-be-going]who were listening to what Obama was actually saying[/url] instead of projecting their own (and in many cases, quite sincere and heartfelt) wishes for &quot;Hope and Change&quot; (tm) into Obama's deliberately vague, market-tested slogans (Yes We Can! yes we can .. what??) and &quot;soaring rhetoric&quot; that the dim-witted, shallow and sycophantic talking-heads and pundits on American media were easily dazzled and wowed by.\n\n-----\n\n[b]TVO - Big Ideas[/b]\n\nTELEVISION FOR PASSIONATE THINKERS\n\n[quote]I had never seen your program before, in fact I had never even heard of it. I was fortunate enough to tune in today ... Nothing is quite as nourishing as food for thought.\n-Brian, Big Ideas viewer[/quote]\n\n[quote]I have been off and on social assistance for several years. When I watch your show, I really am in university (a place I badly miss) and I don't feel so poor.\n-Gillian, Big Ideas viewer[/quote]\n\n[quote]... Were it not for Big Ideas to bring this to our attention we would be clueless. You are doing important work and those of us that are fortunate enough to catch your program, greatly appreciate your efforts.\n-Gary, Big Ideas viewer[/quote]\n\nBIG IDEAS, now in its eighth season, has an increasingly loyal following, exemplified by viewers such as Brian, Gillian and Gary. The program started in a late, late-night time slot with - among other offerings - the literary lectures by Robert Adams. It is now an established part of our weekend schedule, airing at 4pm on Saturday, with a repeat broadcast on Sunday, also at 4:00 pm. As TVO's educational mandate grew, so did the concept for BIG IDEAS, explains producer Wodek Szemberg: &quot;We have recognized from the passionate viewer response that there was a real niche for this kind of unapologetically intellectual programming.&quot; BIG IDEAS podcasts are among the most popular TVO web offerings.\n\n&quot;BIG IDEAS is a showcase of ideas that shape our public debates. At their best the lectures featured on the program expose us to the differing ways of defining what matters and how that affects our understanding of the world as it is and as it is likely to be,&quot; adds Szemberg. &quot;Each age has a set of questions by which it defines itself. If, 50 years from now, someone came across a list of BIG IDEAS shows, they would have a pretty good idea of what people thought about and debated in the early 2000s.&quot;\n\nBy nature of its lecture format, pacing and inquisitive approach, it is the antithesis of the prevailing sound-bite television norm. Engaging, articulate speakers stand behind lecterns across the province addressing audiences - a stark, on-air aesthetic running counter to fast edits and whizzy sound effects. The simple, bold concept, a victory of substance over style, has found an appreciative following. The success of this public television offering is testimony to our viewers need for nothing but intelligent discussion with perhaps a dash of personality and humour. At a time when much television programming induces in many viewers feelings of guilt, BIG IDEAS is as guilt-free television experience as it is possible to imagine.\n\nBIG IDEAS offers a variety of thought-provoking topics which range across politics, culture, economics, art history, science.... The program has introduced Ontario viewers to the impressive brainpower of people like Niall Ferguson on American empire, Daniel Libeskind on architecture, Robert Fisk on the Middle East, George Steiner on the demise of literacy, Camille Paglia on aesthetic education, Tariq Ramadan on being a Western Muslim, Noam Chomsky on U.S. politics, Leon Kass on dying, Janice Stein on accountability and governance.\n\nThe public face of the program is Andrew Moodie, who assumed the hosting duties for BIG IDEAS on January 7, 2006. You may recognize him as one of the three jurors who helped us to come up with the 10 finalists in 2005's Best Lecturer Competition, or you may know him as a gifted actor and playwright.\n\nTVO's [b]Big Ideas[/b] website: &lt;a href=&quot; http://www.tvo.org/TVOsites/WebObjects/TvoMicrosite.woa?bigideas&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.tvo.org/TVOsites/WebObjects/TvoMicrosite.woa?bigideas&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:a357ab926f8696e8879f0ae3003f22a07a9dba28","amp;dn":"TVO+-+Big+Ideas%2C+December+2%2C+2002%3A+Noam+Chomsky+on+international","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a357ab926f8696e8879f0ae3003f22a07a9dba28","infoHashBuffer":{"type":"Buffer","data":[163,87,171,146,111,134,150,232,135,159,10,227,0,63,34,160,122,157,186,40]},"announce":[],"urlList":[]}}