{"title":"Blade Runner Dvdrip H264 Bookerdog.mp4","uid":5077646,"size":920933524,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a3ea4b60d1db163f1fa6c5c473ba7871d4ac84ae&amp;dn=Blade+Runner+Dvdrip+H264+Bookerdog.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bookerdog","files":-1,"time":1252005461,"description":"Category\tAction, Horror, Science-Fiction/Fantasy, Gift Set, Classic, Detective, Robots/Cyborgs, Futuristic, Death, Big City\nStarring\tHarrison Ford, Rutger Hauer, Edward James Olmos, Daryl Hannah, Sean Young, M. Emmet Walsh, Brion James, William Sanderson\nDirector\tRidley Scott\nCostume Designer\tMichael Kaplan, Charles Knode\nDirector of Photography\tJordan Cronenweth\nEditor\tTerry Rawlings, Marsha Nakashima\nProducer\tMichael Deeley\nProduction Designer\tDavid L. Snyder, Lawrence G. Paul\nScreenwriter\tDavid Peoples, Hampton Fancher\nSpecial Effects\tDouglas Trumbull\nStory\tPhilip K. Dick\nClosed Captioned; Soundtrack English; Amaray Case; Special Edition\nTwenty-five years after the initial release of BLADE RUNNER, director Ridley Scott uses archival footage to re-create his original vision for the sci-fi classic. Based on a story by Philip K. Dick, the film is set in Los Angeles in 2019. Earth has become a polluted and miserable dystopia, and many people have fled to live &quot;Off World&quot; on other planets. This dreary vision of the future features replicants: lifelike robots built as slaves for human use. When a replicant escapes his owner, a &quot;blade runner&quot; is called in to hunt him down and kill him. Enter Harrison Ford as the retired blade runner Rick Deckard. He is pulled out of retirement to help catch four escaped replicants: Batty (Rutger Hauer), Leon (Brion James), Pris (Darryl Hannah), and Zhora (Joanna Cassidy.) Despite his distaste for the job, Deckard is soon hot on their heels, tracking them down one by one through the over-crowded, crumbling city streets. In the midst of his hunt, Deckard becomes involved with a beautiful replicant named Rachael (Sean Young). Rachel has fled her owner, and Deckard rightfully should kill her. However, the two fall in love, and after some startling revelations, they are both soon on the run from the very authorities that once employed Deckard. This final cut is a bleaker, more cynical version of an already dark film, which might explain why the studio insisted on a softer, more optimistic ending when it was first released. While some superfans might take issue with some of the revelatory new twists, they will no doubt delight in the quality of the digital restoration. The special effects were already impressive for 1982, but these new touch-ups give them a look that appears just as sharp and imaginative as the sci-fi films of today.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0083658/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0083658/&lt;/a&gt;","torrent":{"xt":"urn:btih:a3ea4b60d1db163f1fa6c5c473ba7871d4ac84ae","amp;dn":"Blade+Runner+Dvdrip+H264+Bookerdog.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3ea4b60d1db163f1fa6c5c473ba7871d4ac84ae","infoHashBuffer":{"type":"Buffer","data":[163,234,75,96,209,219,22,63,31,166,197,196,115,186,120,113,212,172,132,174]},"announce":[],"urlList":[]}}