{"title":"Bruce Lee - A Warriors Journey DVDRip","uid":5658701,"size":1060685491,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a410c649d4d41f07a5d665d11fb64e48273583c8&amp;dn=Bruce+Lee+-+A+Warriors+Journey+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sceneline","files":3,"time":1277891725,"description":"Bruce Lee was an enigmatic, legendary figure at the time of his death in 1973. \nHis popularity has never waned and this documentary on the black belt movie star \nattempts to explain some of his magnetic appeal. Included in this biographical \nfilm is footage of The Game of Death, the film that Lee was involved in at the \ntime of his death. Pieced together by Lee aficionado John Little, the film s \nfinale is a flurry of images of the master in action for over 30 minutes\n\nRated 8.3 / 10 Stars at IMDB\n\nThings to love about this film:\n* The Game of Death sequence, fully restored, edited and soundtracked to Bruce s \nwishes (according to recently found production notes)\n* The one finger (and a thumb) press-ups\n* The one inch punch\n\nTruly awesome and 10/10\n\nBruce Lee s life, philosophy, and final film are examined in this reverent \ndocumentary, which traces the master s path through the development of his \nown style, his battles with mainstream Hollywood and martial arts traditionalists, \nand his emergence as the world s top box-office draw. Just as interesting as Lee s \nlife is the chance to see lost footage from The Game of Death, Lee s final, unfinished film. \nOuttakes offer the opportunity to see Lee s perfectionism in action, and the reconstructed \nstoryline reveals how Lee s personal martial arts philosophy shaped the film. And yes, \nthere is a spectacular nunchakau fight. Interviews with Lee and those close to him highlight \nhis energy, intelligence, and remarkable charisma. Fans of Lee will welcome this new insight \ninto his filmmaking, and those unfamiliar with his life and work will come away with a new respect\n\nEnjoy","torrent":{"xt":"urn:btih:a410c649d4d41f07a5d665d11fb64e48273583c8","amp;dn":"Bruce+Lee+-+A+Warriors+Journey+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a410c649d4d41f07a5d665d11fb64e48273583c8","infoHashBuffer":{"type":"Buffer","data":[164,16,198,73,212,212,31,7,165,214,101,209,31,182,78,72,39,53,131,200]},"announce":[],"urlList":[]}}