{"title":"Jamie Foxx feat. T-Pain - Blame It","uid":5087309,"size":191617028,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a43599456bebafa28b9174dc8d10644998e0f818&amp;dn=Jamie+Foxx+feat.+T-Pain+-+Blame+It&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":-1,"time":1252823603,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Blame It&quot; is the second single off Jamie Foxx's third studio album Intuition It features singer T-Pain and was written by Christopher &quot;Deep&quot; Henderson, Nate Walker, James T. Brown (SLUGGER JONES), and Brandon Melanchon and produced by Christopher &quot;Deep&quot; Henderson. Both Jamie Foxx and T-Pain use the Auto-Tune effect. T-Pain also uses some elements from &quot;I Luv Your Girl&quot; by The-Dream. &quot;Blame It&quot; is the most successful single from the album, peaking at #2 on the U.S. Billboard Hot 100, the album's only top ten single so far, and has topped the Hot R&amp;B/Hip-Hop Songs chart for 14 consecutive weeks. &quot;Blame It&quot; has sold over one million downloads.\n\nThe music video was directed by Hype Williams and premiered at 106 &amp; Park on February 25, 2009. Cameo appearances in the video are made by Ron Howard, Forest Whitaker, Jake Gyllenhaal, Samuel L. Jackson, Quincy Jones, Cedric the Entertainer, Morris Chestnut, Clifton Powell, Alex Thomas, DeRay Davis, Joe, Mos Def, Tatyana Ali, Jalen Rose, Bill Bellamy, Ashley Scott, Electrik Red, Dawn Richard, Keshia Knight Pulliam and LeToya.\n\n&quot;Blame It&quot; rose rapidly to the top spot on Billboard's Hot R&amp;B/Hip-Hop Songs chart, becoming Foxx's first number one on the chart as a lead artist, and his third including featured credits. &quot;Blame It&quot; broke the record for the longest running #1 song ever on the chart by a male artist. It spent fourteen consecutive weeks at #1 before finally being knocked off by Jeremih's &quot;Birthday Sex.&quot; It is tied with &quot;We Belong Together&quot; by Mariah Carey and &quot;Nobody's Supposed to Be Here&quot; by Deborah Cox as the second longest running song ever on the chart. Only &quot;Be Without You&quot; by Mary J. Blige spent more time at #1, with 15 weeks.\n\nOn the Billboard Hot 100, it has thus far reached #2, making it his second top ten, but first top five hit on the chart as a lead artist and his highest peak on the chart (following two No.1s as a featured artist). The song sold one million downloads in 14 weeks in the United States. In Canada, it has peaked at #7 on the Canadian Hot 100 chart. After consistently remaining in the Hot 100's Top 20 for more than twenty weeks, &quot;Blame It&quot; took a sudden fall from number 22 to 34 in mid July.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a43599456bebafa28b9174dc8d10644998e0f818","amp;dn":"Jamie+Foxx+feat.+T-Pain+-+Blame+It","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a43599456bebafa28b9174dc8d10644998e0f818","infoHashBuffer":{"type":"Buffer","data":[164,53,153,69,107,235,175,162,139,145,116,220,141,16,100,73,152,224,248,24]},"announce":[],"urlList":[]}}