{"title":"Handel: Julius Caesar / Giulio Cesare (1984) ENO","uid":5571641,"size":8134721536,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a5a13f8569b3ab617f0a5589b1335cbb24fe1459&amp;dn=Handel%3A+Julius+Caesar+%2F+Giulio+Cesare+%281984%29+ENO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"FatFreddy347","files":-1,"time":1274267616,"description":"George Frideric Handel\n\nJulius Caesar / Giulio Cesare\n\n\nYear: 1984\nDirector: John Michael Phillips\nCountry: UK\nGenres: Drama, History, Music\nCast: Janet Baker, Valerie Masterson, Sarah Walker, Della Jones, James Bowman, John Tomlinson, John Kitchiner, Tomemlyn Williams, Brian Casey\n\nConductor: Sir Charles Mackerras\nDirector: John Michael Phillips\n \n\n\nSYNOPSIS:\n\nAct 1\nGiulio Cesare and his victorious troops arrive on the banks of the River Nile after defeating Pompey's forces. Pompey's second wife, Cornelia, begs for mercy for her husband's life. Cesare agrees, but on condition that Pompey must see him in person. Achille (Achillas), the leader of the Egyptian army, presents Cesare with a casket containing Pompey's head. It is a token of support from Tolomeo (Ptolemy), the co-ruler of Egypt (together with Cleopatra, his sister). Cornelia faints. Cesare's assistant, Curio, offers to avenge Cornelia, hoping that she will fall for him and marry him. Cornelia rejects the offer in grief, saying that another death would not relieve her pain. Sesto, son of Cornelia and Pompey, swears by singing &quot;Svegliatevi nel core&quot; to take revenge for his father's death. Cleopatra decides to use her charm to seduce Cesare. Achille brings the news to Tolomeo that Cesare was furious over the murder of Pompey. Cleopatra (in disguise) goes to meet Cesare in his camp hoping that he will support her as the queen of Egypt. Cesare is amazed by her beauty. Cesare, Cornelia and Sesto go to the Egyptian palace to meet Tolomeo. Tolomeo is fascinated by Cornelia's beauty but has promised Achille that he could have her. Sesto attempts to challenge Tolomeo, but is unsuccessful. When Cornelia rejects Achille, he orders the soldiers to arrest Sesto.\n\nAct 2\nIn Cleopatra's palace, she uses her charms to seduce Cesare. She sings praises of Cupid's darts and Cesare is delighted. In Tolomeo's palace, Achille pleads with Cornelia to accept him, but she rejects him. When he leaves, Tolomeo also tries to win her, but is also rejected. Sesto enters the garden of the palace, wishing to fight Tolomeo for killing his father. In Cleopatra's palace, Cesare hears the sounds of enemies approaching. Cleopatra reveals her identity and asks Cesare to flee, but he decides to fight. In Tolomeo's palace, the fight between Tolomeo and Sesto is interrupted by Achille's announcement that Cesare (in the attempt to run from soldiers) has jumped from the palace window and died. Achille asks again for Cornelia's hand in marriage but is turned down by Tolomeo. Sesto feels devastated and tries to kill himself but is prevented from doing so by his mother; he repeats his vow to kill Tolomeo.\n\nAct 3\nSounds of battle between Tolomeo's and Cleopatra's armies. Tolomeo celebrates his victory against Cleopatra. Cesare has survived his leap and prays for Cleopatra's safety. While searching for Tolomeo, Sesto finds the wounded Achille. Before Achille dies, he hands Sesto a seal of authority to enable Sesto to command his armies. Cesare appears and demands the seal. He promises that he will save both Cornelia and Cleopatra or die. Cleopatra is overjoyed to see Cesare alive. Sesto finds Tolomeo in the palace courting his mother and kills him. The victorious Cesare and Cleopatra enter the city of Alexandria, and Cesare proclaims Cleopatra as queen of Egypt and promises his support to her country. They declare their love, and the people acclaim their happiness and the bringing of peace to Egypt.\n\n\n\n\n IMDb.............: User Rating of 7.7/10\n\n Year.............: 1984\n Country..........: UK, performed at the English National Opera (ENO)\n Runtime..........: 180 Minutes\n Audio............: ENGLISH (Dolby Digital)\n Subtitles........: GERMAN, ENGLISH, FRENCH, SPANISH\n Video Format.....: PAL\n Aspect Ratio.....: 1.33:1\n DVD Format.......: Anamorphic\n DVD Source.......: DVD9\n DVD Distributor..: Arthaus Musik\n Program..........: Fairmount\n Average Bit Rate.: 5.74 Mb/sec \n\nMenus............: [X] Untouched\nVideo............: [X] Untouched\nDVD-extras.......: [X] None\nDVD-Audio........: [X] Untouched","torrent":{"xt":"urn:btih:a5a13f8569b3ab617f0a5589b1335cbb24fe1459","amp;dn":"Handel%3A+Julius+Caesar+%2F+Giulio+Cesare+%281984%29+ENO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5a13f8569b3ab617f0a5589b1335cbb24fe1459","infoHashBuffer":{"type":"Buffer","data":[165,161,63,133,105,179,171,97,127,10,85,137,177,51,92,187,36,254,20,89]},"announce":[],"urlList":[]}}