{"title":"Alan.Watt.2009.08.September.Mega.Pack2-sig_garrett","uid":5135060,"size":131320997,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a60baee1ee0053a298421be7f9f15e7b6f88775d&amp;dn=Alan.Watt.2009.08.September.Mega.Pack2-sig_garrett&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sig_garrett","files":14,"time":1256413376,"description":"Alan Watt &quot;Cutting Through The Matrix&quot; Radio ShowAlan Watt &quot;Cutting Through The Matrix&quot; Radio Show\n\n\nSept. 15, 2009\n\nPlay the Clown as We're Going Down:\n&quot;The Human Agenda, Vastly Detailed Plan,\nEntails Dehumanization of Every Man,\nThe Destruction of All That Went Before,\nInto Complete Immorality, Blood and Gore,\nTimes of Mayhem, Crisis and Strife,\nThe Desanctification of Human Life,\nCorpses Hanging on Wires, Copulating,\nFreak Art by Freaks, Authorized, Degrading,\nYoung Murdered for Body Parts, Utterly Disgusting,\nArranged by a Priestly Class, Pious and Trusting,\nThe Wise do Watch and the Wise do Know,\nMalevolence is Manifest, Not Far to Go&quot;\n\nImplementation of Planned Society - Guise of Environmentalism / Carbon / Climate Change to Save World - Post-2001 Reign of Terror - Surveillance Cameras Everywhere, Intimidation - Society of Masters and Slaves - Same Posters of Nazi Germany and Soviet Union. Dehumanization, Humans as Animals - Gawkers and Pseudo-Intelligentsia - &quot;Body Worlds&quot; Cadaver Art Show on Sex. New World Soviet System - Creation of Frustration and Helplessness, Acceptance of Insanity - Britain, Fined for Producing No Garbage - Paying Protection Money to State - Mice in Lab Cage Yapping - Saying NO - Rule Requires Consent and Needs You to Vote. Boston Tracking Flu Vaccinations, Batch Numbers and Names - Flu Outbreaks in Elderly Homes after Shots - Take Flu Jab or Jail for Ireland. EU Lisbon Treaty, Countries as Minor Provinces under EU Parliament, Global Governance, Amalgamated Military and Police. Body Organ Trafficking Rings, Algerian and Palestinian Children Abducted and Killed for Organ Harvesting. Interdependence (No Personal Independence) - Limits and Bans on Home Schooling, Must have Same Indoctrination - Think Tank Projections, City-States and Outside Barbarians. \n***Dialogue Copyrighted Alan Watt - Sept. 15, 2009 (Exempting Music, Literary Quotes, and Callers' Comments)\n\nTopics of show covered in following links:\n\n&quot;Body Worlds plans cadaver show dedicated to sex&quot; by Jason Rhodes (news.yahoo.com) - Sept. 11, 2009.\n\n&quot;Green shop owner is fined by council...for not producing any rubbish&quot; by Andrew Levy (dailymail.co.uk) - Sept. 12, 2009.\n\n&quot;Boston launches flu shot tracking&quot; by Stephen Smith (boston.com) - Nov. 21, 2008.\n\n&quot;Irish Star: GET THE RUSHED FLU JAB - OR BE JAILED&quot; (wiseupjournal.com) - Sept. 13, 2009.\n\n&quot;Exclusive Video Interview With Jim Corr - The Lisbon Treaty (video)&quot; (wiseupjournal.com) - Sept. 11, 2009.\n\n&quot;New Jewish organ theft gang busted&quot; (presstv.com) - Sept. 9, 2009.\n\n&quot;Israeli MP backs organ theft reports&quot; (presstv.com) - Sept. 9, 2009.\n\n&quot;Bostrom tells Press TV of Israel organ scenario&quot; (presstv.com) - Aug. 22, 2009.\n\n&quot;Parents protest at Ofsted inspections for children taught at home&quot; by Joanna Sugden (timesonline.co.uk) - Sept. 14, 2009.\n\n\nSept. 16, 2009\n\nSovietization of World Federation:\n&quot;New World Order at the Core of it,\nIs Plainly a Revamped World Soviet,\nThe People will Serve a New Ideal,\nDoesn't Matter if None of it's Real,\nElitists in Charge of Each Resource\nWhich They'll Dispense, Fairly of Course,\nAnd to Ensure You Pay Your Carbon Fines,\nTo Alleviate the Stress on Overworked Pines,\nFoundation-Backed NGOs Speak for the People,\nWho Apparently are Silent, as Befits True Sheeple,\nTotalitarian World, How Could it Be?\nIf You Stay Silent, Just Watch, You'll See&quot;\n\nTalking to the Perfectly Brainwashed Public - Changes from Top Down - Future Guided by NGOs, Think Tanks and Organizations. Eugenics, Nobility, &quot;Inherited&quot; Intelligence and Abilities - Selective Breeding Communities, Oneida Experiment. C.G. Darwin's &quot;The Next Million Years&quot;, Julian Huxley, Scientific Elite - Mass Cull by Stealth Methods - Plummeting Health, Skyrocketing Cancers, No Crisis (Planned That Way) - Fast Reduction in Third World, Slower in West - Health Care, Political Agenda of Population Reduction. European Union - Regional Blocs Subservient to Bloc (then World) Parliament - EU President - Tony Blair, No Regrets - EU Council and Commissioners, Unelected Body Makes Laws, Secret Working Groups - Parallel Government and Technocrats. War For and On the Mind - Bernays, Propaganda (Now Public Relations) - &quot;Experts&quot; Campaign to Counter Side-Effects of Flu Vaccines, Reporting of Adverse Reactions. Worldwide Aerial Spraying and Media Blackout - Reality Creation and Suppression - NASA to Create Noctilucent Clouds - U.S. Air Force Owning the Weather. British Empire, Indentured Servants, 16-Hour Workdays, Reinvention of Slavery - Soviet System, Marxist Doctrine - Totalitarian Regimes - Club of Rome: Man is the Enemy - Personal Carbon Rationing (Reduced Yearly), Emission Fines for Everyone. CFR-picked Politicians - Obama Extends Patriot Spy on Citizens Bill - U.S. Healthcare Bill and Fines for Poor. \n***Dialogue Copyrighted Alan Watt - Sept. 16, 2009 (Exempting Music, Literary Quotes, and Callers' Comments)\n\nTopics of show covered in following links:\n\n&quot;Architecture of a Totalitarian State - The Non-Democratic Power Structure of Post-Lisbon EU&quot; [Page 5, PDF file (13 MB)] (sovereignindependent.org) - Sept-Oct 2009 issue.\n\n&quot;Flu experts gear up for pandemic of vaccine worry&quot; [Experts Ready Propaganda Campaign to Counter Side-Effects of Flu Vaccines] (reuters.com) - Sept. 16, 2009.\n\n&quot;Risk from swine flu vaccine 'greater than catching virus' &quot; by Sylvia Thompson (irishtimes.com) - Sept. 15, 2009.\n\n&quot;NASA Rocket to Create Clouds Tuesday&quot; by Clara Moskowitz (space.com) - Sept. 14, 2009.\n\n&quot;Staff in carbon footprint trial face Ã‚Â£100 fines for high emissions&quot; by Ben Webster (timesonline.co.uk) - Sept. 14, 2009.\n\n&quot;Obama Backs Extending Patriot Act Spy Provisions&quot; by David Kravets (wired.com) - Sept. 15, 2009.\n\n&quot;Senate Bill Sets Lines for Health Showdown&quot; by Greg Hitt, Janet Adamy and Jonathan Weisman (online.wsj.com) - Sept. 17, 2009.\n\n\n\nSept. 17, 2009\n\nDon't Procrastinate -- De-Domesticate:\n&quot;The New World Order Group, within Their Own Milieu,\nKeep Extensive Data on Each Peasant's Work Value,\nYour Genealogical History, Statistical Life Expectancy,\nAs You Slave All Your Days in Total Interdependency,\nNo Reasoning with These Boys, Each Interbred Fanatic,\nShafting You, Dumping You in System Post-Democratic,\nTrue Darwinian Zealots, Elected Fittest to Survive,\nDo Sigh, Surplus Must Die so Fittest Families Thrive,\nBetter Wake Up Very Quickly, Don't be So Naive,\nDiscard Domestication, 'fore Nothing's Left to Retrieve&quot;\n\nGovernments are Corporations, Based on Economics - Economists, John Stuart Mill, Darwin, &quot;Arrested Civilizations&quot; and Lists of Peoples Who would not &quot;Adapt&quot; Slated for Elimination - Public to &quot;Prepare the Soil&quot; for Elite - UN Agenda 21 &quot;Human Habit&quot; Areas (Reservations) and Biospheres - Self-Sufficient American Indians, Put in Reservations, Residential Schools - Health Canada (Govt.) sends Bodybags to Native Indian Reserves. Imaginary Swine Flu Hype, Training for Annual Vaccinations - Rights for Individual Survival and Self-Sustenance - Interdependence = Dependence for Everything You Need to Survive. Darwinian Plan, Planetary Masters and Slaves - Forced Labour (Taxes) is Slavery - Set-up of EU and Parliament (Totalitarian). Push from Top for Religious Movements to go &quot;Green&quot; - God and Christianity Banned by Councils in Britain. Riots Feared as Unemployment Rises - Lord Mandelson. Political Healthcare Agenda - Doctors Withdraw Treatment for Terminally iLL, Euthanasia, Death &quot;Pathways&quot; - EXTERMINATION - Giving Govt. Power Over You - Darwinian &quot;Survival of the Fittest&quot; - Enslavement through Physical Force or Economic System (Money). Karl Marx - Leaders of All Parties Members of CFR-RIIA - Australian P.M., Obama. \n***Dialogue Copyrighted Alan Watt - Sept. 17, 2009 (Exempting Music, Literary Quotes, and Callers' Comments)\n\nTopics of show covered in following links:\n\n&quot;Ottawa sends body bags to Manitoba reserves&quot; (cbc.ca) - Sept. 16, 2009.\n\n&quot;Alcohol-based sanitizers for flu-hit First Nations delayed over substance abuse fears&quot; (cbc.ca) - June 23, 2009.\n\nVIDEO: &quot;UNREPENTANT: KEVIN ANNETT AND CANADA'S GENOCIDE (documentary)&quot; [Time: 1:48:56] (video.google.com).\n\nVideo: &quot;The swine flu fiasco&quot; (archives.cbc.ca) - Broadcast Feb. 21, 1983.\n\n&quot;CBC Flu Archive&quot; [Old documentaries on first Swine Flu Outbreaks, CBC Canada.] (at archive.org).\n\n&quot;DON'T GET SHOT: The Save 10,000 Kids Street Action (Sep 19th, 1 pm)&quot; Toronto Truth Seekers (9-11.meetup.com).\n\n&quot;You mustn't mention God... council bans church from putting up notices about its meetings&quot; (dailymail.co.uk) - Sept. 16, 2009.\n\n&quot;TUC fears risk of riots as jobless total rises&quot; by Brian Groom and Jim Pickard (ft.com) - Sept. 13, 2009.\n\n&quot;Report warns doctors snub families of the terminally ill amid growing use of 'death pathway' &quot; by Daniel Martin (dailymail.co.uk) - Sept. 15, 2009.\n\n\n\nSept. 18, 2009\n\nWhy Wait for Retiring?  Here's Population Downsizing:\n&quot;Terrorism, Swine Flu, Rationing Health Care and Stuff,\nElitist Masters Saying You're Not Dying Fast Enough,\nArmfuls of Statistics, Graphs with Zig-Zag Courses,\nImpressive (to a Moron), Say We're Chomping Up Resources,\nYou See, We Ordinary Folk with Decency, Few Needs and Compassion\nAre Loaded Down with Junk Genes, Declared Out of Fashion,\nThe Rich have Made it to the Top with Cunning and with Slaughter\nAnd Centuries of Inbreeding, Sometimes with Their own Daughter,\nOnce We've been Eliminated, the World will be Their Home,\nQuiet Forests and by River, Elite's Offspring then can Roam&quot;\n\nWorld News Blitzes, Raising Public Awareness - Planned World Population Reduction, Promotion of Small Families, Abortions, Euthanasia - Death Control - Eugenicist-Geneticist Icons like David Suzuki, David Attenborough - Elites' Fear of &quot;Too Many People&quot; - Malthusian Graphs and Charts - Starvation, Corporate Farm Takeovers, Govt. Legislation, Food Used as Weapon - U.S. Policies for Latin America, NAFTA, Small Farmers Put Under - Wars, Famines and Plagues for Depopulation - C.G. Darwin, Elimination of Lower Classes - Britain, Borders Opened to Immigration - Aristocratic Class of Born Liars. Emotive Topics to Fall Into - Obama - Taking Money Away from Healthcare, $Trillions Given to Bankers and Military - Government Control of Your Life (and Death) - Denying Care to Elderly - &quot;Soylent Green&quot; movie (&quot;Make Room, Make Room&quot;) - Baxter Labs' Mix of Avian-Human Killer Flu. S.O.A.R. Paragliders for Cops (Toys for the Boys) - Taxpayer Funding - NASA. Cooling Temperatures &quot;Mask&quot; Global Warming - New Religion of Going Green - Media's Job to Keep You in the Dark - Mass Swine Flu Cardboard Coffins for Scotland. Management of Music Bands - the Beatles - Pythagoras, Pythagorean Scale, Medieval Church Music - 13. \n***Dialogue Copyrighted Alan Watt - Sept. 18, 2009 (Exempting Music, Literary Quotes, and Callers' Comments)\n\nTopics of show covered in following links:\n\n&quot;News Review interview: David Attenborough - The naturalist is frightened by the number of people in the world and says the human race needs to be reduced&quot; by Camilla Long (timesonline.co.uk) - April 19, 2009.\n\n&quot;The Case for Killing Granny - Rethinking end-of-life care&quot; by Evan Thomas (newsweek.com) - Sept. 12, 2009.\n\n&quot;The Jane Burgermeister website - investigating the swine flu pandemic&quot; (theflucase.com).\n\n&quot;Flying Florida police in their new bullet-proof paragliders&quot; (dailymail.co.uk) - Sept. 18, 2009.\n\n&quot;Sceptics seize on climate cooling model&quot; George Monbiot blog (guardian.co.uk) - Sept. 16, 2009.\n\n&quot;Mass swine flu coffins warning&quot; by David Maddox (news.scotsman.com) - Sept. 17, 2009.\n\n\n\nSept. 21, 2009\n\nEuthanasia, No Tears, We Want Volunteers:\n&quot;News from Above, it's Something They Said,\nI'm Getting the Feeling They Want Us All Dead,\nThe Quickest Way to Reduce CO2,\nIs to Eliminate the Chance of Producing More You,\nWith Statistics and Graphs, This Bunch of Comics (O.P.T.)\nHas Teamed with the London School of Economics,\nThe Elite are Saying in Their Own Polite Way,\nOur Use is Now Over, We've Outlived Our Stay,\nGiven CO2 Fairy Tales with Future of Gloom,\nUnless We Bite the Cyanide, Go to Our Doom,\nAll in Good Cause so Those 'Better' People\nWill have a Bright Future Without 'Lesser' Sheeple&quot;\n\nAgenda 21, Destruction of &quot;Urban Sprawl&quot; - Long-Term Planning, London Corporations, Private Armies - New World Order leading to Eugenicists' Utopia. Club of Rome, Dreamed-Up Cons like Global Warming, Man is Enemy of Planet - Survival of the Fittest and Elimination of &quot;Inferior&quot; Types. Media P.R. Pieces, News Blitzes - New Religion of Carbon Emissions - Population Reduction to Manageable Level - United Nations and Departments - Optimum Population Trust - Forced Movement off Rural Areas into Crowded Cities - UN Biospheres - Wartime Scenario, Rationing of All Essentials - UN: Good Citizen is Producer-Consumer - Intergenerational Ties Cut - &quot;Inevitable&quot; Euthanasia for Retirees and Elderly. Common Purpose group, RIIA, Fabian Society - Infiltration of Govt. and Civic Organizations - Training of Future Leaders - NGOs, UN Affiliation - Nick Begich, Bo Gritz. Totalitarian Elite, Need Co-operation of Public - Full-Scale War on &quot;Lesser&quot; Types. \n***Dialogue Copyrighted Alan Watt - Sept. 21, 2009 (Exempting Music, Literary Quotes, and Callers' Comments)\n\nTopics of show covered in following links:\n\n&quot;Should contraception qualify for climate funds?&quot; by Candace Lombardi (news.cnet.com) - Sept. 17, 2009.\n\n&quot;FEWER EMITTERS, LOWER EMISSIONS, LESS COST - REDUCING FUTURE CARBON EMISSIONS BY INVESTING IN FAMILY PLANNING - A COST/ BENEFIT ANALYSIS&quot; [PDF File] London School of Economics / Optimum Population Trust (optimumpopulation.org) - August 2009.\n\n&quot;Greying Britain looks to assisted suicide reform&quot; by Farah Master (reuters.com) - Sept. 21, 2009.\n\n&quot;The Case for Killing Granny - Rethinking end-of-life care&quot; by Evan Thomas (newsweek.com) - Sept. 12, 2009.\n\n\n\nSept. 22, 2009\n\nU.N. Master Mentor, War of Terror:\n&quot;War of Terror, Screamed from On High,\nU.N. Declares 'A Lot Must Die',\nToo Many People, the Climate's Changed,\nNeed Carbon Taxes, from Mind Deranged,\nAll So We'll Accept a New Society,\nSafe, with No Freedom, No Choice Variety,\nFabian Agenda of a Hundred Years,\nStealing Freedoms with Unfounded Fears,\nSociety Dumbed Down in Somnambulance,\nVaguely Accepting New Governance&quot;\n\nShock and Awe used on World - United Nations Treaties, Globalization - IMF, Bretton Woods 1 and 2, Loans (and Mandates) to Nations. Copenhagen Climate Change Summit, Scary Scenarios to Terrify Public - Corporations &quot;Going Green&quot; - IPCC - Individual Carbon Taxes - C.G. Darwin's &quot;The Next Million Years&quot;, New More Sophisticated Slavery - Co-ordinated Media Blitz for Depopulation - Royal Society - Birth Control Pill - Africa - Kissinger's &quot;Enemy to the State&quot; - Thomas Malthus. Post-Democratic Governance - New Feudal System - The New Deal - New World Economic Order - Paying for Carbon, Indulgences of Catholic Church - NGOs, Soviet System (Rule by Councils) - Prince Charles says Walk don't Drive. Aerial Spraying, Weather Warfare - Man-made Drought and Flooding - Building on Floodplains. Nasal Spray Flu Vaccine. Bill Cooper - Bo Gritz (Special Forces Assassin), Orders from Pentagon. Falling Chemtrails. \n***Dialogue Copyrighted Alan Watt - Sept. 22, 2009 (Exempting Music, Literary Quotes, and Callers' Comments)\n\nTopics of show covered in following links:\n\n&quot;Copenhagen summit: UN plans 'shock therapy' for world leaders on environment&quot; by Suzanne Goldenberg (guardian.co.uk) - Sept. 20, 2009.\n\n&quot;Population growth driving climate change, poverty: experts&quot; (breitbart.com) - Sept. 21, 2009.\n\n&quot;U.N. 'Climate Change' Plan Would Likely Shift Trillions to Form New World Economy&quot; by George Russell (foxnews.com) - March 27, 2009.\n\n&quot;U.S. to push for new economic world order at G20&quot; by Alister Bull (reuters.com) - Sept. 21, 2009.\n\n&quot;Prince Charles urges people to abandon car in favour of walking and public transport&quot; by Andrew Pierce (telegraph.co.uk) - Sept. 21, 2009.\n\n\n\n\nSept. 23, 2009\n\nFreedom is the Right to Say 2 + 2 = 4 (Orwell's '1984'):\n&quot;Plan Sprung into Action in 2001,\nAge of Crisis Creation had Truly Begun,\nA Global Crisis comes with Each Season,\nVia Propaganda, Aimed at Folks with No Reason,\nExchange Freedom for Safety, Keep Us from Harm,\nWith Media Hyping Each False Alarm,\nTerrorism, Bank Crashes, Plagues All Abound,\nWhile Carbon Taxes Make No Sense to Mind that is Sound,\nMassive Overreaction to a Flu that is Mild\nShould Heighten Suspicions in Mind of a Child,\nGovernments Call for Population Reduction,\nAdd it All Up, What's Your Deduction?&quot;\n\nWhat is the &quot;New World Order&quot; - 2001: Century of Change - Global Governance - Ben Franklin, Beginnings of &quot;Federation of the World&quot; Run by 12 Wise Men - Benevolent Dictatorship - Collective Punishment for Crimes of Few - Former U.S. Legal System - Philemon, Fisher King, Vow of Silence - Pythagoras, Mystery School, Covert Revolution, Greece and Egypt - Carl Jung. Royal Institute of International Affairs / Council on Foreign Relations - War of Terror - &quot;Change is Good&quot; - Foundations and Corporations Funding Greening / Depopulation Agenda. Plato - Jacques Attali, &quot;Millennium&quot; and &quot;A Brief History of the Future&quot; - Public Given Heroes to Follow - Ralph Nader: &quot;Only the Rich can Save Us&quot;. Kevin Annett, Exposure of Canadian Indian Genocide, Religious Residential Schools, Smallpox and Tuberculosis - Experimental Testing and Mandatory Treatment on Reserves - Forced Inoculations - Real Pandemic FROM Vaccines - Targets for Extermination - Nurses Refuse Flu Shot - 1976 and Today's Swine Flu, Effects of Shots. \n***Dialogue Copyrighted Alan Watt - Sept. 23, 2009 (Exempting Music, Literary Quotes, and Callers' Comments)\n\nTopics of show covered in following links:\n\n&quot;The Program on International Institutions and Global Governance (IIGG) at the Council on Foreign Relations (CFR)&quot; (cfr.org).\n\n&quot;World Order in the 21st Century&quot; [PDF File] (cfr.org) - May 1, 2008.\n\n&quot;Ralph Nader on the G-20, Healthcare Reform, Mideast Talks and His First Work of Fiction, 'Only the Super-Rich Can Save Us!' &quot; (democracynow.org) - Sept. 21, 2009.\n\n&quot;The Mask Slips, for Those with Eyes to See: Preparing for the Real Pandemic&quot; by Kevin D. Annett, M.A., M.Div. (republicoflakotah.com) - Sept. 19, 2009.\n\n&quot;Dr Crippen: Just don't try giving me the swine flu vaccine&quot; (guardian.co.uk) - Sept. 8, 2009.\n\n&quot;LI nurses to rally against mandatory swine flu vaccines&quot; by Delthia Ricks (newsday.com) - Sept. 21, 2009.\n\n\n\nSept. 24, 2009\n\nThe Elective Collective:\n&quot;Each National Leader Forgets His Nation,\nAttends World Summits, Global Sovietization,\nTheir Politburo Format Strains Credibility,\nThese Poor Ham Actors with No Versatility,\nEach Interchangeable with Spiel They Sell,\nFrom Same Scriptwriters, Not Very Well,\nWe've All to be Poor and Not Consume,\nWe can Then Die Off, Leaving Room,\nFor Those Who Declare They're Fittest to Survive,\nIn Their Post-Human Spacious World, Certain to Thrive,\nThanks to Rockefeller and Co., Each Foundation Laid it,\nWithout All You Peasants They'd Never Have Made it&quot;\n\nLiving Through a Script - Philanthropy, Foundation-Funded NGOs - Ownership of Planetary Resources - Sudbury (Ontario, Canada) and Mines, Rothschild Square - Scientific Elite - Agri-Business - Culture Creators - Men Marching in Step to Get Things Done - Must-Be Climate Change Agenda - Depopulation to Meet CO2 Targets. G8 and G20 Meetings - Training into Governance - CFR / RIIA, Chatham House (WWII OSS Headquarters), MI6 / CIA - National &quot;Global&quot; Leaders (Internationalists, Chosen and Groomed) - Front Actor Politicians - Elite of Soviet Union and West - Gordon Brown (Fabian) at UN calls for &quot;Global Society&quot; - Obama, Public is to Blame (and Pay) - Oil and Mining Companies backing Greening Agenda - World Health Authority. Parallel Government run by Technocrats - Bill Clinton's &quot;Global Initiative&quot;, Training Media for New Soviet Style in &quot;Collective Human Interest&quot; - Collectivism, Remote Declarations. Mandatory Flu Shot or Mist Spray - Implantable Microchip to &quot;Monitor Pandemic&quot;. \n***Dialogue Copyrighted Alan Watt - Sept. 24, 2009 (Exempting Music, Literary Quotes, and Callers' Comments)\n\nTopics of show covered in following links:\n\n&quot;U.N. climate meeting was propaganda: Czech president&quot; by Louis Charbonneau (reuters.com) - Sept. 22, 2009.\n\n&quot;Gordon Brown warns next six months will test the world, tells UN it stands 'at a point of no return' &quot; by Patrick Wintour (guardian.co.uk) - Sept. 23, 2009.\n\n&quot;Launch of The Global Council for Media Transformation, 2009&quot; (clintonglobalinitiative.org).\n\n&quot;Clinton Global Initiative&quot; (clintonglobalinitiative.org).\n\nAbout Clinton's Global Initiative (clintonglobalinitiative.org).\n\n&quot;Comprehend VeriChip's Swine Flu Chip&quot; [Chip to &quot;Monitor Pandemic&quot;] by Gabriel O'Hara (wiseupjournal.com) - Sept. 24, 2009.\n\n&quot;Hitachi Develops a New RFID with Embedded Antenna MU-Chip&quot; [Under-Skin Chip] (hitachi.com) - Sept. 2, 2003.\n\n\n\nSept. 25, 2009\n\nOligarchy on Roll Against the Prole:\n&quot;Soviet Scientific Dictatorship Unfurls its Plan\nTo Direct the Lives of Woman, Child, Man,\nUnder Various Guises, Sustainable, Ecology,\nTreating Us like We'd Each had a Lobotomy,\nBehind Philanthropists' Smiles is Eugenicists' Sneer,\nTerrifying the Lessers, Always Hyping the Fear,\nMore like Robots, Showing No Soul,\nGraphs and Statistics, Means to Their Goal,\nNo Depth to Deception, No Lie's too Low,\nNo End of Force to which They Won't Go,\nThey're On a Roll, No Negotiation,\nThey Get the World, You're Just Earth Compostation&quot;\n\nBeria (NKVD), Soviet Union, Bertrand Russell, Alteration of Society by Scientific Indoctrination - Credit Card Era, Consumerism to Sustainability - New World Soviet (Rule by Councils), Global(ist) Leaders. TOTAL Information Network, Everyone Monitored - Mass Surveillance Grid in EU - Government Spending Your Tax Money - Programming through Fiction - DNA Database - Amalgamation of Americas, 2005-2010. Europe: Will Make Arrests on Data Predicting Future Actions (Pre-Crime Arrest) - Predictability in Totalitarian Society - Computer Models, Pentagon's &quot;Virtual World&quot; of You - Everyone is Potential &quot;Criminal&quot; - Legal Today, Illegal Tomorrow - Economic Depression, Immigration, Destruction of Nationalism - Britain, Official Decrees, &quot;Child Protection&quot; Database and Mandatory Vetting by ISA Agency - Scientific Dictatorship. Dictatorial European Union, Lisbon Treaty, EU as Legal Personality (Corporation) - Gorbachev, Communism's Next Phase (Blend with West). Leaders Given to Public - Elitist Ecologist-Eugenicists pushing Depopulation - Jacques Cousteau - Jane Goodall in &quot;Green&quot; Sudbury, Optimum Population Trust - Paul Ehrlich and John Holdren - America into Marxism Phase. \n***Dialogue Copyrighted Alan Watt - Sept. 25, 2009 (Exempting Music, Literary Quotes, and Callers' Comments)\n\nTopics of show covered in following links:\n\n&quot;EU funding 'Orwellian' artificial intelligence plan to monitor public for 'abnormal behaviour' &quot; by Ian Johnston (telegraph.co.uk) - Sept. 19, 2009.\n\n&quot;Euro project to arrest us for what they think we will do&quot; by John Ozimek (theregister.co.uk) - Sept. 23, 2009.\n\n&quot;Now Big Brother targets helpful parents as 1 in 4 Britons are to be vetted for giant new child protection database&quot; by James Slack and Matthew Hickley (dailymail.co.uk) - Sept. 12, 2009.\n\n&quot;Long Live The New Union?&quot; by Gabriel O'Hara (wiseupjournal.com) - Sept. 25, 2009.\n\n&quot;Population: Enough of us now&quot; by Paul Ehrlich and Anne Ehrlich (newscientist.com) - Sept. 25, 2009; Magazine issue 2727.\n\n\n\nSept. 28, 2009\n\nLogan's Run -- Termination's Fun:\n&quot;It's TV Reality in the Land of the Dead,\nNo Interest in Warnings or What's been Said,\nNo Interest in Rulers Who Call Each Shot,\nBy the Time You've Spoken They've Already Forgot,\nThey Love Their Trivia and Little Routine,\nThe Latest from Hollywood They've All Seen,\nAvoiding the Negative as Trained to do,\nGoing for Flu Shots, Lining in Queue,\nThey'll Line Up for Extinction if it's a Party Affair\nAnd Cheer for Each One Turned to Puff in the Air&quot;\n\nNew Priesthood (Experts) of Science and Greening - Reality Creation, Television Images, &quot;Most-Trusted&quot; Newscasters - New Feudal Society for New Age - Malthus - Symbiosis of Elite Masters and Masses of Slaves - The Dead - Survival Instincts, Wild vs. Domesticated Animals - Orwell's &quot;1984&quot;, Mindset of Bureaucrat, Group Consensus. Managerial Class, Governance - World Wars to Bring World to Their Knees. Aerial Spraying, Weather Manipulation - Shock and Awe since 2001, Continual Crisis, Terrorism, Everyone Suspect - &quot;Change is Good&quot; - Humiliation Techniques - CCTV Cameras in Homes - Bankers' Crash and Reward - Bacterial-Viral Warfare, Inoculation Program - Vaccination for &quot;Novel&quot; H1N1 Flu - Govt. Mandates and Protection for Big Pharma - Paralysis and Deaths from Cervical Cancer Vaccine - Vaccines, Acceptable Risk (&quot;Write-offs&quot;) - Parents Not Buying Propaganda on Flu - Mild or Non-Existent Flu. Targeting Food, Water and Infrastructure in Warfare - Attack on Farmers, Agri-Business Takeover - Worldwide Food Rationing for &quot;Inevitable&quot; Shortages - Carbon Taxes for Farmers (and Everyone Else) - Prohibition on Meat Eating - More Sophisticated Form of Slavery - Property Seizure (Theft) - Rights for Animals, Not People - EU Carbon Trading (Invisible Nothing) Scheme - Soviet Union - Control of Agriculture by Corporate Farms and Packers. \n***Dialogue Copyrighted Alan Watt - Sept. 28, 2009 (Exempting Music, Literary Quotes, and Callers' Comments)\n\nTopics of show covered in following links:\n\n&quot;Most parents won't have kids get H1N1 flu shots, study finds&quot; by Melissa Healy (latimes.com) - Sept. 25, 2009.\n\n&quot;Paralysed cancer drug girl to be put on at-risk register 'to shut her up' &quot; by Jan Disley (dailymail.co.uk) - Sept. 20, 2009.\n\n&quot;Schoolgirl, 14, dies after being given cervical cancer jab&quot; by Daniel Martin (dailymail.co.uk) - Sept. 29, 2009.\n\n&quot;Parents 'not buying' H1N1 panic message&quot; by Mark Baard (timenauts.com) - Sept. 25, 2009.\n\n&quot;Value of climate credits, foreign ownership concern U.S. farmers&quot; by Philip Brasher (desmoinesregister.com) - Sept. 27, 2009.\n\n&quot;E.U. Alone and Lonely on Carbon&quot; by James Kanter (nytimes.com) - Sept. 27, 2009.\n\n&quot;Small Farm Extermination&quot; by Thomas Linzey (celdf.org).\n\n\n\nSept. 29, 2009\n\nNWO Masters of Disasters:\n&quot;New World Order is Deceptive, Techniques Machiavellian,\nIt's No Surprise They Disguise They are Totalitarian,\nYou've No Rights, You're being Watched for Safety,\nYou'll be Scared if You've Dared to Read History Lately,\nLenin, Stalin, Hitler Set Their Sights Way Low,\nThe Master's Boys with High-Tech Toys Prize World as Way to Go,\nThe Sheeple are so Mind-Bombed, Not a Thought Inside that's Vital,\nTV's Blood and Gore and Sex Galore, then on to American Idol,\nTo Take Down a Society, Complete Culture Must be Destroyed,\nDone Bit by Bit, Masters Never Slip, On Cue Each Change Deployed&quot;\n\nTool of Television to Change Society and Culture for Domination - Updating of Reality - Planned Society, Slavery - Science and Sci-Fi Writers, CIA Authors - Aldous Huxley's &quot;Brave New World&quot; and George Orwell's &quot;1984&quot; - Conditioning, Hypnosis, Suggestibility - Pop Music and Fashion, Societal and Familial Takedown. Public Disbelief in Reality, Belief in Media - Skinner, Psychopathic Scientists - EU's Project Indect, Monitoring of ALL Phones, Faxes, Internet, Email etc. for &quot;Threats&quot;. Stanford University, Persuasive Computer Technology to Change Attitudes and Behaviours (Brainwashing) - Mental Preparation for Changes. CCTV Cameras to Intimidate You - Big Brother Watching You - Britain, Public Humiliation over Screen and Loudspeaker - ISIS Cameras to &quot;Prevent&quot; Crime, &quot;Anti-Social&quot; and &quot;Suspicion&quot; Alerts - Well-Behaved Children of Soviet Union - Tax-Funded Prison Earth - &quot;Minority Report&quot; and &quot;1984&quot; movies. Neighbourhood Gossip and Data Collection - U.K. Govt. &quot;Children's Vetting&quot; Agency - State Indoctrination to Overcome Parental Input - Lawyers, Spoken Word and Interpretation, Legal Joust in Courtroom - Human Organ Harvesting and Sales. Open Totalitarian Regime - Eugenics Agenda - Margaret Sanger, Coming &quot;Race&quot; of Women - Tools of Money, Food and Water for Control. \n***Dialogue Copyrighted Alan Watt - Sept. 29, 2009 (Exempting Music, Literary Quotes, and Callers' Comments)\n\nTopics of show covered in following links:\n\n&quot;EU funding 'Orwellian' artificial intelligence plan to monitor public for 'abnormal behaviour' &quot; by Ian Johnston (telegraph.co.uk) - Sept. 19, 2009.\n\n&quot;Machines Designed to Change Humans&quot; The Stanford Persuasive Technology Lab (captology.stanford.edu).\n\n&quot;Mobile Persuasion: 20 Perspectives of the Future of Behavior Change&quot; [book] (mobilepersuasion.com).\n\nCaptology.tv\n\n&quot;Artificially Intelligent CCTV could prevent crimes before they happen&quot; by Richard Alleyne (telegraph.co.uk) - Sept. 23, 2009.\n\n&quot;Mothers are banned from looking after each other's children&quot; by Sarah Harris (dailymail.co.uk) - Sept. 26, 2009.\n\n&quot;Cash-strapped sell their kidneys to pay off debts&quot; by Sarah-Kate Templeton (timesonline.co.uk) - Sept. 27, 2009.\n\n\nSept. 30, 2009\n\nHumanity -- Progress Means Less:\n&quot;The Architects of the Route of Progress\nWish to Reduce Population to 2 Million or Less,\nReplacing the Slaves with Better Breeds,\nThrough Cloning and Splicing to Best Serve Their Needs,\nFrom the Mass Propaganda We're Living Through,\nAll They Need is the Co-operation of You,\nTo Accept You're Inferior, Not Much Contribution\nTo Society, So Please Accept Final Solution,\nDon't be a Spoilsport, Let Mankind Progress,\nSame Old Eugenics is My Better Guess,\nOver Methods Employed They Bicker and Wheedle,\nLord Bertrand Russell said 'We'll Use the Needle' &quot;\n\n&quot;Progress&quot;, Science and Behaviour Alteration - Survival of the Fittest, U.S. Eugenics Movement, Sterilization of &quot;Feeble Minded&quot; - Academia, Club of Rome: Man is Enemy of Planet - NASA's Hole in Ozone Layer - Global Freezing and Warming, Climate Change (Weather) - Monsanto's Patents (Ownership) of Genes - Immigration into Cities, Prince Philip: &quot;Too Many People&quot; - &quot;Nationalist&quot; Wars and Financing of - Carroll Quigley, CFR-RIIA, Rhodes-Milner Group - Power in hands of Technocrats, Parallel Govt.. Bogus &quot;Democracy&quot; - UN Treaties and Laws - King of the World - Gore Vidal, Made-Up War on Terror and WMDs, Media Liars - Being Awake and Not Brainwashed to &quot;Fit in&quot;. H1N1 / Swine Flu / Common Flu Shots and Contradictions - Tamiflu Drug - Flu Inoculation Plans for Canada - Flu Outbreaks from Old Folks' Homes (after Vaccination). World Split into UN Regions, Human Habitat Areas, Animal Corridors, Rewilding Projects - Stopping Development. Control of Farming and Food Supply by Agri-Business, Genetically Modified Crops. Aleister Crowley, Phallus Worship, Washington Monument. \n***Dialogue Copyrighted Alan Watt - Sept. 30, 2009 (Exempting Music, Literary Quotes, and Callers' Comments)\n\nTopics of show covered in following links:\n\n&quot;Gore Vidal: 'We'll have a dictatorship soon in the US' &quot; (timesonline.co.uk) - Sept. 30, 2009.\n\n&quot;B.C. to limit seasonal flu vaccines&quot; by Jonathan Fowlie (calgaryherald.com) - Sept. 28, 2009.\n\n&quot;Flu shot plans vary across Canada&quot; (cbc.ca) - Sept. 25, 2009.\n\n&quot;UK to get 'motorways for animals' &quot; by Rachel Shields (independent.co.uk) - Sept. 27, 2009.\n\nGMWatch (gmwatch.org).\n\n&quot;Patents, Climate Change and African Agriculture: Dire Predictions&quot; (biosafetyafrica.org.za).\n\nÃ¢â‚¬Â¢ PDF of Above\n &lt;a href=&quot;\nhttp://truthnews.info&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://truthnews.info&lt;/a&gt;\n88.7 FM Olympia, WA (west side)\n-))&gt;&gt;&gt;sig_garrett&lt;&lt;&lt;((-\n\n\n","torrent":{"xt":"urn:btih:a60baee1ee0053a298421be7f9f15e7b6f88775d","amp;dn":"Alan.Watt.2009.08.September.Mega.Pack2-sig_garrett","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a60baee1ee0053a298421be7f9f15e7b6f88775d","infoHashBuffer":{"type":"Buffer","data":[166,11,174,225,238,0,83,162,152,66,27,231,249,241,94,123,111,136,119,93]},"announce":[],"urlList":[]}}