{"title":"U2 - I'll Go Crazy If I Don't Go Crazy Tonight","uid":5084042,"size":150030340,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a635cf853727392023597ec8efceb83902af4d4a&amp;dn=U2+-+I%5C%27ll+Go+Crazy+If+I+Don%5C%27t+Go+Crazy+Tonight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1252578098,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nThis video is the David O'Reilly animated video.\n\n\n&quot;I'll Go Crazy If I Don't Go Crazy Tonight&quot; is a song by Irish rock band U2 and the fifth track from their 2009 album No Line on the Horizon. It was released as the album's third single in a digital format on 25 August 2009, with a physical version released on 7 September 2009. Two music videos were made, one directed by David O'Reilly, and one by Alex Courtes.\n\nThe first music video received its world premiere on 17 July 2009 through U2'schannel. Directed by David O'Reilly and designed by Jon Klassen, it is the band's first animated music video since 1995's &quot;Hold Me, Thrill Me, Kiss Me, Kill Me&quot;, and is one of the few not to feature the band. It depicts several people in a city undergoing hardships, and the events that interconnect them and bring them happiness as they decide to make changes in their lives. The video was entered in the 2009 Ottawa International Animation Festival.\n\nThe second music video was directed by Alex Courtes and produced by Malachy Mcanenny. While the O'Reilly video plays over the studio version of the song, the Courtes version is the single edit. It consists of a live performance taken from the U2 360Ã‚Â° Tour, filmed at Camp Nou in Barcelona, Spain, on 2 July 2009.\n\n\nDavid O'Reilly animated video\n\nA runaway young boy is sitting on a train and gets a call on his cellphone from his mother, a nurse. He ignores it and she is left crying in the hospital. Meanwhile, a girl from a broken home is packing her possessions in a few bags as she also prepares to run away, while a homeless man outside the train station tries to seek shelter as it begins to rain. The nurse leaves the hospital and a young girl is shown photocopying flyers for a lost dog and plastering them over adverts for an upcoming U2 concert. Her dog encounters the homeless man who devises a &quot;tramp dog&quot; routine in an attempt to make some money, with little success.\n\nThe runaway girl is walking against the wind and rain with no protection when the nurse pulls over and offers her a lift, examining some minor injuries on her face as she does so. The girl falls asleep in the car, and the nurse is reminded of her son, who has encountered the homeless man and the lost dog on the train. Picturing himself in that condition he runs out of the train in an attempt to find his mother, leaving his bag behind. While the man discovers the contents of the bag, the dog goes after the boy and runs into the girl with the flyers, who is delighted to have found her pet again. The boy continues on his way and runs past a cafÃƒÂ©; he is spotted by his mother and the runaway girl, who were sitting inside. His mother runs to the door and calls out to him, causing him to come to a halt and turn to look at her. The video concludes with scenes of each character and showing the relief and happiness they have all found. The runaway girl has found warmth and shelter from the rain, the girl with the flyers has found her lost dog, the homeless man has food, and the boy and his mother have each other.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a635cf853727392023597ec8efceb83902af4d4a","amp;dn":"U2+-+I%5C%27ll+Go+Crazy+If+I+Don%5C%27t+Go+Crazy+Tonight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a635cf853727392023597ec8efceb83902af4d4a","infoHashBuffer":{"type":"Buffer","data":[166,53,207,133,55,39,57,32,35,89,126,200,239,206,184,57,2,175,77,74]},"announce":[],"urlList":[]}}