{"title":"MP3Resizer 1.8.3 Portable","uid":5049178,"size":3418177,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a6436cee04608f40c64fa956f96ea720255505cc&amp;dn=MP3Resizer+1.8.3+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NoExcuses","files":3,"time":1249814249,"description":"MP3Resizer 1.8.3 made Portable (Thinstalled).\n\nNo need to install it!\nOr, if you want to, Setup and Crack are included.\n\nMP3Resizer is designed to optimize the capacity of your portable music player by reducing the size of MP3 files.\nThis is especially useful when listening to MP3 files or MP3 Audio books on a mobile phone, MP3 player, Pocket PC, etc.\n\nPortable MP3 players don't usually have much memory, and of course, it's a shame to waste precious megabytes.\nIt's hard to refuse temptation to upload more music than possible.\n\nFor example, a 5-minute 256kbit MP3 file will occupy approximately 9.15Mb. By recompressing this file to 80kbit, the file size is dramatically reduced to 2.86Mb.\n\nThe output file size is more than three times smaller than the source file size!\nUsing MP3\nResizer, you can upload three times more music to your MP3 player than before.\n\nPlease note, the reduction in size is achieved by recompressing the file with a lower bit rate. This may cause a slight degradation in audio quality.\nThis application uses Lame, a high quality MP3 codec. A minimum bitrate of 64kbps is recommended for music playback on a mobile phone's MP3 player. The best and most commonly used MP3 formats for Audio Books are as follows: Mono, 8/16/24 kbps.\n\nMP3Resizer is designed to work with Windows 2000/XP/2003/Vista.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.skyshape.com/mp3resizer.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.skyshape.com/mp3resizer.html&lt;/a&gt;\n\n\n\nThis has been built up on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=34&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=34&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:a6436cee04608f40c64fa956f96ea720255505cc","amp;dn":"MP3Resizer+1.8.3+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6436cee04608f40c64fa956f96ea720255505cc","infoHashBuffer":{"type":"Buffer","data":[166,67,108,238,4,96,143,64,198,79,169,86,249,110,167,32,37,85,5,204]},"announce":[],"urlList":[]}}