{"title":"Fallout Collection DVD (XP/Vista)","uid":5056817,"size":3718905856,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a71ab69ef4a363e5cca7719e359bae8fb04e799b&amp;dn=Fallout+Collection+DVD+%28XP%2FVista%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SK234269","files":1,"time":1250465215,"description":"Here's a wonderful gem I purchased about two years ago.  It contains all three of the Fallout games from our dearly departed Black Isle Studios.  This indludes:\n\nFallout\nFallout 2\nFallout Tactics (Brotherhood of Steel)\n\nThe DVD came completely DRM free, and this is a pure ISO of it.  I know I'm not known in the TPB community as a software uploader, but if there's a virus it came with the disc, and would encourage you to do a scan just in case (of course).\n\nOne thing of note about the installation of these games: The autorun appears to be completely *useless*.  Instead, just explore the disc, go to the individual folders, and install them that way.\n\nAlso: FO1 and FO2 should work completely without the disc if you do a full install.  If you run FO3, however, it will expect the disc to be in the drive.  I should note, however, that I just tested an install of FO3 from a mount of this ISO, and it appears to recognize that as the &quot;disc&quot; it needs.\n\nPlease seed this fairly large file for everyone else who wants to see these games.  Fallout 3 was a terrific game, but it lacked the depth and character of the originals, and a lot of the young folk are hearing this.  This is our way to spread the word.","torrent":{"xt":"urn:btih:a71ab69ef4a363e5cca7719e359bae8fb04e799b","amp;dn":"Fallout+Collection+DVD+%28XP%2FVista%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a71ab69ef4a363e5cca7719e359bae8fb04e799b","infoHashBuffer":{"type":"Buffer","data":[167,26,182,158,244,163,99,229,204,167,113,158,53,155,174,143,176,78,121,155]},"announce":[],"urlList":[]}}