{"title":"Styx - Miss America  (Xvid-2nafish)","uid":5049493,"size":107917006,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a7715004b969878b2e7b6fdac69d93cd0e1fd837&amp;dn=Styx+-+Miss+America++%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1249900221,"description":"Source: TV\n\nFile Info:\n\nValid : Yes [AVI]\nDuration : 00:05:31\n\n[Video]\nResolution : 640x480\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 1070 Kbps\nQuality Factor : 0.12 b/px\n\n[Audio]\nCodec : Microsoft PCM Format\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 1536 Kbps\n\n\nStyx - Greatest Hits is a compilation album by the American rock band Styx. It was released by A&amp;M Records on August 22, 1995.\n\nThis album essentially replaced Styx's previous greatest hits album, Styx - Classics, Volume 15, which was released by A&amp;M in 1987. That previous album had excluded the hit song &quot;Lady&quot; because the song was originally recorded for and released through Wooden Nickel Records (which also had a distribution arrangement with RCA Records). Because A&amp;M/Polygram had been unable to secure distribution rights to the song, most of the classic lineup of Styx (Dennis DeYoung, Tommy Shaw, Chuck Panozzo, and James &quot;J.Y.&quot; Young) reunited to re-record the track at Dennis' home studio, The White Room. They were joined by uncredited session drummer Todd Suchermann, who filled in for John Panozzo due to Panozzo's failing health. The track, which is very similar to the original, was titled &quot;Lady '95&quot;.\n\nWith the exception of &quot;Lady '95&quot;, Styx - Greatest Hits features the original album versions of all the other songs included in the compilation. &quot;Come Sail Away&quot; is presented here in its full 6:05 version and &quot;Miss America&quot; is here in its original studio version (despite the CD's packaging showing incorrect time listings for both tracks).\n\nThe Grand Illusion is the seventh studio album by Styx, released in 1977. It became the band's first Triple Platinum album, and spawned the Top 10 hit &quot;Come Sail Away&quot; and the Top 30 hit &quot;Fooling Yourself&quot;.\n\nThe album was the subject of an episode of the US radio show In the Studio with Redbeard featuring interviews with several band members. According to lead singer Dennis DeYoung, the album's theme was the struggle to overcome self-deluding superficiality in order to affirm one's genuine value. This theme was reflected in the lyrics of the album's title track:\n\n    so if you think your life is complete confusion\n    'cause your neighbor's got it made\n    just remember that it's a grand illusion\n    and deep inside we're all the same\n\nDeYoung also revealed that the title of The Grand Illusion had been considered dating back to the 1975 album Equinox.\n\nThe track &quot;Miss America&quot; was guitarist James Young's scathing attack on the Miss America pageants. Young, in his interview on the In the Studio program, said the track came to him in the middle of the night and that its riff was inspired by the Jethro Tull song &quot;Minstrel in the Gallery&quot;.\n\n\nMy Videos: &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:a7715004b969878b2e7b6fdac69d93cd0e1fd837","amp;dn":"Styx+-+Miss+America++%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7715004b969878b2e7b6fdac69d93cd0e1fd837","infoHashBuffer":{"type":"Buffer","data":[167,113,80,4,185,105,135,139,46,123,111,218,198,157,147,205,14,31,216,55]},"announce":[],"urlList":[]}}