{"title":"Semantic Bundle","uid":5036755,"size":2252605,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a77831021794fb5fe70aa95d3d18646e14cb8aaf&amp;dn=Semantic+Bundle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wikidev","files":1,"time":1249158687,"description":"Release 20090730.\n\n\n\nSemantic Bundle is a pre-packaged bundle of extensions meant to be used on wikis based around the Semantic MediaWiki extension. It can be obtained either through SVN or by downloading a single .tgz or .zip file.\n\n\n\nContents\n----------------\n\nSemantic Bundle contains a large number of MediaWiki extensions; chief among them is, of course, Semantic MediaWiki, an extension that enables semantic storage and querying of data. Other SMW-based extensions included in this bundle are:\n\n    * Semantic Result Formats - defines many additional formats for SMW queries\n    * Semantic Forms - allows wiki administrators to create easy-to-use, domain-specific editing interfaces for their wiki\n    * Semantic Compound Queries - allows for displaying multiple queries at the same time\n    * Semantic Drilldown - defines an easy browsing tool for the data set\n    * Semantic Maps - allows for using various various map services to display semantic coordinate data and enter coordinates within forms\n    * Semantic Tasks - allows for sending reminder and notification emails to users for tasks\n\nThere are other extensions included in Semantic Bundle that, though they do not use Semantic MediaWiki directly, are often used in conjunction with SMW. These are:\n\n    * Admin Links - defines a special page that serves as a &quot;control panel&quot; for administrative tasks\n    * ArrayExtension - defines useful parser functions for manipulating arrays\n    * Data Transfer - allows importing data into and out of the wiki via XML and CSV formats\n    * External Data - allows for displaying data from outside APIs in the wiki\n    * Header Tabs - allows to convert top-level sections of the page into tabs; often used with Semantic Forms to make long forms more user-friendly\n    * Maps - allows for displaying individual points and geocoding addresses using various map services\n    * Page Object Model (POM) - a code library that helps extension and bot developers manipulate parts of structured wiki text easily using a model similar to W3C DOM. It is also MediaWiki API extension to perform such modifications remotely.\n    * ParserFunctions - adds useful parser functions for programming logic and string manipulation\n    * Replace Text - provides a form for administrators to do a text search-and-replace across the wiki\n    * Widgets - allows adding widgets to wiki by simply creating pages in the Widget namespace\n\nSemantic Bundle is not at all meant to be a comprehensive set of useful extensions, and there are many other extensions that are also quite useful, either in conjunction with SMW or in general, that were not included in the bundle, for technical or other reasons; we would encourage administrators setting up an SMW-based wiki to look at the wide variety of other extensions available. Some of these helpful extensions include CategoryTree, Configure, ConfirmEdit, FCKeditor, Halo, OpenID, reCAPTCHA, Semantic Signup and SemanticQueryFormTool.\n\n\n\nInitializing Semantic MediaWiki\n----------------\n\nTo initialize Semantic MediaWiki, open Special:SMWAdmin page on your wiki and click &quot;Initialize or upgrade tables&quot; button. This is enough to start using extensions in the bundle. For more information see installation and configuration sections for each extension.\n\n\n\nBenefits\n----------------\n\nSemantic Bundle provides a number of important benefits over downloading and installing individual extensions; among them:\n\n    * it provides a &quot;best practices&quot; set of extensions around Semantic MediaWiki, based on user experiences\n    * it simplifies download, especially for those systems that don't have SVN, and especially for those extensions (like ParserFunctions) that don't have a downloadable version already\n    * it tries to guarantee working code by using tagged, stable versions of extensions whenever possible\n    * it simplifies installation by providing a pre-generated list of includes\n\n\n\nAuthors\n----------------\n\nSemantic Bundle was created, and is maintained, by Sergey Chernyshev and Yaron Koren.\n\n\n\n\nMore MediaWiki related downloads can be found @ http://thepiratebay.se/user/wikidev","torrent":{"xt":"urn:btih:a77831021794fb5fe70aa95d3d18646e14cb8aaf","amp;dn":"Semantic+Bundle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a77831021794fb5fe70aa95d3d18646e14cb8aaf","infoHashBuffer":{"type":"Buffer","data":[167,120,49,2,23,148,251,95,231,10,169,93,61,24,100,110,20,203,138,175]},"announce":[],"urlList":[]}}