{"title":"Tropic.Thunder.(2008)Dvdrip(C/Sub)-Gozita","uid":5063799,"size":735866625,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a78df87fa55bcfd708544522e1716bc9bb5042e9&amp;dn=Tropic.Thunder.%282008%29Dvdrip%28C%2FSub%29-Gozita&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Gozita","files":2,"time":1250836771,"description":"Tropic Thunder (en EspaÃƒÂ±a: Tropic Thunder, una guerra muy perra / en Latinoamerica: Una guerra de PelÃƒÂ­cula) es una pelÃƒÂ­cula de comedia que parodia el cine de acciÃƒÂ³n. Es una producciÃƒÂ³n de Hollywood filmada en 2008, dirigida por Ben Stiller y escrita por Ben Stiller, Justin Theroux y Etan Cohen.\n\nLa pelÃƒÂ­cula es protagonizada por Ben Stiller, Jack Black y Robert Downey Jr., quienes encarnan a un grupo de actores en declive que filman una pelÃƒÂ­cula sobre la Guerra de Vietnam. El director y escritor de la pelÃƒÂ­cula deciden abandonarlos en la mitad de la selva, obligÃƒÂ¡ndolos a escapar de ahÃƒÂ­ por sus propios medios.\n\nBen Stiller inicialmente tomÃƒÂ³ la idea despuÃƒÂ©s de protagonizar un pequeÃƒÂ±o papel en la cinta El imperio del sol, y luego pidiÃƒÂ³ ayuda a Justin Theroux y Etan Cohen para completar el libreto. DespuÃƒÂ©s de ser aprobada en el 2006, la pelÃƒÂ­cula fue filmada en el 2007, en la isla de Kauai (Hawaii) durante 13 semanas, la producciÃƒÂ³n de cine mÃƒÂ¡s grande que se ha hecho en la isla. La pelÃƒÂ­cula ha tenido un largo despliegue de publicidad, incluyendo numerosas pruebas en los cines, la venta de la bebida energÃƒÂ©tica ficticia que se hace en la pelÃƒÂ­cula, la publicaciÃƒÂ³n de websites ficticios de los personajes de la pelÃƒÂ­cula, supuestas pelÃƒÂ­culas que protagonizan los personajes y productos con el nombre de Tropic Thunder.\n\nLa cinta causÃƒÂ³ controversia entre algunas comunidades de discapacitados y grupos de apoyo a estos antes de que saliera al mercado, el 13 de agosto de 2008. En general, recibiÃƒÂ³ criticas positivas con entre 84% y 71% de aprobaciÃƒÂ³n de acuerdo a las pÃƒÂ¡ginas de internet Rotten Tomatoes y Metacritic, (respectÃƒÂ­vamente).\n\nLogrÃƒÂ³ recaudar 26 millones de dÃƒÂ³lares en su estreno de fin de semana.\n\nSubtitulos en EspaÃƒÂ±ol Latino\n\nBy Gozita","torrent":{"xt":"urn:btih:a78df87fa55bcfd708544522e1716bc9bb5042e9","amp;dn":"Tropic.Thunder.%282008%29Dvdrip%28C%2FSub%29-Gozita","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a78df87fa55bcfd708544522e1716bc9bb5042e9","infoHashBuffer":{"type":"Buffer","data":[167,141,248,127,165,91,207,215,8,84,69,34,225,113,107,201,187,80,66,233]},"announce":[],"urlList":[]}}