{"title":"2Bobule","uid":5580769,"size":695521614,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a7b8bd5cad2f75bccfe22b4b65ff08ad02e98ac0&amp;dn=2Bobule&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vanoleo","files":-1,"time":1274529393,"description":"2Bobule are loose sequel to the comedy berry seen in theaters over 360 000 people and has become one of the most successful films of 2008. \nAgain, we observe the escapades of two friends Joe (Christopher Hadek) and George (Lukas Langmajer). George to be involved with a young beautiful girl whose father (George Krampol) has, however, the suitors of his daughter completely different ... George and prefer to flee a friend Honza South Moravia. John has lived with Klara (Teresa VoÃ…â„¢ÃƒÂ­Ã…Â¡kovÃƒÂ¡) at his grandfather's winery, and winemaker, as a beginner is embarking on the high art of straw wine. Not only that, faced with failure, but the unexpected arrival of his companion George lives turned upside down. Jirka weakness for women is literally degenerated into a struggle for life. \n\nContinuation of poetic comedy environment of South Moravian vineyards and enrich the new characters and new actors' faces at the head of Korn, George and Jane Krampol Ã…Â vandovo. For Lubomir Leipzig, who again played by the role of grandfather, mean 2Bobule film role number 100! Wrote the screenplay for the film, the talented creator John Holecek, who participated including the screenplay for the film and the popular sitcom RafÃ…Â¥ÃƒÂ¡ci Nova TV comeback. Directed by movie director took the promising Russian Vlad Lanna, whose film Happy End has won many film awards. (The official text of the distributor","torrent":{"xt":"urn:btih:a7b8bd5cad2f75bccfe22b4b65ff08ad02e98ac0","amp;dn":"2Bobule","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7b8bd5cad2f75bccfe22b4b65ff08ad02e98ac0","infoHashBuffer":{"type":"Buffer","data":[167,184,189,92,173,47,117,188,207,226,43,75,101,255,8,173,2,233,138,192]},"announce":[],"urlList":[]}}