{"title":"020-Coast to Coast-Ian Punett-Frank Meeink-9 May 10.m4a","uid":5670030,"size":131583841,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a7f5e9f5a1d95b7d1f0483f90aecb2a835edd4ed&amp;dn=020-Coast+to+Coast-Ian+Punett-Frank+Meeink-9+May+10.m4a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"panzerfaust69","files":1,"time":1278307104,"description":"Reflections of an Ex-Neo Nazi\nDate:05-08-10\n\nHost:Ian Punnett\n\nGuests:Frank Meeink\n\nIan Punnett was joined by former Skinhead and drug addict Frank Meeink, who shared the story of his descent into America's Nazi underground and his ultimate triumph over hatred and addiction. He recalled being recruited into the white supremacist movement when he was an angry thirteen-year-old from a broken home, abusing alcohol and having dropped out of school. Meeink gravitated towards the Skinheads after they befriended him and took an interest in his life, which was a stark contrast to the way his family treated him. Sadly, he would later use these same tactics to recruit other disillusioned youths into the Neo Nazi culture.\n\nRecounting his days as a member of a Skinhead gang, Meeink explained that &quot;violence was a constant part of our camaraderie.&quot; The targets of this violence, he noted, had less to do with their ethnicity and more because they were seen as outsiders by the gang. &quot;We honestly felt we had the right to do it to anyone that wasn't us,&quot; Meeink said. His life of violence culminated when he administered a brutal beating to a peripheral member of his group. Refusing to let his victim leave the apartment where he was being held, Meeink and his cohorts tortured the man for hours and even videotaped the ordeal as a means of humiliation and for future recruiting efforts. Arrested, tried, and convicted of the crime, Meeink was sentenced to three years in prison at the age of seventeen.\n\nOnce in prison, Meeink's perspective began to change after he was invited to join a Bible Study group led by African American inmates. Meanwhile, he also befriended fellow prisoners, of various cultural backgrounds, who were his age and shared similar life problems such as having a child on the way. After leaving prison, Meeink returned to his Skinhead gang, but began to see the hypocrisy of their ways when a visiting gang member besmirched Italians and none of the Italian gang members stood up to his epithets. Soon thereafter, a Jewish business owner gave Meeink a job and befriended him, despite his anti-Semitic tattoos and Neo Nazi past. Looking back on the series of events and relationships that led him to turn his back of his life of hatred and violence, Meeink observed, &quot;God, of a sorts, came into my life and kept putting people into my life to prove me wrong.&quot;\nWebsite(s):\n# frankmeeink.com\nBook(s):\n# Autobiography of a Recovering Skinhead\n","torrent":{"xt":"urn:btih:a7f5e9f5a1d95b7d1f0483f90aecb2a835edd4ed","amp;dn":"020-Coast+to+Coast-Ian+Punett-Frank+Meeink-9+May+10.m4a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7f5e9f5a1d95b7d1f0483f90aecb2a835edd4ed","infoHashBuffer":{"type":"Buffer","data":[167,245,233,245,161,217,91,125,31,4,131,249,10,236,178,168,53,237,212,237]},"announce":[],"urlList":[]}}