{"title":"The Spaghetti Western Collection","uid":5116909,"size":13610426368,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a88b88043e75b1cefab03a48e6092a245e2d5749&amp;dn=The+Spaghetti+Western+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sozae","files":-1,"time":1255109673,"description":"A Fistful of Dollars\n\nA drifter gunman arrives in the Mexican village of San Miguel at the border of United States of America, and befriends the owner of the local bar Silvanito. The stranger discovers that the town is dominated by two gangster lords: John Baxter and the cruel RamÃƒÂ³n Rojo. When the stranger kills four men of the Baxter's gang, he is hired by RamÃƒÂ³n's brother Esteban Rojo to join their gang. However, the stranger decides to work for both sides, playing one side off against the other\n\nThe Good, the Bad and the Ugly\n\nBlondie (The Good) is a professional gunslinger who is out trying to earn a few dollars. Angel Eyes (The Bad) is a hit man who always commits to a task and sees it through, as long as he is payed to do so. And Tuco (The Ugly) is a wanted outlaw trying to take care of his own hide. Tuco and Blondie share a partnership together making money off Tuco's bounty, but when Blondie unties the partnership, Tuco tries to hunt down Blondie. When Blondie and Tuco comes across a horse carriage loaded with dead bodies, they soon learn from the only survivor (Bill Carson) that he and a few other men have buried a stash of gold in a cemetery. Unfortunately Carson dies and Tuco only finds out the name of the cemetery, while Blondie finds out the name on the grave. Now the two must keep each other alive in order to find the gold. Angel Eyes (who had been looking for Bill Carson) discovers that Tuco and Blondie meet with Carson and knows they know the location of the gold. All he needs is for the two to lead him to it. Now The Good, The Bad and The Ugly must all battle it out to get their hands on $200,000 worth of gold\n\nFor A Few Dollars More\n\nMonco is a bounty killer chasing El Indio and his gang. During his hunting, he meets Col. Douglas Mortimer, another bounty killer, and they decide to make a partnership, chase the bad guys together and split the reward. During their enterprise, there will be lots of bullets and funny situations. In the end, one of the bounty hunters shows the real intention of his hunting\n\nI have just ripped the collection to write to dvd for better viewing\n\nSOZAE\n\n\n","torrent":{"xt":"urn:btih:a88b88043e75b1cefab03a48e6092a245e2d5749","amp;dn":"The+Spaghetti+Western+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a88b88043e75b1cefab03a48e6092a245e2d5749","infoHashBuffer":{"type":"Buffer","data":[168,139,136,4,62,117,177,206,250,176,58,72,230,9,42,36,94,45,87,73]},"announce":[],"urlList":[]}}