{"title":"Against Me! - I Was A Teenage Anarchist (2nafish)","uid":5670192,"size":113377284,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:aba5b46333fa7cf36307947787a78aebe66338e7&amp;dn=Against+Me%21+-+I+Was+A+Teenage+Anarchist+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1278312716,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;I Was a Teenage Anarchist&quot; is a song by the Gainesville, Florida-based punk rock band Against Me!, released as the first single from their 2010 album White Crosses. The single was released as a four-track digital download through various online music stores on April 6, 2010, including the additional album track &quot;Rapid Decompression&quot; and two B-sides from the album's sessions, &quot;One by One&quot; and &quot;Bitter Divisions&quot;. A 7&quot; single is scheduled for release April 17 in conjunction with Record Store Day, with an acoustic version of &quot;I Was a Teenage Anarchist&quot; as the B-side.\n\nWhite Crosses is Against Me!'s fifth studio album, and their second to be released on Sire Records. As with its predecessor, 2007's New Wave, the album was produced by Butch Vig. It is also the first Against Me! album to feature George Rebelo, former drummer of Hot Water Music, following the departure of previous drummer Warren Oakes.\n\nRecording began in August 2009, finishing two months later. The mixing and mastering of the album finished in February 2010. It is to be released June 7 or June 8, 2010. The initial pressing of the record will include four bonus tracks.\n\nThe album leaked March 12, 2010, a full three months before its release date, to which Tom Gabel responsed on his blog that it was simply &quot;no drama&quot;, and what was followed by lyrics for all the songs.\n\nA four track digital EP for &quot;I Was A Teenage Anarchist&quot; was released as the first single from the album, on April 20, 2010. \n\nWhite Crosses is one of Billboard's top picks for 2010.\n\nOn March 17, their first video from the album, &quot;Rapid Decompression,&quot; was released online via AOL.\n\nAgainst Me! is a punk rock band formed in 1997 in Gainesville, Florida. Their first full-length album, released on No Idea Records in 2002, is Reinventing Axl Rose. They have previously released music on Misanthrope Records, Crasshole Records, Plan It X Records, Sabot Productions, No Idea Records, and Fat Wreck Chords. In December 2005, they signed with Sire Records, and released their major label debut, New Wave, on July 10, 2007. Their second album since signing to Sire Records, White Crosses, was released on June 4, 2010.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:aba5b46333fa7cf36307947787a78aebe66338e7","amp;dn":"Against+Me%21+-+I+Was+A+Teenage+Anarchist+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aba5b46333fa7cf36307947787a78aebe66338e7","infoHashBuffer":{"type":"Buffer","data":[171,165,180,99,51,250,124,243,99,7,148,119,135,167,138,235,230,99,56,231]},"announce":[],"urlList":[]}}