{"title":"Faith No More - Midlife Crisis","uid":5088317,"size":136441860,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ac0276058f96c3d672017106b2ca3ffe0c47ab1f&amp;dn=Faith+No+More+-+Midlife+Crisis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1252908029,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Midlife Crisis&quot; is the third track and first single from Angel Dust, the fourth studio album by alternative metal band Faith No More. It was released on May 26, 1992, and became their sole #1 hit on the Modern Rock Tracks chart.\n\nThe video for this song was directed by Kevin Kerslake, who also directed their shoestring video for the song &quot;Everything's Ruined&quot;. The version on the Who Cares a Lot?: Greatest Videos collection features the uncensored version that contains some shots omitted from pre-watershed broadcasts of the video. Most noticeably during the bridge which shows a man being stretched by four horses (alluding to an old French punishment for regicide, known as &quot;quartering&quot;) - the censored version features additional shots of choirboys running to a big cross instead.\n\nFor the video, the sound mix of this song is slightly different than the album version (on certain promotional releases it is referred to as 'The Scream Mix'). For the DVD re-release of Who Cares a Lot?: Greatest Videos, the album version of the song is used instead, with the accommodating edits made.\n\nAngel Dust is the fourth studio album by American rock band Faith No More, first released through Slash on June 8, 1992 in Europe and the United States. It's the follow-up to 1989's highly successful The Real Thing, as well as the final studio album with long time guitarist &quot;Big&quot; Jim Martin and the second to feature Mike Patton on vocals; it is, however, the first album in which Patton had an influence on the band's sound, as Patton hadn't previously had input on the musical composition of the albums predecessor, The Real Thing, as it had all been composed and recorded prior to his joining.\n\nIt remains as Faith No More's highest-selling album outside the United States (where, as of July 2007, it has sold 664,000 copies). The album and subsequent tour were very successful in Europe where it went Platinum for sales of more than 1 million copies and Gold in Australia for selling more than 35,000 copies. Worldwide sales are around 3 million copies.\n\n\nI believe this is the uncensored version because it shows the man being stretched by four horses.\n\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ac0276058f96c3d672017106b2ca3ffe0c47ab1f","amp;dn":"Faith+No+More+-+Midlife+Crisis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac0276058f96c3d672017106b2ca3ffe0c47ab1f","infoHashBuffer":{"type":"Buffer","data":[172,2,118,5,143,150,195,214,114,1,113,6,178,202,63,254,12,71,171,31]},"announce":[],"urlList":[]}}