{"title":"Kiss - Thrills In The Night","uid":5076227,"size":158117892,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ac2899a1dffce2542d77f942829f3811a00e7040&amp;dn=Kiss+-+Thrills+In+The+Night&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1251861516,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Thrills in the Night&quot; is a song by the American hard rock band Kiss featured on their 1984 album Animalize, and released as a single in 1985. The song was written by Kiss guitarist/vocalist Paul Stanley and ex-Plasmatics bassist Jean Beauvoir.\n\nTwo videos were made to promote the song, but only one was commercially released which featured the band playing in front of a live audience. The video would be the first with Kiss guitarist Bruce Kulick, who replaced the departed Mark St. John earlier in 1984.\n\nThe song is about a woman who works a 9 to 5 job in an ordinary &quot;professional&quot; work environment, and also works as a high class prostitute at night, and speaks of the irony in that no one that knows her from her day life could possibly be aware of what she does at night.\n\nAnimalize is an album by the American hard rock/heavy metal band Kiss. In a continuation of the commercial resurgence begun with Lick It Up, Animalize was certified platinum by the RIAA on December 12, 1984. It was the highest-selling Kiss album since 1977's Alive II.\n\nThe album marked the only appearance by lead guitarist Mark St. John, who replaced Vinnie Vincent in April 1984. St. John would be forced to leave Kiss during the subsequent tour after being diagnosed with Reiter's Syndrome. By November 1984 he was out of the band; the third lead guitarist to exit the band in two years.\n\nWhen asked what 'Animalize' meant, Stanley said that people were starting to become more like computers - and that &quot;making music by pressing buttons&quot; was no fun.\n\nMark St. John (aka Mark Norton) has stated that when recording this record, he had utilized his Rockman gear, and that heavy equalization was used to take the &quot;Boston&quot; sound out of the recording.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:ac2899a1dffce2542d77f942829f3811a00e7040","amp;dn":"Kiss+-+Thrills+In+The+Night","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac2899a1dffce2542d77f942829f3811a00e7040","infoHashBuffer":{"type":"Buffer","data":[172,40,153,161,223,252,226,84,45,119,249,66,130,159,56,17,160,14,112,64]},"announce":[],"urlList":[]}}