{"title":"Radio Encubierta-Dvdrip-[Condd.com]-[CineTT.com]","uid":5098838,"size":1458141639,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ada2d6353297231a90c5d6420edcace4651d6dcc&amp;dn=Radio+Encubierta-Dvdrip-%5BCondd.com%5D-%5BCineTT.com%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ESPACONSOLAS","files":1,"time":1253802840,"description":"En 1966, sin duda alguna la epoca del mejor pop ingles, la BBC solo emitia dos horas de rock and roll a la semana. Pero la radio pirata inundaba el pais con rock y pop 24 horas al dia. Y 25 millones de personas, mas de la mitad de la poblacion, escuchaba cada dia a los piratas. Carl (Tom Sturridge) acaba de ser expulsado del colegio, y su madre, miembro de la jet set, decide que para encauzarle en la vida, lo mejor sera que pase algun tiempo con su padrino Quentin (Bill Nighy). Pero da la casualidad de que Quentin es el jefe de Radio Rock, una emisora pirata instalada en un barco en el mar del Norte, poblado por un eclectico grupo de pinchadiscos encabezado por El Conde(Philip Seymour Hoffman), un corpulento bocazas estadounidense, autentico dios de las ondas enamorado de la musica. Sus compaÃƒÂ±eros se unen para ayudar a Carl a encontrarse a si mismo y, sobre todo, para que encuentre a alguien con quien acostarse. Pero las emisoras encubiertas han llamado la atencion del gobierno, que decide ir a por los drogadictos, ilegales y fornicadores que solo quieren acabar con el pais que antaÃƒÂ±o fue una gran nacion. En una epoca en la que el poder ahoga cualquier cosa que se asemeje a la exuberancia juvenil, la radio pirata se convierte en el enemigo publico numero 1. Al parecer, el explosivo movimiento roquero quebranta el Acta de Infracciones Marinas, una buena excusa para acabar con su nefasta influencia. Por parte del gobierno, lidera la batalla el temible ministro Dormandy (Kenneth Branagh) acompaÃƒÂ±ado por su ayudante, Dominic Twatt, y su secretaria, la Srta. Clitt. Perseguido por los navios del gobierno, el barco de Radio Encubierta choca contra una roca y empieza a hundirse en medio del mar del Norte ante la indiferencia de los politicos. Los seguidores de la emisora, consternados, se echan a la mar a medianoche en pequeÃƒÂ±as embarcaciones para rescatar a sus locutores favoritos de una muerte segura.\nRadio encubierta \n\n &lt;a href=&quot;\nhttp://www.cinett.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cinett.com&lt;/a&gt;","torrent":{"xt":"urn:btih:ada2d6353297231a90c5d6420edcace4651d6dcc","amp;dn":"Radio+Encubierta-Dvdrip-%5BCondd.com%5D-%5BCineTT.com%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ada2d6353297231a90c5d6420edcace4651d6dcc","infoHashBuffer":{"type":"Buffer","data":[173,162,214,53,50,151,35,26,144,197,214,66,14,220,172,228,101,29,109,204]},"announce":[],"urlList":[]}}