{"title":"For The Faithful And The Infidels [Compilation  VA - 2009]","uid":5069830,"size":165433212,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:add10f6042804a070603cb4f2733ea107aafdadf&amp;dn=For+The+Faithful+And+The+Infidels+%5BCompilation++VA+-+2009%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"verifire","files":-1,"time":1251299426,"description":"Hi there..\n\nThen it finally happened. TPB's trackers are down. But I've been anticipating something like this for a while. So for those who'll want to download torrents I've made and will make in the future, I'm moving nearly all of them to another torrent-site, maybe two. I guess it'll be at least:\n &lt;a href=&quot;\nhttp://www.torrentbox.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentbox.com&lt;/a&gt;\n\nJust browse for the torrents on that site, and all uploads will come up, just give me some days.. :-)\n\nAnd you can still start your download from this site!! Just add these trackers to the torrent, and we'll find each other again.\n &lt;a href=&quot;\nhttp://tracker.publicbt.com:80/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.publicbt.com:80/announce&lt;/a&gt;\n &lt;a href=&quot;\nhttp://tracker.torrentbox.com:2710/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.torrentbox.com:2710/announce&lt;/a&gt;\n \nNow don't click on the &quot;links&quot; above, that won't work. Copy and paste them to add them to your trackers in the torrent-file.\n\nAnd be sure to enable DHT. It tracks too..\n  \nAnyway, they should also all be available by search on my alias, verifire, on for instance: &lt;a href=&quot;\nhttp://www.isoHunt.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.isoHunt.com&lt;/a&gt;\n \n- because they search the contents and comments on the upload for tags as well as the title of the torrent.. Just give me some time..\n\nSee you later, when things are settled and (maybe) there's a working tracker on the site again, and I'll miss it terribly, but I hope for, and guess this isn't the last word on the matter. I'll upload stuff here anyway, as well as on the other sites...\n\nTPB WILL ALWAYS RULE!! THANK YOU, GUYS. YOU'VE BEEN A PLEASURE TO BE SHIPWRECKED WITH. IT'S AN HONOUR...\n\nVerifire.\n\n____________________________________________________________________________\n\nI originally intended this to be just a message to those tampering with my listening port (but I found out that I'd make it a statement for everybody. Songs of freedom.. :-), and somebody is constantly, and I mean every two minutes or so at times, shuts my upload speed down, so I'm able to seed only at about 3-7 Kbps in total. Then I have to manually change port, and then it picks up again. Then they hunt me down and down she goes.. and so on and SO ON!! I get a break now and then, though.. A few hours.. A day.. Weekend.. :)\n\nI got really bored about this fact, and mighty frustrated. And I almost made an upload named &quot;Quit Jamming Me!&quot;, after a song in this compilation, written and performed by a man who had just been up against the whole &quot;Firm&quot;, in this case the record industry, refusing to make another album if they didn't give him back the publishing rights to his own music. He won... (And you can hear him tell about it in the documentary &quot;Running Down A Dream&quot;. Slight digression there.. sorry..:)\n\nNow back to the reason for this upload: If someone dislikes what I upload to the degree that they resort to methods like these, I REFUSE TO GIVE IN!!! I'll seed like there's no tomorrow!!!\nAnd besides: Now I KNOW for sure I must be doing something right, since it's that important to stop me.. :-)\n\nAllow me to quote the (in)famous pirate, Captain Edward Teach, known as &quot;Blackbeard&quot;. (I borrow this line from the BBC two-part series):\n\n&quot;First they want us to help them build Empire, and now they want to hang us?!! Shall we go along with that?&quot; Answer: &quot;NEEEEY!!!!! Arrrh...&quot; Or there about..\n\nTo the rest of you, I'd like to say thank you for your support and for helping me to shoulder the burden by seeding further the stuff I upload. Thank you very much.\nAs you might understand, though, the upload speed is a bit of a problem at first, but if enough of you just hang in there... It's suddenly alive!!!!!! :-)\n\nEven though some of the songs in this little compilation I've thrown together can't be called Christian songs, I like the sound of freedom that forces it's way out and up if you listen to them. Preferably loud.. Plus I've just seen the movie &quot;The Boat That Rocked&quot;, about pirate radio in England back in the 60's.. :-)\n\nThe songs are all normalized mp3's of high quality encoding, and sound good to me..\nI hope you like it!\n\nThanks for bearing with me..\n\nYours truly, in Christ, as always, Verifire.\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;f68093849f909f84939b979f9ab6919b979f9ad895999b&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:add10f6042804a070603cb4f2733ea107aafdadf","amp;dn":"For+The+Faithful+And+The+Infidels+%5BCompilation++VA+-+2009%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"add10f6042804a070603cb4f2733ea107aafdadf","infoHashBuffer":{"type":"Buffer","data":[173,209,15,96,66,128,74,7,6,3,203,79,39,51,234,16,122,175,218,223]},"announce":[],"urlList":[]}}