{"title":"Arlington Road(subs Eng Fr Ned)(2Lions-Team)","uid":5565064,"size":4682382747,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ae36fcdda9adf1c89481234545d092bb422c6c0c&amp;dn=Arlington+Road%28subs+Eng+Fr+Ned%29%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JUULTJE","files":-1,"time":1273955073,"description":"Arlington Road (1999) \n\nVerenigde Staten\nThriller\n117 minuten\n\ngeregisseerd door Mark Pellington\nmet Jeff Bridges, Tim Robbins en Joan Cusack\n\nMichael Faraday is een professor aan een universiteit. Zijn vrouw, FBI-agente, is een tijdje geleden om het leven gekomen bij een foute anti-terrorisme actie. Sindsdien is Michael geobsedeerd door terroristische groeperingen. Als hij nieuwe buren krijgt, lijken ze in het begin erg vriendelijk. Langzaam begint Michael echter te vermoeden dat er iets niet helemaal pluis is met de buurman, en begint in z'n verleden te graven.\n\nEngels\n\nMichael Faraday is a recently widowed college history professor living alone with his ten-year-old son Grant in the suburbs of Washington, DC. The death of Michael's wife Leah, an FBI agent killed in the line of duty, continues to haunt both father and son. Michael and Grant are soon befriended by the Langs, a vivacious, All-American family new to the neighborhood. The parents, Oliver and Cheryl Lang, go out of their way to draw Michael into their lives. Soon, Grant and young Brody Lang become inseparable friends. The Faradays' long period of mourning seems finally to be over. As the two families become closer, Michael begins to have misgivings about the gregarious Oliver. After catching Oliver in a few insignificant lies, the more Michael learns about Oliver, the more his uneasiness grows. With Grant spending more and more time at the Langs, Michael decides to check into the background of his neighbors. What he discovers deepens the mystery, arousing suspicions that shake Michael to the core of his existence. The Langs are definitely not who they claim to be; but who are they? Why have they come to Washington, DC?\n\nWeblink http://www.moviemeter.nl/film/216\nWeblink http://www.imdb.com/title/tt0137363/\n\n\nVideo                 : Retail DVD Rip\nAudio                 : AC 3  5.1 English French\nSubs                  : Englich French Dutch\nID                    : 224 (0xE0)\nFormat                : MPEG Video\nFormat version        : Version 2\nBit rate mode         : Variable\nWidth                 : 720 pixels\nHeight                : 576 pixels\nDisplay aspect ratio  : 4:3\nFrame rate            : 25.000 fps\nStandard              : PAL\nCover                 : Yes\n\n*****************************************\n\nBrought to you by Juultje\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                          &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\t\t\n\n\n\n","torrent":{"xt":"urn:btih:ae36fcdda9adf1c89481234545d092bb422c6c0c","amp;dn":"Arlington+Road%28subs+Eng+Fr+Ned%29%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae36fcdda9adf1c89481234545d092bb422c6c0c","infoHashBuffer":{"type":"Buffer","data":[174,54,252,221,169,173,241,200,148,129,35,69,69,208,146,187,66,44,108,12]},"announce":[],"urlList":[]}}