{"title":"To Live And Die In L.A.  (1985)  DVD-R  PAL","uid":5032373,"size":4680636416,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:aea54117ac160196cdd74506b0647997aec48175&amp;dn=To+Live+And+Die+In+L.A.++%281985%29++DVD-R++PAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Coolguy33","files":-1,"time":1248967340,"description":"To Live And Die In L.A. (1985)\n\n\n\nDirected by William Friedkin \nProduced by Irving H. Levin\nBud S. Smith \nWritten by Story:\nGerald Petievich\nScreenplay:\nWilliam Friedkin\nGerald Petievich \nStarring William L. Petersen\nWillem Dafoe\nJohn Pankow\nDean Stockwell\nJohn Turturro \nMusic by Wang Chung \nCinematography Robby MÃƒÂ¼ller \nDistributed by United Artists\nMetro-Goldwyn-Mayer \nRelease date(s) November 1, 1985 \nRunning time 116 minutes \nCountry United States \nLanguage English \n\n\n\nTo Live and Die in L.A. is an American thriller film directed by William Friedkin and based on the novel written by former Secret Service agent Gerald Petievich, who co-wrote the screenplay with Friedkin. The film features William L. Petersen, Willem Dafoe, John Turturro, John Pankow, among others. Wang Chung composed and performed the original music soundtrack. The film tells the story of the lengths to which two Secret Service agents go to arrest a counterfeiter.\n\nRichard Chance (Petersen) is a Secret Service agent for the U.S. Treasury with a reputation in the department for reckless behavior. His partner, Jimmy Hart (Michael Greene) is days away from retirement, but takes on one last mission to investigate counterfeiter Rick Masters (Dafoe). After Hart is killed by Masters' bodyguard, Chance is outraged and seeks revenge. Chance explains his outlook to his new partner, John Vukovich (Pankow) this way:\n\nLet me tell you something, amigo. I'm gonna bag Masters, and I don't give a shit how I do it. \nThe two T-men try to track down Masters, to no avail. Chance and Vukovich finally engage Masters by posing as potential counterfeiting clients interested in Masters' services.\n\nChance and Vukovich eventually break the law in their relentless pursuit of Masters. In order to get enough money to convince Masters that they are &quot;real&quot; clients, they kidnap and steal the money from a man who, unbeknownst to them, is an undercover F.B.I. agent. In a wild chase through the streets and freeways of Los Angeles, the F.B.I. agent is accidentally shot to death by his own men.\n\nLater, Chance once again meets with Masters, and pays him the &quot;front money&quot; that Masters has requested. The two agents go through with the transaction, even when Masters implies that he knows they stole the money from the F.B.I. undercover agent. During a set-up transaction, Chance tries to arrest Masters and his bodyguard, but the bodyguard pulls a shotgun from a locker and shoots Chance in the face, at the same time Chance shoots the bodyguard in the chest. They both die.\n\nMasters briefly gets away, but Vukovich gives chase, eventually locating Masters at a warehouse Masters uses to produce his counterfeit money. At the time of Vukovich's arrival, Masters has already set fire to the contents of the warehouse. Vukovich confronts Masters and during a brief struggle, Vukovich is knocked unconscious. Masters covers Vukovich with shredded paper and just before Masters lights Vukovich on fire, Vukovich recovers and shoots Masters, who then drops his lighter and lights himself ablaze in the process. Vukovich survives and Masters perishes in the blaze.\n\nAfter Masters' death, Masters' attorney gives his estate to his girlfriend, Bianca. Without showing much remorse, she rides away in Masters' black Ferrari with her new companion, a woman named Serena given to her as a present by Masters.\n\nIn the last scene, Vukovich pays Chance's informant, Ruth, a visit just as she's packing up to leave L.A. for good. He mentions Chance's death, that she had known that the man they stole the advance money from was FBI, and that Chance had left her with the leftover front money that his agency now wants back. All this leads to a surprise for Ruth: &quot;You're working for me now&quot;. And with that, Chance lives on through Vukovich.\n\n\n\n\nLanguage: English 5.1\n\nSubs:     English, French, Italian, Spanish, Dutch, Swedish, Finnish,\n          Norwegian, Portuguese, Greek, Slovenian, Croation\n\nAspect Ratio: 1.85:1\nWidescreen 16:9\nPAL\n\n \n","torrent":{"xt":"urn:btih:aea54117ac160196cdd74506b0647997aec48175","amp;dn":"To+Live+And+Die+In+L.A.++%281985%29++DVD-R++PAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aea54117ac160196cdd74506b0647997aec48175","infoHashBuffer":{"type":"Buffer","data":[174,165,65,23,172,22,1,150,205,215,69,6,176,100,121,151,174,196,129,117]},"announce":[],"urlList":[]}}