{"title":"Coast to Coast AM - Sep 11 2009 - Open Lines, Astrology &amp; Dreams","uid":5099873,"size":55359615,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:afa714d36bd68bc6e1211f06c76ebfea7fed1746&amp;dn=Coast+to+Coast+AM+-+Sep+11+2009+-+Open+Lines%2C+Astrology+%26+Dreams&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"0vercast","files":4,"time":1253888694,"description":"Open Lines, Astrology &amp; Dreams\n\nDate: 09-11-09\nHost: George Noory\nGuests: Open Lines, Mark Lerner, Kelly Sullivan-Walden\n\nDuring Open Lines, notorious repeat caller JC phoned in excited about the new national ban on flavored cigarettes. He said this was only the beginning, and alcohol and sweet drinks would be next. JC also told George that he was suffering with a bout of Swine Flu, given to him by God so that he could &quot;taste&quot; how America will soon be punished.\n\nA caller in Oregon revealed that she has, according to her husband's account, spoken fluently in an unknown language while dreaming. Brian from Poplar Bluff, Missouri recalled his visit to the &quot;Witch's Grave&quot; at an area cemetery. While there he and his buddies heard a branch snap and, while looking for the source of the noise, caught a shadow person in their flashlight beams. Brian said the being seemed to absorb light and disappeared in an instant.\n\nGeorge also offered a 'snore' hotline for callers who wanted to broadcast their loved ones' snoring episodes live over the air.\n\nAstrology Update\n\nIn the first hour, professional astrologer Mark Lerner provided his periodic astrology update. Lerner said today (Sept. 11, 2009) was rather significant because Pluto appeared to be stationary from Earth's point of view, an event that occurs only twice a year. Pluto is the planet of extremes, Lerner continued, noting how this can, for example, lead to extreme riches or loses in the gold market.\n\nLerner commented on the current three-week Mercury Retrograde cycle. According to Lerner, Mercury is not to blame for people's problems during this period. Instead, we need to use this time to review and reflect on our lives in order to go forward more clearly when the present cycle ends on Sept. 29th, he explained. Lerner also discussed a possible link between the movement of Saturn and bizarre behavior, as well as how his charts show the wars in Iraq and Afghanistan will be unbelievably costly and perhaps even unwinnable.\n\nDreams\n\nGeorge spoke with therapist and dream coach Kelly Sullivan Walden during the second hour. Kelly described dreams as the language of the human soul. There are no throw away dreams, she explained, noting that every single dream is magical and worth examining. Kelly said dreams always come up in her counseling sessions, where she uses hypnotherapy to help her clients stir their subconscious minds and tune into the other side.\n\nIn one hypnotherapy case, a man who had come to her for smoking cessation began speaking with a different voice, crying and channeling information to Kelly. Details of past lives as well as messages from departed loved ones often emerge in hypnotherapy sessions, she noted. Kelly also shared a nightmare she had about being wrapped in plastic and placed into a silverware drawer by her father. Kelly encouraged the audience to work through such dreams, as they can be a doorway to freedom and peace.\n\nWebsite(s):\nearthaquariusnews.com\nihadthestrangestdream.com\nkellysullivanwalden.com\n\nBook(s):\nInner Child Cards\nBaseball Tarot\nI Had the Strangest Dream...: The Dreamer's Dictionary for the 21st Century\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224","torrent":{"xt":"urn:btih:afa714d36bd68bc6e1211f06c76ebfea7fed1746","amp;dn":"Coast+to+Coast+AM+-+Sep+11+2009+-+Open+Lines%2C+Astrology+%26+Dreams","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afa714d36bd68bc6e1211f06c76ebfea7fed1746","infoHashBuffer":{"type":"Buffer","data":[175,167,20,211,107,214,139,198,225,33,31,6,199,110,191,234,127,237,23,70]},"announce":[],"urlList":[]}}