{"title":"The Nightmare Before Christmas - 1993","uid":5021285,"size":3977490270,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:afd7b6a7a4b15b6f546fb75b29e870e696320066&amp;dn=The+Nightmare+Before+Christmas+-+1993&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"EvilTSAngel","files":-1,"time":1248470751,"description":"This stop-motion animated fable was a big hit when it was released -- not only at the box office, but critically. It was praised for its stunning originality and for the excellence of its execution. In addition, it was praised for being a completely absorbing fable that both grownups and children can enjoy, so long as the children are able to its handle scary bits (beginning perhaps at age seven or eight). In the story, Jack Skellington (voice of Chris Sarandon) is the Pumpkin King of Halloweentown, a realm of reality where the inhabitants make it their life's work to scare humans on Halloween. He's good at his work, and is very popular around town, but it all bores him. In a funk one day, he wanders into a wood where every tree is the doorway to realms serving one or another human holiday, and falls through the doorway into Christmas. There, he sees scenes of such glee and good will that he is overwhelmed. He returns to Halloweentown with the inspiration to persuade his fellow citizens to kidnap Santa and do Christmas in their own Halloweentown way -- complete with snakes and shrunken heads. Despite strong arguments against this project by Jack's otherwise loyal girlfriend, Sally (voice of Catherine O'Hara), Santa (voice of Edward Ivory) is duly captured, and the townspeople prepare a very special Christmas for everyone. Jack is excited about the new plan, and at first doesn't notice that Sally isn't around much anymore. Meanwhile, Oogie Boogie (voice of Ken Page), a sinister opponent of Jack's, has re-kidnapped Santa and has captured Sally as well. Since Sally is the true love of Jack's life and (he eventually realizes) the only one who can be relied upon to tell him the truth in every circumstance, a confrontation with Oogie Boogie becomes inevitable. In addition to being a monumental work of animation (it took over 120 animators and many more technicians more than two years to film it), this show features ten very appropriate musical numbers by composer Danny Elfman, who also supplies Jack's singing voice. In October 2006, fans of the innovative animated classic got to experience The Nightmare Before Christmas in a whole new dimension when the film was re-released into theaters in Disney Digital 3-D -- a process developed to add remarkable new depth to films that were originally released in standard 2-D. ~ Clarke Fountain, All Movie Guide\n\n\n\nTheatrical Feature Running Time: 76 mins \nComplete Cast:\nDanny Elfman - Barrel\nCatherine O'Hara - Shock\nGlenn Shadix - Mayor\nKen Page - Oogie Boogie\nL. Peter Callender\nSherwood Ball - Mummy, Vampire\nBarbara Cohen\nCarmen Twillie - Undersea Gal/Man Under Stairs\nDavid McCharen\nCatherine O'Hara - Sally\nJudi M. Durand\nChris Sarandon - Jack Skellington\nWilliam Hickey - Dr. Finklestein\nPaul Reubens - Lock\nEdward Ivory - Santa\nGreg Proops\nMary Gail Artz\nDoris Hess\nGary Schwartz\nGary Raff\nRandy Crenshaw - Mr. Hyde/Behemoth/Vampire\n\n\nDirector(s):Henry Selick\nWriter(s):Caroline Thompson, Michael McDowell\nProducer(s):Denise Di Novi, Tim Burton, Bill Gavin\nTheatrical MPAA Rating: PG(Mild Violence, Suitable for Children, Adult Situations)\nCategories:Sci-Fi &amp; Fantasy, Family &amp; Kids, Animation\n\nThis is the movie only\n\nCustom Menu's","torrent":{"xt":"urn:btih:afd7b6a7a4b15b6f546fb75b29e870e696320066","amp;dn":"The+Nightmare+Before+Christmas+-+1993","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afd7b6a7a4b15b6f546fb75b29e870e696320066","infoHashBuffer":{"type":"Buffer","data":[175,215,182,167,164,177,91,111,84,111,183,91,41,232,112,230,150,50,0,102]},"announce":[],"urlList":[]}}