{"title":"Jan Akkerman - A Touch Of Class DVD","uid":5584846,"size":2472483827,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b05330723b2ca1dedbaa24c8583a051474338fcc&amp;dn=Jan+Akkerman+-+A+Touch+Of+Class+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Iron_Horse","files":34,"time":1274666271,"description":"At the end of 1983 Channel Four in London, England broadcasted a Christmas Special on television featuring guitarist Jan Akkerman. This special had parts from a live performance shot at Virgin Records Group 'The Venue' Victoria, London 21st December 1983. Most of the material performed came from his album &quot;Can't Stand Noise&quot;. Some of those songs had blues influences but were also a mix of jazz rock, fusion and progressive rock music. Good examples are songs such as &quot;Heavy Treasure&quot;, &quot;Streetwalker II&quot;, &quot;Just because&quot; and &quot;Pietons&quot;. The last one had live also a short piece of &quot;Hocus Pocus&quot;. A song from his former band Focus. This song plus &quot;Sylvia&quot; from the &quot;Old Grey &amp; Whistle Test&quot; live TV performance recorded in 1973 was also featured in this special. They were included because Jan talked about this band during an interview. During this interview he also talked about his classical influences and demonstrates it on his electric guitar. The use of the lute he blames his staying in England for almost one year. How beautiful this instrument sounds he shows at a local church in Friesland when he plays the songs &quot;Britainnia&quot; and &quot;A Galliard by Anthonie Holbourne&quot; from his &quot;Tabernakel&quot; album. This special also shows that Jan Akkerman was an innnovative musician at the time. He was one of the first guitar players who experimented with a guitar synthesizer. Playing several synth parts next to the occasional keyboard player Mark van de Geer. The other musicians in Jan's backing band were at the time the fantastic drummer Hans Waterman (Solution) and the excellent bassist Dino Walcott. The British fans of Jan's music had a great time watching this 50 minutes TV special. The good news is that the whole special is now released on a DVD. Even the sound is very good. It was originally recorded on the Rolling Stones Mobile Studio's and mixed at Pete Townsend's Eel Pie Studio's. As a bonus two extra tracks are included from a live performance shot for Dutch TV 18 months later. This time without the extra keyboard player they play great versions of &quot;Pietons&quot; and &quot;Just because&quot;. Jan again demonstrates his great technique on the guitar synth showing that he does not really need someone behind the keyboards. I would certainly name this DVD with the TV Special plus the bonus material a great document. It shows that Jan Akkerman was still a great musician after he left Focus. This DVD is not only a must for his fans only! Fantastic stuff and certainly a touch of class!\n\n\n\nTRACK LISTING\n\n1. Britainnia\n2. Heavy Treasure\n3. Sylvia\n4. Hocus Pocus\n5. Streetwalker II\n6. Just Because\n7. Everything Must Change\n8. A Galliard By Anthonie Holbourne\n9. Pietons (With Hocus Pocus Reprise)\n\nBONUS TRACKS\n\n10. Pietons\n11. Just Because\n\n\n\n\n\nPERSONNEL\n\nJan Akkerman - electric guitar, lute, Roland guitar synthesiser\nDino Walcott - bass\nHans Waterman - drums\nMarc Van Der Greer - keyboards (1-9)\n\n\n\n\nDVD INFO\n\nSize: 2.30 Gb ( 2,407,962 KBytes ) - DVD-5\nEnabled regions: 1, 2, 3, 4, 5, 6, 7, 8\nPlay Length: 00:51:21 + 00:05:35 + 00:03:22\nVideo: NTCS 4:3 (720x480) VBR\nAudio: English (Dolby AC3, 2 ch)\nMenu Video: NTCS 4:3 (720x480) VBR\nMenu English Language Unit : Root Menu\n\n\nNOTE : This DVD is with hidden menus. When playback start, just press ''Menu'' button on remote.","torrent":{"xt":"urn:btih:b05330723b2ca1dedbaa24c8583a051474338fcc","amp;dn":"Jan+Akkerman+-+A+Touch+Of+Class+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b05330723b2ca1dedbaa24c8583a051474338fcc","infoHashBuffer":{"type":"Buffer","data":[176,83,48,114,59,44,161,222,219,170,36,200,88,58,5,20,116,51,143,204]},"announce":[],"urlList":[]}}