{"title":"El Precio de la Verdad[DVDrip][Spanish]","uid":5111778,"size":733802496,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b057ea82c22c4b26415acd70dddaaedbf55626cb&amp;dn=El+Precio+de+la+Verdad%5BDVDrip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sahae","files":1,"time":1254857908,"description":"TÃƒÂ­tulo original: Shattered Glass\nAÃƒÂ±o: 2003\nPaÃƒÂ­s: USA\nDuraciÃƒÂ³n: 95 min\nEstreno en EspaÃƒÂ±a: 23-04-2004\nEstreno en USA: 31-10-2003\nDirector: Billy Ray\nReparto: Hayden Christensen, Peter Sarsgaard, ChloÃƒÂ« Sevigny, Steve Zahn, Melanie Lynskey, Hank Azaria, Rosario Dawson, Luke Kirby, Jamie Elman, Mark Blum, Chad Donella, Russell Yuen, Cas Anvar, Linda E. Smith, Ted Kotcheff\nGuiÃƒÂ³n: Billy Ray\nMÃƒÂºsica: Mychael Danna\nProductora: Lions Gate Entertainment\nGÃƒÂ©nero: Drama\n\nSinopsis: Stephen Glass (Hayden Christensen), es redactor de plantilla para la prestigiosa revista de actualidad y polÃƒÂ­tica The New Republic y articulista por cuenta propia para publicaciones como Rolling Stone, Harper's y George. A mediados de los 90, sus artÃƒÂ­culos convirtieron a Glass en uno de los periodistas jÃƒÂ³venes mÃƒÂ¡s solicitados de Washington, pero una extraÃƒÂ±a cadena de acontecimientos (recogida en el artÃƒÂ­culo de Buzz Bissinger publicado en septiembre de 1998 en Vanity Fair, en el que se basa el filme) detuvo de pronto su meteÃƒÂ³rica trayectoria. Chuck Lane (Peter Sarsgaard), es el editor que debe contrastar personalmente la existencia real de cada uno de los personajes supuestamente inventados por la firma mÃƒÂ¡s carismÃƒÂ¡tica de su redacciÃƒÂ³n. En 1998, pocos meses despuÃƒÂ©s de ser nombrado director de The New Republic, Charles Lane despidiÃƒÂ³ a Stephen Glass por inventarse un artÃƒÂ­culo que apareciÃƒÂ³ en la revista con el tÃƒÂ­tulo &quot;Hack Heaven&quot; (&quot;El paraÃƒÂ­so del hacker&quot;). Este intrigante artÃƒÂ­culo de rabiosa actualidad empresarial describÃƒÂ­a con detalle las andanzas de un pirata informÃƒÂ¡tico menor de edad cuyo representante logra un lucrativo negocio extorsionando a una compaÃƒÂ±ÃƒÂ­a de software que habÃƒÂ­a sido una de las vÃƒÂ­ctimas del pirata. &quot;Hack Heaven&quot; fue el ÃƒÂºltimo artÃƒÂ­culo que llegÃƒÂ³ a escribir Glass, pero aquella no fue la primera vez que el periodista se habÃƒÂ­a tomado libertades en la forma de retratar la realidad. Finalmente se supo que Glass se inventÃƒÂ³ la totalidad o parte de los hechos que plasma en 27 de los 41 artÃƒÂ­culos que escribiÃƒÂ³ para The New Republic. Como periodista por cuenta propia, tambiÃƒÂ©n escribiÃƒÂ³ artÃƒÂ­culos inventados para publicaciones como George, Harper's y Rolling Stone.\n\n","torrent":{"xt":"urn:btih:b057ea82c22c4b26415acd70dddaaedbf55626cb","amp;dn":"El+Precio+de+la+Verdad%5BDVDrip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b057ea82c22c4b26415acd70dddaaedbf55626cb","infoHashBuffer":{"type":"Buffer","data":[176,87,234,130,194,44,75,38,65,90,205,112,221,218,174,219,245,86,38,203]},"announce":[],"urlList":[]}}