{"title":"The Secret Policeman's Ball. The Complete Edition. Volume 5","uid":5580662,"size":3562164224,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b06b036c6a2dcb7d7596fe73584712945cf096da&amp;dn=The+Secret+Policeman%5C%27s+Ball.+The+Complete+Edition.+Volume+5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"s-policeman","files":-1,"time":1274527124,"description":"\n                       THE SECRET POLICEMAN'S BALL\n                          THE COMPLETE EDITION\n\n    A UNIQUE COLLECTION OF LIVE COMEDY AND MUSIC FOR AMNESTY INTERNATIONAL\n\n\nVOLUME FIVE\n~~~~~~~~~~\n* FEATURE LENGTH DOCUMENTARY FROM BAFTA AWARD WINNING PRODUCER ROGER GRAEF\n  &quot;REMEMBER THE SECRET POLICEMAN'S BALL?&quot;\n\n\nREMEMBER THE SECRET POLICEMAN'S BALL?\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nThe Secret Policeman benefit shows for Amnesty International brought together\ncomedy grand masters - from Python and Beyond the Fringe - and performers then\nrelatively unknown, like Rowan Atkinson.\n\nNarrated by Dawn French, the programme includes interviews with many of the\ncomedians and musicians who took part: John Cleese, Stephen Fry, Michael\nPalin, Sting, Lenny Henry and many more.\n\nThe shows and their stars had a huge effect on modern British comedy. There\nare few comics today whose careers have not been heavily influenced by the\nanarchic and surreal humour of these events.\n\n\n\nAMNESTY INTERNATIONAL WORKS\nJOIN US!\n\n&quot;I was kept naked in an underground cell. When the first 200 letters came, the\nguards gave me back my clothes .... The letters kept coming, 3000 of them, and\nthe President called me to his office. He showed me an enormous box of letters\nand said: &quot;How is it that a trade union leader like you has so many friends\nall over the world.&quot;\n                                       Union leader in The Dominican Republic\n                                      campaigned for by Amnesty International.\n\n&quot;Words are too poor to express the gratitude and thanks of my mother for the\nreturn of her son, my wife for the return of her husband, and my children for\nthe return of their father.... You were the only organisation (as far as I\nknow) ...which raised its voice for the rights of citizens unjustly denied by\nthe government in power.&quot;\n                                                          Timonsheno Pekmezi,\n                                             Albanian prisoner of conscience,\n                                   released by presedential decree following\n                                         pressure from Amnesty International.\n\nThese are just two letters Amnesty International has received from people we\nhave worked for. They show what a difference individual members of Amnesty can\nmake.\n\nAmnesty International was founded over four decades ago in 1961 when lawyer\nPeter Benenson launched what was intended to be a year-long 'appeal for\namnesty' after reading about two Portuguese students jailed for drinking a\ntoast to freedom.\nToday Amnesty International is a worldwide voluntary movement with more than 1\nmillion members - including more than 180,000 in the UK - who campaign for\nhuman rights. Our appeals for victims of human rights violations are based on\naccurate research and on international law. We are independent of any\ngovernment, political ideology, economic interest or religion and to protect\nour independence and impartiality, Amnesty is funded entirely from the pockets\nof its members and from fundraising projects like this special box set - thank\nyou for your support.\nBy buying this box set you are supporting human rights worldwide. You can help\nfurther by joining Amnesty International simply by calling 0845 60 120 60,\nvisiting our website www.joinamnestynow.com, or completing and returning the\nenclosed leaflet. The more members we have, the more work we can do.\nThank you once again for all your support. We really appreciate it.\nEnjoy the shows!\n\nwww.joinamnestynow.com\n","torrent":{"xt":"urn:btih:b06b036c6a2dcb7d7596fe73584712945cf096da","amp;dn":"The+Secret+Policeman%5C%27s+Ball.+The+Complete+Edition.+Volume+5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b06b036c6a2dcb7d7596fe73584712945cf096da","infoHashBuffer":{"type":"Buffer","data":[176,107,3,108,106,45,203,125,117,150,254,115,88,71,18,148,92,240,150,218]},"announce":[],"urlList":[]}}