{"title":"Cold Fear (Portable)","uid":5060309,"size":241547525,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b0945782b28cadfec7e783258332dab141264091&amp;dn=Cold+Fear+%28Portable%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1250680728,"description":"Plot\n\nIn Cold Fear the player takes on the role of Tom Hansen, a former soldier now in the employ of the United States Coast Guard who has been sent in to investigate a mysterious Russian whaler Eastern Spirit in the middle of the Bering strait. The beginning cut-scenes show a SEAL team under the orders of a CIA agent, identifying the ship and trying to discover its cargo. Unfortunately, the SEAL squad is slaughtered mercilessly by an unknown threat. CIA agent Bennett then orders any government vessel in the vicinity of the Russian boat to investigate, and it is Hansen's ship which responds. As Hansen, the player finds out that the boat is occupied by hostile Russian soldiers and by strange creatures, known as &quot;exocels&quot;, that use humans and other life forms as hosts, to feed on and to use as protection from the environment. These parasites are a threat to Hansen from inside and outside their host bodies. His investigation leads to the mystery of the ship and its lethal cargo, as well as the unethical experiments which were being carried out aboard the ship.\n\n[edit]\nGameplay\n\nIn Cold Fear, players can assume a behind the shoulder camera angle. However players also can choose between a fixed camera angle or a behind the shoulder camera angle. The game employs many scare tactics. For example, when opening a door, a creature may jump out at the player, or while talking to an NPC, a creature may just burst out of his chest. Cold Fear employs a stamina bar, which decreases as the player performs certain actions, like running.\n\nThe conditions on the deck of the ship can change how the player can control Hansen. Since the game takes place in the middle of the ocean during a storm, there is a lot of movement of the vessel as it bobs up and down through the rough seas. The cargo ship continuously banks left and right while Hansen is walking on deck, making it more difficult to aim and to walk a straight line. In some instances, the ship rocks so much, and to such a great degree, that Hansen can get knocked down and possibly sent overboard. There are also many environmental hazards, like swinging electrical wires and crates hooked up to ropes, which are also affected by the swaying of the ship, and can easily crash into the player or enemies if they aren't careful. Waves crashing on to the ship's deck may also inflict damage on a player's health. The environmental hazards can also be used against enemies.","torrent":{"xt":"urn:btih:b0945782b28cadfec7e783258332dab141264091","amp;dn":"Cold+Fear+%28Portable%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0945782b28cadfec7e783258332dab141264091","infoHashBuffer":{"type":"Buffer","data":[176,148,87,130,178,140,173,254,199,231,131,37,131,50,218,177,65,38,64,145]},"announce":[],"urlList":[]}}