{"title":"Barely Legal 55 (DVD.xvid) - Brea Bennett, Jenna Presley,","uid":5049364,"size":746044840,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b138bafd6bf436add34b5cbb91270ec7e8deab99&amp;dn=Barely+Legal+55+%28DVD.xvid%29+-+Brea+Bennett%2C+Jenna+Presley%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pure_screens","files":7,"time":1249847227,"description":"Barely.Legal.55.XXX.DVDRiP.XviD\n\n\n\n\nscreens: &lt;a href=&quot;\nhttp://www.cbuz.com/1697b4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cbuz.com/1697b4&lt;/a&gt;\n\n\n\n\nNice girls turn naughty!\nYou're calling the shots when these innocent cuties go bad! \nWatch fresh, tight pussies get stretched to the max as they get rammed in true Barely Legal style!\n\n\nStarring: \n\n    * Brea Bennett \n    * Chelci \n    * Jenna Presley \n    * Kaiya Lynn \n    * Nikki Nievez \n    * Sasha Knox \n    * Vanessa Lynn\n\n   \nScene Breakdowns\n\n    * Scene 1. Kraig Kragen, Vanessa Lynn\n    * Scene 2. Brea Bennett, Kaiya Lynn\n    * Scene 3. Barry Scott, Chelci\n    * Scene 4. Sasha Knox, Van Damage\n    * Scene 5. Jenna Presley, Jerry\n\n\nStudio:          Hustler\nDirector:        Erika Mclean\nReleased:        2005\nFormat:          Xvid\nLanguage:        English\n\n\n3,000+ torrents: \n(ALWAYS with honest screens &amp; detailed info)\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/pure_screens&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pure_screens&lt;/a&gt;\n\n\n\n700mb\n112 vbr audio bitrate\nxvid codec\n1.30.19 runtime\n956 video bitrate\n29 fps\n512*384 res\n\n\nREVIEW:\n\nHustler's long running Barely Legal series continues with the 55th installment. We start with Vanessa Lynn, who tells Barely Legal that her dad owns a boatyard, and when she turned 18 it became her mission to fuck every employee there. It's good to have goals. Vanessa drives up in a golf cart, oozing with confidence and practically good to go. It doesn't take long for &quot;the only guy left she hasn't banged yet&quot; to be all over her. He goes down on her shaved 18 year old pussy and gives some intense fingerbanging to kick things off. In return he gets a fantastic looking blowjob and then plows his cock into her awaiting pussy. After a few position change-ups he pops on her face, which she isn't that into. Solid scene otherwise, and bonus points if you like watching people fuck on a golf cart.\n\nBrea Bennett heads to the auto garage to meet up with her boyfriend, and instead finds Kaiya Lynn. Somehow this turns into lesbian sex. I'm not complaining. Kaiya goes down on Brea to get the juices flowing, then Brea gives back. They bust out the toys for some lackluster stuff and then the strap ons come out. Things get much better at that point. Kaiya takes one of the strap ons in the ass, which she also performs ass to mouth on.\n\nChelci has been lusting after her pool man, and now that she's 18 she plans to fuck him silly. She tempts him by masturbating, then asks him to oil her up with some lotion. She whips out her boobs for some lube, and the party officially starts. He goes down on her barely legal yet totally shaved pussy and in return he gets a somewhat decent blowjob. She then straddles him in a reverse cowgirl position and they start pounding away. The usual position changes follow and then he unloads on her face which she doesn't really want to be a part of.\n\nSasha Knox's friend dares her to fuck their high school coach in the men's locker room. Coach doesn't put up much of a fight when he learns she's 18 and she swallows his cock. Coach licks her pussy and ass, getting her ready for when he slides his cock deep inside her from behind. He pounds on her like that and then missionary until blowing his spunk on her face.\n\nJenna Presley works in the local coffee shop and asks a regular customer to drive her home. They don't make it, stopping instead under a big tree so he can undress her and taste her pussy. He gets a damn fine looking blow for his efforts then he slams her from behind on the hood of his car. She then rides him on the hood, takes it missionary style, and he pops on her face, which she enjoys. Good scene to end on. \n\n\n\n","torrent":{"xt":"urn:btih:b138bafd6bf436add34b5cbb91270ec7e8deab99","amp;dn":"Barely+Legal+55+%28DVD.xvid%29+-+Brea+Bennett%2C+Jenna+Presley%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b138bafd6bf436add34b5cbb91270ec7e8deab99","infoHashBuffer":{"type":"Buffer","data":[177,56,186,253,107,244,54,173,211,75,92,187,145,39,14,199,232,222,171,153]},"announce":[],"urlList":[]}}