{"title":"Librivox M4B Audiobook - Talents Incorporated by Murray Leinster","uid":5518143,"size":179583757,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b1babcc68ceecbcdd38c61af552f32b51f0b8129&amp;dn=Librivox+M4B+Audiobook+-+Talents+Incorporated+by+Murray+Leinster&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"VoxRatio","files":-1,"time":1272346568,"description":"Bors felt as if he'd been hit over the head. This was ridiculous! He'd planned and carried out the destruction of that warship because the information of its existence and location was verified by a magnetometer.\n\nBut, if he'd known how the information had been obtained--if he'd known it had been guessed at by a discharged spaceport employee, and a paranoid personality, and a man who used a hazel twig or something similar--if he'd known that, he'd never have dreamed of accepting it. He'd have dismissed it flatly! (Summary from the Gutenberg text)\n\n\n\nAn M4B file is an audio file which can be bookmarked. This is the audio-book file type. These files can have chapter markers which can be skipped through as you would skip through files on a play list. They can have built in cover art and chapter images. They will remember where you left off each time you stop the file and come back to it . And variable speed settings on Ipods and a growing number of other mp3 players can be utilized by this file type. The ability to bookmark allows for as little as one large file instead of many small ones without the burden of fast forwarding to find your spot every time you resume listening or the fear of otherwise losing your place. The reduced number of files also makes browsing through your files to find your book and your place in it much less effort.\n","torrent":{"xt":"urn:btih:b1babcc68ceecbcdd38c61af552f32b51f0b8129","amp;dn":"Librivox+M4B+Audiobook+-+Talents+Incorporated+by+Murray+Leinster","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1babcc68ceecbcdd38c61af552f32b51f0b8129","infoHashBuffer":{"type":"Buffer","data":[177,186,188,198,140,238,203,205,211,140,97,175,85,47,50,181,31,11,129,41]},"announce":[],"urlList":[]}}