{"title":"Sean Kingston - Fire Burning","uid":5061865,"size":149284868,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b3ce7bb9c7923f3af0fc628f7af2f653cacf2169&amp;dn=Sean+Kingston+-+Fire+Burning&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":-1,"time":1250742871,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Fire Burning&quot; is a dance pop reggae-influenced song by pop musician Sean Kingston. It is released as the lead single from his second studio album Tomorrow. The song displays a little more synth-dance sound than his previous recordings, with influences of dance music and electropop. Unlike many of his previous singles, which are all produced by J.R. Rotem, the song is produced by RedOne.\n\nVideo was premiered at MTV on June 15, 2009. Rick Ross makes a cameo appearance in the video. The video was directed by Gil Green. The video also shows Kingston's Audi R8 in the video.\n\n&quot;Fire Burning&quot; is an uptempo electropop song with a modern dance beat. The composition blend the infectious hook with heavy synthesizers and a variety of percussive sounds. The song is set in common time with a moderate tempo of 120 beats per minute and is written in the key of D major. It begins with an energetic clarion call to the dance floor followed by modern dance beat.\n\nMichael Menachem of Billboard reviewed the song as &quot;the most danceable single yet&quot; and commented on the fast tempo and Kingston's well-projected vocal &quot;that allows producer RedOne to blend the infectious hook with heavy synthesizers and a variety of percussive sounds that made Lady GaGa's &quot;Poker Face&quot; so striking&quot;. He also comments that &quot;the chorus is repetitive, it sounds just like 'Unstoppable' by Kat Deluna, but this song is often what makes for a sizzling club hit&quot;. Alex Fletcher of Digital Spy said that 'Fire Burning' has all the makings of a classic summer anthem with its swathes of GaGa-esque synths, infectious chorus hook and fuzzy bassline but he wasn't in favor of Kingston's reggae-tinged vocals.\n\nBill Lamb of About.com comments on the song's fuzzed up bass lines, potent vocals, and a clear call to head to the dance floor, saying that it stands a good chance of making this a summer smash and demonstrate RedOne's success with Lady GaGa is no fluke. Lamb also calls the pros of the song a Clarion call to the dance floor, Sean Kingston's energetic vocals, and fuzzed up bass tracks while the cons are the standard synth dance sound.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:b3ce7bb9c7923f3af0fc628f7af2f653cacf2169","amp;dn":"Sean+Kingston+-+Fire+Burning","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3ce7bb9c7923f3af0fc628f7af2f653cacf2169","infoHashBuffer":{"type":"Buffer","data":[179,206,123,185,199,146,63,58,240,252,98,143,122,242,246,83,202,207,33,105]},"announce":[],"urlList":[]}}