{"title":"Inside The Firestorm.mp4","uid":5513486,"size":559387662,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b3fe39bd941877fb4e1a11aae60332d098fd7635&amp;dn=Inside+The+Firestorm.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Owen65","files":1,"time":1272159630,"description":"This is the story of Australia's most devastating bushfires. Twenty-four terrifying hours through the eyes of those who were there, the witnesses caught inside the firestorm that would re-write history and change all the rules.\n\nOn February 7, 2009, Australia suffered its most horrendous bushfires. 'Black Saturday' claimed 173 lives in Victoria, left more than 7,000 homeless and destroyed close to half a million hectares of Victorian bushland. One year on, this is the story of what happened inside the firestorm.\n\nInside The Firestorm documents hour by hour the events that unfolded on that fateful day. It is a film of record - a film that commemorates a catastrophe bravely told by some of the survivors. They tell their heart-breaking stories - some of miraculous survival, others of devastating loss of loved ones and property by the bushfires described by one eyewitness as a 'fire tornado'.\n\nUsing Country Fire Authority footage, eyewitness accounts, ABC 774 radio reports, photos and amateur footage, this documentary shows how these monster fires, exacerbated by hurricane-force winds, destroyed everything in their path. A firestorm so ferocious, it could kill from 200 metres.\n\nHorrendous conditions on that day in Victoria were a recipe for disaster. Long term drought resulted in tinder dry fuel that was very easily ignited and very difficult to extinguish. This, combined with the summer heat wave and humidity under ten percent, provided optimal conditions for a fire. Victoria recorded its highest temperature on February 7. The mercury topped 48.8:C in the Mallee region. It is the highest temperature on record. Melbourne city reached 46.4:C - also a record. Unofficially the temperatures were even higher.\n\nBy mid-afternoon fire crews and emergency services and personnel were stretched to breaking point. Hospitals prepared for the worst. By early evening, 90 fires raged across the State, ten were major and out of control. Towns had been obliterated, lives lost.\n\nFor those who survived this horrifying day, life must somehow go on.","torrent":{"xt":"urn:btih:b3fe39bd941877fb4e1a11aae60332d098fd7635","amp;dn":"Inside+The+Firestorm.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3fe39bd941877fb4e1a11aae60332d098fd7635","infoHashBuffer":{"type":"Buffer","data":[179,254,57,189,148,24,119,251,78,26,17,170,230,3,50,208,152,253,118,53]},"announce":[],"urlList":[]}}