{"title":"Halo 3 ODST [X360][ojuegos.eu]","uid":5088955,"size":13779897707,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:b5043dcf6135c2e5078a1e0d9a3ad3fdd76d7854&amp;dn=Halo+3+ODST+%5BX360%5D%5Bojuegos.eu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Morck22","files":143,"time":1252962343,"description":".. Allstars present :\n \n   Halo 3 : ODST (c) Bungie/Microsoft\n \n.. iNFOS :\n \n   Rel.Date...: Sept/09\n   Platform...: X360\n   Region Free: YES\n   Genre......: Action\n   Languages..: English\n   Format.....: .dvd\n   Size.......: 2 DVDs\n\n\n\n\nDesarrollado en exclusiva para Xbox 360 por el aclamado estudio Bungie, Halo 3: ODST es una nueva entrega de la exitosa saga &quot;Halo&quot; que permitirÃƒÂ¡ a los fans experimentar los hechos que precedieron a Halo 3 a travÃƒÂ©s de un equipo ODST (Orbital Drop Shock Trooper), mientras tratan de localizar al resto del escuadrÃƒÂ³n y averiguar los motivos de la invasiÃƒÂ³n de Nueva Mombasa a cargo del Covenant.\n\nCaracterÃƒÂ­sticas:\nNuevo contenido en modo campaÃƒÂ±a: La campaÃƒÂ±a de Halo 3: ODST explora los eventos que precedieron la llegada del Jefe Maestro a Nueva Mombasa en Halo 3. Defiende el futuro de la tierra desde la novedosa perspectiva del grupo de fuerzas especiales, los ODST (Orbital Drop Shock Trooper), aÃƒÂ±adiendo una nueva ambientaciÃƒÂ³n y nuevos elementos de juego a la historia que cerrÃƒÂ³ el final de la trilogÃƒÂ­a.\nUn nuevo hÃƒÂ©roe: Los soldados ODST forman la elite de las fuerzas especiales de la UNSC. Conocidos por su fortaleza, valor y locura forman la primera unidad que acude en situaciones hostiles.\nExpansiÃƒÂ³n del modo multijugador: NingÃƒÂºn juego de Halo estarÃƒÂ­a completo sin su revolucionario modo multijugador. Halo 3: ODST introduce una nueva forma de jugar a Halo con &quot;Firefight&quot;, un nuevo modo multijugador cooperativo que permite a cuatro jugadores poder saltar inmediatamente a la acciÃƒÂ³n. Como un escuadrÃƒÂ³n ODST, te enfrentarÃƒÂ¡s a un constante ataque de enemigos, cada vez mÃƒÂ¡s agresivos. Halo 3: ODST tambiÃƒÂ©n incluye un segundo disco con tres nuevos mapas multijugador para Halo 3, los mapas originales de Halo 3 y los packs de mapas Legendario, Heroico y MÃƒÂ­tico sumando un total de 24 mapas.\nPosibilidades infinitas para la comunidad: Los jugadores podrÃƒÂ¡n disfrutar de todas las innovaciones que introdujo Halo 3, como la posibilidad de guardar capturas de vÃƒÂ­deo e imagen, tablas de clasificaciÃƒÂ³n y cooperativo para cuatro jugadores. Todos los mapas incluirÃƒÂ¡n el editor Forge, ofreciendo mÃƒÂ¡s posibilidades de personalizaciÃƒÂ³n que nunca.\nAcceso a &quot;Halo: Reach&quot;: Como bonus especial para los fans, todas las copias de Halo 3: ODST tendrÃƒÂ¡n acceso a la beta multijugador de Halo: Reach cuando estÃƒÂ© disponible en primavera de 2010.","torrent":{"xt":"urn:btih:b5043dcf6135c2e5078a1e0d9a3ad3fdd76d7854","amp;dn":"Halo+3+ODST+%5BX360%5D%5Bojuegos.eu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5043dcf6135c2e5078a1e0d9a3ad3fdd76d7854","infoHashBuffer":{"type":"Buffer","data":[181,4,61,207,97,53,194,229,7,138,30,13,154,58,211,253,215,109,120,84]},"announce":[],"urlList":[]}}