{"title":"HBO HUNG S01E05 DO IT, MONKEY - AAADICTEDONE HD 720P MP4 PS3","uid":5048304,"size":733277815,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:b510484d9dd58c23712bd6212598bcebfea64551&amp;dn=HBO+HUNG+S01E05+DO+IT%2C+MONKEY+-+AAADICTEDONE+HD+720P+MP4+PS3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"aaadicted","files":1,"time":1249758258,"description":"| a | a | a | d | i | c | t | e | d | o | n | e |==| H | D |==| M | P | 4 |\n\n\n-=- HBO -=-\n\nHUNG\n\nSeason 1\n\nEpisode 5\n\n&quot;Do It, Monkey!&quot;\n\n\n| a | a | a | d | i | c | t | e | d | o | n | e |==| H | D |==| M | P | 4 |\n\nRay ends a call from an angry mother about her son's position on the basketball team to pull over and help an attractive woman with a flat tire. He invites her to lunch at a nearby cafe, and they end up having rough sex in the bathroom. Turns out she's a trick, and Tanya explains to Ray later that the customer wasn't happy: She wanted more of a female fantasy than a male fantasy. The client, Jemma, pays for a do-over in which Ray shows up as Randall, a book editor. This time, when he asks her on a date she says she has a boyfriend and takes off. Debriefing, Tanya explains Ray was supposed to stop her from leaving.\n\nAt a buffet lunch, the twins complain to Jessica about the quality of the food, and Ronnie explains that they are not as rich as they used to be. That night, Ray, feeling flush, grills some T-bones for the kids and revels in the news that Ronnie can't afford to get them a car. Ray makes a grand offer: to buy them a car himself. He quickly calls Tanya to get the well-paying Jemma back for more.\nTanya hands out samples of her Lyric Bread for Floyd's final workshop class as Floyd tries to enlist them for part two of his seminar. But there are no takers, including Tanya. When Ray goes for the third break-down fantasy with Jemma, his school principal walks by and sees him seducing her in the cafe parking lot.\nMeanwhile, Jessica and her mother argue about whether or not Ronnie is really broke, but they are interrupted by the twins, who've noted that Doris the dog is in trouble. She ends up in a coma, but Ronnie doesn't want to spend the money on treatment and orders Doris put to sleep.\n\nRay and Jemma picnic on the beach, but Ray gets snagged in another trap when she mentions &quot;love&quot; and he doesn't respond appropriately. They argue, and she storms off yet again. When Tanya delivers Jemma's payment, she assures him it's final; they need to find another client. Later, Tanya is dumbfounded when Floyd tells her he's not attracted to her -- she insists she'd only gone out with him out of pity and an attempt to have an open mind. Miserable, she calls her mother, but getting no comfort, calls Ray instead. He doesn't answer because he's making a house call to Jemma -- that Tanya didn't book -- to ask for another chance.\n\n| a | a | a | d | i | c | t | e | d | o | n | e |==| H | D |==| M | P | 4 |\n\n\nStats - http://bayimg.com/baDleaAcC\n\nScreenshot - http://bayimg.com/BAdLDaACc\n\n\n| a | a | a | d | i | c | t | e | d | o | n | e |==| H | D |==| M | P | 4 |\n","torrent":{"xt":"urn:btih:b510484d9dd58c23712bd6212598bcebfea64551","amp;dn":"HBO+HUNG+S01E05+DO+IT%2C+MONKEY+-+AAADICTEDONE+HD+720P+MP4+PS3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b510484d9dd58c23712bd6212598bcebfea64551","infoHashBuffer":{"type":"Buffer","data":[181,16,72,77,157,213,140,35,113,43,214,33,37,152,188,235,254,166,69,81]},"announce":[],"urlList":[]}}