{"title":"Tita Tovenaar deel 7.DVDr.NLT-Release (DIVx)","uid":5118475,"size":476866838,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b52a482526af8b1f5b2028961a2dd82e6e91f33f&amp;dn=Tita+Tovenaar+deel+7.DVDr.NLT-Release+%28DIVx%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"diddle783","files":4,"time":1255190019,"description":"Tika woont samen met haar vader in een luchtkasteel. Haar vader is een grote, verstrooide tovenaar met maar een beperking: hij kan geen aardbeien in kamelen veranderen. Samen beleven ze veel avonturen. De meeste worden veroorzaakt door Titi, die met zijn apenstreken de mensen op aarde de stuipen op het lijf jaagt. Vooral het keurige heertje moet het vaak ontgelden. Op deze DVD staan de volgende 2 afleveringen:\n\nHet Zevenmijls Borsteltje:\nToverleerling Kwark moet Tita Tovenaar helpen nu Tika er niet is. Maar Tita vraagt om allerlei spullen waar Kwark nog nooit van gehoord heeft en het experiment van Tita Tovenaar mislukt. Dit gaat afkoelen en Kwark die nu helemaal alleen op het kasteel is gaat maar de zolder opruimen. Daar vindt hij een schoenenborstel. Hij maakt er de schoenen van Titi Toveraap mee schoon maar als Titi een stukje loopt verdwijnt hij opeens. Kwark poetst ook zijn schoenen, loopt en verdwijnt dan ook. Het blijkt dat het is zevenmijls-borsteltje is. Als men de schoenen met dit borsteltje poetst brengen de schoenen de drager bij elke derde stap 7 mijl verder. Tika mag alles weer oplossen\n\nDe Handjesman:\nDoor een opmerking van opa denkt Grobelia dat de kracht van Tita Tovernaar in zijn glazen bol ligt. Met haar Toverlantaarn roept ze de Handjesman op. De Handjesman heeft losse handjes en pikt alles wat vast en los zit. Grobelia stuurt de Handjesman naar het kasteel om de toverbal van toverpapa te pikken. Maar Tika, Kwark en Opa hebben hem door en Tika gaat met de Handjesman naar het dorp maar daar pikt hij ook alles wat vast en los zit.\n\nbron dvd\noorspronkelijke uitzenddatum 1972/1974\nverschijning dvd: (2009)\n\nDeze torrent wordt je aangeboden door NLT.ons-Forum \n\nHet forum met de nieuwste films en muziek en de meest uitgebreide\nCollectie DviX torrents.\n\nAl onze Film torrents hebben Nederlandse subs of zijn Nederlands Geproken\n\nTot ziens op het NLT.\n\nWe zijn te vinden op: &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt;","torrent":{"xt":"urn:btih:b52a482526af8b1f5b2028961a2dd82e6e91f33f","amp;dn":"Tita+Tovenaar+deel+7.DVDr.NLT-Release+%28DIVx%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b52a482526af8b1f5b2028961a2dd82e6e91f33f","infoHashBuffer":{"type":"Buffer","data":[181,42,72,37,38,175,139,31,91,32,40,150,26,45,216,46,110,145,243,63]},"announce":[],"urlList":[]}}