{"title":"VSO.ConvertXtoDVD.3.8.0.193j.Final.Full.[WwW.PorTorrent.CoM].Por","uid":5120732,"size":17429747,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b5af4420a14253fcf61c55c63fe3e786f7a92e5c&amp;dn=VSO.ConvertXtoDVD.3.8.0.193j.Final.Full.%5BWwW.PorTorrent.CoM%5D.Por&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gamolama","files":1,"time":1255335890,"description":"VSOConvertXtoDVD v.3.8.0.193j\n\nLiberado el 8 de octubre\n\nFinal, New &amp; Full\n\nConvertXtoDVD (antes DivxToDVD Converter) es una utilidad de VSO para convertir fÃƒÂ¡cil y cÃƒÂ³modamente tus vÃƒÂ­deos a formato DVD.\n\nQuizÃƒÂ¡ lo mejor sea que ConvertXtoDVD es capaz de hacerlo todo ÃƒÂ©l solito, convirtiendo e incluso grabando el resultado final a DVD.\n\nConvertXtoDVD no se limita exclusivamente a archivos DivX, sino que tambiÃƒÂ©n es capaz de convertir archivos MPEG, Quicktime, XviD y Windows Media Video (WMV).\n\nEs un convertor de video espectacular que admite todos los formatos e ideal para la familia. Se bajan las pelÃƒÂ­culas, series y la miran cÃƒÂ³modamente sentados en el sofÃƒÂ¡ de su living-room. A menos que prefieran estar todos acurrucados alrededor del P.C.\n\n\n\nPropiedades\n\nFormatos de Video Soportados: DivX, Xvid, MPEG4, MOV, AVI, WMV, WMV HD, DV, MKV, OGM y mÃƒÂ¡s...\nFuentes Soportadas: Archivos procedentes de videocamaras digitales, TV/Sat, tarjetas capturadoras\nPuede utilizar hasta 4 horas de material audiovisual procedente de diferentes fuentes\n\nFormatos de Audio Soportados: AC3, DTS, PCM, OGG, MP3, WMA y mas...\nAdmite archivos de subtitulos (.SRT .SUB/IDX .SSA) permitiendo seleccionar fuente y color, ademas soportando tags (italic, bold)\n\nSeleccion de Formato de Video: NTSC, PAL, o automatico y PULL-DOWN\nFormato de Salida: Widescreen, Fullscreen, o automatico\nCrea capitulos automaticamente o creelos a su gusto, con vista previa\nModo de previsualizacion rapida para verificar que se a cargado correctamente el video\n\nGuarde la estructura en el disco duro o grabelo a un soporte DVD grabable\nIntegra un fiable motor de grabacion (soportando todos los formatos de DVD)\n\nCodificador rapido y de calidad (normalmente tarda menos de 1 hora en convertir una pelicula)\nPOsibilidad de juntar varios archivos entre ellos\nControl de la velocidad y calidad de la conversion con el &quot;Evaluador de conversion&quot;\n\nSoporte de los multiprocesores (dual/quad core)\nCreacion de menus avanzados: posibilidad de aÃƒÂ±adir video y audio a los menus, varios fondos disponibles, creacion de sub-menus para los capitulos, los subtitulos, etc\n\nInterface configurable (temas, ventanas plegables)\nSoporte multilingual (idiomas disponibles...)\nOptimizado para Windows 2000 / XP / Vista...yo lo tengo instalado en 7!!!","torrent":{"xt":"urn:btih:b5af4420a14253fcf61c55c63fe3e786f7a92e5c","amp;dn":"VSO.ConvertXtoDVD.3.8.0.193j.Final.Full.%5BWwW.PorTorrent.CoM%5D.Por","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5af4420a14253fcf61c55c63fe3e786f7a92e5c","infoHashBuffer":{"type":"Buffer","data":[181,175,68,32,161,66,83,252,246,28,85,198,63,227,231,134,247,169,46,92]},"announce":[],"urlList":[]}}