{"title":"Allok Video to FLV Converter v6.2.0603","uid":5117072,"size":5418770,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b5e5b1a757388b15f60c59aaa72c662444535a76&amp;dn=Allok+Video+to+FLV+Converter+v6.2.0603&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"penguincomrade","files":-1,"time":1255116200,"description":"Program.........................: Allok Video to FLV Converter v6.2.0603\nUrl.............................: http://www.alloksoft.com/flv_converter.htm\nPrice(Fee)......................: $39.95 USD \nCracker.........................: Nan0miT\nRelease Type....................: Serial\nProtection......................: Mole Box 2.6.1\nRelease Date....................: 03.06.2009\n\n// RELEASE iNFOS\n\nAllok Video to FLV Converter is a powerful Flash Video Encoder to convert any video into SWF video and FLV streaming video formats.\n\nIt can convert almost all video formats, e.g.DivX, XviD, AVI, WMV, MPG, MPEG, MP4, M4V, FLV, 3GP, ASF, RM, RMVB, MOV, MOD, ASX, MKV, OGM, SVCD, VCD, VOB to FLASH Video (SWF, FLV) formats.\n\nVideo to FLV Converter produces flash reels ready for the Web publishing and streaming. You can create flash reels with custom video quality, frame rate, size, duration and quality.\n\nIt is also a Video to Flash Converter, an ideal solution that lets you quickly prepare your video movies for Web casting.\n\nKey Features of Allok Video to FLV Converter:\n\n* Video source supports DivX, XviD, AVI, WMV, MPG, MPEG, MP4, M4V, FLV, 3GP, ASF, RM, RMVB, MOV, MOD, ASX, MKV, OGM, SVCD, VCD, VOB any video format play-able.\n* All video to FLV format like AVI to FLV Converter, MPEG to FLV Converter, WMV to FLV Converter, MOV to FLV Converter, RM to FLV Converter etc.\n* All video to SWF format like AVI to SWF Converter, MPEG to SWF Converter, WMV to SWF Converter, MOV to SWF Converter, RM to SWF Converter etc.\n* All audio to FLV Converter like MP3 to FLV Converter, WMA to FLV Converter, WAV to FLV Converter etc.\n* All audio to SWF Converter like MP3 to SWF Converter, WMA to SWF Converter, WAV to SWF Converter etc.\n* Convert movie files into Macromedia Flash.\n* Inside FLV encoder.\n* Batch files conversion.\n* High-speed encoder ensures smooth conversion of video and audio data.\n* Direct any video files to Flash Video with high quality.\n* Customize the resulting file quality.\n* Adjust framerate and bitrates in resulting Flash movie.\n* Movie scene spot edit-able.\n* Support various subtitle file .\n* Keep the original aspect ratio or resize movie to fit resolution.\n* Automatically create HTML file with embedded Flash movie file.\n* Support Drag and Drop.\n* Preview source clips\n* Shutdown computer automatically when job is done.\n* Simple GUI and very EASY to use.\n\n\nSystem Requirements of Allok Video to FLV Converter:\n\n* Windows 2000/ME/XP/2003 operating system.\n* DirectX8.1 or higher (DirectX9.0 is recommended)\n* Pentium 300 MHz or better\n* 128M or more RAM \n\n// iNSTALL NOTES \n\n1. Install the software.\n2. Use the registration info inside Nan0miT.nfo. (Use a program like DAMN NFO Viewer or Notepad to view the .nfo file.)\n3. Have fun ;)\n\n// PERSONAL NOTES\n\nI'm afraid I can't really help you with much, there's not much to this release. Just follow the instructions and there you go.\nPlease try and keep all e-mails in English. There's only so much Spanish, Italian and French I can understand and speak.\nAlso please no more e-mails about how to download torrents or any e-mails about how to extract .rar files, you'll get much faster results by googling it.\nRemember: GIYF (Google is your friend.)\nSharing is caring, so please, seed back at least 1:1.\n\nPenguinComrade[at]gmail[dot]com\n\nYour friendly neighbourhood Penguin,\nPenguin Comrade","torrent":{"xt":"urn:btih:b5e5b1a757388b15f60c59aaa72c662444535a76","amp;dn":"Allok+Video+to+FLV+Converter+v6.2.0603","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5e5b1a757388b15f60c59aaa72c662444535a76","infoHashBuffer":{"type":"Buffer","data":[181,229,177,167,87,56,139,21,246,12,89,170,167,44,102,36,68,83,90,118]},"announce":[],"urlList":[]}}