{"title":"State.Of.Play.2009.DVD.AC3.XviD.V.O.Sub.Spanish.[www.SubEstrenos","uid":5054157,"size":1149380608,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b5ef4d805be371e671777c1716a2cd5f405e124e&amp;dn=State.Of.Play.2009.DVD.AC3.XviD.V.O.Sub.Spanish.%5Bwww.SubEstrenos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gamolama","files":1,"time":1250324951,"description":"State of Play (2009) DVD AC3 V.O Sub Esp Titulo: La Sombra del Poder Titulo original: State of Play Pais: USA Estreno en USA: 17/04/2009 Estreno en Espana: 17/04/2009 Lanzamiento en DVD (alquiler): 27/08/2009 Estreno en Blu-ray: 27/08/2009 Productora: Andell Entertainment Director: Kevin Macdonald Guion: Matthew Michael Carnahan, Tony Gilroy Reparto: Russell Crowe, Ben Affleck, Helen Mirren, Jason Bateman, Rachel McAdams, Robin Wright Penn Genero: Thriller, Crimen, Drama Sinopsis:El apuesto e imperturbable congresista Stephen Collins (Ben Affleck) representa el futuro de su partido: debido a su honradez, ha sido elegido presidente del comite que supervisa los gastos de Defensa. Todos esperan que esta estrella en auge represente a su partido en la proxima carrera hacia la presidencia. Hasta que alguien asesina brutalmente a su ayudante/amante y los secretos se escapan de su escondite. McCaffrey tiene la dudosa fortuna de ser un viejo amigo de Collins y de que su jefa (Helen Mirren) sea totalmente despiadada y le mande a investigar el caso. Mientras sigue la pista del asesino con la ayuda de su companera Della (Rachel McAdams), descubre una tapadera que amenaza con hacer temblar las estructuras del poder de la nacion. En una ciudad de relaciones publicas, asesores y ricos politicos, aprendera una verdad innegable: cuando miles de millones estan en juego, la integridad, el amor y la vida de cualquiera estan en peligro.\nState of Play","torrent":{"xt":"urn:btih:b5ef4d805be371e671777c1716a2cd5f405e124e","amp;dn":"State.Of.Play.2009.DVD.AC3.XviD.V.O.Sub.Spanish.%5Bwww.SubEstrenos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5ef4d805be371e671777c1716a2cd5f405e124e","infoHashBuffer":{"type":"Buffer","data":[181,239,77,128,91,227,113,230,113,119,124,23,22,162,205,95,64,94,18,78]},"announce":[],"urlList":[]}}