{"title":"DiRT_2_XBOX360-[ESPACONSOLAS]","uid":5081667,"size":6552396723,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:b5f77a0197c646aa3bb86089c035eca9b48b21d0&amp;dn=DiRT_2_XBOX360-%5BESPACONSOLAS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ESPACONSOLAS","files":77,"time":1252357595,"description":"Region free\n\nManufacturer's Description\nColin McRae: DiRT 2 will take players on a World Tour of adrenaline-fuelled extreme off-road events in stunning real-world locations. Events include exhilarating rally cross in the massive Los Angeles sports stadium?s ?Stadium King Shootout?, edge-of-control canyon racing of Utah?s ?Creek Trailblazer? event, the ?Rawang Rally Run? along treacherous Malaysian rainforest tracks and the ?Battersea Battle?, where night races are staged at the iconic London power station. Building on the technical and gameplay benchmark of Colin McRae: DiRT and borrowing from snowboarding and skateboarding lifestyle and culture, Colin McRae: DiRT 2 will also add full online multiplayer functions to extend the gaming experience and build a thriving community.\n\n? Huge Variety of Race Styles and Formats\n? Features intense solo races and frantic multi-car events with up to 12 individually style cars in each race.\n? 100+ off-road racing events including rally, rallycross, raid and trailblazer\n? Players are no longer constrained to traditional rally racing as the game boasts a roster of contemporary off-road events\n\n? Intense Real-World Environments\n? DiRT 2 boasts 9 varied real-world locations throughout the game to create a virtual DiRT World Tour with cultural styling and brands to make each location unique\n? Players will travel the globe in an RV that will aesthetically improve as players progress in the world tour\n? Up to 120,000 spectators per track to bring the locations to life\n\n? Award-Winning Technology\n? DiRT2 is powered by the third generation of the EGO Engine racing technology\n? Updated car-handling physics system and damage engine effects\n? Unprecedented visual fidelity with cars and tracks twice as detailed as seen in GRID\n\n? Full Online Functionality\n? Supports full online multiplayer across all racing genres\n? Features head-to-head competitive online play and new social features to further engage the racing community\n? Online tournaments and downloadable content keep the player engaged in the DiRT experience\n\nProduct Description\nColin McRae: DiRT 2 will take players on a World Tour of adrenaline-fuelled extreme off-road events in stunning real-world locations.\n\n\n\n\n\n\nDiRT 2\n(c) Codemasters\n\nRelease date: 09/07/09 Source: DVD9\nPlatform: Xbox360 Region: FREE\nGenre: Racing Files: *x100mb \n\n\n\n\n\n\n\nDirt 2 Review Is the king of rally still fit to wear the crown? by Hilary Goldstein US, September 3, 2009 - The Colin McRae series has long been considered king of rally racers. With Dirt 2, Codemasters pays fitting homage to the late McRae while trying to appeal to a larger audience. The result is a gorgeous racing game with some satisfying rally sections and a whole lot of wheel-to-wheel racing. While hardcore rally fans may be a bit bummed to find pure rally racing makes up only a fifth of the Career Mode, those who just want a good racing game will be happy. The original Dirt, released in 2007, has one of the best menu designs of all time. It-s truly a stunning piece of art, just on the frontend alone. Dirt 2 has an equally impressive interface that puts you into a RV that you (somehow) drive across the world. Everything you could want is in and around this trailer -- from a world map used to select from 100 different racing events to the multiplayer board on the wall to a TV that shows off instructional videos. Step outside your trailer and you get a look at the festival-like surroundings for each locale and can buy and customize new cars or see the latest tournament results. It-s an immersive experience and is in many ways better than the first Dirt. The core of Dirt 2 is the Career Mode, which starts you as an up-and-coming racer and builds you into a champion. Each race earns you experience points, which in turn increases your driver-s level. Through Level 30 you gain new liveries, unlock new races and earn some lovely parting gifts. These include dashboard items such as a hula girl and fuzzy dice to hang from your rearview mirror. Xbox 360 owners get a special bonus of unlocking their Avatar to dangle from their interior. Rewards are always welcome and Dirt 2 makes certain to spoil you early and often.\nDirt 2 Xbox360\n &lt;a href=&quot;\nhttp://www.CineTT.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.CineTT.com&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b5f77a0197c646aa3bb86089c035eca9b48b21d0","amp;dn":"DiRT_2_XBOX360-%5BESPACONSOLAS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5f77a0197c646aa3bb86089c035eca9b48b21d0","infoHashBuffer":{"type":"Buffer","data":[181,247,122,1,151,198,70,170,59,184,96,137,192,53,236,169,180,139,33,208]},"announce":[],"urlList":[]}}