{"title":"Blade: Trinity(2004) DVD-R NTSC (WS) (hjsn1)","uid":5133368,"size":4688529408,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b6ccc999dbaeaf528bb43a696e8ea83e1da6d3d8&amp;dn=Blade%3A+Trinity%282004%29+DVD-R+NTSC+%28WS%29+%28hjsn1%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hjsn1","files":15,"time":1256315728,"description":"@@@ @@@@@@ @@@@@@ @@@@@@ @@@ @@@ \n@@@ @@@@@@@@ @@@@@@@ @@@@@@@@ @@@@ @@@ \n@@! @@! @@@ !@@ @@! @@@ @@!@!@@@ \n!@! !@! @!@ !@! !@! @!@ !@!!@!@! \n!!@ @!@!@!@! !!@@!! @!@ !@! @!@ !!@! \n!!! !!!@!!!! !!@!!! !@! !!! !@! !!!\n!!: !!: !!! !:! !!: !!! !!: !!! \n!!: :!: :!: !:! !:! :!: !:! :!: !:! \n::: : :: :: ::: :::: :: ::::: :: :: :: \n: ::: : : : :: : : : : : :: : \n\n\n\nMovie Information &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0359013/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0359013/&lt;/a&gt;\n\nWesley Snipes returns as legendary vampire hunter Blade in this, the third film inspired by the popular Marvel Comics character. A fearless warrior immune to vampires, Blade (Snipes) has become a hated enemy of the bloodsucking community, and as they gather in their desert compound, a group of vampires is plotting to eliminate Blade once and for all by turning the mortal community against him. The vampires have concocted a misinformation campaign that paints a picture of Blade as a ruthless murderer and has sent the FBI on the vampire hunter's trail, led by the relentless agent Cumberland (James Remar). At the same time, the vampires have brought their founding father, Dracula, back to his undead state, renaming him Drake (Dominic Purcell) and investing him with special powers that allow him to walk unharmed in daylight. After a dangerous encounter with Cumberland, Blade and his ally, Whistler (Kris Kristofferson), form an uneasy alliance with a scruffy team of human vampire slayers, the Nighstalkers, led by Hannibal King (Ryan Reynolds), and Whistler's daughter, Abigail (Jessica Biel. While Sommerfield (Natasha Lyonne), a biologist working with the Nightstalkers, researches a scientific answer to the vampire problem, Blade and his comrades take a more hands-on approach against Drake and his minions, including Danica Talos (Parker Posey), Asher (Callum Keith Rennie), and Grimwood (Triple H). Blade: Trinity was directed by David Goyer, who also wrote the screenplay for this film, as well as the first two movies in the series.\n\n\n\nMpaa Rating++++++++++\n\nRated R for strong pervasive violence and language, and some sexual content.\n\n\nRetail Release Date++++++++\n\n8 December 2004\n\nDVD Content++++++++++\n\n\nMain Movie+++++++++++++++\n+Video- CCE Encoded - 5 passes\n+Audio-English\n+Subs-English, Spanish\n\n\nMenu+++++++\n+Yes \n\nExtras/Special Features+++++\n+Yes\n\nRemoved++++++++++++++\nFBI crap and trailers and all of the other annoying and useless stuff.\n\n\n\nChapters++++++++++++++\n\nN/A\n\n\nUploader Info ***: Thank you for choosing my release from others that are available on the internet already. I wanted to ask a small favor. After you have completely downloaded my release, please return back where you downloaded the movie and leave a comment. Let me know how the movie quality is &amp; give others who are going to be downloading my release better information about the upload. I actually do check the comments and I try to respond as much as possible.\nAlso DO NOT COMMENT OR PRIVATE MESSAGE asking me to upload a movie that is going to be released on DVD in the upcoming week or month. Feel free to comment and leave requests for older movies or movies that have been out for a while. I am going to upload movies that I feel people will enjoy so if you have a movie you want me to upload that I haven't done yet, comment and i'll check it. Upload information is available to you @ torrentbucket.info. I am helping djfred keep up with you guys. The site is updated almost every week. He has movies listed on the site for up to a month in advance. If you truly love this DVD, do actually buy and support the producers, writers, actors who made this movie possible. Thank You [J] \n\n\n\n\nLinks ***********: Here are many of djfreds tutorials, Enjoy. \n\n**DVD Ripping (how to: advanced) \n\n**Rip DVD9 to DVD5 with CloneDVD2 \n\n**Rip with DVDShrink \n\n**Burn Video_TS files with NERO \n\n**Watch DVD Files with VLC Player \n\nLet him know how you like his tutorials! http://torrentbucket.com/\n\nDVD Release Dates. http://torrentbucket.com/ \n\nFor Mac Users who cant burn &amp; get CSS Error http://forum.videohelp.com/topic340322.html\n\n\nPEOPLE WHO DOWNLOAD TORRENTS FROM DJFRED AND MYSELF, PLEASE SEED EVEN AFTER THEY ARE DONE DOWNLOADING. THAT WAY WE WILL BE ABLE TO GET MORE MOVIES UP. WHO KNOWS, THE NEXT ONE WE PUT UP MIGHT BE A REQUEST OF YOURS.","torrent":{"xt":"urn:btih:b6ccc999dbaeaf528bb43a696e8ea83e1da6d3d8","amp;dn":"Blade%3A+Trinity%282004%29+DVD-R+NTSC+%28WS%29+%28hjsn1%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6ccc999dbaeaf528bb43a696e8ea83e1da6d3d8","infoHashBuffer":{"type":"Buffer","data":[182,204,201,153,219,174,175,82,139,180,58,105,110,142,168,62,29,166,211,216]},"announce":[],"urlList":[]}}