{"title":"Atom Ant","uid":5062422,"size":744560210,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b6eaf727ee4b39d4bebcb65cb5370a62779bdc70&amp;dn=Atom+Ant&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Brianinmd","files":-1,"time":1250768529,"description":"Atom Ant is a cartoon ant and superhero, created by Hanna-Barbera in 1965. His name may have been derived from adamant, which gives indication towards his great strength, exceeding &quot;250 times his own weight&quot;. The name and character might also be a gentle parody of the Charlton Comics character, Captain Atom.[citation needed] Atom costarred in The Atom Ant/Secret Squirrel Show (sharing top billing with Secret Squirrel). In syndication, Atom Ant aired alongside Precious Pupp and The Hillbilly Bears.\n\nAtom Ant (voiced by the late Howard Morris then by Don Messick in later episodes) operated out of an anthill in the countryside, where he possessed such things as a mainframe computer and exercise equipment. His powers mostly consisted of the ability to fly, superspeed, and amazing strength.\n\nHe was often contacted by the police, who sent him out on assignment. Some of these missions parodied those of Batman. In one episode, the police force was shown to be underfunded and inept, as they relied on Atom Ant to do all their police work. The only two police officers were the chief and deputy chief. The department only possessed one rusted patrol car. Atom Ant fights various villians including recurring ones like Ferocious Flea (voiced by Don Messick) and mad scientist Professor Von Gimmick.\n\n","torrent":{"xt":"urn:btih:b6eaf727ee4b39d4bebcb65cb5370a62779bdc70","amp;dn":"Atom+Ant","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6eaf727ee4b39d4bebcb65cb5370a62779bdc70","infoHashBuffer":{"type":"Buffer","data":[182,234,247,39,238,75,57,212,190,188,182,92,181,55,10,98,119,155,220,112]},"announce":[],"urlList":[]}}