{"title":"ORPHAN.2009.DVDrip[vice]","uid":5128822,"size":592165790,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b77c967cbd5e2c3c055274764ba3b407b75eddbb&amp;dn=ORPHAN.2009.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vicerock","files":-1,"time":1255965825,"description":"ORPHAN 2009 DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x272[wide screen]\nruntime 122:16mins\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCast\n\n* Vera Farmiga as Katherine &quot;Kate&quot; Coleman\n* Peter Sarsgaard as John Coleman\n* Isabelle Fuhrman as Esther/Leena Klammer\n* CCH Pounder as Sister Abigail\n* Jimmy Bennett as Daniel Coleman\n* Aryana Engineer as Maxine &quot;Max&quot; Coleman\n* Margo Martindale as Dr. Browning\n* Karel Roden as Dr. VÃƒÂ¤rava\n* Rosemary Dunsmore as Grandma Barbara\n* Genelle Williams as Sister Judith\n*\n\nPlot\n\nKate (Vera Farmiga) and John Coleman (Peter Sarsgaard) are experiencing strains in their marriage after Kate's third child was stillborn. The loss is particularly hard on Kate, who is still recovering from a drinking habit that cost her her job. While visiting the local orphanage, they decide to adopt Esther (Isabelle Fuhrman), a nine-year-old Russian girl. While Kate and John's daughter Max (Aryana Engineer), who is deaf and communicates with sign language, embraces Esther almost immediately, their son Daniel (Jimmy Bennett) is somewhat less welcoming.\n\nKate grows suspicious when Esther, who watched Kate and John have sex, expresses far more knowledge of sex and its slang than would be expected for a child her age. Not long after Esther arrives, she pushes a schoolmate who had picked on her off a playground slide, breaking her ankle. Max saw Esther shove the girl, but covers for Esther by saying that the girl slipped.\n\nAt dinner Daniel is mad and annoyed at Esther even saying &quot;she's not my f***ing sister.&quot;\n\nKate is further alarmed when Sister Abigail (CCH Pounder), the head of the orphanage, warns her and John about Esther's tendency to be around when things go wrong. Esther overhears this and later kills Sister Abigail by bludgeoning her with a hammer. She forces Max to help her hide the body and the hammer. Daniel sees Esther and Max descending from his treehouse from behind a rock, not knowing they hid the hammer there. Later that night, Esther threatens Daniel with genital mutilation if he tells anyone what he saw.\n\nKate is told that the Russian orphanage Esther came from has no record of her ever being there. However, John does not believe her, despite continued ominous behavior by Esther. At one point, Esther breaks her own arm in John's vise and convinces John that Kate broke it. On Esther's first day back at school, she slips Kate's SUV into neutral, nearly killing Max. Badly shaken, Kate buys two bottles of wine, but at the last minute pours one of them down the drain and leaves the other full.\n\nKate learns that Esther was housed at a mental institution in Estonia called the Saarne Institute, but when she expresses misgivings to John, he and her counselor think that Kate is relapsing into her drinking habit. After John produces the other bottle Kate bought the night before, he threatens to leave her unless she gets help.\n\nDaniel learns of the hammer from Max and decides to get it and go to the police. However, Esther sets the treehouse on fire, intending to get rid of the evidence and kill Daniel. Daniel escapes by falling out of the tree, severely injuring his neck and knocking him unconscious. Esther tries to finish him off by smashing a brick over his head, but Max shoves her out of the way just in time. Esther again tries to kill him at the hospital by smothering him with a pillow and unhooking his respirator. Doctors rush into the room and barely manage to save Daniel. Outside, Kate angrily knocks Esther down, calling her a bitch, and is sedated by doctors.\n\nThat night, Esther tries to seduce a drunk John. John realizes Kate was telling the truth all along and threatens to call the orphanage.\n\nAs Kate is coming out of sedation, she gets a call from the Saarne Institute's director, Dr. VÃƒÂ¤rava (Karel Roden), who reveals that Esther isn't a nine-year-old girl at all, but a thirty-three-year-old woman named Leena Klammer. She has hypopituitarism, a disorder that stunted her physical growth and has spent most of her life posing as a little girl (it is revealed to the audience when Esther/Leena sheds her child's clothes, that she has scars on her neck and wrists, from being bound in restraints, and also has fully developed breasts).\n\nThe doctor tells Kate that Leena is dangerously psychotic, and warns her to protect her family. While at home, Esther/Leena stabs and kills John with a knife. Max witnesses this and hides in her laundry hamper. Kate rushes home, where Leena shoots her in the arm while searching for Max. When Kate is shot, the glass of the green house that she is standing on shatters, causing her and sharp glass to fall, crushing Leena.\n\nKate takes Max and runs away from the house. When the cops arrive, Leena's body disappears. Leena runs after Kate, trying to kill her and Max with a gun. Their chase takes them to a frozen pond, where Kate and Leena struggle. Max grabs Leena's gun trying to shoot her, but misses causing the ice to shatter. Leena and Kate fall into the freezing water. Kate crawls out of the hole, followed by Leena, who begs for her life, addressing Kate as &quot;mommy&quot; while hiding a knife behind her back. Kate yells, I'm not your fucking mommy!&quot; and kicks Leena in the face, breaking her neck and sending her flying back into the pond to drown &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1148204/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1148204/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS","torrent":{"xt":"urn:btih:b77c967cbd5e2c3c055274764ba3b407b75eddbb","amp;dn":"ORPHAN.2009.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b77c967cbd5e2c3c055274764ba3b407b75eddbb","infoHashBuffer":{"type":"Buffer","data":[183,124,150,124,189,94,44,60,5,82,116,118,75,163,180,7,183,94,221,187]},"announce":[],"urlList":[]}}