{"title":"Keel - The Right To Rock","uid":5136601,"size":175077380,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b7aeec3995a22d2aff1fda9c8898c690c60af941&amp;dn=Keel+-+The+Right+To+Rock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":1,"time":1256538025,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nKeel is an American heavy metal band founded in 1984 in Los Angeles, California. They were known for their rock anthem &quot;The Right to Rock.&quot; The band was active until 1989, with a brief reunion in 1998. Keel reunited in 2008 and is currently touring for their 25th anniversary.\n\nThe Right to Rock is the second studio album by heavy metal band Keel. It was the first to be produced by Kiss's Gene Simmons under their new label Gold Mountain Records (which was distributed by A&amp;M Records at the time). When the band started recording the album, drummer Bobby Marks left. He was replaced by different drummers: Fred Coury (who went on to join Cinderella), Barry Brandt (of Angel) and Steve Riley (who subsequently left to join the band W.A.S.P.). Dwain Miller eventually became the band's permanent drummer before the album was released.\n\nIn 1998, members of Keel got together to release their sixth album Keel VI: Back in Action. It mainly consisted of unreleased material from their previous albums, including the aforementioned &quot;Proud To Be Loud&quot;.\n\nThe band's song &quot;Speed Demon&quot; (from The Right to Rock) is briefly heard on the 2002 movie Men in Black II, and appears on Mike Varney's U.S. Metal Vol. IV compilation.\n\nRon Keel has pursued numerous musical projects since Keel's disbandment. In the mid-1990s, he played Country music under the name &quot;Ronnie Lee Keel&quot; before forming the country metal band IronHorse in 2001. In 2006, Ron left IronHorse and formed K2 Featuring Ron Keel a year later.\n\nOn November 2008, Keel reunited in time to celebrate the band's 25th anniversary. All the members from The Right to Rock era have rejoined except for Chaisson. The new bassist is Ron Keel's longtime friend, Geno Arce. Their first reunion show was held in Hollywood, CA, on January 31, 2009. They were to release a new album this summer but it never happened. In addition, the band will be playing at the third annual Rocklahoma festival on July 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:b7aeec3995a22d2aff1fda9c8898c690c60af941","amp;dn":"Keel+-+The+Right+To+Rock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7aeec3995a22d2aff1fda9c8898c690c60af941","infoHashBuffer":{"type":"Buffer","data":[183,174,236,57,149,162,45,42,255,31,218,156,136,152,198,144,198,10,249,65]},"announce":[],"urlList":[]}}