{"title":"Soul Calibur IV Broken Destiny [EUR] [PSP][ojuegos.eu]","uid":5076521,"size":359373243,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:b7d8872af29f9a9119a0fd0f67d27153937c5d58&amp;dn=Soul+Calibur+IV+Broken+Destiny+%5BEUR%5D+%5BPSP%5D%5Bojuegos.eu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Morck22","files":20,"time":1251851447,"description":"Soulcalibur: Broken Destiny es la ÃƒÂºltima entrega de la serie Soulcalibur, el primer juego de lucha uno contra otro basado en las armas.\nBroken Destiny es el primer lanzamiento de la serie para el sistema PSP y es la primera entrega portÃƒÂ¡til de Soulcalibur.\nLos robustos y desafiantes modos de un solo jugador, los enfrentamientos multijugador cara a cara y unos grÃƒÂ¡ficos impactantes lo convierten en indispensable para cualquier entusiasta de los juegos de lucha.\n\nCaracterÃƒÂ­sticas:\nGran variedad de personajes: Lucha con tus personajes favoritos de la saga SoulCalibur o disfruta de los nuevos personajes que incluyen un invitado especial de lujo.\nExcitantes modos de juego: AtrÃƒÂ©vete con el nuevo modo individual desarrollado exclusivamente para PSP y los modos clÃƒÂ¡sicos del juego como Arcade, Versus o Supervivencia.\nPotentes batallas: Acaba con tus rivales usando tÃƒÂ©cnicas de batalla como el final crÃƒÂ­tico, la destrucciÃƒÂ³n del equipo, el destrozo del alma y el sistema de combos.\nPersonalizaciÃƒÂ³n ilimitada de los personajes: Crea a tu propio personaje con la herramienta de ediciÃƒÂ³n de personajes mÃƒÂ¡s potente de toda la saga Soulcalibur.\nParticipa en la competiciÃƒÂ³n definitiva: EnfrÃƒÂ©ntate a la IA de la consola o compite contra tus amigos en el modo Versus.\nUna herramienta de entrenamiento definitiva: Mejora tus habilidades en mÃƒÂ¡s de 100 ejercicios o practica en los modos Entrenamiento y Supervivencia.","torrent":{"xt":"urn:btih:b7d8872af29f9a9119a0fd0f67d27153937c5d58","amp;dn":"Soul+Calibur+IV+Broken+Destiny+%5BEUR%5D+%5BPSP%5D%5Bojuegos.eu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7d8872af29f9a9119a0fd0f67d27153937c5d58","infoHashBuffer":{"type":"Buffer","data":[183,216,135,42,242,159,154,145,25,160,253,15,103,210,113,83,147,124,93,88]},"announce":[],"urlList":[]}}