{"title":"Judas Priest - Judas Rising","uid":5089411,"size":157298692,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b8014544e8d1effc03944524aaf2f246cd6d7704&amp;dn=Judas+Priest+-+Judas+Rising&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1253013963,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Judas Rising&quot; is a song by heavy metal band Judas Priest. It is the opening track on the band's 2005 album Angel of Retribution. The song is about the Judas Priest Messiah on the cover of the albums Sad Wings of Destiny, Painkiller and Angel of Retribution.\n\nAccording to Rob Halford:\n\n&quot;'Judas Rising' is not really a statement of intent, no. I just like that expression. But it could be taken in both contexts. To me it's about the angel coming out of that SAD WINGS OF DESTINY artwork environment, where it was a very despondent, very doomy type of oppressive world, and now suddenly it's back in its full majesty and glory and it's overcome the odds and it's full of optimism and energy.&quot;\n\nIt was well received by fans, and has been regularly played live since the album's release.\n\nAngel of Retribution is the 15th studio album by British heavy metal band Judas Priest, released in 2005. It marks the return of Rob Halford, after a 12 year departure from the band. The album debuted at #13 on the U.S. Billboard chart, what makes it the second highest chart of a Judas Priest album (only before Nostradamus). It also marked the first time Judas Priest have been the number 1 artist on a national chart (in Greece). The album was produced by Roy Z, who co-wrote the song &quot;Deal with the Devil&quot;.\n\nWithin the lyrics of the album, several references to past albums and songs are to found, as a way of showing that Priest has not forgotten where they came from. The song &quot;Demonizer&quot; references both &quot;The Hellion&quot; from Screaming for Vengeance as well as &quot;Painkiller&quot; from the eponymous album. &quot;Hellrider&quot; mentions both &quot;Ram It Down&quot; off the same-titled album, and &quot;Tyrant&quot; from Sad Wings of Destiny. &quot;Eulogy&quot; references &quot;Stained Class&quot; and &quot;The Sentinel&quot; from the albums &quot;Stained Class&quot; and &quot;Defenders of the Faith&quot;, respectively. The song &quot;Deal With the Devil&quot; can be viewed as a biography of Judas Priest, telling their origins from the Black Country of England's West Midlands, mentioning their transitory days gigging around England and practicing at the Church of Holy Joseph in Walsall, which is where Judas Priest was effectively born.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:b8014544e8d1effc03944524aaf2f246cd6d7704","amp;dn":"Judas+Priest+-+Judas+Rising","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8014544e8d1effc03944524aaf2f246cd6d7704","infoHashBuffer":{"type":"Buffer","data":[184,1,69,68,232,209,239,252,3,148,69,36,170,242,242,70,205,109,119,4]},"announce":[],"urlList":[]}}