{"title":"The Godfather - Original 1967 Version","uid":5515520,"size":860252289,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b92ea35833919e4793a64a6e9f896e22847fe2c8&amp;dn=The+Godfather+-+Original+1967+Version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"210015allan","files":-1,"time":1272233995,"description":"Watch The Rare Original version of the Godfather. This story is about a Young boy Named Vito Corleone. His family was killed by a mad man in Italy named Don, Ciccio. He Killed Vito's Father because he wouldn't give in. Then he Killed Vito's Older Brother Paolo Corleone because he swore Revenge, and then he killed Vito's Mother who refused to surrender Vito over to him. Vito then ran away and got sneaked on a ship to America in New york. Where he got married , and had a baby boy. He became friends with a guy who works in a grocery store with his father. And Vito also got a job their. But his friend wanted to take him to a show to see this girl on stage. And try to go backstage and ask her out to dinner. But they run into a powerful man known as the Black Hand. His name is Don Fanucci who is the town's most powerful gang leader. He later brings his nephew into the grocery store where Vito works and forced the owner to replace Vito for his nephew. And later Vito and his friends got caught up in some money trouble with Don Fanucci who says they have to pay him $600. But Vito discusses with everyone saying their only going to pay him $100 instead. Which everybody thought Vito was crazy. But Vito said he would straighten it out and get him to accept the $100 which he does. Then latter sneaks up on him outside his apartment room and wackes him. Making Vito Corleone the new big guy in the Streets of New York. Naming him The Godfather. And he would straighten out people's problems and making them right. Vito later takes a trip back to Italy to pay a surprising visit to Don Ciccio who originally wiped out his whole family when he was little. And gives him a surprise in return which was a knife in the stomach. Then Vito later runs away never seen in Italy again. He goes back to America where he buys this big mansion where him and his family will live forever. That is mostly the story of this movie. This is the Original Story of the Godfather and how he became a legend. Enjoy!\n\n\nType: WMV\n\nTitle: The Godfather\n\nYear: 1967\n\nColor: Black &amp; White\n\nGenre: Crime, Action, Drama\n\nQuality: Good, DVD quality. \n\nLanguage: Italian\n\nSubtitle Language: English\n\nLength: 01:01:39\n\n\nThis is The Classic Original version of the Godfather. This Started the Whole series. Enjoy! Let me know what u think. \n\n\n\n\nAND PLEASE SEED! SO OTHERS CAN DOWNLOAD!!!!!!\n\n\nTHANKS! Allan\n\n","torrent":{"xt":"urn:btih:b92ea35833919e4793a64a6e9f896e22847fe2c8","amp;dn":"The+Godfather+-+Original+1967+Version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b92ea35833919e4793a64a6e9f896e22847fe2c8","infoHashBuffer":{"type":"Buffer","data":[185,46,163,88,51,145,158,71,147,166,74,110,159,137,110,34,132,127,226,200]},"announce":[],"urlList":[]}}