{"title":"Octopus (La Piovra - Season 3 - Disk 3) - 2Lions-Team","uid":5513084,"size":4681892876,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:bbfccdec30a443c4c45d32784ede1f65b6a9ae0f&amp;dn=Octopus+%28La+Piovra+-+Season+3+-+Disk+3%29+-+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"SAIMOR","files":-1,"time":1272143193,"description":"Italie / Misdaad\nRelease Datum 1987\n3 DVD`s / Speelduur 435:00 minuten\n\nRegisseur: Damiano Damiani \nmet Gedeon Burkhard, Mario Adorf, Martin Balsam, Michele Placido, Patricia Millardet, Raoul Bova, Florinda Bolkan, Flavio Bucci, Simona Cavallari, Vittorio Mezzogiorno \n\nBeschrijving:\n\nNadat zijn vrouw en dochter door de maffia zijn vermoord, heeft inspecteur Corrado Cattani (Michele Placido) zich als een verbitterd en gebroken man teruggetrokken uit het onderzoek tegen de georganiseerde misdaad. \nMet de geestelijke hulp van een monnik hervindt Cattani stapsgewijs de moed en gedrevenheid om de strijd te hervatten. \nZijn nieuwe onderzoek leidt naar de machtige bankiersfamilie Antinari die betrokken is bij wapenhandel. \nTerwijl hij dieper in de zaak duikt, krijgt Cattani sterke gevoelens voor Giulia, de dochter van bankier Carlo Antinari. \nNa een harde strijd weet Cattani de maffia een harde slag toe te brengen. Maar voor zijn succes zal hij een vreselijke prijs betalen...\nHet derde deel van het grandioze Italiaanse maffia-epos Octopus met wederom een glansrol voor Michele Placido en prachtige muziek van Ennio Morricone!\n\n\nCategorie:  Beeld  \nBron:       DVD\nTaal:       Italiaans\nOndertitels:Nederlands\nAudio:      Dolby Digital 2.0\n\n****************************************************************************\nItaly / Crime \nRelease Date 1987 \n3 DVD `s / Playing time 435:00 minutes \n\nDirector: Damiano Damiani \nwith Gedeon Burkhard in, Mario Adorf, Martin Balsam, Michele Placido, Patricia Millardet, Raoul Bova, Florinda Bolkan, Flavio Bucci, Simona Cavallari, Vittorio Mezzogiorno \n\nDescription: \n\nAfter his wife and daughter were murdered by the Mafia, has Inspector Corrado Cattani (Michele Placido) is a bitter and broken man, removed from the investigation against organized crime. \nWith the help of a spiritual monk Cattani gradually regains the courage and passion to the fight to resume. \nHis new research leads to the powerful banking family Antinari involved in arms trafficking. \nAs he dives deeper into the case, Cattani get strong feelings for Giulia, the daughter of banker Carlo Antinari. \nAfter a hard fight Cattani know the Mafia a hard blow to. But his success he will pay a terrible price ... \nThe third part of the grandiose Italian mafia epic Octopus with again a star role for Michele Placido and wonderful music by Ennio Morricone! \n\n\nCategory: Image \nSource:   DVD \nLanguage: Italian \nSubtitles:Dutch \nAudio:    Dolby Digital 2.0\n\n*****************************************************************************\nBrought to you by \nROMIAS\n2Lions Team \n\nmeer zien?? \nKom dan eens kijken op ons forum \n    &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n2Lions-Team for all your Dutch MOVIES and more \n\n****************************************************************************** \nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding.\n\n******************************************************************************\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n*******************************************************************************\t\n \n \n \n","torrent":{"xt":"urn:btih:bbfccdec30a443c4c45d32784ede1f65b6a9ae0f","amp;dn":"Octopus+%28La+Piovra+-+Season+3+-+Disk+3%29+-+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbfccdec30a443c4c45d32784ede1f65b6a9ae0f","infoHashBuffer":{"type":"Buffer","data":[187,252,205,236,48,164,67,196,196,93,50,120,78,222,31,101,182,169,174,15]},"announce":[],"urlList":[]}}