{"title":"What If?   -  Volume 2","uid":5038347,"size":130071229,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bcd8b61c3f04e2379fb3600c6dc7a1e68ada4664&amp;dn=What+If%3F+++-++Volume+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eddie1969","files":7,"time":1249242676,"description":"Audio Books : Literary : Other quality : English\n \n\n\nWHAT IF? No. 2\n\nBy Various Authors: James Bradley, Caleb Carr, Thomas Fleming, etc.\n\nEdited by Robert Cowley\n\n\n\n\nMany armchair historians have spent hours daydreaming of what might have been if some turning point in history had gone another way. The appeal of the What If? books is that editor Robert Cowley gets professional historians to concentrate on these imaginative questions. \n\nThe first volume focused entirely on military matters; What If? 2 leans heavily but not exclusively in that direction. Victor Davis Hanson wonders about the consequences for Western philosophy if Socrates had died in battle, Thomas Fleming ponders a Napoleonic invasion of North America, and Caleb Carr argues the Second World War lasted longer than it should have because George Patton's superiors restrained their energetic general. \n\nMore than two dozen contributors offer bold speculation: If the Chinese had committed themselves to ocean exploration, asks Theodore F. Cook Jr., might they have discovered the New World and even prevented &quot;the worst horrors of the Atlantic Slave Trade [by halting] Portuguese expansion along the African coast at this early date?&quot; Other times they are pleasantly modest: In one of the book's best sections, John Lukacs describes the fantasy of Teddy Roosevelt defeating Woodrow Wilson in the 1912 election - and decides the long-term effects would not have been great. Like its predecessor, What If? 2 is delicious mind candy for readers willing to believe there's nothing inevitable about what has come before us.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:bcd8b61c3f04e2379fb3600c6dc7a1e68ada4664","amp;dn":"What+If%3F+++-++Volume+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcd8b61c3f04e2379fb3600c6dc7a1e68ada4664","infoHashBuffer":{"type":"Buffer","data":[188,216,182,28,63,4,226,55,159,179,96,12,109,199,161,230,138,218,70,100]},"announce":[],"urlList":[]}}