{"title":"Steel Panther - Community Property","uid":5080162,"size":128212996,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bcf2a22ac41615662a9cf61b9e27bd6cef833ea1&amp;dn=Steel+Panther+-+Community+Property&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":-1,"time":1252230243,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nThis video is not the Explicit version.\n\n\n\nSteel Panther (formerly known as Danger Kitty, Metal Shop and Metal Skool), is a Los Angeles, California parody glam metal band.\n\nOriginally formed as Metal Shop, they have the longest running heavy metal show on the Sunset Strip. Onstage, the band both pays tribute to and lampoons the heyday of 80's glam metal. The band's between-song comedy includes jests at conflict between band members, discussions of drugs, sex, and improvised humor with the crowd.\n\nThe band members have all adopted pseudonyms in the spirit of the bands they imitate. Their line up is billed as: drummer &quot;Stix Zadinia&quot; (real name Darren Leader), guitarist &quot;Satchel&quot; (real name Russ Parrish), singer &quot;Michael Starr,&quot; (real name Ralph Saenz) and bassist &quot;Lexxi Foxxx&quot; (real name Travis Haley).\n\nFeel the Steel is the second album by American glam metal band Steel Panther and their debut major label release. The tracks Fat Girl, Stripper Girl and Hell's On Fire are re-recordings from the 2003 debut album Hole Patrol whilst Death To All But Metal is a re-recording from their 2004 contribution to the Metal Sludge compilation Hey That's What I Call Sludge! Vol. 1. Unlike the debut album and their Metal Sludge compilation tracks, Feel The Steel is composed entirely of music, lacking any spoken word comedy skits present on earlier releases.\n\nThe CD is currently out in the UK, and is scheduled to be released in North America on October 6.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:bcf2a22ac41615662a9cf61b9e27bd6cef833ea1","amp;dn":"Steel+Panther+-+Community+Property","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcf2a22ac41615662a9cf61b9e27bd6cef833ea1","infoHashBuffer":{"type":"Buffer","data":[188,242,162,42,196,22,21,102,42,156,246,27,158,39,189,108,239,131,62,161]},"announce":[],"urlList":[]}}