{"title":"Videocharge.Studio.v2.6.2.624","uid":5660576,"size":30476333,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bd00b76f72836b9566b53a6522c2f0bdd734be80&amp;dn=Videocharge.Studio.v2.6.2.624&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"niggonometry101","files":3,"time":1277959109,"description":"Videocharge Studio is a video editing software which is intended for those users who regularly work with video, create Internet video galleries, convert video files. Videocharge Studio includes all features for video editing: video converting, splitting video into parts, joining several video files into a single one, adding watermark on video or image (add logo to video or photo), embedding image into video file, creating video from several images, editing audio. Videocharge Studio can edit video without reencoding as well. Videocharge Studio supports all existing video formats and can edit DVD or VOB files. It allows you to work via command line interpreter, extracts frames from video, creates thumbnail for video (for torrent video as well), sets metadata. The application supports a batch processing for editing a lot of files, can process all files in a folder, blur some area on the frame of video and remove watermarks from video.\n\nWith the help of VideoCharge Studio you can do the following:\n\nMain\n. Convert a video, change video or audio stream parameters.\n. Convert an image, change image file format, parameters.\n. Convert a video avoiding changing file format. Using it, file of the same format will be created keeping video and audio settings.\n. Edit video without reencoding. This allows you to save 100% of video quality and edit video file very quickly.\n. Changing of file format without reencoding. For example, a quickly way to create FLV video from MKV video file.\n. Edit video files of all main formats, including work with DVD and VOB files.\n. Work with directory of files. Batch processing.\n. Create several video files of different formats or with different parameters on the base of one original file for one generation.\n. Extract frames from the video files and save them as image. You can create several images of different formats on the base of one frame.\n. Convert a video file and create thumbnail for it all at once.\n. Create thumbnail for a torrent video file: a image which contains several frames from the video file organized as a table with added file's metadata: its size, duration, name, etc.\n. Set filename and directory for created files using templates. It allows user to use formatting while creating file names.\n. Create video of high quality using double pass coding.\n. Create one video clip and several thumbnails for it from well distributed frames. For example, you can create a video clip of 1 minute duration and six thumbnails from the following frames: 1, 10s,., 60s.\n. Set metadata for video files. You can set metadata without reencoding too.\n\nWatermarking\n. Add watermarks on a frame of the video file or in the graphic file.\n. Set the period of time when a watermark will be show in the video. Watermark can be showed one time at a specified place in the video file, several times with specified display time and delay between displays, randomly or using SRT file: this is a file which contains information about display time, text, and the end time of watermark show.\n. Set smooth watermark appearance/disappearance (Fade In/Fade Out).\n. Add subtitles from SRT file directly to the video file.\n. Draw DVD subtitles directly to the video file.\n. Move a watermark throughout the frame while video playing.\n. Manually record watermark moving throughout the frame: you can preliminary review video file and save watermark motion path.\n. Apply effects to the watermarks: shadow effect, embossment, skew, scale and so on.\n. Set color of a text watermark.\n. Add several watermarks all at once.\n. Text for the text watermark can be taken out from a text file. If the text file has several lines, they can be displayed gradually with a specified delay or each line will be displayed in a new created file.\n. Set watermark background.\n. Add watermark on the base of Animations of GIF images.\n. Create watermarks instantly. If watermark shouldn't appear while playing the whole file, you can use &quot;Without reencoding&quot; mode. In this case, only those frames which should have drawn watermarks will be decoded/coded. This will increase speed of video file processing.\n. Draw files metadata (name, resolution, date of creation), time, etc. in the video frame.\n. Draw rectangles or ellipses.\n. Duplicate watermarks throughout the whole frame (tile effect).\n\nImage editing:\n. Resize video or image using different algorithm: Bilinear, Bicubic, Lanczos3, Lanczos8.\n. Set aspect ratio for video files.\n. CROP.\n. Apply filters to make better the image, including auto-contrast, auto-level, sharpness, blur video and so on.\n. Solve interlace DVD problem with the help of de-Interlace filter.\n. Blur some part of the image or video. You can blur any moved element in the video too.\n. Remove watermark from the video.\n\nVideo editing:\n. Extract scene out of the video.\n. Split video into several parts by time or according to specified number of parts.\n. Join several video files into a single one.\n. Join several graphic files into a single video file.\n. Audio editing.\n. Apply switches between scenes upon joining video files.\n. Embed video titles or a simple image to the video file.\n. Cut scenes out of the video file.\n\nExtra features for creation of files for WEB:\n. Create WEB sites on the base of your HTML Template and graphic/video files.\n. Create index pages for video galleries.\n. Preliminary view video files and distribute them and their Thumbnails among groups.\n. Upload created files on your FTP server using provided FTP Client.\n\nPreliminary work with files which will be created:\n. Sort created video files by the name, date, randomly or evenly (if created files are grouped by ten elements, they will be sorted as the following: first group will have the first and the last elements, second group - the second and the second to the last elements and so on).\n. Preview files which will be created, delete unnecessary or add additional files: for example, if it is necessary to cut several scenes out of the video file.\n. Distribute created files before generation. Using along with WEB galleries, it is possible to preliminary distribute files among groups as you need.\n. Preview and select the most successful Thumbnails for the video file.\n. Set file coding parameters both for each file separately and for group of files.\n\nInteraction with the software:\n. Solve professional tasks of video edition applying the user interface.\n. Work with the application via the command line.\n. Use Wizard for more convenient work with the application.\n. Protect from unexpected completion of the files processing: it is possible to continue your work from the point of termination","torrent":{"xt":"urn:btih:bd00b76f72836b9566b53a6522c2f0bdd734be80","amp;dn":"Videocharge.Studio.v2.6.2.624","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd00b76f72836b9566b53a6522c2f0bdd734be80","infoHashBuffer":{"type":"Buffer","data":[189,0,183,111,114,131,107,149,102,181,58,101,34,194,240,189,215,52,190,128]},"announce":[],"urlList":[]}}