{"title":"Librivox M4B Audiobook - Underground City by Jules Verne","uid":5518094,"size":33805646,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bd54fe053bd3047d965bed6f2e1704e8a2324ff7&amp;dn=Librivox+M4B+Audiobook+-+Underground+City+by+Jules+Verne&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"VoxRatio","files":-1,"time":1272345309,"description":"Covering a time span of over ten years, this novel follows the fortunes of the mining community of Aberfoyle near Stirling, Scotland. Receiving a letter from an old colleague, mining engineer James Starr sets off for the old Aberfoyle mine, thought to have been mined out ten years earlier. Starr finds mine overman Simon Ford and his family living in a cottage deep inside the mine; he is astonished to find that Ford has made a discovery of the presence of a large vein of coal. Accompanying Simon Ford are his wife, Madge, and adult son, Harry. (Summary by Wikipedia)\n\n\n\nAn M4B file is an audio file which can be bookmarked. This is the audio-book file type. These files can have chapter markers which can be skipped through as you would skip through files on a play list. They can have built in cover art and chapter images. They will remember where you left off each time you stop the file and come back to it . And variable speed settings on Ipods and a growing number of other mp3 players can be utilized by this file type. The ability to bookmark allows for as little as one large file instead of many small ones without the burden of fast forwarding to find your spot every time you resume listening or the fear of otherwise losing your place. The reduced number of files also makes browsing through your files to find your book and your place in it much less effort.\n","torrent":{"xt":"urn:btih:bd54fe053bd3047d965bed6f2e1704e8a2324ff7","amp;dn":"Librivox+M4B+Audiobook+-+Underground+City+by+Jules+Verne","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd54fe053bd3047d965bed6f2e1704e8a2324ff7","infoHashBuffer":{"type":"Buffer","data":[189,84,254,5,59,211,4,125,150,91,237,111,46,23,4,232,162,50,79,247]},"announce":[],"urlList":[]}}