{"title":"Jump The Gun Discography","uid":5044420,"size":38897921,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bdae5cd6ed69ce3f5e3cb35a08943f52a58af96a&amp;dn=Jump+The+Gun+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jumpthegunfl","files":6,"time":1249557153,"description":"free download for you all, give us a go and if you like what you hear pass onto a friend, add our myspace and spread the word! \n\n\n\nJump the Gun was formed in 2008 in Fort Lauderdale,     Florida, and after going through a few line up settled with the current members.Jump The Gun have already built up a reputation as a chaotic live band who put on a great show. We are just people who want to make honest music that has a positive message, play shows with a passion and have an awesome time along the way, so long as its fun we'll still be here. We plan to record an EP for a fall release.\n\n\n\n\n\n\n\n A sextet of young raw talent ready to set fire to the airwaves. Their adrenaline rushing songs would make anyone want to stop what their doing and two-step or at least attempt to. With their eccentric stage presence its hard to just stand still and listen. Their sound is as if Bring Me the Horizon and Underoath combined and had a baby. Their outgoing personalities make them easy to relate to and a band to watch out for. - Coffeestain.com\n","torrent":{"xt":"urn:btih:bdae5cd6ed69ce3f5e3cb35a08943f52a58af96a","amp;dn":"Jump+The+Gun+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdae5cd6ed69ce3f5e3cb35a08943f52a58af96a","infoHashBuffer":{"type":"Buffer","data":[189,174,92,214,237,105,206,63,94,60,179,90,8,148,63,82,165,138,249,106]},"announce":[],"urlList":[]}}