{"title":"Transformers (2007)","uid":5032438,"size":2347288892,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:be872dfb573beb7883d2dda24d2a0acd3b4a5351&amp;dn=Transformers+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Tazman15","files":2,"time":1248969968,"description":"A version Transformers (2007) that is fully compatible with iPod\n\nA long time ago, far away on the planet of Cybertron, a war was being waged between the noble Autobots (led by the wise Optimus Prime) and the devious Decepticons (commanded by the dreaded Megatron) for control over the Allspark, a mystical talisman that would grant unlimited power to whoever possessed it. The Autobots managed to smuggle the Allspark off the planet, but Megatron blasted off in search of it. He eventually tracked it to the planet of Earth (circa 1850), but his reckless desire for power sent him right into the Arctic Ocean, and the sheer cold forced him into a paralyzed state. His body was later found by Captain Archibald Witwicky, and before going into a comatose state Megatron used the last of his energy to engrave a map, showing the location of the Allspark, into the Captain's glasses, and send a transmission to Cybertron. He is then carted away by the Captain's ship. A century later, Sam Witwicky, nicknamed Spike by his friends, buys his first car. To his shock, he discovers it to be Bumblebee, an Autobot in disguise who is to protect Spike, as he bears the Captain's glasses and the map carved on them. But Bumblebee is not the only Transformer to have arrived on Earth - in the desert of Qatar, the Decepticons Blackout and Scorponok attack a U.S. military base, causing the Pentagon to send their special Sector Seven agents to capture all &quot;specimens of this alien race,&quot; and Spike and his girlfriend Mikaela find themselves in the middle of a grand battle between the Autobots and the Decepticons, stretching from Hoover Dam all the way to Los Angeles. Meanwhile, within the depths of Hoover Dam, the cryogenically stored form of Megatron awakens...","torrent":{"xt":"urn:btih:be872dfb573beb7883d2dda24d2a0acd3b4a5351","amp;dn":"Transformers+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be872dfb573beb7883d2dda24d2a0acd3b4a5351","infoHashBuffer":{"type":"Buffer","data":[190,135,45,251,87,59,235,120,131,210,221,162,77,42,10,205,59,74,83,81]},"announce":[],"urlList":[]}}