{"title":"TVO - The Agenda with Steve Paikin - October 20, 2009: Quantum t","uid":5133747,"size":107453307,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:be9170ff0c91f6b396968923576d717e3d6cc656&amp;dn=TVO+-+The+Agenda+with+Steve+Paikin+-+October+20%2C+2009%3A+Quantum+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Temptation","files":1,"time":1256329217,"description":"[b]TVO - The Agenda with Steve Paikin - October 20, 2009: Quantum to Cosmos (Q2C) Festival - Wired 24/7?[/b]\n\nOverwired? Technology and our daily life. Part II of The Agenda at The Quantum 2 Cosmos Festival.\n\n[u]The Debate: Wired 24/7[/u]\n\nWould you be able to survive one day without your television? Computer? your Blackberry? Our grandparents didn't need them. Some of our parents lived without them. And yet these technologies are now an integral part of our lives, for better or for worse. Where will the wired world lead us next? And will we be happy with what we find at that destination?\n\n[u]Guests[/u]\n\n[b]Neil Gershenfeld[/b] is the Director of MIT's Center for Bits and Atoms, and has been named one of Scientific American's 50 leaders in science and technology. He is best known as a pioneer in personal fabrication--small-scale manufacturing enabled by digital technologies, which gives people the tools to build literally anything they can imagine.\n\n[b]Raymond Laflamme[/b] is the Director of the Institute for Quantum Computing (IQC) at the University of Waterloo, and an Associate Faculty memeber at Perimeter Institute. Amongst his most important theoretical results was inventing, with Emmanuel Knill and Gerard Milburn, a radically new approach to Quantum computing using linear optics.\n\n[b]Jaron Lanier[/b] is the author of You Are Not A Gadget and was a pioneer in, and popularized the term, 'Virtual Reality'. His monthly column Jaron's World in Discover magazine is devoted to his own wide ranging ideas and research that include computational approaches to the fundamentals of physics. His current appointments include Interdisciplinary Scholar-in-Residence, CET, UC Berkeley.\n\n[b]Neal Stephenson[/b] is the author of the three-volume epic The Baroque Cycle (Quicksilver, The Confusion, and The System of the World) and the novels Cryptonomicon, The Diamond Age, Snow Crash, and Zodiac. His most recent book is Anathem.\n\n[b]Tara Hunt[/b] is the author of The Whuffie Factor and has spent the past fifteen years living her life online. From the first wave of online marketing as it emerged in the late 90's while in Canada all the way to being a pioneer of new marketing in Silicon Valley in 2005, leading the wave into Web 2.0: the participatory web.\n\nFor more information on this episode, including information on the guests and various other resources and links, visit the [url=http://www.tvo.org/cfmx/tvoorg/theagenda/index.cfm?page_id=7&amp;bpn=104106&amp;ts=2009-10-20%2020:00:00.0]episode webpage[/url]\n\n-----\n\nNote:  This is an iPod video podcast that is available for free download from the website.  Quality is good.  Audio podcasts (mp3 format) are also available for free download for the individual segments.    \n\nType: mp4 file\nSize: 102MB\nRuntime: 00:52:49\nVideo: MPEG4 Video (H264) 320x240 \nAudio: AAC 32000Hz mono 48Kbps \n\nDownload this episode using the attached torrent file or download it directly using this link: &lt;a href=&quot;\nhttp://feeds.tvo.org/~r/tvo/TxZN/~5/LkR4fFfZxVY/TAWSP_Dbt_20091020_104106_0_320x240_304k.mp4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://feeds.tvo.org/~r/tvo/TxZN/~5/LkR4fFfZxVY/TAWSP_Dbt_20091020_104106_0_320x240_304k.mp4&lt;/a&gt;\n\nYou can also watch a flash video of this episode through your web-browser here: &lt;a href=&quot;\nhttp://www.tvo.org/cfmx/tvoorg/theagenda/index.cfm?page_id=7&amp;bpn=104106&amp;ts=2009-10-20%2020:00:00.0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tvo.org/cfmx/tvoorg/theagenda/index.cfm?page_id=7&amp;bpn=104106&amp;ts=2009-10-20%2020:00:00.0&lt;/a&gt;\n\n-----\n \n[b]Quantum to Cosmos: Ideas for the Future (Q2C)[/b]\n\nFOR 10 EXCITING DAYS THIS OCTOBER, [url=http://www.qtocfestival.com/]Perimeter Institute's Quantum to Cosmos: Ideas for the Future (Q2C)[/url] will take a global audience from the strange world of subatomic particles to the outer frontiers of the universe. All events will occur on-site in Waterloo, Ontario and online at [url=http://www.qtocfestival.com/]q2cfestival.com[/url] and TVO.org.\n\nQ2C's extensive program features more than 50 events - including panel discussions, keynote presentations, special screenings, exhibits including the full-scale model of the next Mars Rover (named Curiosity), and recorded sessions with Honorary Festival President Professor Stephen Hawking.\n\nQ2C will transcend traditional festivals by streaming events live and on demand, offering virtual interaction with exhibits, and providing special opportunities for students and teachers.\n\n[b]THE AGENDA WITH STEVE PAIKIN[/b] will be broadcasting live for 5 nights from Perimeter Institute in Waterloo. The themes that The Agenda is planning to explore in these programs include:\n\n[list]\n\n[*][b]Monday, October 19 Ã‚Â» Plan B: Colonize Space?[/b]\nStephen Hawking thinks it's a good idea, given the multiple problems facing earth. Can we imagine a human future off earth?\n[*][b]Tuesday, October 20 Ã‚Â» Does/Does Not Compute[/b]\nSo you think technology controls your life now? From nanotechnology to quantum computing, what the future has in store.    \n[*][b]Wednesday, October 21 Ã‚Â» Designer Genetics[/b]\nThe legal, social, and medical implications of trying to engineer humans without defects.    \n[*][b]Thursday, October 22 Ã‚Â» Robotics[/b]\nArtificial Intelligence, evolution, and the man/machine interface.    \n[*][b]Friday, October 23 Ã‚Â» The Importance of Science[/b]\nDo we still believe that science is the path to progress and a better life?\n[/list]\n\nFOR ADDITIONAL INFORMATION on Q2C festival events, programs, speakers, and tickets, go to their [url=http://www.qtocfestival.com/]website.[/url]\n\n[b]Resources and links to related material[/b]\n\nTVO's Quantum to Cosmos (Q2C) Festival webpage: http://www.tvo.org/TVOsites/WebObjects/TvoMicrosite.woa?scientific_literacy\n\nWatch video on demand of lectures from all Q2C sessions: http://www.tvo.org/cfmx/tvoorg/literacy/index.cfm?page_id=616&amp;action=blog&amp;blog_id=484\n\n-----\n\n[b]TVO - The Agenda with Steve Paikin[/b]\n\n[i]The Agenda with Steve Paikin[/i] is TVO's flagship current affairs program - devoted to exploring the social, political, cultural and economic issues that are changing our world, at home and abroad. The Agenda airs weeknights at 8:00 PM EST on TVO - Canada's largest educational broadcaster.\n\nTVO's [i]The Agenda with Steve Paikin[/i] website: http://www.tvo.org/agenda/ ","torrent":{"xt":"urn:btih:be9170ff0c91f6b396968923576d717e3d6cc656","amp;dn":"TVO+-+The+Agenda+with+Steve+Paikin+-+October+20%2C+2009%3A+Quantum+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be9170ff0c91f6b396968923576d717e3d6cc656","infoHashBuffer":{"type":"Buffer","data":[190,145,112,255,12,145,246,179,150,150,137,35,87,109,113,126,61,108,198,86]},"announce":[],"urlList":[]}}