{"title":"No-Do [DVDRIP][Spanish][2009]","uid":5077750,"size":1468487680,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bf405435fd1fd89745956d086baf9257c9904045&amp;dn=No-Do+%5BDVDRIP%5D%5BSpanish%5D%5B2009%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":1,"time":1252010664,"description":"DirecciÃƒÂ³n y guiÃƒÂ³n: Elio Quiroga.\nPaÃƒÂ­s: EspaÃƒÂ±a.\nAÃƒÂ±o: 2008.\nDuraciÃƒÂ³n: 94 min.\nGÃƒÂ©nero: Terror.\nInterpretaciÃƒÂ³n: Ana Torrent (Francesca), Francisco Boira (Pedro), HÃƒÂ©ctor ColomÃƒÂ© (Miguel), RocÃƒÂ­o MuÃƒÂ±oz (Jean), Alfonsa Rosso (Blanca), Francisco Casares (Gabriel), Miriam Cepa (Rosa), Aitor Gaviria (Senel), LucÃƒÂ­a Navarro (Paqui), Alejandra Lorenzo (niÃƒÂ±a).\nProducciÃƒÂ³n ejecutiva: Margaret Nicoll, Stefan Nicoll, Jerome Debeve y Juan A. Ruiz.\n.\n\nSINOPSIS\n\nFrancesca (Ana Torrent) es una joven pediatra que se muda con Pedro, su marido (Francisco Boira), a una nueva casa en el campo para intentar olvidar un trÃƒÂ¡gico evento que ha marcado sus vidas. Pero desde el momento en que entra en la nueva vivienda, Francesca empieza a vivir extraÃƒÂ±os fenÃƒÂ³menos de naturaleza inexplicable que amenazan con acabar con su cordura. La respuesta a estos enigmÃƒÂ¡ticos hechos parece encontrarse oculta en un &quot;No-Do secreto&quot;. &quot;No-Do&quot; nos propone un cuento terrorÃƒÂ­fico de fantasmas y secretos que parte de unos hechos reales extraÃƒÂ­dos de la Historia reciente de EspaÃƒÂ±a, cuya existencia ha dado lugar a todo tipo de especulaciones y rumores. Se trata de los &quot;No-Dos secretos&quot;, unas filmaciones realizadas confidencialmente por el rÃƒÂ©gimen Franquista para la Iglesia CatÃƒÂ³lica en los aÃƒÂ±os 40 y 50 documentando fenÃƒÂ³menos milagrosos, apariciones marianas, prodigios y sucesos parapsicolÃƒÂ³gicos. Se afirma que en el Vaticano hay almacenados varios centenares de esas grabaciones, que buscaban convertir EspaÃƒÂ±a en una especie de gigantesco territorio de peregrinaciÃƒÂ³n para los cristianos, y que permanecen ocultas al pÃƒÂºblico por razones que nunca han sido aclaradas.","torrent":{"xt":"urn:btih:bf405435fd1fd89745956d086baf9257c9904045","amp;dn":"No-Do+%5BDVDRIP%5D%5BSpanish%5D%5B2009%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf405435fd1fd89745956d086baf9257c9904045","infoHashBuffer":{"type":"Buffer","data":[191,64,84,53,253,31,216,151,69,149,109,8,107,175,146,87,201,144,64,69]},"announce":[],"urlList":[]}}