{"title":"Jay Z - Minority Report [MP3]","uid":5021377,"size":7703676,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bf7eed40f3ad8dd297d93f33076fccc87faf2a4b&amp;dn=Jay+Z+-+Minority+Report+%5BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"lkobescak","files":1,"time":1248473667,"description":"Jay Z - Minority Report\n-----------------------\n\nSong About Governments Lack of Support For Katrina Victims.\n\n\nLyrics:\n\n[Intro: News Excerpts] \nThe damage here along the gulf coast is catastrophic.\nThere's a frantic effort under way tonight to find\nsurvivors. There are an uncounted number of the dead tonight... \nPeople are being forced to live like animals... \nWe are desperate... \nNo one says the federal government is doing a good job.. \nAnd hundreds and hundreds and hundreds of people... \nNo water, I fought my country for years.. \nWe need help, we really need help.. \nIn Baghdad, they they drop, they air drop water, food to people..why cant they do that to their own people? \nThe same idiots that can't get water into a major American city in less than three days are trying to\nwin a war... \n\n[Verse 1 - Jay-Z] \nPeople was poor before the hurricane came \nBut the down pour poured is like when Mary J. sang \nEvery day it rains, so every day the pain \nBut ignored them, and showed em the risk was to blame \nFor life is a chain, cause and effected \nNiggas off the chain a cause they affected \nIt's a dirty game so whatever is effective \nFrom weed to selling kane, gotta put that in effect shit\nWouldn't you loot, if you didn't have the loot? \nBaby needed food and you stuck on the roof \nHelicopter swooped down just to get a scoop \nThrough his telescopic lens but he didn't scoop you \nThe next five days, no help ensued \nThey called you a refugee because you seek refuge \nThe commander-in-chief just flew by \nDid he stop? No, he had a couple seats \nJust proved jet blue he's not \nJet flew by the spot \nWhat if he ran out of jet fuel and just dropped \nhu,That woulda been something to watch \nHelicopters doing fly-bys to take a couple of shots \nCouple of portraits then ignored 'em \nHe'd be just another bush surrounded by a couple orchids \nPoor kids just 'cause they were poor kids \nLeft 'em on they porches same old story in New Orleans \nSilly rappers, because we got a couple Porches \nMTV stopped by to film our fortresses \nWe forget the unfortunate \nSure I ponied up a mill, but I didn't give my time \nSo in reality I didn't give a dime, or a damn \nI just put my monies in the hands of the same people that left my people stranded \nNothin' but a bandit \nLeft them folks abandoned \nDamn, that money that we gave was just a band-aid \nCan't say we better off than we was before \nIn synopsis this is my minority report \nCan't say we better off than we was before \nIn synopsis this is my minority report \n\n[Verse 2 - Ne-Yo] \nSo many times I'm, covering my eyes \nPeeking through my fingers \nTryin' to hide my, frustration at the way that we treat \n(Seems like we don't even care) \nTurn on the TV, seein' the pain \nSayin' such a shame \nThen tryin' to go on with my life \nOf that, I too, am guilty \n(Seems like we don't even care) \nSo we send a lil' money, tell 'em it's alright \nTo be able to sleep at night \nYou will pay that price \nWhile some of these folks' lost their whole life \n(Seems like we don't even care) \nNow it wasn't on the nightly news no more \nSuddenly it didn't matter to you no more \nIn the end almost nothing changed \nWhat the hell, what was that for? \n(Seems like we don't even care) \n\n[Outro: News Excerpts] \n...Buses are on the way to take those people from New Orleans to Houston \n...They lyin' \n...People are dying at the convention center \n...Their government has failed them \n...George Bush doesn't care about black people\n\n\n------------------------------------------------------------------------\n\nAdditional information on September 11th, NWO, the Illuminati and the great threat to you can be found at www infowars com or www.prisonplanet.com\n\n------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:bf7eed40f3ad8dd297d93f33076fccc87faf2a4b","amp;dn":"Jay+Z+-+Minority+Report+%5BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf7eed40f3ad8dd297d93f33076fccc87faf2a4b","infoHashBuffer":{"type":"Buffer","data":[191,126,237,64,243,173,141,210,151,217,63,51,7,111,204,200,127,175,42,75]},"announce":[],"urlList":[]}}