{"title":"AutoHideIP v4.7.1.8 Portable","uid":5590760,"size":5424627,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c0c8779b4aefb0b29b0cbddb58660c9443621c1f&amp;dn=AutoHideIP+v4.7.1.8+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoExcuses","files":4,"time":1274859650,"description":"AutoHideIP v4.7.1.8 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Crack are included. Copy the Crack file in the Install Dir...\n\n\nAuto Hide IP - Hide Your IP Address, Surf Anonymously, Protect Your Identity, Guard Against Hackers\n\nBe careful! Have you ever been aware of your IP adress? Your IP exactly points to your location, with very high precision, right to the door of your apartment. Every time you visit a website, your IP address is completely exposed.\n\nAuto Hide IP will help you conceal your real IP and protect your identity online. You need not worry about your privacy and security any more. Browse anonymously with one click  from now on.\n\nKey Features\n\n    * Anonymous Web Surfing\n      Assign you fake IP addresses which will make hackers taken in, by this way, your IP could be disguised from online predators.\n\n    * Protect Your Identity\n      Hide your real IP when surfing the web to prevent hackers or identity thieves from monitoring your web activity or stealing your personal information such as your financial information.\n\n    * Choose IP Country\n      You decide to use fake IP from different countries via &quot;Choose IP Country&quot; option and you can check the current IP directly.\n\n    * Send Anonymous E-mails\n      Hide your real IP address in email headers. Be protected in email-sending from Yahoo!, Hotmail and GMail, etc.\n\n    * Un-ban Yourself from Forums and Message Boards\n      Use Auto Hide IP to change your IP, then you can get access to any forums or restricted websites that have banned you.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.autohideip.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.autohideip.com/&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. It's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you like it and it's useful for you, show your support buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:c0c8779b4aefb0b29b0cbddb58660c9443621c1f","amp;dn":"AutoHideIP+v4.7.1.8+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0c8779b4aefb0b29b0cbddb58660c9443621c1f","infoHashBuffer":{"type":"Buffer","data":[192,200,119,155,74,239,176,178,155,12,189,219,88,102,12,148,67,98,28,31]},"announce":[],"urlList":[]}}