{"title":"Dissidia Final Fantasy [EUR][PSP][ojuegos.eu]","uid":5077864,"size":1170291547,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:c0d5c7cbf4cef7c9bbd7d4475fa9a688e276746f&amp;dn=Dissidia+Final+Fantasy+%5BEUR%5D%5BPSP%5D%5Bojuegos.eu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Morck22","files":61,"time":1252018925,"description":"\nLa fantasÃƒÂ­a no tiene fin. ContinÃƒÂºa la batalla sin fin entre Cosmos, diosa de la armonÃƒÂ­a, y Caos, dios de la discordia. Ambos forman el equilibrio, pero sobre todo, ambos son el universo. Pero cuando se destruyÃƒÂ³ el equilibrio, el mundo fue consumido por el Caos. La ÃƒÂºnica esperanza para el mundo se haya en los 10 guerreros convocados por Cosmos.\nEstas son las posibilidades. Este es el mundo que crearon. La fantasÃƒÂ­a no tiene fin.\nElige el que quieras de entre la mayor colecciÃƒÂ³n de personajes de Final Fantasy jamÃƒÂ¡s vistos en un juego de peleas en que los jugadores pueden elegir entre ser leales al bien o al mal. Tras mÃƒÂ¡s de 20 aÃƒÂ±os de una de las sagas de juegos de rol mÃƒÂ¡s populares del mundo, los hÃƒÂ©roes y villanos de Final Fantasy chocan en una guerra que amenaza con destruir el universo. Este juego nos brinda una novÃƒÂ­sima experiencia de juego de lucha, la capacidad de personalizar a tus personajes, grÃƒÂ¡ficos increÃƒÂ­bles y un sonido de primera calidad que consiguen llevar a un nuevo nivel tu consola PSP.\nCaracterÃƒÂ­sticas:\n# IncreÃƒÂ­bles batallas 3D: Este nuevo y emocionante sistema permite que tu personaje pueda correr por las paredes, volar por el cielo y ejecutar terribles ataques, todo ello con una maniobrabilidad de lo mÃƒÂ¡s intuitiva\n# PersonalizaciÃƒÂ³n mÃƒÂ¡xima: A medida que tu personaje va creciendo, quedan disponibles muchas acciones, habilidades y equipo. Los personajes personalizados pueden ser utilizados en lÃƒÂ­nea en una gran variedad de opciones\n# Gran carga emocional en la historia: Ã‚Â¿Por quÃƒÂ© han sido reunidos estos guerreros? Una emocionante historia os espera, presentada con maravillosas escenas de vÃƒÂ­deo\n# Comunidad de usuarios: DesafÃƒÂ­a a otros jugadores vÃƒÂ­a ad hoc o en lÃƒÂ­nea. Intercambia tarjetas de amigo, crea objetos y comparte personajes con otros jugadores e incluso podrÃƒÂ¡s combatir en batallas virtuales gracias al sistema ad hoc de tu PSP\n# CaracterÃƒÂ­sticas nuevas no presentes en la versiÃƒÂ³n japonesa: Las nuevas caracterÃƒÂ­sticas incluyen la modalidad Arcade, un juego mÃƒÂ¡s equilibrado, nuevos tutoriales y escenas de vÃƒÂ­deo adicionales","torrent":{"xt":"urn:btih:c0d5c7cbf4cef7c9bbd7d4475fa9a688e276746f","amp;dn":"Dissidia+Final+Fantasy+%5BEUR%5D%5BPSP%5D%5Bojuegos.eu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0d5c7cbf4cef7c9bbd7d4475fa9a688e276746f","infoHashBuffer":{"type":"Buffer","data":[192,213,199,203,244,206,247,201,187,215,212,71,95,169,166,136,226,118,116,111]},"announce":[],"urlList":[]}}