{"title":"Wii - Rev14 and NG r6 channel and NG r7 beta - 187CrashOverride","uid":5027117,"size":11079380,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:c0f1357e5e6ba9c4dca5595720558d00830808c5&amp;dn=Wii+-+Rev14+and+NG+r6+channel+and+NG+r7+beta+-+187CrashOverride&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"oscarhummel","files":7,"time":1248745325,"description":"all credit for this upload goes to 187CrashOverride, as noted in the title.  this is simply a re-upload and i have made zero changes to the file content.  i just changed the tracker.  follow the directions and enjoy!  and let us know how it works.\n\n\nGames : Wii : Full Game : English\nHi, here is rev14 plus a new NeoGamma R7 RC4 beta loader AND neogamma R6 channel to try. just out.\n\nTo Install:\n\nCopy the apps and WAD folder to your sd. run the apps with HBC and the wad with wad manager.\n\nI would do a net install of rev14 if possible.\n\n\n[ CIOS38 rev 14 ]:\n- Support for games with new error 002.\n- DIP plugin updated (cover commands emulation fixed).\n- ES plugin updated.\n- FFS plugin updated.\n- EHCI module improved.\n- SDHC module improved.\n- FAT module improved.\n- Implemented new anti error 001 system.\n- Anti error 002 system removed.\n- NAND emulation system added (from SD/USB device).\n- Content override system added (from SD/USB device).\n- System Menu support (Disc Channel works again).\n- Installer support for cBoot2.\n- Installer support for all IOS.\n- Some bugs fixed.\n\n\n \nV9 Wii Modkit - http://thepiratebay.se/torrent/4983382\n\n\nto see my other torrents go here: &lt;a href=&quot;\nhttp://thepiratebay.se/user/crash_override_&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/crash_override_&lt;/a&gt;\n\nI meant to include this changelog for neogamma. this is ALL for neogamma:\n\nQuote:PROBLEMS PLAYING A CERTAIN GAME?\n\nTry the following options:\nHooktype: none\nOcarina: no\nAlternative .dol: no\nBoot language: Console Default (2nd test with the language used in the game)\nForce Video: Disc\nPatch Video: no\nVIDTV Patch: no\nPatch Country Strings: no (2nd test with yes)\n\nIf you play from sd or usb, insert a disc.\n\nIf the game does not work with this, the game is not compatible or an IOS Reloading game, or it's a cIOS, media or new unknown problem.\n\nIf you get either color issues or a green screen freeze(with video mode != Disc), try different combinations of Force Video, Patch Video and VIDTV. Note that this issue can't be fixed in lots of games.\n\n\nPROBLEMS WITH OCARINA?\n\nTry the different hooktypes.\n\n\nPROBLEMS WITH USB LOADING?\n\n- NeoGamma is not able to load games from usb with rev12(maybe rev11 does not work too) of Waninkoko's cIOS\n- Make sure you are using the bottom usb port, the top one won't work for HDDs from cIOSrev12 on.\n- Also if you have WiiConnect24 enabled, test what happens if you disable it.\n- If you have an IDE HDD, try both master and slave jumper settings(experts only!, very low chance to change something)\n\nTry starting the loader after the HDD was connected and powered\nTry starting the loader, connect and power the HD, and then selecct mount WBFS\nTry starting the loader, select mount WBFS, connect the HDD, and then power it\nTry starting the loader, select mount WBFS, power the HDD, and then connect it\nTry starting the loader, select mount WBFS, wait until tries left 20, connect the HDD, and then power it\nTry starting the loader, select mount WBFS, wait until tries left 20, power the HDD, and then connect it\n\nIf all this does not help, get: &lt;a href=&quot;\nhttp://wiibrew.org/wiki/GeeXboX&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://wiibrew.org/wiki/GeeXboX&lt;/a&gt;\nstart something from the HDD with it(requires 2 partitons, 1 wbfs and 1 other),\ndon't do anything to the HDD, do not unplug,\nexit to HBC, start NeoGamma and try to connect.\n\nIf GeeXboX is the only way for you to get your HDD working, please get in contact with the people at irc://irc.freenode.org/cIOS or me\n\nAnd if even this does not work, try to get 2 partitions on the HDD:\n1. FAT32 or NTFS\n2. WBFS\n\nAnd then try again, maybe try the GeeXboX trick again.\n\n\n\nOPTIONS:\n\nHook Type:\nONLY ENABLE IF YOU NEED IT! Required for debugging and Ocarina, the different option can differently reduce game compatibilty.\n\nOcarina:\nONLY ENABLE IF YOU NEED IT! options to use either sd or usb for Ocarina and which IOS to use to access that device. The &quot;not cIOS&quot; options may not work with some cIOS and sd/usb loading.\n\nAlternative .dol:\nONLY ENABLE IF YOU NEED IT! &quot;Disc&quot; searches the disc for .dols and let's you select which one to load then. It should be ovious that only using a .dol different from the main.dol makes sense here. &quot;SD &amp; USB&quot; load a .dol from storage instead of loading the main.dol from disc. The .dol has to be in the folder 'NeoGamma' and the name has to be the first 6(or 4) characters of the disc id.\n\nBoot Language:\nOption which language to force. &quot;Console Default&quot; forces nothing, &quot;Auto Force&quot; forces english on NTSC-U games, and japanese on NTSC-J games. Forcing the language of the disc is required for some import games.\n\nForce Video:\nOption which video mode to use. &quot;Disc&quot; is the default and DOES NOT force anything and is THE option that works. &quot;Wii&quot; forces the video mode set in the Wii settings.\n\nPatch Video:\nONLY ENABLE IF YOU NEED IT! Patches the video mode(s) inside the main.dol to the video mode the game will be started with. This makes more import games playable with &quot;correct&quot; colors.\n\nVIDTV Patch:\nONLY ENABLE IF YOU NEED IT! Something video related.\n\nPatch Country Strings:\nONLY ENABLE IF YOU NEED IT! Required for some import games, mostly people with japanese Wiis need this.\n\n\n\nCHANGELOG:\n\nR6 - &gt; R7:\n\n- Increased timeout to 30 seconds\n- Cleaned up code for decrypted discs\n- Hopefully 100% working gamecube disc detection now\n- Cleaned up code for video modes, gamecube games are started with the selected video mode now\n- Changed rebooter behaviour, hopefully works for all system menus WITHOUT preloader attached\n- Removed 001 main.dol patching for alternative .dols\n- Removed Anti 002 fix\n- Removed dirty fix for Wii Sports Resort\n- Added alternative .dol loading from usb storage\n- Alternative .dol loading from storage now loads .dols with 6 and 4 characters\n- Fixed error that prevented to load games after receiving an error in a previous loading attempt\n\n\nR5 - &gt; R6:\n\n- Fixed bug in game selection\n- Fixed no wpad error when no cIOS is installed\n- Added timeout for dvd reading\n- Clearing bss now for alternative .dols\n- Added loading alternative .dols from disc","torrent":{"xt":"urn:btih:c0f1357e5e6ba9c4dca5595720558d00830808c5","amp;dn":"Wii+-+Rev14+and+NG+r6+channel+and+NG+r7+beta+-+187CrashOverride","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0f1357e5e6ba9c4dca5595720558d00830808c5","infoHashBuffer":{"type":"Buffer","data":[192,241,53,126,94,107,169,196,220,165,89,87,32,85,141,0,131,8,8,197]},"announce":[],"urlList":[]}}