{"title":"Extra Video Converter 6.7.Incl patch(trees)","uid":5061899,"size":4277476,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c1353e8ebe559632ca0c19b7af55730721fef8ef&amp;dn=Extra+Video+Converter+6.7.Incl+patch%28trees%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ProDvDRipper","files":2,"time":1250745124,"description":"An all-in-one software that will help you convert the most common video files to other formats.\n\nSoftpedia, in association with Extra Global Creativity, offers you a special discount: Now, only from Softpedia, you can buy Extra Video Converter with a 10% discount. Take advantage of this opportunity by pressing the Buy Now button and entering this coupon code: EXTR-94JB-DVD\n\nExtra Video Converter - an all-in-one video converter software to convert video files from one format to another. It allows you to convert all popular video formats including AVI, DivX, XviD, MPEG, WMV, ASF, MOV, QT, RealMedia. Providing a very easy to use interface, this applcaition will enable you to convert media files with very fast speed.\n\nHere are some key features of &quot;Extra Video Converter&quot;:\n\nÃ‚Â· Convert AVI, DivX, Xvid, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, file without losing quality.\nÃ‚Â· Support converting AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, file to AVI\nÃ‚Â· Support converting AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, file to MPEG\nÃ‚Â· Support converting AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, file to WMV\nÃ‚Â· Support converting AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, file to MOV\nÃ‚Â· Support converting AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, file to RM\nÃ‚Â· Support batch files conversion.\nÃ‚Â· Automatically Shutdown Computer After Long Time Batch Conversion.\nÃ‚Â· Normally the conversion speed is 5 times of the playback speed.\nÃ‚Â· Set the start position and end position of source file to convert.\n\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\n\n\n1GHz CPU\n\n\n\n1.Unpack with any archiver\n2.Install setup.exe\n3.copy and paste patch in the installer folder run\npatch below on the patch click patch done","torrent":{"xt":"urn:btih:c1353e8ebe559632ca0c19b7af55730721fef8ef","amp;dn":"Extra+Video+Converter+6.7.Incl+patch%28trees%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1353e8ebe559632ca0c19b7af55730721fef8ef","infoHashBuffer":{"type":"Buffer","data":[193,53,62,142,190,85,150,50,202,12,25,183,175,85,115,7,33,254,248,239]},"announce":[],"urlList":[]}}