{"title":"PowerArchiver2010 11.60.20 RC5 Portable","uid":5114643,"size":19471040,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c1869003a35c8892736c9be6a772038fb83961e4&amp;dn=PowerArchiver2010+11.60.20+RC5+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoExcuses","files":3,"time":1254999822,"description":"PowerArchiver 2010 11.60.20 (RC5) made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and License are included...\n\n\nPowerArchiver 2010 - universal archiver with support of all popular formats. This archive supports ZIP, RAR, 7-ZIP, CAB, LHA (LZH), TAR, TAR.GZ, TAR.BZ2, BH, ARJ, ARC, ACE, ZOO, GZ, BZIP2, XXE, MIME, UUE, XPI , EAR, WAR, REP, JAR, BK, QWK, Quake PK3, skins WinAMP, self-extracting executable file format ZIP and CAB, as well as CD-images: ISO, BIN, IMG and NRG. At the time the program is free, but as the expansion of its capabilities, has moved into the commercial status that, if we look at the overall trend, it is not surprising. This current application, which combines support practically all popular archival formats. If necessary, you can use encrypted archives using AES algorithm with varying degrees of stability (128-bit/192-bit/256-bit). The interface supports the change of skin, works as in classical or contemporary form.\n\nFeatures: \n- Complete built-in support for 7-ZIP, ZIP, CAB, LHA (LZH), TAR, TAR.GZ, TAR.BZ2, BH, RAR, ARJ, ARC, ACE, ZOO, GZ, and BZIP2 file formats\n- Support for reading and extracting disc image formats: ISO, BIN, IMG and NRG\n- Built-in support for XXE, UUE, and yENC encoded files and full MIME (Base 64) support\n- Creating ZIP and CAB and PAE encrypted self-extracting archives using a Wizard interface\n- Support for unlimited size ZIP archives, with improved performance when working with 100,000+ files\n- Support for Deflate64, providing improved compression results (both size and speed)\n- Complete support for PKZIP 4.0 and PKZIP 4.5 disk spanning\n- Compression Profiles to store frequently used compression settings\n- Full support for ZIP AES encryption, 128-bit/192-bit/256-bit (supports: PKZip 5.1 (full), Secure Zip 8.0 and WinZip 9.0 AE-1 &amp; AE-2) and proprietary PAE format using 5 different methods: Blowfish (128-bit), DES (64-bit), Triple DES (128-bit), AES 128-bit, and AES 256-bit\n- Support for AES encrypted 7-Zip archives and multivolume 7-Zip archives\n- Uploading archives or backups directly to FTP or SFTP (SSH) sites with multiple profiles supported and timeout option\n- Password manager for saving frequently used passwords\n- Tool for creating PBS backup scripts and running automated backups\n- Internal viewer that supports TXT, RTF, GIF, PNG, BMP, ICO, TIFF, GFI, SGI, EMF, WMF, PPM, Adobe Photoshop, Autodesk, Truevision, - ZSoft Paintbrush, Kodak Photo-CD, JASC PaintShop Pro, and Dr. Halo file formats\n- Many powerful archive operations (including: renaming files in archive, spanning archives, testing archives, viewing and writing comments, installing archives, and checking archives for viruses)\n- Drag and Drop from/to Windows Explorer and the Desktop\n- Two ways of viewing archives (Classic - all files in the same listing; Explorer - browsing through an archive like folders in Windows Explorer)\n- Complete integration with Windows (extracting archives and creating archives directly from Windows Explorer using powerful &quot;Explorer Shell Extensions&quot;)\n- Ability to edit files within an archive using one single operation\n- Printing file listing to text file or HTML document\n- Tool for repairing corrupted ZIP archives\n- Converting between file formats (for example: changing a ZIP archive to CAB archive, or LHA archive to ZIP archive)\n- Extracting multiple archives at the same time\n- Batch Zip function to create multiple different archives at once\n- Favorite Folders to quickly locate archives\n- Powerful Find function for searching within an archive\n- Auto Update to automatically download and install new versions of PowerArchiver\n- Powerful help in HTML and a tutorial with pictures for beginners\n- Full skinning support via PSF files - includes interface skins, toolbar skins, icons and customizable application settings\n- Customizable toolbar that can be docked to any side of the application or float independently \n- Windows XP Theme and ClearType support\n\n\nVersion 11.60 Preview [October/2009]\n\nNew Features\n\t* Support for extracting ZIPX JPEG format, PowerArchiver becomes only\n\tapplication after WinZip 12 to fully support ZIPX format.\n\t* Updated Burner engine.\n\t* Burner now uses SPTD layer for burning if you install latest PAVD, for faster\n\tburning and improved access to drive.\n\t* New file/folder selection with checkboxes for backup.\n\t* &quot;No to All&quot; option added to all relavant continue dialogues.\n\t* Open archive after creation option added to shell.\n\n\nImprovements\n\t* Memory usage improvements - up to 1 MB less memory used.\n\t* Faster explorer view (startup and browsing folders).\n\t* Improved select folder window (faster).\n\t* PA uses ZIP as default compression when PA has not been run.\n\t* Spanning now enabled when Queue is used.\n\t* PA Starter improvements (unicode, interface, etc).\n\t* MRU's are now being saved during shell actions as well.\n\t* Improved behaviour when extracting single files out of huge rars.\n\nBug Fixes\n\n\t* #1634 - spanned 7zip files showing compress to shell options\n\t* #1633 - if overwrite fails, PA does not show an error.\n\t* #1626 - if we select open after creating, spanning options get enabled.\n\t* #1625 - during drag &amp; drop extraction, empty folders not extracted.\n\t* #1581 - Updating encrypted files in certain situations.\n\t* #1632 - if burner is not present, yet selected in backup, AV shows.\n\t* #1643 - cbr, cbz, pak files showing drag and drop options when opened.\n\t* #1621 - CRC not shown for folders inside 7zip archives.\n\t* #1624 - CRC issue with zip files that dont have proper local/central headers.\n\t* #1612 - Issue with specific large zip file.\n\t* #1615 - Unrar does not work in specific situations.\n\t* #1618 - PA does not create zip spans over 4 GB properly (sometimes).\n\t* #1480 - 7zip bad password can not cancel.\n\t* #1603 - PA crashes in config if closed with esc.\n\t* #1595 - PA can not encrypt spanned zip files in encrypt tool.\n\t* #1577 - Need to click Ok twice when d&amp;d with encryption\n\t* #1589 - Can not extract some 7zip archives when filename encryption is on.\n\t* #1522 - PAE extraction does not show % done.\n\t* #1601 - Pae not under extract menu in 64bit.\n\t* #1574 - Change shortcut for shell&gt; extract.\n\t* #1582 - Different fonts in preview and backup window.\n\t* #1584 - Zipx shows in final backup screen, despite zip selected.\n\t* #1435 - Starter crashes if installation closes it.\n\t* #1588 - Only one queue item is processed at time.\n\t* #1544 - Sometimes erase option in CDRW/DVDRW did not work (in burner/backup tools)\n\t* #1580 - Can not open zip encrypted archives created in PA 2007.\n\t* #1569 - modification date of folders not extracted properly for rar.\n\t* #1573 - compression of larger files through batch zip did not work in specific situations.\n\t* #1570 - Optimized + Queue did not work .\n\t* #1559 - Previewing inside solid 7zip archives does not work.\t\n\t* #1547 - PA can not rename specific files in zip.\n\t* #1560 - clicking on .z01 does not show file contents.\n\t* #1541 - PA does not extract files without extensions in tar format, via D&amp;D\n\t* #1536 - Issue with compressing unicode files in non-english Windows (such as Chinese versions of Windows).\n\t* #1533 - File format selection resets when open dialogue is used to select new filename.\n\t* #1501 - FTP profile selection in backup gets reset.\n\t* #1524 - Issue with 7zip and encrypt filename option.\n\t* #1520 - Spanning is available when PAE encryption is selected.\n\t* #1521 - Update save window does not always default to my documents.\n\t* #1517 - Some Pro options still available when registered as Standard license.\n\t* #1525 - Mount Virtual DVD option not showing up in shell.\n\t* #1507 - Other PA settings not saved if PA is restarted after registration.\n\t* #1513 - Right click menu not showing in backup list.\n\n\n\nMore infos at &lt;a href=&quot;\nhttp://www.powerarchiver.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.powerarchiver.com/&lt;/a&gt;\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at: &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:c1869003a35c8892736c9be6a772038fb83961e4","amp;dn":"PowerArchiver2010+11.60.20+RC5+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1869003a35c8892736c9be6a772038fb83961e4","infoHashBuffer":{"type":"Buffer","data":[193,134,144,3,163,92,136,146,115,108,155,230,167,114,3,143,184,57,97,228]},"announce":[],"urlList":[]}}