{"title":"NetTransport v2.85.460 - J.O. Edition","uid":5021983,"size":3955117,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c18ad6112ec95ed881a32b89aee98c0184dc867c&amp;dn=NetTransport+v2.85.460+-+J.O.+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JustusOumlov","files":-1,"time":1248514456,"description":"NetTransport 2.85.460 - J.O. Edition\nOriginal Program Author's website: http://xi-soft.com/\n\n-----------------------------\n\nInstall Instructions\n\n1. Install NetTransport 2.85.460 normally using the install package provided (NXSetup_Vista(x86).exe) or downloaded from: (http://xi-soft.com/downloads/NXSetup_Vista(x86).zip) &lt;-- both the same file if you downloaded this from TPB\n\n2. Run the patch &quot;NetTransport v2.85.460 Patch.exe&quot;\n\n   a. Click &quot;Patch Program&quot; and it will either automatically find NetTransport.exe and patch it or it will ask you where it is to open it. Find NetTransport.exe and you're good to go =D!\n\n   b. Type in your name and click &quot;Register Username&quot; to use your name in the About box\n\n3. Enjoy ;o)\n\n-----------------------------\n\nDescription\n\n&quot;Net Transport&quot; (also called NetTransport or NetXfer) is a faster, exciting and the most powerful downloading manager that you ever saw, now supports the most pop Internet protocols, including:\n\nHTTP / HTTPS \n\nFTP / over SSL (Secure Sockets Layer) / over SSH (Secure Shell) \n\nMMS (Microsoft Media Services) \n\nRTSP (Real-Time Streaming Protocol) \n\nBitTorrent \n\neMule \n\nRTMP (Real Time Messaging Protocol) \n \n \n\nNews\n\nVersion 2.85 Added DHT network support for BT.\n\nDevelop History\n\nNet Transport 2.85 (Jun 8, 2009)\n\nAdded DHT network support for BT. \nAdded options to enable/disable KAD and DHT networks respectively.\n \nNet Transport 2.84a (May 18, 2009)\n\nFixed a bug that program could not parse RTSP protocol from some SMIL scripts. \nFixed a fatal bug that &quot;Streaming&quot; &gt; &quot;Locate&quot; was not 24h format. \nFixed a bug for BT that some trackers perhaps crashed program. \n\nNet Transport 2.84 (May 5, 2009)\n\nModified that &quot;Decrease&quot; menu of the task would remove the selected connection instead of the last one. \nAdded support for more Flash Media Servers. \nEnhanced the combination of partial data files for MP4 to smooth video by comparing more content between two partial parts. \nModified content of some requests for RTMP protocol. \n\nNet Transport 2.83 (Apr 15, 2009)\n\nEnhanced the inbuilt &quot;URL-Sniffer&quot; to parse RTMP protocols. The task added by this feature can greatly promote successful chance to record streaming via RTMP. \nAdded code to limit the length of the local filename up to 250 bytes. \nEnhanced [MS-RTSP] to recognize more Windows Media Services. \nFixed a fatal bug that program could not record LIVE streaming via RTMP from some sites.\n\nNet Transport 2.82 (Mar 30, 2009)\n\nEnhanced the inbuilt &quot;URL-Sniffer&quot; to parse MS-MMSP, RTMP protocols. \nFixed a bug that [MS-RTSP] could not handle this type of ASF header with padding data. \n\nNet Transport 2.81 (Mar 15, 2009)\n\nAdded code to implement that if you use NetTransport first time, respective two toolbars would be put side by side in the &quot;Download&quot; and &quot;Site-Explorer&quot; tabs. \nEnhanced [MS-RTSP] that if the remote server refuses &quot;OPTIONS&quot; method, program would continue to send &quot;DESCRIBE&quot; method. \nEnhanced [MS-MMSP] to record this type of streaming that only older Windows Media Player (WMP6.4) can play. Please choose &quot;NSPlayer/4.1.0.3937&quot; entry from &quot;Task Properties&quot; -&gt; &quot;Other Settings&quot; -&gt; &quot;Streaming&quot; -&gt; &quot;User-Agent&quot;. \nEnhanced [MS-WMSP] to decode the &quot;chunked&quot; transfer-coding. \nFixed a bug that other connections except the first connection could not use the dynamic URL that generated by the task. \nAdded code to recognize these type of URLs including only &quot;new line&quot; without &quot;carriage return&quot;. \n\n\nOther Features\n\nThe flexible &quot;Scheduler Manager&quot; is also most powerful item in NetXfer. Even you can record the dynamic URL according to time and save it as your desire filename. \nYou can use the inbuilt &quot;URL Sniffer&quot; to catch the real URLs for streaming, Flash, etc. \nYou can use the simple but powerful &quot;File Manager&quot; to categorize and manage downloaded files more efficiently. \nSimple multi-user management. You can maintain several databases by logging on Windows with different username. \nYou can use the inbuilt &quot;Site Explorer&quot; to list the directory structure of the remote server, and easily select the desired files. FTP is the most powerful item in NetXfer. \nFTP reuse mechanism allows you to use one connection to get different files from the same site. \nThe &quot;Multiple Proxies mode&quot; allows you to assign every working thread a different proxy to break certain site restrictions, like only one connection per IP. \nYou can adjust the bandwidth usage of Net Transport to ensure surf at the same time. \nMonitor browser click. And you can add links through Internet Explorer extended context menu, or drag links to the &quot;drop zone&quot; window, etc. \nNet Transport can automatically shutdown the system or hang up the modem once all downloads are completed. \nMultilingual support for the user interface. We will be glad if you help us localize NetXfer. \nYou can use multi-threads for all streaming protocols to significantly reduce the time of downloads. \nAutomatically parse streaming script such as .asx, .smi to acquire real URLs. \nFrom version 2 on, you can record the clip with range. \nThe disk cache buffer can prolong your hard disk life. \nSupported OS: Win95 / Win98 / Win98SE / WinME / WinNT4 / Win2000 / WinXP / Win2003 / Vista\n\nRecommend strongly install Internet Explorer 5.01 and above for Windows 95/98/NT.","torrent":{"xt":"urn:btih:c18ad6112ec95ed881a32b89aee98c0184dc867c","amp;dn":"NetTransport+v2.85.460+-+J.O.+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c18ad6112ec95ed881a32b89aee98c0184dc867c","infoHashBuffer":{"type":"Buffer","data":[193,138,214,17,46,201,94,216,129,163,43,137,174,233,140,1,132,220,134,124]},"announce":[],"urlList":[]}}