{"title":"Magic Training Arena Bot *Cracked* UPDATED","uid":5652474,"size":1746484,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c19bc4e05eb17dda5ea2814005609328ee4ecaed&amp;dn=Magic+Training+Arena+Bot+%2ACracked%2A+UPDATED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"IcrackForYou","files":1,"time":1277680749,"description":"*This is the cracked version of the mta4 bot from RID if you want to purchase this bot please visit there website,this version is free and will always work no need to pay*\n\n-Description- \n\n\nMagic Training 4 performs all four Magic Training Arena minigames to train magic fast and profitably! People always ask me in game how much I spent on my way over-the-top mage XP, and they practically faint when I tell them actually I earned about 600Mil training my magic. Ofcourse, the bot did it all for me, it's capable of earning 70+K XP an hour, and usually earns 200K gold an hour but depending on markets it's been known to make over 500k an hour. This is the best way to train magic, and if you put in the time you will get the 99, this bot (like all of our bots) has a 100% record against the detection system.\n\n\n-Features-\nHuman Mouse Movement\nRiD Unique Styles, each member has a bot with a different training style.\nRiD Auto-Talker, The best around... our legendary talker has several conversations every day, and has been passing as human for years.\nArtificial Intelligence, a more human approach than scripts.\nNo Hacks, the only major bot around today that reads information entirely from screen.\nBlack-Box Security, the only bot ever, who's code is kept server-side and a mystery to Jagex.\n100% undetectable, RiD has had a perfect record against the detection system, since August 2008.\n\nTHIS IS THE CRACKED VERSION YOU WILL HAVE TO PAY FOR THE REAL ONE\n\n*Please seed*","torrent":{"xt":"urn:btih:c19bc4e05eb17dda5ea2814005609328ee4ecaed","amp;dn":"Magic+Training+Arena+Bot+%2ACracked%2A+UPDATED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c19bc4e05eb17dda5ea2814005609328ee4ecaed","infoHashBuffer":{"type":"Buffer","data":[193,155,196,224,94,177,125,218,94,162,129,64,5,96,147,40,238,78,202,237]},"announce":[],"urlList":[]}}