{"title":"DVD Audio Extractor v4.5.5 Incl serial [Bit-Byte]","uid":5083833,"size":3806337,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c1bc905bec375e2c8863989c98c7031b3c356ad5&amp;dn=DVD+Audio+Extractor+v4.5.5+Incl+serial+%5BBit-Byte%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ProDvDRipper","files":2,"time":1252556088,"description":"DVD Audio Extractor is a powerful software DVD audio extracting/ ripping tool. It can help you to extract audio streams from your favorite DVDs and save them as OGG, MP3, Wave or FLAC files.\n\nDVD Audio Extractor can also demux audio streams directly to pcm, mpa, ac3 or dts files. The newly added CD Image creating feature allows you to convert DVD to Audio CD in one step.\n\nDVD Audio Extractor features on its easy-to-use interface, ultra-fast extracting speed, rich audio formats support, multi-channel capability, resample to arbitrary sample rate, audio preview and much more. It's all what you needed to get audios out of DVD-Video discs, so that you can listen on MP3 Player, play on PC, record to CD or do anything else.\n\n\nEasy-to-use user interface\nDVD Audio Extractor is designed in sense of easy use. The program comes with a step by step wizard-like interface and all the functions can be used by simple mouse clicks.\nUltra-fast extracting speed\nWith its fully optimized processing engine, DVD Audio Extractor can convert selected audio tracks within 10% of normal playback time. (Note: processing time differs for different audio format settings)\nSupport all DVD audio formats\nDVD Audio Extractor can decode all the audio formats available on DVD-Video: Dolby Digital (AC-3), MPEG1/2, Linear PCM (any 16, 20 or 24 bit, 48000 or 96000 Hz sample rate, 1 to 8 channels), and DTS (Digital Theater Systems).\nSupport multiple output formats\nDVD Audio Extractor is able to encode to several formats: OGG (Mono, Stereo or 5.1 Surround), MP3 (Mono, Stereo or Joint Stereo), Uncompressed PCM Wave (unlimited channel, with an option to save each channel to separate file), and FLAC. You can also demux audio stream from the DVD stream and save them as separate files.\nThe newly added CD Image creating feature allows you to convert DVD to Audio CD in one step.\nAudio playbac","torrent":{"xt":"urn:btih:c1bc905bec375e2c8863989c98c7031b3c356ad5","amp;dn":"DVD+Audio+Extractor+v4.5.5+Incl+serial+%5BBit-Byte%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1bc905bec375e2c8863989c98c7031b3c356ad5","infoHashBuffer":{"type":"Buffer","data":[193,188,144,91,236,55,94,44,136,99,152,156,152,199,3,27,60,53,106,213]},"announce":[],"urlList":[]}}