{"title":"Naruto Uncut Boxed Set, Volume 3 disk 2","uid":5067109,"size":4252022956,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c25a6920b6a293afc3b475aff488dca4dcfc9d98&amp;dn=Naruto+Uncut+Boxed+Set%2C+Volume+3+disk+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mike80219","files":12,"time":1251065215,"description":"Format: Animated, Box set, Color, Dubbed, DVD, NTSC, Subtitled \n\nLanguage: Japanese, English \n\nNumber of discs: 3\n\nDVD Release Date: May 29, 2007 \nRun Time: 325 minutes\n\nThe second season of the popular comedy-adventure Naruto begins with the second round of the Chunin exams. To reintroduce the main characters, the eternally impatient Naruto Uzumaki starts the show &quot;27 minutes early--in the time slot of The Prince of Tennis&quot;--so everyone has to scramble to fill the time until the videotape arrives. But once this very silly introduction concludes, the tone of the series darkens and the relationships grow more complicated. Brooding, beetle-browed Rock Lee reveals his affection for Sakura, just as she's coming to terms with her former best friend (and rival for Sasuke's affection) Ino. Sakura and Sasuke grudgingly gain a little respect for Naruto--when he's not annoying them by shooting off his big mouth. But the most significant development is the emergence of the villain Orochimaru, a reptilian character with a prehensile tongue Gene Simmons would envy. One of the most notorious and deadly criminals in ninja history, Orochimaru is drawn to Sasuke's extraordinary abilities, and he plans to ensnare the young ninja as an accomplice. Naruto, Sakura, and Sasuke fail to grasp the seriousness of Orochimaru's plot, although the Hokage and his lieutenants are on the alert. This dire threat infuses the often slapstick antics of Squad Seven with a menace the first season lacked. Naruto may still be everybody's favorite knucklehead, but he's up against much tougher foes. The three-disc comes with the bound storyboards (in Japanese only) of Episode #29, &quot;Naruto's Counterattack: Never Give In!&quot; (Rated T+ Older Teen; suitable for ages 12 and older: violence, brief nudity, toilet humor) --Charles Solomon \n\nThe squad mates face their deadliest challenge yet as the Chunin Exam continues. Deep in the Forest of Death, Naruto, Sasuke, and Sakura must battle their rival Genin to collect the scrolls of Heaven and Earth. It's no easy task, but is there an even darker force at work? Something evil is afoot, and it's after Sasuke! \n\n","torrent":{"xt":"urn:btih:c25a6920b6a293afc3b475aff488dca4dcfc9d98","amp;dn":"Naruto+Uncut+Boxed+Set%2C+Volume+3+disk+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c25a6920b6a293afc3b475aff488dca4dcfc9d98","infoHashBuffer":{"type":"Buffer","data":[194,90,105,32,182,162,147,175,195,180,117,175,244,136,220,164,220,252,157,152]},"announce":[],"urlList":[]}}