{"title":"The Sugarcubes - Hit","uid":5076400,"size":140032004,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c28dfa8655ceb515d48961e20cffda76e897630d&amp;dn=The+Sugarcubes+-+Hit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1251882319,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThe Sugarcubes (Sykurmolarnir in Icelandic) were an Icelandic alternative rock band formed in 1986 and disbanded in 1992. They received critical and popular acclaim internationally.\n\nThey first came to notice in the UK when radio DJ John Peel played &quot;Birthday&quot;, later voted by his listeners as a single of the year. The band's music was characterized by a psychedelic post-punk sound sometimes reminiscent of The B-52's, whimsical yet heartfelt lyrics, and the imploring, girlish voice of vocalist BjÃƒÂ¶rk GuÃƒÂ°mundsdÃƒÂ³ttir, who later went on to great success as a solo artist. While not as successful as BjÃƒÂ¶rk's solo career would be, the band is still very highly regarded and was the most influential Icelandic group until the rise of Sigur RÃƒÂ³s.\n\nThe Sugarcubes dissolved in 1992 as different members of the band had realised they all had different ambitions; instead of risking their friendship, the band went on an indefinite hiatus. They remain friends to this day and are all still involved in the management of record label Smekkleysa (Bad Taste Ltd).\n\nOn November 17, 2006, the band had a one-off reunion concert at LaugardalshÃƒÂ¶ll sport arena in ReykjavÃƒÂ­k, Iceland, to celebrate the 20th anniversary of their debut single with all profits going to the non-profit Smekkleysa SM to promote Icelandic music. They were supported by fellow Icelandic groups mÃƒÂºm and Rass. Despite this reunion, the group has expressed that it has no intention to play future shows or record new material.\n\nStick Around For Joy released in February 1992 was the third and final album released by the Icelandic alternative rock band The Sugarcubes. In terms of quality fans usually rate the album somewhere between the band's acclaimed debut, Life's Too Good and the widely panned follow-up Here Today, Tomorrow, Next Week!. The album provided the band's first and only hit, aptly titled &quot;Hit&quot;, which reached #1 on the Modern Rock Tracks chart in the U.S. and #17 on the UK Singles Chart.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c28dfa8655ceb515d48961e20cffda76e897630d","amp;dn":"The+Sugarcubes+-+Hit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c28dfa8655ceb515d48961e20cffda76e897630d","infoHashBuffer":{"type":"Buffer","data":[194,141,250,134,85,206,181,21,212,137,97,226,12,255,218,118,232,151,99,13]},"announce":[],"urlList":[]}}