{"title":"Signs [HDRips.4.iPod] -- VoV","uid":5088003,"size":1126529882,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:c321072d8858e466c6332db56794529355a98964&amp;dn=Signs+%5BHDRips.4.iPod%5D+--+VoV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"VixenofVenus","files":-1,"time":1252877752,"description":"*******************************************************************************\nSigns\n*******************************************************************************\n\n\n\n-------------------------------------------------------------------------------\nCommon File Information\n-------------------------------------------------------------------------------\nSource / Type........: 720p HD Blu Ray Rip (SEPTiC)\nCompatibility........: All iPods &amp; iPhones / Zune / X-Box 360 / PS3 / etc.\nVideo Format.........: H.264\nVideo Resolution.....: 853 x 462 (640x462 Container)\nVideo Frames/Second..: 23.98\nVideo Bitrate........: 1.37 Mbps\nAudio Format.........: AAC-LC\nAudio Bitrate........: 160kbps\nAudio Sampling.......: 48kHz\nAudio Channels.......: Stereo\nGenre................: Science Fiction &gt; Thriller &gt; Drama &gt; Religion\nCover Art............: &lt;a href=&quot;\nhttp://i120.photobucket.com/albums/o168/VixenofVenus/ScreenShots/psigns.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i120.photobucket.com/albums/o168/VixenofVenus/ScreenShots/psigns.jpg&lt;/a&gt;\nScreen Shots.........: &lt;a href=&quot;\nhttp://i120.photobucket.com/albums/o168/VixenofVenus/ScreenShots/signs.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i120.photobucket.com/albums/o168/VixenofVenus/ScreenShots/signs.jpg&lt;/a&gt;\nIMDb Link............: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0286106/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0286106/&lt;/a&gt;\nIMDb Description.....: After the death of his wife in a freak accident, Reverend Graham Hess questions his faith and even leaves the church. Six months later, he discovers a gigantic crop circle in his yard. Similar events happen all over the world. Graham's children think it's aliens, his brother thinks it's pranksters, and Graham doesn't know what to think. However, as more and more strange events occur, he realizes something big is coming, and it's probably not going to be friendly.\n-------------------------------------------------------------------------------\n\nI've uploaded this film tobefore, but oddly enough, never before to a torrent.  Which to me, is quite odd, considering it is easily one of my favorite films and is my favorite M. Night Shyamalan film as well.  For those who haven't seen this film, it may seem like a Sci-Fi film with some big drama stars in it instead of action stars.  However, this film is truly a drama / thriller, and though it involves a story with aliens and has Sci-Fi elements, in fact, the story is really a religious one.\n\nThe film starts with Mel Gibson's character in the middle of the grieving process at the loss of his wife in a horrible car accident.  In the aftermath of the accident, the former Reverend has lost his faith, his faith in nearly everything, including God.  So when the &quot;signs&quot; begin piling up, his entire family begins questioning their faith, what they believe, and begins preparing for the best and the worst.  Personally, my favorite scene in the film is when Graham and Merrill are sitting on the couch in the dark watching the television and they have an intense discussion about the two kinds of people in this world, those who have faith that everything is going to turn out alright and everything has meaning and purpose ... and those who think that everything is random, and there is no purpose or meaning.  Personally, I'm one of the former and I think the latter are crazy people who just can't see the &quot;signs&quot;.\n\nEither way, I hope you enjoy the film!\n\n\n\nAs this is one of my favorite films, I know a bunch of neat trivia about it:\n1.  While most people remember Abigail Breslin as &quot;Little Miss Sunshine&quot;, she was actually 'discovered' by Douglas Aibel (Casting) and M. Night Shyamalan (Director) and this was her first film.\n2.  Mel Gibson and most of the cast did not know that Shyamalan was planning to play the vet who accidentally killed his wife in a traffic accident until the day they shot their first scene together.\n3.  Originally, Shyamalan pictured Reverend Graham Hess as an older man and both Paul Newman and Clint Eastwood are two actors who were specifically contacted about the film early on, but turned down the role.\n4.  In the scenes where Gibson describes the stories of his children's births to them, the stories are actually the stories of Shyamalan's own children's births.\n5.  When Joaqin Phoenix is considering signing up for military service, the poster he is looking at in the recruiting office is actually a film poster of Buffalo Soldiers, a film he starred in.\n6.  When the family hides in the basement towards the end of the film, Mel Gibson's character states that the basement was once used for coal storage.  This is one of several omages to H.G. Well's &quot;War of the Worlds&quot;, as the main character in that story hides from the aliens in a coal shed.\n\n\n-------------------------------------------------------------------------------\nAdditional Info\n-------------------------------------------------------------------------------\nLike all my iPod torrents, these files have their ID3 tags preformatted for your ease!  Album Art, Release Dates, and TV Tags are already filled out for you.  However, if you wish to change them, I recommend the third-party tagging program TVTagger!\n\nFor VoV's iPod Downloads throughvisit RapidRise! &lt;a href=&quot;\nhttp://www.rapidrise.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rapidrise.org/&lt;/a&gt;\n\nAnd ... a new edition! Check out VoV's Blog at BayWords! Get up to date information on new VoV torrents, what is coming up, and just random stuff about VoV! &lt;a href=&quot;\nhttp://vixenofvenus.baywords.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://vixenofvenus.baywords.com/&lt;/a&gt;\n\n\nAfter downloading, please leave your client open and the torrent actively seeding so others may download as well and your ratio will remain high!  Also remember not to severely limit your upload speed by over-throttling.  Be kind, rewind!  Remember to eat your green vegetables.  And ...\n\n-- Please Enjoy and Keep Seeding for Others to Enjoy!! --","torrent":{"xt":"urn:btih:c321072d8858e466c6332db56794529355a98964","amp;dn":"Signs+%5BHDRips.4.iPod%5D+--+VoV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c321072d8858e466c6332db56794529355a98964","infoHashBuffer":{"type":"Buffer","data":[195,33,7,45,136,88,228,102,198,51,45,181,103,148,82,147,85,169,137,100]},"announce":[],"urlList":[]}}