{"title":"No Doubt - Hella Good","uid":5049842,"size":145973252,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c34cb503d355ffeb297ee83c4e350baa398db49a&amp;dn=No+Doubt+-+Hella+Good&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1250052523,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Hella Good&quot; is a song written by Gwen Stefani, Tony Kanal, and The Neptunes for No Doubt's fifth studio album Rock Steady (2001). The song draws influence from electro, rock, and funk music. It received positive reviews from music critics, who made comparisons to the work of a diverse range of artists such as Afrika Bambaataa and Madonna.\n\n&quot;Hella Good&quot; was released as the album's second single in April 2002. It was moderately successful, and Roger Sanchez's remix of the song topped the Billboard Hot Dance Music/Club Play. At the 45th Grammy Awards, &quot;Hella Good&quot; was nominated for Best Dance Recording, and Sanchez's remix won for Best Remixed Recording, Non-Classical. A black-and-white music video was produced, featuring the band squatting in an abandoned ship.\n\nThe song's music video was directed by Mark Romanek. Not following any plot, the video depicts the band as a group of punk rockers squatting in an abandoned ship while the rest are chasing Stefani through out the ship. During the course of the video, the band members perform the song, using bodyboards to float electronic equipment, and they and their friends explore and dance throughout the ship. There are also sequences of people riding on personal water crafts, Stefani performing on a coiled rope, people playing Jet Set Radio Future, and Stefani broadcasting on a pirate radio station.\n\nRomanek came up with the video's concept it and e-mailed it to the band. He based it off of a black-and-white Italian Vogue fashion shoot from the mid 1990s which featured models on waverunners. The video was then filmed over three days in March 2002 in Long Beach, California. The scenes inside the ship were filmed from man-made sets at South Bay Studios.\n\nThe music video was moderately successful. Following a premiere on an episode of MTV's Making the Video, it reached number four on the network's video countdown Total Request Live. The video debuted on MuchMusic's Countdown in April 2002 and peaked at number six, spending over four months on the program.\n\n\nMy Videos: &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:c34cb503d355ffeb297ee83c4e350baa398db49a","amp;dn":"No+Doubt+-+Hella+Good","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c34cb503d355ffeb297ee83c4e350baa398db49a","infoHashBuffer":{"type":"Buffer","data":[195,76,181,3,211,85,255,235,41,126,232,60,78,53,11,170,57,141,180,154]},"announce":[],"urlList":[]}}