{"title":"Nelly Furtado - Maneater  (2nafish)","uid":5510303,"size":162066436,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c387dfbf30a0e762aea566cfe466db2ac885880c&amp;dn=Nelly+Furtado+-+Maneater++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1272021989,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Maneater&quot; is a song written by Nelly Furtado, Timothy &quot;Timbaland&quot; Mosley, Jim Beanz and Nate &quot;Danja&quot; Hills for Furtado's third album, Loose. It was co-produced by Timbaland and Danja and includes influences of 1980s music by artists such as Eurythmics and Hall &amp; Oates. Furtado stated that Hall &amp; Oates' song of the same name was an influence during the writing and recording of the song.\n\nReleased as the album's first single in Europe in May 2006, &quot;Maneater&quot; became one of Nelly Furtado's most popular singles, topping the singles charts in Poland and the UK, and reaching the top ten across much of Continental Europe. It served as the album's second single in Australia, where it reached the top five, and in North America, where it became a club hit but was less commercially successful than the lead single, &quot;Promiscuous&quot;. It received favorable reviews from many music critics.\n\nThe single's music video was directed by Anthony Mandler. The video features former So You Think You Can Dance contestant Jamile McGee as a dancer. Nelly Furtado had to schedule extra practicing sessions for her own dancing in the video.\n\nThe video does not have a substantial plot and, per Furtado's request, focuses on simultaneously celebrating and parodying the &quot;maneater clichÃƒÂ©&quot;. It begins with Furtado searching for her runaway Great Dane, Toby, at night in a seemingly deserted industrial district of an unnamed city. She follows the dog to the basement of a dark, dilapidated building, where she encounters a silent crowd of people in the middle of what MTV News described as a &quot;Fight Club-esque party&quot;. Furtado positions herself in the middle of the crowd and, as the initial beat of the song emerges, begins to dance with &quot;a sense of abandon&quot;, according to Furtado. This serves as the catalyst for a dance party that continues as the song plays. Towards the end of the video, Furtado moves to the roof of the building and dances in front of the rising sun. In the end she leaves the party at dawn, finding her dog sitting at the stairhead near the exit. &quot;I like to walk on the dangerous side of life&quot;, Furtado said of the filming of the video.\n\nIn the U.S., the video premiered on Yahoo! Music on September 6 and was given a &quot;First Look&quot; on MTV's Total Request Live on September 8. It debuted on the show's top ten video countdown on September 11 and peaked at number nine, remaining on the countdown for three consecutive days. The video entered the MuchMusic Countdown in Canada in the week ending September 22, and it peaked at number one in the week ending December 8.\n\nAt the 2007 MTV Video Music Awards, Furtado was nominated in the category of Female Artist of the Year for &quot;Maneater&quot; and &quot;Say It Right&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c387dfbf30a0e762aea566cfe466db2ac885880c","amp;dn":"Nelly+Furtado+-+Maneater++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c387dfbf30a0e762aea566cfe466db2ac885880c","infoHashBuffer":{"type":"Buffer","data":[195,135,223,191,48,160,231,98,174,165,102,207,228,102,219,42,200,133,136,12]},"announce":[],"urlList":[]}}