{"title":"Coast to Coast AM - Aug 10 2009 - Illuminati, Giants, &amp; Dead Mic","uid":5063028,"size":55815997,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:c39b99b37953b55521fad38fe3a1ea7dc7f8d2d4&amp;dn=Coast+to+Coast+AM+-+Aug+10+2009+-+Illuminati%2C+Giants%2C+%26+Dead+Mic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1250795770,"description":"Author and researcher Steve Quayle discussed a number of intertwining subjects including swine flu, dead microbiologists, fallen angels, sightings of giants, the importance of the volcano Krakatau, and the nefarious plans of the &quot;global elite&quot; or Illuminati. The list of microbiologists and scientists who have died under possibly suspicious circumstances continues to grow. He speculated they're being murdered because they would have interfered with the global elite's plan to eliminate 90% of the world's population through the use of some type of pathogen.\n\nThe vaccination for swine flu that is being worked on may come in different versions, one of which may be particularly deadly, especially for children, and this could be part of the depopulation plan, Quayle cautioned. Further, the Model State Emergency Health Powers Act could be enforced to make it a crime not to take the vaccine, he said.\n\nThere were recent sightings of three 8-9 ft. tall beings in England, who were seen looking at crop circles, Quayle said. He also talked about reports of giants with triangular heads that his military sources were said to have contact with, and large beings who escaped from the underground facility at Dulce, NM.\n\nQuayle warned that another volcanic eruption could occur at Anak Krakatau, possibly triggered by weaponry of the global elite. The volcanic ash interacting with HAARP's radio waves will bring about a situation &quot;where the very fabric of reality will be ripped apart,&quot; and cannibalistic giants will be unleashed, he proclaimed. \n\n[This information has been shared to spread knowledge to those who otherwise would not have access to it.  If you can afford it please support www.coasttocoast.com]","torrent":{"xt":"urn:btih:c39b99b37953b55521fad38fe3a1ea7dc7f8d2d4","amp;dn":"Coast+to+Coast+AM+-+Aug+10+2009+-+Illuminati%2C+Giants%2C+%26+Dead+Mic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c39b99b37953b55521fad38fe3a1ea7dc7f8d2d4","infoHashBuffer":{"type":"Buffer","data":[195,155,153,179,121,83,181,85,33,250,211,143,227,161,234,125,199,248,210,212]},"announce":[],"urlList":[]}}