{"title":"Michael Jackson - Black Or White (Long Version)","uid":5066901,"size":393392132,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c3f9b3621e284d1ed7d50c8c367b48a43a4bd736&amp;dn=Michael+Jackson+-+Black+Or+White+%28Long+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1251057741,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Black or White&quot; was the first single taken from Michael Jackson's Dangerous album, released on November 1991. The single is considered the biggest selling rock song of the 1990s. &quot;Black or White&quot; is a mix of hard rock, dance and rap, but basically it is a hard rock song like &quot;Beat It&quot;.\n\nWritten, composed, and arranged by Jackson with the rap lyrics by Bill Bottrell, it is a song that promotes racial unity. The song's introduction and main riff, reminiscent of that of &quot;Hurts So Good&quot; by John Mellencamp are performed by guitarist Slash and Bill Bottrell.\n\nThe song peaked at number one on the US Billboard Hot 100 and the UK Singles Chart, as well as in 18 other countries.\n\nThe music video for &quot;Black or White&quot; was first broadcast on MTV, BET, VH1, and FOX (giving them their highest Nielsen Ratings ever) on November 14, 1991. Along with Jackson, it featured Macaulay Culkin, Tess Harper, and George Wendt. It helped usher in morphing as a new technology in music videos, pioneered by Godley &amp; Creme's &quot;Cry&quot; video in 1985 (the sequence begins with extra, Let Mon Lee, and features supermodel Tyra Banks). The video was directed by John Landis, who also directed Thriller.\n\nThe first few minutes of the video featured an extended version of the song's intro, in which a young kid (Macaulay Culkin) is playing loud music in his bedroom at night, and is yelled at by his enraged father (George Wendt), who demands he stops playing the music and go to bed. Culkin decides to forego his father's request to go to sleep by setting up large speaker cabinets behind his father's reclining chair, donning leather gloves and sunglasses, and playing an extremely loud power chord on an electric guitar. The sound then shatters the house's windows and sends his father (seated in his chair) halfway around the world, where the actual song begins. Culkin's mother (Peggy Lipton) declares that his father will be &quot;very upset&quot; upon his return. The song from the CD does not use Culkin's nor Wendt's voice; they are replaced by voice actors performing a similar intro. Wendt winds up in Africa, and Jackson begins to sing &quot;Black or White&quot;, surrounded by various different cultures scene-by-scene.\n\nA young Tyra Banks, just beginning her career as a supermodel, is seen dancing to the song in the ending of the video, as well as actress Cree Summer.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c3f9b3621e284d1ed7d50c8c367b48a43a4bd736","amp;dn":"Michael+Jackson+-+Black+Or+White+%28Long+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3f9b3621e284d1ed7d50c8c367b48a43a4bd736","infoHashBuffer":{"type":"Buffer","data":[195,249,179,98,30,40,77,30,215,213,12,140,54,123,72,164,58,75,215,54]},"announce":[],"urlList":[]}}