{"title":"016 - coast to coast - George Knapp and Danny Schechter April 18","uid":5567860,"size":90461254,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c420b4d33f5de5016540fc1c067e7c4ee515e235&amp;dn=016+-+coast+to+coast+-+George+Knapp+and+Danny+Schechter+April+18&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"panzerfaust69","files":1,"time":1274050460,"description":"(sorry missed last hour)\n\nWall Street Fraud\n\nDate:04-18-10\n\nHost:George Knapp\n\nGuests:Danny Schechter, Stephen Bassett\n\nGeorge Knapp was joined by filmmaker and veteran journalist Danny Schechter, who discussed the fraud perpetrated on the nation by Wall Street and the factors which played a role in the current financial crisis. While the media has portrayed the meltdown as the result of a series of blunders by the banking industry, Schechter said that it was really a calculated effort to take advantage of a flawed system. Calling it &quot;the greatest theft in history,&quot; he observed that &quot;you have a situation where a small group of people enriched themselves in ways that were never thought possible.&quot;\n\nSchechter explained that the economic crisis is really the result of the financial, insurance, and real estate industries &quot;working in cahoots with each other and becoming kind of a cabal.&quot; This nefarious coalition was made possible, he said, by financial deregulations which were fueled by lobbyists and campaign contributions working at the behest of these industries. To that end, Schechter said, there is misplaced blame in the minds of many Americans, who see the government at fault for the financial crisis. However, he claimed that the power of the government has essentially been usurped by these financial institutions which he dubbed the &quot;debt and finance complex,&quot; akin to the infamous military-industrial complex.\n\nBeyond the financial sector, he noted a number of elements which also contributed to the maelstrom that has unfolded in the last few years. He was particularly critical of the media, which he said were profiting from the housing boom and, as such, weren't scrutinizing Wall Street practices. Additionally, Schechter pointed out that the FBI warned of mortgage crimes being perpetrated, but that they did not have the manpower to police these infractions, since they were busy fighting terrorism. He also stressed that the sheer complexity of economics allowed for the financiers to take advantage of average citizens. &quot;We have a financially illiterate nation,&quot; Schechter lamented, &quot;you can't blame the people for that. They've been kept deliberately in the dark.&quot;\nUFO Activism\n\nIn the first hour, exopolitical activist Stephen Bassett talked about UFO disclosure as well as two major conferences coming to Washington D.C. later this year. On the subject of UFO disclosure, he alleged that the &quot;truth embargo is hanging by a thread&quot; and that &quot;disclosure is inevitable and soon.&quot; Citing the vast number of countries that have released UFO files, Bassett said that &quot;the ability of the US to contain this is evaporating.&quot; In looking at how disclosure may come about, he surmised that President Obama would be chosen, by the &quot;powers that be,&quot; to reveal the truth about UFOs, rather than initiating the announcement himself.\n\nBassett also previewed the two conferences he is holding in Washington D.C. later this year. He noted that the X-Conference, coming in May, will be the first ET/UFO conference to be held at the National Press Club, which is mere blocks from the White House. &quot;We are really bringing it right down to the center of the nation's capital,&quot; Bassett declared. In addition to that, he announced the creation of the Contact 2010, to be held in October. This event, he said, will be the first major event, since 1992, to deal specifically with the issue of ET contact.\nWebsite(s):\n# plunderthecrimeofourtime.com\n# newsdissector.org/blog\n# mediachannel.org\n# paradigmresearchgroup.org\n# x-conference.com\n# contacttwentyten.com\nVideo(s):\n# Plunder: The Crime of Our Time\n\n","torrent":{"xt":"urn:btih:c420b4d33f5de5016540fc1c067e7c4ee515e235","amp;dn":"016+-+coast+to+coast+-+George+Knapp+and+Danny+Schechter+April+18","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c420b4d33f5de5016540fc1c067e7c4ee515e235","infoHashBuffer":{"type":"Buffer","data":[196,32,180,211,63,93,229,1,101,64,252,28,6,126,124,78,229,21,226,53]},"announce":[],"urlList":[]}}