{"title":"S02 E11 Fc de kampioenen - de controlleur.avi","uid":5035362,"size":306252102,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c4c7fb5cccadee49ada9b92c17080a6a58401f91&amp;dn=S02+E11+Fc+de+kampioenen+-+de+controlleur.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xkissie","files":1,"time":1249088398,"description":"Op deze DVD's : Xavier komt er achter dat DDT een advertentie heeft geplaatst om aan een vrouw te geraken. - Xavier, niet om een grap verlegen, belt DDT op en maakt een afspraak. - Ook Boma heeft het razend druk. Naast het organiseren van een voetbaltornooi en het rokken jagen, wil hij absoluut de lamentabele prestaties van de ploeg verbeteren door nieuwe spelers aan te trekken. De Kampioenen zijn het hier niet mee eens en maken een plan om de voorzitter te boycotten. Als klap op de vuurpijl komt de belastingscontroleur langs. - Bieke vertrekt voor een jaar naar Amerika om er te studeren, maar keert , door heimwee verteerd, eerder terug dan voorzien. - Carmen wil dat Xavier hoger op geraakt in het leger en schakelt de Kampioenen in om hem hierbij te helpen. - Doortje heeft groot nieuws : ze is zwanger en weet niet goed hoe ze dit aan Pico moet vertellen. Ze gaat om raad bij Pascale. Oscar vangt een deel van het gesprek op en trekt verkeerde conclusies, met alle gevolgen vandien. Kortom, Boma en zijn kampioenenploeg staan weer garant voor uren lachen, want kampioen zijn is plezant.","torrent":{"xt":"urn:btih:c4c7fb5cccadee49ada9b92c17080a6a58401f91","amp;dn":"S02+E11+Fc+de+kampioenen+-+de+controlleur.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4c7fb5cccadee49ada9b92c17080a6a58401f91","infoHashBuffer":{"type":"Buffer","data":[196,199,251,92,204,173,238,73,173,169,185,44,23,8,10,106,88,64,31,145]},"announce":[],"urlList":[]}}