{"title":"The calling Patrick Henry.wmv","uid":5655359,"size":744941263,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c5517ab07dc1b554532649235d3bba592083d85b&amp;dn=The+calling+Patrick+Henry.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ivo2296","files":1,"time":1277777492,"description":"The main goal of this production is to provide information to people, much of which is quite well hidden. It is our sincere hope that everyone views this material will be inspired to question things; and to search out the truth for themselves.\n\nThe arguments and conclusions contained within this work are the accumulated result of over 25\nyears of investigation and personal research. Many of the arguments presented here are not new, however in order to see the larger picture, it is necessary that the many smaller pieces of the puzzle first be put into order.\n\nThe information contained herein is as important to mankind as it is urgent, however in an almost unfathomable act of irresponsibility, it is still for the most part, being ignored by Governments, Academics, and media all over the world.\n\nThis film is designed to make it clear to the viewer that there is more to the workings this world, than how it appears on the surface, and that this fact can readily be proven.\n\nIt is the opinion of the makers of this film that the people of the world very much need to understand the true nature of the problems faced by the human family in order to find real and meaningful solutions to them, and that these problems do seriously need to be addressed in order to secure a peaceful and prosperous future.\n\nWe do not ask or expect anyone to believe what is presented within the chapters of this film, without first investigating all the evidence for themselves, and we very much urge you to do so.\n\nRemember, the truth is always out there somewhere, and sometimes, right in front of our eyes, if we would only choose to notice. ","torrent":{"xt":"urn:btih:c5517ab07dc1b554532649235d3bba592083d85b","amp;dn":"The+calling+Patrick+Henry.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5517ab07dc1b554532649235d3bba592083d85b","infoHashBuffer":{"type":"Buffer","data":[197,81,122,176,125,193,181,84,83,38,73,35,93,59,186,89,32,131,216,91]},"announce":[],"urlList":[]}}