{"title":"O Homem nunca pisou na Lua by TecnoS","uid":5088206,"size":2567342,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c5f0c44111d38dc06b1c5bca83bfc95b26fe745d&amp;dn=O+Homem+nunca+pisou+na+Lua+by+TecnoS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"K0v45t31n","files":1,"time":1252893232,"description":"A Prova de que o Homem nunca foi ÃƒÂ  Lua (em vÃƒÂ­deo)\n\nDe acordo com a versÃƒÂ£o oficial, em horÃƒÂ¡rio mundial UTC, ÃƒÂ s 13 horas e 32 minutos de 16 de julho de 1969, os astronautas Neil Armstrong, Edwin 'Buzz' Aldrin e Michael Collins partiram na ponta do foguete Saturno V, de Cabo Canaveral na FlÃƒÂ³rida, Estados Unidos, tripulando a nave Apollo 11 composta pelo MÃƒÂ³dulo de Comando Columbia e pelo MÃƒÂ³dulo Lunar Eagle na presenÃƒÂ§a de centenas de milhares de pessoas que, pelas estradas e campos ao redor do Centro Espacial Kennedy, assistiam ao lanÃƒÂ§amento do foguete.\n\nVocÃƒÂª terÃƒÂ¡ a oportunidade de ver uma sÃƒÂ©rie de indÃƒÂ­cios de que tudo que existe sobre a ida do homem ÃƒÂ  Lua pode nÃƒÂ£o passar de uma grande fraude muito bem arquitetada, porÃƒÂ©m, repleta de erros, o que poderÃƒÂ¡ levar vÃƒÂ¡rias pessoas a se perguntarem em como puderam ter sido tÃƒÂ£o ingÃƒÂªnuas aceitando a versÃƒÂ£o oficial divulgada em todos os meios de comunicaÃƒÂ§ÃƒÂ£o sem contestar os fatos por tantos e tantos anos.\n\nApÃƒÂ³s conhecer os diversos indÃƒÂ­cios de fraude coletados por diversos pesquisadores ao longo de 4 dÃƒÂ©cadas, o sentimento que vocÃƒÂª poderÃƒÂ¡ ter, serÃƒÂ¡ o de ter feito papel de palhaÃƒÂ§o, de ter sido feito de trouxa juntamente com o restante da humanidade, que acredita em tudo que aparece na televisÃƒÂ£o sem contestar o que estÃƒÂ¡ sendo mostrado e o que ÃƒÂ© dito.\n\nTire suas prÃƒÂ³prias conclusÃƒÂµes depois que vocÃƒÂª assistir este pequeno trecho de vÃƒÂ­deo, que por sinal ÃƒÂ© muito revelador...\n\nDetalhes TÃƒÂ©cnicos:\n\nResoluÃƒÂ§ÃƒÂ£o: 320 x 240\nFPS: 25 quadros/s\nVÃƒÂ­deo Codec: Xvid - Avi\nAudio Codec: AC-3\nTamanho do Arquivo: 2,44 MB\nAno do VÃƒÂ­deo: 1969\nAno de LanÃƒÂ§amento: 2009\nEdiÃƒÂ§ÃƒÂ£o: K0v45t31n\nNÃƒÂºmero de episÃƒÂ³dios: 1\nIdioma do Audio: InglÃƒÂªs\nLegenda: PT-BR\nPaÃƒÂ­s de Origem: EUA\nGÃƒÂªnero: EvidÃƒÂªncia Top Secret\nTempo de DuraÃƒÂ§ÃƒÂ£o: 46 segundos\nClassificaÃƒÂ§ÃƒÂ£o etÃƒÂ¡ria: Livre\n\nPor favor seja seed, NÃƒÂ£o seja apenas um Leecher! \nCoopere com outras pessoas, semeie pelo menos o dobro do tamanho do arquivo que vc baixou.\n\nObrigado!\n\nProof that the man was never the Moon (video)\n\nAccording to the official version, on schedule worldwide UTC, the 13 hours and 32 minutes of 16 July 1969, astronauts Neil Armstrong, Edwin 'Buzz' Aldrin and Michael Collins set off the tip of the Saturn V rocket from Cape Canaveral, Florida, United States, driving the spacecraft Apollo 11 made up of the command module Columbia and the Lunar Module Eagle in the presence of hundreds of thousands of people, roads and fields around the Kennedy Space Center, watching the lanÃƒÂ§aamento rocket.\n\nYou will have the opportunity to see a lot of evidence that everything is on the way of man to the moon may be only a massive fraud engineered very well, but full of errors, which may take several people to ask how might have been so naive accepting the official version published in all media without contesting the facts for so many years.\n\nAfter meeting the various indications of fraud by several researchers collected over 4 decades, the feeling that you might have would be to have done the role of clown, has been made to bundle along with the rest of mankind, who believes in everything on television without challenge what is being shown and what is said.\n\nDraw your own conclusions after you watch this little piece of video, by the way is very telling ...\n\nTechnical details:\nResolution: 320 x 240\nFPS: 25 frames / s\nVi-deo Codec: Xvid - Avi\nAudio Codec: AC-3\nFile Size: 2.44 MB\nYear: 1969\nRelease Date: 2009\nEdition: K0v45t31n\nNumber of episodes: 1\nAudio Language: English\nLegend: PT-BR\nNether-s of Origin: USA\nGenre: Top Secret Evidence\nRunning Time: 46 seconds\nAge rating: Free\n\nPlease be seed, is not just a Leecher!\nCooperate with other people, sow at least twice the size of the file that you downloaded.\n\n","torrent":{"xt":"urn:btih:c5f0c44111d38dc06b1c5bca83bfc95b26fe745d","amp;dn":"O+Homem+nunca+pisou+na+Lua+by+TecnoS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5f0c44111d38dc06b1c5bca83bfc95b26fe745d","infoHashBuffer":{"type":"Buffer","data":[197,240,196,65,17,211,141,192,107,28,91,202,131,191,201,91,38,254,116,93]},"announce":[],"urlList":[]}}