{"title":"OutRun 2006 - Coast 2 Coast [Pal/Ntsc], Ps2","uid":5576174,"size":740685248,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:c63b6a5e7a04544c8167f754d2953597baf90a96&amp;dn=OutRun+2006+-+Coast+2+Coast+%5BPal%2FNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Big_dude","files":-1,"time":1274390981,"description":"OutRun 2006 - Coast 2 Coast for the Ps2                             Rel. 04/25/2006\n\n\nFormat:        DVD5 PAL/NTSC SELECTOR\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nGenre.:        Racing\nRating:        E (Everyone)\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Game was tested and works.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\nRelease Notes - The Game starts off in pal then goes to the pal/ntsc screen, push\n                down for 60hz (Ntsc) Done.\n\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. \n\nFree Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nLike its predecessors, OutRun 2006 is an old-school arcade racer, which means that your cars don't have realistic physics, don't get damaged and have insanely fast speed.\n\nSince this title is officially licensed by Ferrari, you drive with 15 original models from the DINO 246 GTS over the F430 to the all-new Enzo Ferrari. The heart of the game is the Coast 2 Coast mode in which you race against up to 5 AI players on 15 US themed tracks. In addition you have to impress different girlfriends. She tells you what she wants to see (a hard slide around a curve or a close take-over for example) and you have to perform it to win her heart.\n\nThere are 3 other game modes available in singleplayer: OutRun, Time Attack and OutRun2SP. In OutRun2SP you get access to 15 arcade tracks from the original OutRun 2. In OutRun however you need to drive your girlfriend through various checkpoints to the goal before the timer hits zero. In Time Attack you just have to beat the high score of the current track. You can either race against the clock or against ghost cars.\n\nIn every mode you get OutRun miles after the race. These are the currency of the game and are needed to unlock new cars, upgrades and additional music-stations. \n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t","torrent":{"xt":"urn:btih:c63b6a5e7a04544c8167f754d2953597baf90a96","amp;dn":"OutRun+2006+-+Coast+2+Coast+%5BPal%2FNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c63b6a5e7a04544c8167f754d2953597baf90a96","infoHashBuffer":{"type":"Buffer","data":[198,59,106,94,122,4,84,76,129,103,247,84,210,149,53,151,186,249,10,150]},"announce":[],"urlList":[]}}