{"title":"Alan.Watt.2009.08.September.Mega.Pack1-sig_garrett","uid":5129264,"size":114259943,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c6655e34a8ac579210de0187b1019c0ab7e543a2&amp;dn=Alan.Watt.2009.08.September.Mega.Pack1-sig_garrett&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sig_garrett","files":13,"time":1255976607,"description":"Alan Watt &quot;Cutting Through The Matrix&quot; Radio Show\n\n\n0) Sept. 1, 2009\n\nBanking Con-Fidence is Stealing Licence:\n&quot;Confidence Men, Down through the Ages,\nRun the Banking, Give Pittance Wages,\nThen, When Enough Cash is in the Kitty,\nAnd the Public Thinks it's Sitting Pretty,\nBankers Hold Secret Convention,\nSteal the Cash, Cause Depression,\nFat Greedy Men, Power-Mad Knavery,\nPulled it Off, We're All in Slavery,\nIn Ancient Times, the Land of Punt\nUsed Priestly Government as a Front\nTo Shield the Rich Merchant Class\nWho Lent the Gold, Bold as Brass&quot;\n\nElite Riding on Backs of Peasants - The Matrix and Plato's Cave, Shadows, Bogus Reality - Newswires, Reuters (Routers) - Aldous and Julian Huxley - &quot;New World Order&quot; term - Suggestibility of Public, Belief in Mainstream Media - Surveillance to Find Intelligence - Bertrand Russell, Recruitment or Eradication of &quot;Brighter&quot; Children - Breaking the Spell. Getting Ripped-off by Confidence (Con) Men - Politicians, Voting Gives Govt. Legal Right Over You - Familiar News Anchors, Reading Dummy Boards - CBC, Mr. Mansbridge &quot;Most Trusted Man in Canada&quot; - Federal Reserve urges Secrecy on Bank Bailouts (Taxpayer-Funded Gifts) - Who Your Government Really Works For - Con Trick of Money and its Managers - &quot;Ephemeral&quot; Public Confidence - Politicos' Pay-offs and Ghost-Written Books. Nathan Rothschild, Privatization of British Roads, Tolls - Public-Private - Govt. Contracts and Bids - Knights are &quot;Bold&quot; and &quot;Audacious&quot;. United Nations, Soviet Marxism, Reverse Discrimination - World Health Organization, Panic and Fear to get Herd to Take Shots (Annually) - Swine Flu Call Centres - Population Reduction. UN's UNESCO &quot;Sexual Education&quot; for Pre-Kindergartens - Ideological Indoctrination - Abortion, Eugenics, Devaluation of Human Life - Plato, Women &quot;in Common&quot;. Hairdressers Hassled by Anti-Terrorist Teams - Terrorism Farce (You Pay for it). \n\nTopics of show covered in following links:\n\n&quot;Fed urges secrecy on banks in bailout programs&quot; (reuters.com) - Aug. 27, 2009.\n\n&quot;NM Rothschild pitches motorway privatisation plan&quot; by Robert Watts and Dominic O'Connell (timesonline.co.uk) - Aug. 30, 2009.\n\n&quot;The swine flu call centres where staff have nothing to do but play cards and Trivial Pursuit&quot; by Tom Kelly (dailymail.co.uk) - Aug. 29, 2009.\n\n&quot;U.N. Report Advocates Teaching Masturbation to 5-Year-Olds&quot; by Joseph Abrams (foxnews.com) - Aug. 26, 2009.\n\n&quot;Hairdressers in terror alert&quot; by Ross Bentley (eveningstar.co.uk) - Aug. 25, 2009.\n\n\n1) Sept. 2, 2009\n\nSpook the Herd to Make Them Scared:\n&quot;Blackmail by Biowarfare Co. who Make Disease,\nThey Offer the Antidote for Big Fat Fees,\nTheir Green Monkey Mix should be Flushed Down the Lavatory\nInstead of Corrupt Politicos Making it Mandatory,\nTerrifying the Public with Scary Predictions\nSo You'll Run to Your Doctor for Jabs and Prescriptions,\nThe W.H.O. hopes to Train You for Annual Injections\nSo You'll Take Your Injection without Reflection&quot;\n\nFormulas for Controlling Nations and Empires - Psychology, Mass Mind Manipulation, Bernays, Marketing - Scientific Indoctrination - Newspapers, Radio and Television, BBC Propaganda. Ideal Planned Society, Death at Retirement Age - Technocrats, Maurice Strong, Teaching People to Consume Less Energy. National Health Care (a Political Agenda), Priority Abortions and Vasectomies, Denial of Life-Saving Operations and Life Support, Doctor Shortages (Quotas set by Govt.), Walk-in Clinics - UN World Health Organization, Citizens to Get Minimal Health Care - Bribery in Socialist-Communist Systems. Canada, Laws regarding Compulsory Vaccination and Exemption - Consent for Invasive Medical Procedures - 1976 Swine Flu, Known Diseases/Paralysis/Deaths from Vaccine. Baxter Laboratories, Bacterial-Viral Warfare, Contaminated Blood for Hemophiliacs - Irish Vaccination Program - WHO's Mandate of Mandatory Annual Shots. Closing Power Plants, &quot;Inevitable&quot; Electric Blackouts, Windmill/Turbines Farce - Reduction of All Energy Consumption (and Population). Splicing Spanish Flu and Common Flu to Create Killer Virus - Swine Flu &quot;Pandemic&quot;, Scary Scenarios to Get Public to Obey.\n\nTopics of show covered in following links:\n\n&quot;Sentenced to death on the NHS&quot; by Kate Devlin (telegraph.co.uk) - Sept. 2, 2009.\n\n&quot;Exemptions from vaccinations - Vaccinations are NOT mandatory in Canada&quot; Vaccination Risk Awareness Network (vran.org).\n\n&quot;Swine Flu 1976 &amp; Propaganda - The Devastation, The Victims Who Took The Shots Back In 1976&quot; [CBS 60 Minutes episode]\n\n&quot;The $531 Trillion Dollar Derivatives Time Bomb&quot; (wiseupjournal.com) - Sept. 1, 2009.\n\n&quot;Vaccines Far More Dangerous Than Swine Flu Itself&quot; (wiseupjournal.com) - Sept. 2, 2009.\n\n&quot;Green zealots and muddled ministers are leading Britain to blackouts&quot; by Christopher Booker (dailymail.co.uk) - Sept. 3, 2009.\n\n\n\n\n2) Sept. 3, 2009\n\nEye of Newt, Green Monkey Kidney -- Like Cartoon from Walt Disney:\n&quot;Reports Galore on Vaccine Side-Effects,\nOnce-Healthy Peoples' Lives are Wrecked,\nThese Vast Reports are Recognized,\nVaccines Seem to be Weaponized,\nIt Goes Against All Common Sense\nTo Wipe Out Body's Self-Defense,\nUnless Those with Bad Intentions\nWill Weaken Us to Simple Infections,\nAnd Adjuvants with Theories Sorry\nTurns Immune System Against Your Body&quot;\n\nWars and Spoils of War - Slaves Own Nothing - Government Creates Debt, Taxpayers are Guarantors - Same Laws Passed Worldwide, One International Must-Be Agenda. Man-Made Global Warming / Climate Change Scam and Fanatics - Population Reduction, Permission to Breed - &quot;Wizard of Oz&quot; movie, Little Man behind the Curtain - Ruthless Scientific Priesthood. Ineffective Vaccines, Diseases and Deaths after Inoculations - Smallpox Deaths after Vaccination - Diphtheria - SV-40 Contaminated Polio Shots - Measles, Whooping Cough, Tuberculosis - Polio Outbreak in Nigeria - Hepatitis B - FDA's Adverse Reaction list - Viruses Grown on Animal Tissues and Liquefied for Shots. Vaccine Adjuvants - Allergies, Immune System at War with Everything (including Your Body) - Aluminum Salts, Neurotoxicity, Impaired Brain Development, Thimerosal (Mercury) - Squalene, Oil-based Adjuvants - Auto-Immune Diseases, Total Allergy System, Multiple Sclerosis - Information Withheld for &quot;National Security&quot;. Fairy Tale Story of &quot;Government Represents You&quot; - New World Order, Spreading &quot;Democracy&quot; - U.S. Set up as Republic - Voting Crooks Out, Voting in Tent Preachers (Politicians). UN Goal of Depopulation - Effective Measures to Destroy Health and Fertility - Crossing the Line when Waking Up; Thinking the Unthinkable - Ancient Egypt, Eye of Ra watching - Soviet Union, Posters of Lenin and Stalin - CCTV Cameras, Intimidation, 24-hour Surveillance Prison.\n\nTopics of show covered in following links:\n\n&quot;At last, man-made climate change is a threat - engineered by the global-warming fanatics themselves&quot; by Gerald Warner (telegraph.co.uk) - Aug. 7, 2009.\n\n&quot;HISTORICAL FACTS EXPOSING THE DANGERS AND INEFFECTIVENESS OF VACCINES&quot; Ian Sinclair (vaclib.org).\n\n&quot;A Glimpse into the Scary World of Vaccine Adjuvants&quot; by Edda West, Published in VRAN Newsletter, Winter 2005 (at whale.to).\n\n&quot;Tenants fuming as flats turned into 'Big Brother house' with 112 CCTV cameras installed inside&quot; (dailymail.co.uk) - Aug. 28, 2009.\n\n\n\n3) Sept. 4, 2009\n\nCompliant Population -- We Will Use the Needle (Lord Bertrand Russell):\n&quot;Governments Colluding with Big Fat Pharma,\nWe're the Guinea Pigs, They're Out to Harm Ya,\nButcher Concoctions in Untried Vaccines,\nNothing in Them Remotely Pristine,\nScary Scenarios Promote the Cause\nOf a Piggy Pandemic that Never Was,\nSo the Sheep while Eating the Grass\nWill Roll Up a Sleeve or Bare Their Ass,\nTake a Shot of Diseased Concoction,\nMonkey Kidneys, Fetal Tissue, Abortion,\nOf All Facts in Scientists' Lofty Minds Lurk\nThe Annual Flu Shot Just Doesn't Work&quot;\n\nCharles Darwin, Royal Society, Age of Reason - Use of Religions, Marxism-Communism, Goals of Freemasonry - Scottish Rite's &quot;New Age&quot;. Bertrand Russell's Experimental Schools, Encouragement of Pre-Pubertal Sex - United Nations front - Destruction of Old to bring in New, Ordo ab Chao. George Bernard Shaw, Creation of the &quot;Superman&quot;, Socialist Society and Authorities - Fabians, CFR-RIIA - Elite, Helpers and the Masses (get Mass Treatment). Scary Scenarios to Train Public to Accept Mandatory Annual Inoculations - Agencies Vying for Power and Territory - UN, Treaties and Departments - UN's World Health Organization (Dr. WHO) releases Pandemic Viruses - Live-Virus &quot;Mock&quot; Vaccines - Guaranteed Sales for Big Pharma through Govt. - Fascism - Vaccination Adverse Effects, Monitoring for &quot;Effectiveness&quot; and &quot;Safety&quot; (After the Fact) - Governor of Maine Declares Civil Emergency to Mandate Flu Shots - Call for 3 Shots (Swine Flu, H1N1 and Booster). Public Unable to Think or Reason for Themselves - Scientific Indoctrination - Behaviour of Domesticated Animals, Want the Familiar. Sterility and Infertility - Warfare on Population of Planet, Planned Reduction - Training through Terror and Fear for Compliance.\n\nTopics of show covered in following links:\n\n&quot;WHO Admits to Releasing Pandemic Virus into Population via 'Mock-Up' Vaccines&quot; Dr. Mercola (mercola.com) - Sept. 3, 2009.\n\nWHO admits Vaccines used to Create Trial Pandemics [&quot;Pandemic (H1N1) 2009 briefing note 6&quot;] (who.int).\n\n&quot;Gov. Baldacci proclaims civil emergency due to H1N1&quot; [Gov. of Maine Declares Civil Emergency to Mandate Flu Shots] by Meg Haskell (bangordailynews.com) - Sept. 2, 2009.\n\n&quot;Infodemiology: Public health at the &quot;granular&quot; level&quot; [Intimate Medical Details freely Given for Govt. and W.H.O. to Monitor] by Mark Baard (timenauts.com) - Sept. 4, 2009.\n\n\n\n\n4) Sept. 7, 2009\n\nYou Have to Hate the New Mandate:\n&quot;New World Order sings New Song,\nDoesn't Want Us to Live Too Long,\nNow Told This Concoction for the Flu\nHas Live Cancer Viruses Just for You,\nThis New Song for World Congregation\nIs All About Depopulation,\nThis Human Species is Rather Sorry\nWhen it Cares Not What's Stuck in the Body&quot;\n\nArnold Toynbee Sr. and Jr., Rhodes Scholars, World Citizenship, Elitists, &quot;We Deny with Our Lips that which We Do with Our Hands&quot;. Lies for Public Consumption - Pre-Planned Events - Government-Mandated Inoculations - Glaxo-Smith-Kline Patent for Flu Vaccine (before Swine Flu &quot;Pandemic&quot;) - W.H.O., Release of Live Viruses. People who Love Socialism, Leave it to the Experts - Medicine as Authority - Adaptation to Jabs, Intrusion, Sterilization - Disassembling the Tower of Babel - It's Us or Them - UN Agenda 21. Iowa (USA), Document (&quot;Template&quot;) on Quarantine Procedures and Facilities for H1N1 &quot;Subjects&quot; - New World Order of Scientific Dictatorship - Center for Disease Control (CDC) - Antiviral Flu Drugs. Soviet System, Political Correctness - Reece Commission on Tax-Exempt Foundations - Collectivism (Top-Down Obedience), Post-9/11 Agencies and Czars - World of Service (Slaves) - &quot;Preventive&quot; Eugenics - Obama's Information-Regulation Czar says Your Organs will be Harvested (&quot;Donated&quot;), &quot;Presumed Consent&quot; for Donations. Swine Flu Vaccines Contain Cancer Cells - Polio Shot - Depopulation, Can't Tell the Children - Vaccinations, Guillain-Barre, Lupus. World Climate Summit, Emission Quotas, Everyone to Pay Carbon Taxes (handled by Rothschild Bank) - Bogus Science, Must Believe and Obey - Orwell's &quot;1984&quot;. Occult Symbolism in Your Face.\n\nTopics of show covered in following links:\n\n&quot;Health officials: Iowa quarantine document not cause for concern&quot; by Lynda Waddington (iowaindependent.com) - Sept. 1, 2009.\n\n&quot;H1N1 Swine Flu Pandemic: Iowa Contemplates &quot;Forced Confinement&quot; in a &quot;Quarantine Facility&quot; &quot; by Michel Chossudovsky (globalresearch.ca) - Sept. 4, 2009.\n\n&quot;IOWA DEPARTMENT OF PUBLIC HEALTH - FACILITY QUARANTINE ORDER -- From CDC&quot; (cdc.gov) - May 1, 2009.\n\n&quot;Flu drugs inappropriate for healthy adults: study&quot; (reuters.com) - Aug. 22, 2009.\n\n&quot;Obama Regulation Czar Advocated Removing People's Organs Without Explicit Consent&quot; by Matt Cover (cnsnews.com) - Sept. 4, 2009.\n\n&quot;Another Shocking Warning About Swine Flu Vaccine&quot; Dr. Mercola (mercola.com) - Sept. 8, 2009.\n\n&quot;German Climate Adviser: 'Industrialized Nations Are Facing CO2 Insolvency' &quot; (spiegel.de) - Sept. 4, 2009.\n\n\n\n5) Sept. 8, 2009\n\nRecycling Trash-ers of Body Snatchers:\n&quot;We Enjoy Scary Movies, Like to Scream,\nYet We're in Scary Reality, People Turning Green,\nWe're Supposed to Let Go, Nature's Will be Done,\nIn Homogenization is Understanding, All is One,\nUpon Awakening, Your Spouse, Like in a Dream,\nWill Seem a Little Different, Skin a Tinge of Green,\nShe'll Fawn over Shrubbery, Still Polite to You,\nYou'll Notice Her Shallow Breathing, Cutting Back on CO2,\nThen Friends and Neighbours, Something Different is Seen,\nOne by One They're Taken Over, Yes They've All Gone Green&quot;\n\nComing Under Attack When Doing the Right Thing, Time Spent Fixing Problems - Inability to Upload to My &quot;Unlimited&quot; Web Space (Yahoo) Sites - My Xplornet Satellite Service Cut Off, Uploading Prohibition, Arbitrary &quot;Fair Use&quot; Policy, Automatic Bandwidth Cut-back (&quot;Rollback&quot;) Policy - Invitation to Xplornet Boss to Explain &quot;Rubber Band&quot; Policy - Paying to Fix Equipment when Not Broken (Problem on Xplornet's End) - Bureaucracy of Government and Corporations, New Feudal System - Xplornet's &quot;Insomniac&quot; Recommendation. Lord May advocates Religious Groups to Police Congregations' Behaviour - &quot;Invasion of the Body Snatchers&quot; movie, Replicant Takeover, Going &quot;Green&quot; - Big Stick of &quot;Sustainability&quot; - International Socialism, Micromanagement of Every Detail of Your Life - UN wants Global Currency and More Power for IMF/World Bank. Totally Corrupt System - Big Pharma and Govt. - Britain, Question Medical Profession and have Your Children Confiscated - Gardasil Vaccine, Paralysis Side-Effect from Injection. The People Saying NO, Enough is Enough - Public Consent (including Silence) is Necessary for Agenda - Trained to Leave it to the &quot;Experts&quot; - Government is an Idea, Small in Relation to Population - Divide and Conquer Strategy - Protests and Demonstrations - We have the Power to Say NO. UN Agenda 21, Blueprint for Global Transformation - Maurice Strong - Socialism-Collectivism to Rule World.\n\nTopics of show covered in following links:\n\n&quot;Leading scientist calls on religious leaders to tackle climate change - President of the British Science Association, Lord May, says faith groups could lead policing of social behaviour&quot; by Ian Sample (guardian.co.uk) - Sept. 7, 2009.\n\n&quot;UN wants new global currency to replace dollar&quot; by Edmund Conway (telegraph.co.uk) - Sept. 7, 2009.\n\n&quot;Question a doctor and lose your child&quot; by Daniel Foggo (timesonline.co.uk) - Sept. 6, 2009.\n\n&quot;Agenda 21: The U.N. Plan for Your &quot;Sustainable&quot; Community&quot; by Berit Kjos (crossroad.to) - 1998.\n\n\n\n\n6) Sept. 9, 2009\n\nPlan of Action Working to Elites' Satisfaction:\n&quot;You'd Think the Public were All Sedated,\nA Society that's been Medicated,\nThe Dream of Huxley's 'Brave New World'\nWhere We Run to Pharma to be Pilled,\nLord Bertrand Russell also Predicted\nA Society by Needle and Pills Addicted,\nWhere People Ruled by Few Who Manage,\nWhile Excess Population Vanish,\nBy Darwin's Laws, Inferiors Eradicated,\nChosen Worthies Leap Forward, All Elated&quot;\n\nCorporate-Government Merger - Socialism-Fascism, Mussolini - No Complaints Allowed in Socialized Systems, Agency Retaliation against &quot;Troublemakers&quot; - Xplornet Satellite, Bandwidth Cutbacks for People Who Actually Use it. Eugenicists/Bioethicists Getting People to Accept Cull - World Banker Philanthropists and their Foundations - Going &quot;Green&quot; and &quot;Carbon Crimes&quot; - Neo and Morpheus in &quot;The Matrix&quot;, Agents and Asleep Public - Drugging of Young Males, Ritalin and Brain Shrinkage - The Oblivious Walking Dead. Big Pharma and Big Govt. in Big Bed - Dictates of International For-Profit Corporations - Musical Chairs of FDA and Drug Makers - Sam Bronfman, Prohibition, Politicians PUT IN Parliament - Corruption and Bribes as Standard Business Practice - Accumulation of Wealth then Bankers Plunder. Reasons NOT to Take Flu Shot - Viruses Grown on Diseased Organs and Tissues - Shedding Viruses, Quarantine of Fast-Breeders (Those Inoculated), Polio Shot - Use of Shame and Intimidation, Non-Inoculated are Stigmatized - YOUR Right to Your Body. Sterilization and Family Planning to Reduce Populations - Abortions/Birth Control to Reduce CO2 Emitters - Elite Eugenicists, George Bernard Shaw: Prove Your Need to Exist - Ultimate Class War. Depression, Psychiatric Drugs and Prozac - Learning to Handle Bad News, Gaining Understanding, Finding Purpose - Doing Your Part.\n\nTopics of show covered in following links:\n\n&quot;From FDA to GSK: The Dangerous Partnership between Government and Big Pharma&quot; by Dr. Peter Breggin (huffingtonpost.com) - July 26, 2008.\n\nToronto Truthseekers against FLU SHOT [Flyers and Posters for Distribution] (9-11.meetup.com).\n\n&quot;Contraception cheapest way to combat climate change&quot; by Richard Pindar (telegraph.co.uk) - Sept. 9, 2009.\n\n\n7) Sept. 10, 2009\n\nFear and Trepidation of New Reality Creation:\n&quot;How Can You be Jaded, Say You Lack Sensation,\nYou're Living through Exciting Bit, Reality Creation,\nPast Reality is becoming a Mere Hazy Dream,\nAs New One is Sustainable, We're All Going Green,\nTaxing Your Very Breathing, Exhaling CO2,\nNever has Such a Con been Pulled on Me and You,\nTaxed Down into Poverty, Head Down in the Dirt,\nThey'll Come for Your Body Parts, Steal Your Ragged Shirt,\nWe're Suffering for a Cause, Bright Future is the Lure,\nBringing in Equality, We'll All be Equally Poor&quot;\n\nDefinition of Reality - View of &quot;Stumbling&quot; Down through Time - Long-term Planning, X-Year Plans - Public Belief in News Media - Left and Right Wing of Same Bird - Psychopathic Multi-millionaires. Soviet Union, Doublethink Reality, Eradication of Memory - Politically Incorrect Taboos - Socialized Medicine, Walk-in Clinics (Factory Style), Canada, Medical Propaganda - Cry of &quot;Too Many People&quot;, Not &quot;Sustainable&quot; - No Pleasing Your Masters. Use of Satire and Comedy, Getting Through to the Land of the Blind - The Media Flu, Signs and Symptoms, Infection and Cure. Interdependence - Planned Population Reduction - Con Game of Money, Carbon Trading and Rationing, IPPR Think Tank, Personal CO2 Quotas - Increasing Taxation (without Representation) - Call to Spend (Buy Disposable Rubbish) to Keep Economy Going - Britain, &quot;Downsized&quot; Garbage Bins. Crashed Economy and Bankers' Payoff - New $3.4 Billion (and more) Building for Homeland Security HQ - Pentagon, Sept. 11, 1941 - Richard Nixon, Negotiator for Setting Up China - War to Change Entire World - Elimination of Middle Class (No Longer Needed) - Punishment of &quot;Children&quot;.\n\nTopics of show covered in following links:\n\n&quot;Global &quot;Media Flu&quot; Pandemic Worsens&quot; by May Kit-Allup, Timbuctoo (checktheevidence.co.uk) - July 17, 2009.\n\n&quot;Carbon-rationing proposed&quot; ITN (uk.news.yahoo.com) - Sept. 9, 2009.\n\n&quot;Age of the 'bonsai' bin: Families will be forced to cram their rubbish into mini wheelies&quot; by Steve Doughty (dailymail.co.uk) - Sept. 10, 2009.\n\n&quot;Ground broken on $3.4 billion Homeland Security complex&quot; by Mike M. Ahlers (cnn.com) - Sept. 9, 2009.\n\n&quot;Alan Greenspan: Market crisis 'will happen again' &quot; (news.bbc.co.uk) - Sept. 8, 2009.\n\n\n\n8) Sept. 11, 2009\n\n\nNew World Order, Phase Six:\n&quot;Planners of the Future, Rolling in Their Stride,\nGoals Rather Obvious, Nothing Much to Hide,\nSame Megalomaniacs Using a Fresh Cover,\nHigh in Ivory Towers, All-Seeing Vultures Hover,\nBy Scientific Propaganda, They with Certitude,\nSay the Peoples will come to Love Their Bleating Servitude,\nUnder Banner Sustainability and Other Think-Tank Drivelege,\nTo Eat, Drink and Live, will be Authorized as Privilege,\nBanks Plundered Us Again, Sheep have been Sheared,\nIn Confidence They Pulled it Off, Nothing to be Feared,\nPoliticos with Hand-Wringing, say We're to be Equal,\nObama / Brown at the Helm, Scriptwriters Writing Sequel&quot;\n\nPopulations Studied for Manipulation - Pre-Selected Politicians of CFR, Bilderberg et al - Karl Marx, Communist Meetings in London - Ruling Class Controlling Material Essentials of Life - Sustainability Spiel, Reduction of &quot;Useless Eaters&quot; - Reece Commission, Foundations Funding &quot;Far-Left&quot; Movements, Blend of Soviet and West - Public-Private Partnerships, Public Pays for and Private Profits - Aldous Huxley's &quot;Brave New World&quot; (1932), Efficient Totalitarian State, Love of Servitude - Mandatory Service to World State. Projections from Department of Defence - Planned Takedown - Aristocrats' Hatred of Middle Class - Arthur C. Clarke's &quot;2001&quot;, &quot;2010&quot;, &quot;3001&quot; books. Russia Predicts End of U.S. in 2010, Martial Law, New World Order - Culture Creation Industry, Public Mimic, Decadence - New Global Currency to Replace Dollar - Jacques Attali, Breakup of Nations into City-States - Interdependence (Total Dependence on System). Climate Change Con, Polls to See if Propaganda's Working - Environmental Psychology - Getting Peasants to Cut Back Lifestyle. Calendars, September 11th, Birth of Minerva (Self-Created). Fall of Berlin Wall.\n\nTopics of show covered in following links:\n\n&quot;Igor Panarin: U.S. Will Collapse By Next Year&quot; by Mike Eckel (huffingtonpost.com) - March 4, 2009.\n\n&quot;Numbers of Climate change sceptics are growing&quot; by Mike Swain (blogs.mirror.co.uk) - Sept. 10, 2009.\n\n&quot;Harriet Harman to force public bodies to discriminate against Middle [Class] Britain&quot; by Ian Drury (dailymail.co.uk) - Sept. 9, 2009.\n\n\n\n9) Sept. 14, 2009 \n\nBan Global Mandate Before Too Late:\n&quot;They're Out to Sap Remaining Vitality\nBy Dishing Out a New Reality,\nWorld's Suddenly Become a Scarier Place,\nWhile to the Bottom We All Race,\nOn the Way We Look Around,\nTerror, Plagues, Bankruptcies Abound,\nWere Experts, Drunk or Slummin',\nThat None of Them Saw it Comin',\nIs the Latest Show 'Yes We Can'\nPart of an Ongoing Elitist Plan?\nTo Restructure the World, Way We Live,\nTaught to Serve, Then Give and Give,\nHaving Freedom is Just Too Untidy,\nSay Experts Serving High and Mighty&quot;\n\nLevels of Reality - Aerial Spraying Worldwide since 1998, Wide-Expanding Chemtrails, Weather Manipulation, Use of HAARP - Media-Generated Swine Flu - Predictions of Swine Flu Virus Mutation, Call for Mandatory Annual Inoculations - United Nations, Department of Population Reduction, Women Sterilized by Tetanus Vaccination - Political Depopulation Agenda - Nanoparticles in Flu Vaccine, Continuous Cell Destruction and Infection - Male Infertility, No Crisis - Sterilization through Food, Water, Injections. Polio Vaccine, Live Simian Viruses (Cancer-Causing) - Bad Reactions blamed on &quot;Bad Genes&quot; - &quot;For the Greater Good&quot; in Mass Society - Trained Seals called Politicians. Thousands Report Side-Effects (Seizures, Paralysis, etc.) from Cervical Cancer Vaccine - 'Experts' Declare &quot;Benefits Outweigh Risks&quot;. Predatory Psychopathic Officials in Charge, Cover Up for Each Other. Internet Cyber-Cops - 9/11 Searches invite Malware Programs - Pentagon's Information Warfare - Constant War on Public - Drive into Overcrowded Cities. Marches of Protest against Obama's Agenda - The New World Soviet, Collectivist Management of Masses. Media Admissions Years after Events and Deaths - Gulf War 1 Soldiers Dying of Cancer--Depleted Uranium (Radioactive).\n\nTopics of show covered in following links:\n\n&quot;Nano Particles used in Untested H1N1 Swine Flu Vaccines&quot; by F. William Engdahl (globalresearch.ca) - Sept. 13, 2009.\n\n&quot;Two thousand schoolgirls suffer suspected ill-effects from cervical cancer vaccine&quot; by Laura Donnelly (telegraph.co.uk) - Sept. 12, 2009.\n\n&quot;Britain's ambassador for schools in Europe sacked over child porn charges&quot; (dailymail.co.uk) - Sept. 4, 2009.\n\n&quot;Internet Security Software Company Says 9/11 Searches Infected with Malware&quot; by Kurt Nimmo (informationliberation.com) - Sept. 14, 2009.\n\n&quot;A million march to US Capitol to protest against 'Obama the socialist' &quot; by David Gardner (dailymail.co.uk) - Sept. 14, 2009.\n\n&quot;Soldier died from exposure depleted uranium during Gulf War&quot; (telegraph.co.uk) - Sept. 10, 2009.\n\n &lt;a href=&quot;\nhttp://truthnews.info&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://truthnews.info&lt;/a&gt;\n88.7 FM Olympia, WA (west side)\n-))&gt;&gt;&gt;sig_garrett&lt;&lt;&lt;((-","torrent":{"xt":"urn:btih:c6655e34a8ac579210de0187b1019c0ab7e543a2","amp;dn":"Alan.Watt.2009.08.September.Mega.Pack1-sig_garrett","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6655e34a8ac579210de0187b1019c0ab7e543a2","infoHashBuffer":{"type":"Buffer","data":[198,101,94,52,168,172,87,146,16,222,1,135,177,1,156,10,183,229,67,162]},"announce":[],"urlList":[]}}