{"title":"Nickelback - If Everyone Cared  (Xvid-2nafish)","uid":5025879,"size":71911520,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c710b4520c7db6da591b646d86a63e9d3a5f7222&amp;dn=Nickelback+-+If+Everyone+Cared++%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1248692278,"description":"Source: TV\n\nFile Info:\n\nVideo: Xvid MPEG-4 Codec (XVID), 640x480, 29.97 fps\nAudio: Uncompressed PCM, 48000 Hz, 16 bit, 2 ch (stereo)\n\n\n&quot;If Everyone Cared&quot; is a Grammy nominated song, the sixth single released from Nickelback's All the Right Reasons, and the single released in Australia and the U.S. respectively (&quot;Animals&quot; was only released in Australia and the U.S., and &quot;Rockstar&quot; only in the UK and U.S.). It was released first in the UK, in 27 November 2006 then in the U.S. in 28 November 2006. The song entered inside the Top 40 on the ARIA Singles Chart on January 7, 2007. The song was then released in most other parts of the world in the beginning of 2007. It debuted at #50 on the Billboard Hot 100 in late January 2007, and climbed to #17. This makes All the Right Reasons the first Nickelback album to feature more than three top 20 singles in the United States. The song reached #1 on the Billboard Hot Adult Top 40 Tracks Chart.\n\nIt was announced that 100% of all digital sales for the song will be donated to the charities of Amnesty International, and the International Children's Awareness Canada. This ties into the theme of the song and video of caring about something to work towards the improvement of human civilization.\n\n&quot;If Everyone Cared&quot; has sold 1,110,819 downloads in the U.S. as of January 12, 2008.\n\nThe song was number 9 on VH1's Top 40 Videos of 2007.\n\nThe music video was Directed by Dori Oskowitz, and Produced by Justin Cronkite. Shot in Vancouver, Canada, then returning to Los Angeles for the post production process. It begins with Nickelback in the studio playing the song. Scenes of this are intercut with images and videos of past social justice and human rights events, essentially when an individual &quot;cared&quot; and ended up changing the world. The people shown are Betty Williams, who led a march of 35,000 women to the gravesites of three Northern Irish children after witnessing their deaths, Bob Geldof starting up Live Aid, Peter Benenson igniting what would become known as Amnesty International, and Nelson Mandela leading South Africa to its first democratic election, (which would end the racist apartheid rÃƒÂ©gime that had divided the country for 46 years). The video ends with a quote from Margaret Mead that reads &quot;Never doubt that a small group of committed people can change the world. Indeed, it is the only thing that ever has.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:c710b4520c7db6da591b646d86a63e9d3a5f7222","amp;dn":"Nickelback+-+If+Everyone+Cared++%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c710b4520c7db6da591b646d86a63e9d3a5f7222","infoHashBuffer":{"type":"Buffer","data":[199,16,180,82,12,125,182,218,89,27,100,109,134,166,62,157,58,95,114,34]},"announce":[],"urlList":[]}}