{"title":"Speed Commander v12.50.5700 Portable","uid":5049264,"size":14878857,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c72d873ab14200fc25ad1fda2b8a92b3929365d8&amp;dn=Speed+Commander+v12.50.5700+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoExcuses","files":5,"time":1249776648,"description":"Speed Commander v12.50.5700 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Key are included.\n\nThe powerful file manager SpeedCommander offers a multitude of exclusive features. Sort, copy, move or delete your files either using the mouse or keyboard.\n\nSpeedCommander displays files and folders using the tried and tested two-pane layout. This means that both source and target of a file operation will always be visible. This increases productivity compared to Windows Explorer. It always enhances the speed of navigation through folders, archives and FTP servers.\n\nSpeedCommander directly supports a variety of archive formats. This means you can unpack and create the 13 most common archive formats. A modern AddIn interface enables the integration of extensions, providing additional functionality. The WinCeFS AddIn allows you to access PDA devices via ActiveSync. The WfxWrapper AddIn can integrate file system plug-ins written for Total Commander (wfx).\n\nThe integrated FTP client supports FTP, FTP via SSH (SFTP) and FTP via SSL. SpeedCommander is also available in a native 64-bit version for Windows XP x64.\n\nSpeedCommander can be directly launched from USB sticks. A special build for U3-compatible USB sticks is available in the download section.\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.speedproject.de/enu/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.speedproject.de/enu/index.html&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=34&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=34&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:c72d873ab14200fc25ad1fda2b8a92b3929365d8","amp;dn":"Speed+Commander+v12.50.5700+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c72d873ab14200fc25ad1fda2b8a92b3929365d8","infoHashBuffer":{"type":"Buffer","data":[199,45,135,58,177,66,0,252,37,173,31,218,43,138,146,179,146,147,101,216]},"announce":[],"urlList":[]}}