{"title":"Honor Society - Where Are You Now","uid":5080265,"size":131295236,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c7ca279a35defecf645de0066363b0003e1586c1&amp;dn=Honor+Society+-+Where+Are+You+Now&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1252237227,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nHonor Society is a pop rock band. The band recently signed to a label under Jonas Records (in affiliation with Hollywood Records). In the summer of 2009, they performed the lead single in Summit Entertainment's Bandslam. The band is set to release their debut album Fashionably Late September 15, 2009, preceded by the Bandslam single &quot;Where Are You Now&quot;.\n\nIn June 2008, the band released their second EP, A Tale of Risky Business.\n\nIn 2009, they achieved more success with the Bandslam single called &quot;Where Are You Now,&quot; which is featured on the movie's soundtrack album. The song is currently featured on the Radio Disney countdown. Later, they also covered the The Cars song &quot;Magic&quot; for the Wizards of Waverly Place soundtrack.\n\nIn May of 2009, RollingStone.com named them one of the six breakout bands from Bamboozle to watch. \n\nIn July 2009, Honor Society performed at the Miss Teen USA pageant, which had a worldwide live online broadcast from Atlantis Paradise Island, in the Bahamas. In August 2009, the Honor Society presented the &quot;Fab-U-lous&quot; award at the 2009 Teen Choice Awards.\n\nTheir debut album will be released on September 15th, 2009. It will be called Fashionably Late and they just finished performing songs from this album on the Jonas Brothers World Tour 2009 where they were an opening act and on the Full Moon Crazy Tour where they just finished headlining. At the end of August 2009, they announced they will be doing a Fashionably Late tour with tickets out beginning of September.\n\nBandslam is the soundtrack album for Summit Entertainment's movie of the same name. The soundtrack was released on August 11, 2009 through Hollywood Records.\n\nDespite its good reviews, the soundtrack album failed to chart within the Billboard 200. The movie failed to chart in the top 10 in the United States, grossing $2,231,273 million on its opening weekend while destributed at 2,121 theatres.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c7ca279a35defecf645de0066363b0003e1586c1","amp;dn":"Honor+Society+-+Where+Are+You+Now","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7ca279a35defecf645de0066363b0003e1586c1","infoHashBuffer":{"type":"Buffer","data":[199,202,39,154,53,222,254,207,100,93,224,6,99,99,176,0,62,21,134,193]},"announce":[],"urlList":[]}}