{"title":"Ass Trap 2008","uid":5125244,"size":7653859624,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c813dbd3b1a45ddbe61b5e5c89d6b8f9c4f46334&amp;dn=Ass+Trap+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"stug0ts","files":149,"time":1255576426,"description":"\n\nNeed to trap some ass? Just leave it to John Leslie to build a better ass trap. And these girls respond to the bait! Alexis Texas starts us off, wearing a tight blue dress which she sprays down until the fabric is wet and clingy. She teases, bends over and oils up her perfect body; then she meets Marco Banderas and does some facesitting with her huge, beautiful ass. Alexis sucks his dick, gets fucked and takes a load of cum in her mouth. Two fellows are jacking off in the bathroom together when Thai sexpot Priva walks in. She sucks one guy's cock in the bathtub while the other guy fucks her. They go to the next room, and Priva gets sweet anal and double penetration and a double facial! Fine-ass Tori Black is teasing us in a big fancy house until she spies sultry Dana DeArmond in another room fingering her pussy. Sean Michaels enters, and Dana sits her sexy bottom right on his face. Tori finally joins in for a threeway, Dana gets anally reamed by Sean's big black cock, and he delivers a messy facial to both girls. Finally, Bobbi Starr walks around wearing a tight pink dress and sits on a stool where she can show off her ass most effectively. Two studs walk in and slide a double-headed toy into her ass and pussy, greasing up her fleshy buttcheeks. Beautiful Bobbi can't wait to suck their dicks, get anally fucked and drink down a double load of sperm!\n\n\n\n\nCOVERS / SCREENS / MORE INFO :\n\n &lt;a href=&quot;\nhttp://www.FuckBits.com/torrent/Anal/12589/Ass.Trap.2008.XXX.NTSC.DVD9-ETM.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.FuckBits.com/torrent/Anal/12589/Ass.Trap.2008.XXX.NTSC.DVD9-ETM.html&lt;/a&gt;\n\n\n\nEnjoy, Seed and Comment !\n","torrent":{"xt":"urn:btih:c813dbd3b1a45ddbe61b5e5c89d6b8f9c4f46334","amp;dn":"Ass+Trap+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c813dbd3b1a45ddbe61b5e5c89d6b8f9c4f46334","infoHashBuffer":{"type":"Buffer","data":[200,19,219,211,177,164,93,219,230,27,94,92,137,214,184,249,196,244,99,52]},"announce":[],"urlList":[]}}