{"title":"Alex.Jones.Show.2009.08.14-sig_garrett","uid":5053940,"size":48670774,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c92049e68fe599161fd9db55330287585222282d&amp;dn=Alex.Jones.Show.2009.08.14-sig_garrett&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sig_garrett","files":6,"time":1250306744,"description":"THE ALEX JONES SHOW\n2009.08.14 Friday\n\nAlex welcomes to the show conservative political activist, author, former diplomat, and presidential candidate Alan Keyes. In May, Keyes was arrested with other pro-life activists prior to Obama's commencement speech at Notre Dame. Keyes also contests Obama's eligibility to be president on the birth issue. Alex talks with Stewart Rhodes, founder of Oath Keepers, a non-partisan association of currently serving military, reserves, National Guard, peace officers, and veterans who swore an oath to support and defend the Constitution against all enemies, foreign and domestic. The SPLC recently attempted to connect Rhodes and Oath Keepers to the militia movement. Regular guest Bob Chapman of the International Forecaster also makes an appearance. Alex covers the news and takes your calls. \n\nHOUR 1: Foreign and US troops training to pull triggers on American people - \nupwards of million regular police force and half million regular military, get\nready for troops to take your farms - homes - businesses - possessions, now DHS\nis (by stated threat assesssments) meant for American population, Whitehouse\nhiring people upwards $500 to protest protesters and anti deathcare, brain washed\npolice minions, etc.\n\nHOUR 2: News, obama joker posters, pentagon to post over 400,000 troops in USA, \ntyranny is completely out in the open now, AJ addresses other talk show hosts\nand web masters, appeals for sense of freedom and love of life, going into \nrevolution, staged attacks or Reichstag fire in the works, mainstream media is\ncalling for AJ's arrest under racism and hate crime, STEWART RHODES Oath Keepers,\nopen lines with Rhodes\n\nHOUR 3: Establishment wants bloody revolt?, more Stewart Rhodes, BOB CHAPMAN,\nmore bailout by year end, federal reserve created another $500 billion out of \nnothing for currencies, the federal reserve having foreign central banks buying\nU.S. treasuries - monetizing the dollar and debt with everyone sinking simultaneously\nand assets going to the elite, Open Lines with Chapman, mass graves,  \n\nHOUR 4: Dr. ALAN KEYES, cover everything from politics to eugenics, pandemic flu for\nmartial law pretext, DOJ and DHS declaring right wing as terrorists etc., Michael Savage\nmentioned, Riechstag Fire was Nazi turning point - an inside job staged event, etc.\n\n\n&gt;&gt; 88.7 FM Olympia, WA (west side)\n&gt;&gt; sig_garrett &lt;&lt; &lt;a href=&quot;\nhttp://www.truthnews.info&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.truthnews.info&lt;/a&gt;\n","torrent":{"xt":"urn:btih:c92049e68fe599161fd9db55330287585222282d","amp;dn":"Alex.Jones.Show.2009.08.14-sig_garrett","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c92049e68fe599161fd9db55330287585222282d","infoHashBuffer":{"type":"Buffer","data":[201,32,73,230,143,229,153,22,31,217,219,85,51,2,135,88,82,34,40,45]},"announce":[],"urlList":[]}}