{"title":"The littlest warrior (1961)","uid":5659065,"size":734093348,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c9328db6244b52f917ca2c829452eb5151bfdad8&amp;dn=The+littlest+warrior+%281961%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Elchinodepelocrespo","files":1,"time":1277904066,"description":"Anju to zushio-maru (1961) is a very interesting children's animated version of the classic Japanese folk tale known as &quot;Sansho the Bailiff&quot;. The first film version was Kenji Mizoguchi's classic Sansho Dayu (1954), based on the short story written by Ogai Mori.\n\nIt contains some songs sung by the characters. There are talking animals that follow Zushio and Anju around also. The storyline is a bit different than the 1954 film. The thing that got Zushio's dad in trouble was a dispute over hunting rights on land surrounding their home. Another official started a big forest fire out of spite and blamed him for it - that's why he is exiled. Sansho has several sons, including one who is very cruel and another who is very kind and spiritual. The rest of the main story details are fairly similar to the 1954 film. Although it is clearly a children's film, it was still entertaining. If you like the original film, you will find it interesting to watch another telling of this classic story.\n\nThe English language version of Anju to zushio-maru is titled &quot;The Littlest Warrior&quot;. It runs for 70 minutes, while the complete Japanese version runs for 83 minutes. ","torrent":{"xt":"urn:btih:c9328db6244b52f917ca2c829452eb5151bfdad8","amp;dn":"The+littlest+warrior+%281961%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9328db6244b52f917ca2c829452eb5151bfdad8","infoHashBuffer":{"type":"Buffer","data":[201,50,141,182,36,75,82,249,23,202,44,130,148,82,235,81,81,191,218,216]},"announce":[],"urlList":[]}}