{"title":"Vrije.Val.Free.Fall.2010.DVDRIP","uid":5565135,"size":1240162777,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c94eaff2240785feaf582343e3c380558b7032ef&amp;dn=Vrije.Val.Free.Fall.2010.DVDRIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"johnsonBS","files":-1,"time":1273958500,"description":"Vrije Val / Free fall (2010)\n\nOfficial international film festival DVD rip.\n\n\n\nSynopsis - English:\n\n\nImagine that...\n\n...your new love is diagnosed with HIV\n...there is nothing you can do\n...it affects you more than her\n...it's all in your imagination...\n\nWhat Eric loves even more than making music with his band, is the bar-lady who works at their favorite hangout.\nWhen they eventually fall in love, their initial frivolous relation is overshadowed by Eric's concern about the times they made love unprotected. He demands of his new girlfriend to have a HIV test, which she reluctantly agrees to. \n\nWhile the test-results from the lab take some time to return, Eric has some pretty bad dreams about the future... In his depressed imagination - that weaves a black streak in his rational thinking and everyday life - she is diagnosed with HIV and will eventually pass away from the terrible disease that is AIDS. His life, his music and his friends all suffer from Eric's depression and only his girlfriend can turn the tide... \n\nVrije Val is a short silent movie, with no spoken word, but packed with music, emotions and beautiful imagery. It addresses the sensitive issues of HIV, AIDS and prejudice in a non-provocative and accessible way. \nVrije Val is based on a true story by Karel Hamm. \n\nAll profit of this movie benefits the battle against HIV, Aids and prejudice!\n\n\n\n\nSynopsis - Dutch:\n\nStel je voor...\n\n...je nieuwe liefde blijkt besmet met HIV\n...er is niets dat jij kan doen\n...het raakt jou meer dan haar\n...het zit tussen jouw oren...\n\nWat Eric nog leuker vindt dan muziek maken met zijn band, is het bar-meisje van hun favoriete kroeg.\nWanneer ze uiteindelijk verliefd op elkaar worden, wordt hun frivole relatie overschaduwd door Erc's zorgen omtrent de keren dat ze onveilige sex hebben gehad. Hij vraagt zijn nieuwe vriendin om zich op HIV te laten testen. \n\nTerwijl de testresulaten op zich laten wachten, begint Eric kwade dromen over de toekomst te krijgen... In zijn depressieve verbeelding - die zich als een zwart lint door zijn dagelijkse leven windt - is zij HIV positief en zal ze uiteindelijk sterven aan de verschrikkelijke ziekte AIDS. Zijn leven, zijn muziek, zijn vrienden en zijn relatie hebben zwaar te lijden onder Eric's depressie. Alleen zijn vriendin kan het tij keren... \n\nVrije Val is een korte stomme film, zonder gesproken woord, maar vol met muziek, emoties en prachtige beelden. Het raakt gevoelige onderwerpen als HIV, AIDS en voor-oordelen op een niet-provocatieve of -confronterende wijze. \nVrije Val is gebaseerd op een waargebeurd verhaal, geschreven door Karel Hamm. \n\nAlle opbrengsten van deze film komen ten goede aan de strijd tegen HIV en Aids in Nederland!\n\n\nGenre: Drama / Romantiek\nRegio: 0\nJaar van uitgave: 2010\nRegisseur: Martin Beek\nUitgever: Disturbing Pictures\nSpeelduur: 25 minuten \nLeeftijd: 12 Jaar\nActeurs: Aukje van Ginneken, Erik Rooseboom\n\nIMBDb: http://www.imdb.com/title/tt1648130/\n","torrent":{"xt":"urn:btih:c94eaff2240785feaf582343e3c380558b7032ef","amp;dn":"Vrije.Val.Free.Fall.2010.DVDRIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c94eaff2240785feaf582343e3c380558b7032ef","infoHashBuffer":{"type":"Buffer","data":[201,78,175,242,36,7,133,254,175,88,35,67,227,195,128,85,139,112,50,239]},"announce":[],"urlList":[]}}