{"title":"Spyware Doctor With AV 2010 V7.0.0.508-FULL","uid":5663449,"size":36640214,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c9dab9f985f0b4927094c9fb37ca458e92204db1&amp;dn=Spyware+Doctor+With+AV+2010+V7.0.0.508-FULL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"odain191","files":4,"time":1278050818,"description":"Spyware Doctor provides three-way spyware protection for your PC through real-time threat blocking, advanced system scanning and immunization against\nknown browser infections. Spyware Doctor is a multi-award winning spyware removal utility that detects, removes and protects your PC from thousands of potential\nspyware, adware, Trojans, keyloggers, spybots and tracking threats. Protect your privacy and computing habits from prying eyes and virtual trespassers with the\nhelp of Spyware Doctor.\n\nAnti-virus software and firewalls do not fully protect your system against the majority of spyware and privacy threats. Because spyware is commonly bundled with\nsoftware downloads, attached to e-mails, or transmitted through networks it can appear to be legitimate software, but once installed it can be nearly impossible\nto detect and remove without the help of a dedicated spyware removal tool like Spyware Doctor.\n\nSpyware Doctor is advanced technology designed especially for people, not just experts. That is one reason why it won the People's Choice Award in 2005, 2006 and 2007.\nIt is automatically configured out of the box to give you optimal protection with limited interaction so all you need to do is install it for immediate and ongoing protection.\n\nSpyware Doctor's advanced OnGuard technology only alerts users on a true Spyware detection. This is significant because you should not be interrupted by\ncryptic questions every time you install software, add a site to your favorites or change your PC settings. Such messages can be confusing and lead to\nundesirable outcomes such as inoperable programs, lost favorites or even Spyware being allowed to install on the system. We've done the research so you don't have to.\n\nSpyware Doctor Tools:\n- Spyware &amp; Adware Scanner Keylogger\n- Guard Popup\n- Blocker Phishing\n- Protector Real Time\n- Protection Browser\n- Guard Spyware Cookie\n- Guard Malware\n- Immunizer","torrent":{"xt":"urn:btih:c9dab9f985f0b4927094c9fb37ca458e92204db1","amp;dn":"Spyware+Doctor+With+AV+2010+V7.0.0.508-FULL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9dab9f985f0b4927094c9fb37ca458e92204db1","infoHashBuffer":{"type":"Buffer","data":[201,218,185,249,133,240,180,146,112,148,201,251,55,202,69,142,146,32,77,177]},"announce":[],"urlList":[]}}