{"title":"ZEITGEIST 1 E 2 - DVD ISO - AVI - LEGENDAS PORTUGUES","uid":5029099,"size":5973593815,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c9f2c97100a3899ce98ad82e6ec2e87e50ced6e4&amp;dn=ZEITGEIST+1+E+2+-+DVD+ISO+-+AVI+-+LEGENDAS+PORTUGUES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CamiloMM","files":10,"time":1248829342,"description":"READ THIS:\nI'm trying to spread this movie because I think the message it contains is very important. The world is in a state of urgency and need for change. &quot;It's time to WAKE UP!&quot; and the Zeitgeist movies do an excelent job at this. Watch, form your opinions and join the movement at www.thezeitgeistmovement.com\n\nThe torrent is big but you can download only the parts you are interested. I highly recomend the .iso file wich contains both movies ready to burn and give to everybody. If you have a slow internet connection, download just the folders of both movies and watch in the computer or do the conversion to dvd yourself using the ConvertXtoDVD app or similar programs.\n\nThis torrent if focused in the Brazilian/Portuguese speakers audience(because the dvd iso contains portuguese subtitles), but everybody from anywhere in the world should/can download it and search for subtitles of your language, or go to the website www.zeitgeistmovie.com and watch there, theres tons of translations from various languages. The only difference is that the files I'm sharing here have a greater quality than the online versions on the website.\n\nContents:\n\nZeitgeist.Final.Edition.DVDRip.XviD - The first Zeitgeist movie, released on June, 2007 by Peter Joseph.\n\nZeitgeist.Addendum.DVDRip.XviD - The second Zeitgeist movie, Zeitgeist Addendum(a.k.a Zeitgeist 2), release in October, 2008 by Peter Joseph.\n\nZeitgeist.iso - ISO file containing the DVD image of both movies with portuguese subtitles only. Burn the file on DVD with Imgburn(www.imgburn.com), Nero or any dvd burning app of your choice.\n\n\nThe Revolution is NOW\n\n\n\n------------------\n\n\n\nLEIA:\nEstou fazendo a minha parte para espalhar este filme pois acredito que a mensagem que ele passa ÃƒÂ© muito importante. Passamos por um momento crÃƒÂ­tico no mundo e precisamos &quot;ACORDAR&quot; e Zeitgeist cumpre muito bem essa tarefa. Assista, forme sua opiniÃƒÂ£o e junte-se ao movimente em www.thezeitgeistmovement.com\n\nO torrent ÃƒÂ© grande mas vocÃƒÂª pode baixar apenas as partes que te interessar. Eu recomendo que baixe a .iso de DVD que contÃƒÂªm ambos os filmes prontos para queimar em dvd e dar pra quem vocÃƒÂª quiser. Se sua internet for lenta, baixe apenas os arquivos .avi, assista em seu computador e faÃƒÂ§a a conversÃƒÂ£o para dvd usando o ConvertXtoDVD ou programas similares.\n\n\nConteÃƒÂºdo do Torrent:\n\nZeitgeist.Final.Edition.DVDRip.XviD - ContÃƒÂ©m o primeiro Zeitgeist, arquivo original lanÃƒÂ§ado por Peter Joseph em Junho de 2007, e a legenda em portuguÃƒÂªs revisada.\n\nZeitgeist.Addendum.DVDRip.XviD - ContÃƒÂ©m o filme Zeitgeist Addendum(a.k.a Zeitgeist 2), arquivo original lanÃƒÂ§ado por Peter Joseph em Outubro de 2008, e com legenda em portugues revisada.\n\nZeitgeist.iso - ISO contendo a imagem de DVD com os dois filmes e legendas revisadas, funciona em qualquer aparelho de DVD. Queime a imagem com o Imgburn(www.imgburn.com), Nero ou qualquer programa de sua preferÃƒÂªncia.\n\n\nA RevoluÃƒÂ§ÃƒÂ£o ÃƒÂ© AGORA\n","torrent":{"xt":"urn:btih:c9f2c97100a3899ce98ad82e6ec2e87e50ced6e4","amp;dn":"ZEITGEIST+1+E+2+-+DVD+ISO+-+AVI+-+LEGENDAS+PORTUGUES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9f2c97100a3899ce98ad82e6ec2e87e50ced6e4","infoHashBuffer":{"type":"Buffer","data":[201,242,201,113,0,163,137,156,233,138,216,46,110,194,232,126,80,206,214,228]},"announce":[],"urlList":[]}}