{"title":"Fall Out Boy - Dance, Dance","uid":5062000,"size":160165892,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ca37bb3b6eb7b67a902bb172e4a64d0a285590b1&amp;dn=Fall+Out+Boy+-+Dance%2C+Dance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1250752508,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Dance, Dance&quot; is the second single from Fall Out Boy's third studio album From Under the Cork Tree. Released in 2006, the single reached #9 in the U.S., becoming their second Top 10 single. It also reached #6 on the Pop 100. The single reached #8 on the UK Singles Chart, becoming their second Top 10 hit there as well. The song is featured in What A Catch, Donnie.\n\nThis song has been included in multiple video games; Burnout Revenge, Madden 2006, the home version of Dance Dance Revolution SuperNOVA, SingStar Pop Hits, the US version of SingStar Rocks!, and as downloadable content for Karaoke Revolution Presents American Idol Encore 2 for the PlayStation 3. It also appeared on the Brazilian and Argentinian version of Infinity on High, From Under the Cork Tree's 2007 follow-up. Pete Wentz prevented the Kidz Bop Kids from singing this on Kidz Bop 10 because of the sexual overtones to the song.\n\nThe music video shows the members of the band performing at a homecoming dance, and simultaneously attending as nerdier versions of themselves.\n\nThe music video was filmed at the famous Salesian High School, which is located in New Rochelle, New York, a suburb of New York City. A cameo is made by Ben Jorgensen of the rock group Armor for Sleep as well as Travis McCoy of Gym Class Heroes.\n\nThe video for &quot;This Ain't a Scene, It's an Arms Race&quot; is a continuation of this video, showing the fans as being cardboard, and the whole thing being fake. Pete's date in the video is one of the attendees at Pete's funeral in this video.\n\nThe &quot;Dance, Dance&quot; music video premiered on October 11, 2005, and has been subsequently retired from Total Request Live.\n\nThe picture on the back of the book that Andy Hurley is reading at a scene where he is on the bleachers is also on the album From Under the Cork Tree.\n\nKatrina Bowden, best known now as Cerie in television series 30 Rock, features heavily in this video clip.\n\nThe black and white striped jacket Patrick was wearing in the video can be seen in the music video for Fall Out Boy's music video, What a Catch, Donnie.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ca37bb3b6eb7b67a902bb172e4a64d0a285590b1","amp;dn":"Fall+Out+Boy+-+Dance%2C+Dance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca37bb3b6eb7b67a902bb172e4a64d0a285590b1","infoHashBuffer":{"type":"Buffer","data":[202,55,187,59,110,183,182,122,144,43,177,114,228,166,77,10,40,85,144,177]},"announce":[],"urlList":[]}}