{"title":"Cream Lemon[Lamonae] 1-13","uid":5067577,"size":2378989568,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:ca7febd0f6059c1f49926ed0ee626d8372406c30&amp;dn=Cream+Lemon%5BLamonae%5D+1-13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"killa132004","files":13,"time":1251088829,"description":"Cream Lemon is a collection of somewhat surreal stories having different settings and situations at different points in time, with genres including fantasy, comedy, suspense, sci-fi, action, drama and mystery. The overriding theme of the series is sex of almost any kind imaginable. Most chapters stand alone as separate titles, having no relation to any other stories within the Cream Lemon series. The main recurring characters are a brother, Hiroshi, and sister, Ami, who are edging ever closer to an incestuous relationship.\n\nCream Lemon often focuses on unrealistic and exaggerated themes that could never happen. One such example is of the story of a girl who does not like sex because of a series of rapes in her family. To cure this, the school counseler orders her to strip off in front of the art class and masturbate herself to the point of orgasm. She then has public sex with a boy and likes it, causing the whole class to start having sex. Others are equally surreal.(Wikipedia.org)\n\nIf you do not like this stuff don't download, look at tags for information on what it is. The genre is lolicon, and contains many other weird subjects.\n\nFirst torrent, be gently. :P\nI'll release more as they are subbed, theres 40 of the original series and alot more of other series.\n\nSubbed, xvid,\nLanguage: Japanese\nSubtitle: English\nGroup: Lamonae","torrent":{"xt":"urn:btih:ca7febd0f6059c1f49926ed0ee626d8372406c30","amp;dn":"Cream+Lemon%5BLamonae%5D+1-13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca7febd0f6059c1f49926ed0ee626d8372406c30","infoHashBuffer":{"type":"Buffer","data":[202,127,235,208,246,5,156,31,73,146,110,208,238,98,109,131,114,64,108,48]},"announce":[],"urlList":[]}}