{"title":"Die Sieger","uid":5124813,"size":5755195392,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:cab6c65597247a33d80f1ed2d198d081129b8e3c&amp;dn=Die+Sieger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FuTG","files":6,"time":1255553446,"description":"Der DÃƒÂ¼sseldorfer Polizeihauptmeister Karl Simon gehÃƒÂ¶rt einem Spezialeinsatzkommando an. Als er und seine Truppe ein Gangstertreffen aufmischen, kann einer der MÃƒÂ¤nner fliehen. Simon glaubt seinen Freund Heinz Schaefer wiedererkannt zu haben. Der ehemalige SEK-Kollege hatte vier Jahre zuvor in einer Kurzschlussreaktion sein geistig behindertes Kind getÃƒÂ¶tet und danach angeblich Selbstmord begangen. Simon hat einen schrecklichen Verdacht Er glaubt, dass Schaefer noch lebt und als V-Mann mit falscher IdentitÃƒÂ¤t fÃƒÂ¼r die BehÃƒÂ¶rden arbeitet. Bei seinen Recherchen kommt er einem Komplott auf die Spur ... \n\n\n\nWer glaubt, dass ein Action-Film mit allem genrespezifischem Drum und Dran, wie Explosionen und waghalsigen Stunts, in Deutschland nicht machbar ist, hat 1994 anscheinend Dominik Grafs von der Kritik gefeierten Film Die Sieger verpasst.\nBei dem Film, in dem ein Mitarbeiter eines SEK-Teams dunklen Machenschaften seiner Organisation auf die Spur kommt, handelt es sich um einen der wenigen gelungenen Versuche, dem Genre des Action-Thrillers einen glaubhaften deutschen Vertreter zu schenken. Zudem setzt der Film nicht auf platte Action-Bolzerei, sondern verbindet die technischen Effekte mit einem cineastischen Anspruch, der die Verwerfungen im Seelenleben der Protagonisten ÃƒÂ¼berzeugend thematisiert. Dazu trÃƒÂ¤gt auch die hervorragende Schauspielerriege bei, die nicht nur in den Hauptrollen mit Herbert Knaup, Hansa Czypionka, Heinz Hoenig oder Katja Flint prominent besetzt ist. Die detailliert ausgearbeiteten Nebenrollen, wie die des im September 2002 verstorbenen Werner Karle jun. als bulliger SEK-KÃƒÂ¤mpfer, der in den MÃƒÂ¼hlen seines eigenen Apparates umkommt, tragen ebenfalls zur Aura des Films bei.\n\nDeswegen stÃƒÂ¶rt es nicht weiter, dass ab der Mitte des Films die Handlung verworrener wird. SchlieÃƒÅ¸lich gerÃƒÂ¤t auch die Psyche der Filmhelden zunehmend in Unordnung, bevor sich alles im tÃƒÂ¶dlichen Showdown auflÃƒÂ¶st.\n\n\nNo Subs available. 6 individual files.\n\n","torrent":{"xt":"urn:btih:cab6c65597247a33d80f1ed2d198d081129b8e3c","amp;dn":"Die+Sieger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cab6c65597247a33d80f1ed2d198d081129b8e3c","infoHashBuffer":{"type":"Buffer","data":[202,182,198,85,151,36,122,51,216,15,30,210,209,152,208,129,18,155,142,60]},"announce":[],"urlList":[]}}