{"title":"Planetary Emergency: One Planet, One Chance (2008.DVD-ISO.NTSC)","uid":5050321,"size":4109681727,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:cc58970f284563f6bbfb482fcf662c915cff22fc&amp;dn=Planetary+Emergency%3A+One+Planet%2C+One+Chance+%282008.DVD-ISO.NTSC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"VeganFreak","files":-1,"time":1250163952,"description":"Release note:\n    There are 2 main ways you can watch this movie.\n    1) Burn the ISO file using a program such as NERO to a DVD-ROM and watch in your NTSC compatible DVD Player.\n    2) Use a program like MagicISO to extract and watch the movie on your computer.\n\n    I'm proud to be the first to bring this DVD to the torrenting world. Formatted and compiled by yours truly, nfo file and CD cover image included. I picked this up for free at the VIVA UK Veggie Show ( http://www.viva.org.uk/roadshows09/veggieshow.html ), after eating a lot of delicious Cheezly, Sheese spreads, and vegan ice cream. :D~\n\n    **************************************************\n\n    Planetary Emergency: One Planet, One Chance  \n                                  \n    Author ...........: Supreme Master TV\n    Author's Website .: http://www.suprememastertv.com\n    Release Date .....: 2008\n    Theater Date .....: N/A\n    DVD RLS Date .....: 2008\n    DVD Runtime ......: 02:59:37 (Approx. 3 Hours)\n    Spoken Language...: English (US English)\n    IMDb URL..........: None yet.\n    IMDB Rating ......: N/A\n    DVD REGION .......: REGION 1 (NTSC); North America\n    Video Size .......: 704 x 576\n    Resolution .......: 4:3\n    Audio Codec ......: Unknown (DVD)\n    Audio Bitrate ....: N/A\n    Subtitles ........: English, French, Spanish, Portuguese, Japanese, \n                        Chinese, Hindu, and more that I do not recognise. \n                        Approx 20 different subtitles are included.\n    Subtitle Info ....: Subtitles are physically embedded into the video and \n                        not an optional DVD feature. \n    File Size of DVD .: 3.82 GB\n    File Size of ISO .: 4,012,896 KB (4.01 GB)\n    Author's Note ....: &quot;Please copy this DVD and give to more people.Thanks!&quot;\n    Uploader's Note ..: Environmental and animal rights activists may burn and\n                        distribute this DVD. DVD Cover image is included in \n                        this torrent for printing on CD/DVD labels, using \n                        special software.\n                        \n\n   - Summary -\n\n   Planetary Emergency is an environmental documentary that raises awareness \n   to Earth's deteriorating condition caused by harmful human lifestyles, and \n   explains how lifestyle changes such as converting to a vegan diet is\n   urgently needed to effectively reverse climate change and improve living \n   conditions on our planet.\n\n   Interviews with many prominent politicians, scientists, professors, etc. \n   bring about environmental perspective to the viewer.\n\n\n   In addition to exploring the environmental causes and preventative measures\n   that can be taken, the author also explores the topic of animal cruelty, \n   and explains how being compassionate towards animals brings an \n   interconnected benefit to the environment as well. Footage of various farm \n   animals is shown, portraying shocking yet standard and common factory farm \n   conditions. This gives motivation to go vegan not only for the environment,\n   but also to help end unnecessary suffering. Health benefits are also \n   presented.\n\n\n\n\n\n   - Interviews -\n\n   Supreme Master Ching Hai\n     |.. World Renowned Humanitarian, Artist, and Spiritual Teacher.\n\n   Dr. Janice Lough\n     |.. Great Barrier Reef researcher, Australian Institute of Marine \n         Science.\n\n   Dr. James Hansen\n     |.. Director, NASA Goddard Spaceflight Centre, USA.\n\n   Dr. Gordon McBean\n     |.. Climatologist, Chair for Policy in the Institute for Catastrophic \n         Loss Reduction, Professor, University of Western Ontario.\n\n   Dr. David Archer\n     |.. Professor of Geophysical Sciences at the University of Chicago, USA.\n   \n   Prince Charles\n     |.. His Royal Highness, The Prince of Wales, United Kingdom.\n\n   Yvo de Boer\n     |.. Executive Secretary, United Nations Framework Convention on Climate \n         Change.\n\n   Ken Livingstone\n     |.. 1st Mayor of London, England.\n\n   Al Gore\n     |.. 45th Vice President of the United States, Environmental Activist,\n         2007 Nobel Peace Prize Laureate.\n\n   Maneka Gandhi\n     |.. Parliament Member, Former India Environment Minister, Vegan.\n\n   Dr. Marc Imhoff\n     |.. Terra Project Scientist, NASA Goddard Spaceflight Center, at UNESCO\n         International Year of Planet Earth launch.\n\n   Dr. Derek Mueller\n     |.. Northern and Polar studies researcher, Trent University, Canada.\n\n   Dr. Ted Scambos\n     |.. Head scientist at the National Snow and Ice Data Center in Boulder,\n         Colorado, USA.\n\n   Dr. Gregory M. Flato\n     |.. Canadian Centre for Climate Modeling and Analysis.\n\n   Dr. Gerald Dickens\n     |.. Associate professor of Earth Science, Rice University, USA.\n\n   Dr. Roy Hyndman\n     |.. Senior Research Scientist, Pacific Geoscience Centre, former \n         President of the Canadian Geophysical Union, Canada.\n\n   Ms. Liz Thompson\n     |.. Environmental advocate of Small Island Developing States, former \n         Minister of the Environment of Barbados, United Nations 2008 Earth \n         Champion.\n\n   Mr. Wael Hmaidan\n     |.. Head of Arab Climate Campaign, Executive Director of the League of \n         Independent Activists, Lebanon.\n\n   Dr. Mihir Deb\n     |.. Director of School of Environmental Studies, University of Delhi, \n         India.\n\n   Dr. Rajendra Pachauri\n     |.. Chief of the UN Intergovernmental Panel for Climate Change (IPCC).\n\n   Surendra Shrestha\n     |.. Director, Strategic Resource Mobilization, United Nations Environment\n         Porgramme.\n\n   Lionel Friedberg\n     |.. Documentary Producer / Script Writer / Cinematographer, Emmy-Award   \n         winning Producer, USA &amp; vegan.\n\n   Dr. Kirk Smith\n     |.. Professor of global environmental health, University of California at\n         Berkerley, USA.\n\n   Marley Tsongas\n     |.. Climate Project presenter, trained by world-renowned environmentalist\n         Al Gore, USA.\n\n   Dr. Shaw C. Liu\n     |.. Member of United Nations Intergovernmental Panel on Climate Change,  \n         Director of Research Center for Environmental Changes, Formosa \n         (Taiwan).\n\n   Dr. Richard Schwartz\n     |.. President of Jewish Vegetarians of North America\n\n   Marianne Thieme\n     |.. Member of Dutch Parliament, Chairwoman of Party for the animals, \n         vegetarian.\n\n   Gary L. Francione\n     |.. Professor of Law, Rutgers University Law School, USA, Author &amp; vegan.\n         Pioneer of the modern 'abolitionist' movement, philosopher, anti-PETA\n         crusader, philosophical advocate of his self-proclaimed &quot;Abolitionist\n         Approach&quot; which effectively divides animal rights groups into those \n         who support tactics that are pure and limited (ie, trying \n         quixotically to lawfully end the property status of animals) to those\n         that are effective and understandably (to most people) compromising, \n         (ie, naked peta protest campaigns that catch peoples' attention yet \n         come at the cost of subjectifying women in an anti-feminist manner).\n \n         The incremental approach Francione preaches in his writings does not \n         involve compromise, therefore is not really incremental but rather \n         preaches to a more receptive animal liberation organisation, than a \n         divided collective animal rights organisation.\n         Francione remains controversial and may effectively encourage some \n         animal rights activists to engage in more extreme (animal liberation) \n         approaches, given an uncompromising and therefore arguably unbalanced\n         position.\n   \n  \n  - Quotes -\n\n   &quot; Nothing will benefit human health and increase chances for survival of \n   life on Earth as much as the evolution to a vegetarian diet.&quot;\n   - Albert Einstein\n\n   &quot;You have just dined, and however scrupulously the slaughterhouse is \n    concealed in the graceful distance of miles, there is complicity.&quot;\n   - Ralph Waldo Emerson\n\n   &quot;We are so close to the red line, we may wake up tomorrow and discover \n    there is nothing left to save.&quot;\n   - Maneka Ghandi, former Indian Environment Minister\n\n   &quot;While we ourselves are the living graves of murdered beasts, how can we \n    expect any ideal conditions on this earth?&quot;\n   - George Bernard Shaw, co-founder of the Independent Labour Party\n\n\n    **************************************************\n\n    About SupremeMasterTV: \n                                  \n\n    SupremeMasterTV is a free-to-air satellite channel \n    broadcasting 24 hours a day, 7 days a week, with a\n    variety of engaging programs in English with over \n    30 subtitles and 60 languages. Being the ideal \n    television channel that brings to your life \n    Nobility and Spirituality. Broadcasting on 14 \n    satellite platforms across the globe.\n\n    Watch Supreme Master TV online for free at:\n\n   &lt;a href=&quot; http://www.suprememastertv.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.suprememastertv.com&lt;/a&gt;\n\n   'Your Constructive Global TV channel!'\n\n    **************************************************","torrent":{"xt":"urn:btih:cc58970f284563f6bbfb482fcf662c915cff22fc","amp;dn":"Planetary+Emergency%3A+One+Planet%2C+One+Chance+%282008.DVD-ISO.NTSC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc58970f284563f6bbfb482fcf662c915cff22fc","infoHashBuffer":{"type":"Buffer","data":[204,88,151,15,40,69,99,246,187,251,72,47,207,102,44,145,92,255,34,252]},"announce":[],"urlList":[]}}