{"title":"Ozzy Osbourne - So Tired","uid":5130578,"size":146071556,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cc73070f3b978039a3763e68946cf0eaad5f0b7e&amp;dn=Ozzy+Osbourne+-+So+Tired&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1256037817,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nBark at the Moon is a heavy metal album by Ozzy Osbourne, released on December 10, 1983. This album features former Mickey Ratt, Rough Cutt, and Dio guitarist Jake E. Lee.\n\nOf all his solo albums only here is writing credited to Osbourne alone, although he states the title track was co-written with guitarist Jake E. Lee in the liner notes to The Ozzman Cometh. Osbourne's former bassist Bob Daisley has stated that he co-wrote most of the music with Lee and wrote the vast majority of the lyrics. Due to legal issues, neither Lee nor Daisley took credit for either of these. Daisley has stated, however, that he sold the lyrics to Osbourne.\n\nBark at the Moon was remastered in 1995 and again in 2002, although the latter re-issue was actually a remix of the album, not a remaster. Many fans were displeased with the remix, noting that some elements found in the original mix are not present in the remix, namely several lead guitar parts.\n\nSome European pressings named the track &quot;Centre of Eternity&quot; as &quot;Forever&quot;. On tours for the album, Osbourne referred to it as &quot;Forever.&quot; This can be heard on bootleg recordings of tours promoting the album.\n\nThe album peaked at number 19 on the Billboard 200 chart.\n\nOsbourne is given sole credit for all the songwriting but it's been disputed that the bulk of the album was written by Bob Daisley and Jake E. Lee.\n\nOn the original UK release (vinyl and cassette) &quot;Slow Down&quot; was replaced by &quot;Spiders in the Night&quot;, retitled, simply, &quot;Spiders&quot;. &quot;Slow Down&quot; would be released as a B-side.\n\nThe &quot;Bark at the Moon&quot; single gave Osbourne his first UK hit single and the band appeared on Top Of The Pops (miming 'live' in the studio). &quot;So Tired&quot; was also a successful single in the UK. During the filming of the latter Osbourne suffered injuries to his throat by glass from the exploding mirror.\n\nThe video &quot;Bark at the Moon&quot; features drummer Carmine Appice, although drums were played by Tommy Aldridge on the recordings.\n\nOsbourne's make-up for the album cover, and the video for the title track, was by Greg Cannom.\n\n\nMy Videos: &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:cc73070f3b978039a3763e68946cf0eaad5f0b7e","amp;dn":"Ozzy+Osbourne+-+So+Tired","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc73070f3b978039a3763e68946cf0eaad5f0b7e","infoHashBuffer":{"type":"Buffer","data":[204,115,7,15,59,151,128,57,163,118,62,104,148,108,240,234,173,95,11,126]},"announce":[],"urlList":[]}}