{"title":"Ghost Dvdrip H264 Bookerdog.mp4","uid":5040638,"size":980878412,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ce11838f102c1bfdd27105e19388c4e5cb5894cb&amp;dn=Ghost+Dvdrip+H264+Bookerdog.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bookerdog","files":-1,"time":1249356710,"description":"Category\tDramas, Romance, Recommended, Murder, Essential Cinema, Fantasy, Love Story, Ghosts, Betrayal, Scams And Cons, Tear Jerker, AFI Top 100 Passions, AFI Top 100 Movie Songs, Afterlife, Hell\nStarring\tWhoopi Goldberg, Patrick Swayze, Demi Moore, Vincent Schiavelli, Tony Goldwyn, Rick Aviles\nDirector\tJerry Zucker\nComposer\tMaurice Jarre\nCostume Designer\tRuth Morley, Eric Harrison, Dawn Jackson\nDirector of Photography\tAdam Greenberg\nEditor\tWalter Murch\nProduction Designer\tJane Musky, Dirk Petersmann\nScreenwriter\tBruce Joel Rubin, Peter Barsocchini\nPatrick Swayze, Demi Moore, Whoopi Goldberg, Tony Goldwyn - Dir:Jerry Zucker A murdered man has a final chance, as a ghost, to discover his murderer and say goodbye to his wife with the help of a phony pyschic.\nShortly after moving into a new Manhattan apartment, a pair of lovers are separated by a street thug's bullet. Communicating through a frazzled false medium, the man's ghost tries to avenge his death and protect his girlfriend. Academy Award Nominations: 4, including Best Picture, Best Original Score. Academy Awards: 2, including Best (Original) Screenplay, Best Supporting Actress--Whoopi Goldberg.\n\nAfter renovating their expensive loft in the TriBeCa section of Manhattan, Molly (Demi Moore) and Sam (Patrick Swayze), a young successful yuppie couple, are walking home one evening when Sam is tragically gunned down by a street mugger. Molly goes into a deep depression, but, unknown to her, Sam has come back as a ghost in order to protect her from danger--although he isn't yet aware who or what means her harm, and he has a lot of learning to do in order to make himself known to her. He teams up with an unwilling psychic, Oda Mae Brown (Whoopi Goldberg), and together they try to convince a very skeptical Molly that Sam was actually murdered and has returned spectrally to complete some unfinished business. Moore and Swayze and are excellent as the couple, and Goldberg won an Oscar for her portrayal of the wild and wacky psychic. GHOST is considered by many to be one of the most romantic films of the 1990s.","torrent":{"xt":"urn:btih:ce11838f102c1bfdd27105e19388c4e5cb5894cb","amp;dn":"Ghost+Dvdrip+H264+Bookerdog.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce11838f102c1bfdd27105e19388c4e5cb5894cb","infoHashBuffer":{"type":"Buffer","data":[206,17,131,143,16,44,27,253,210,113,5,225,147,136,196,229,203,88,148,203]},"announce":[],"urlList":[]}}