{"title":"OJOsoft Total Video Converter v2.6.10 Portable [Bit-Byte]","uid":5044079,"size":15079090,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cef7dccaca4b0cf15ebb7dbb5dffcf90d7b84a1d&amp;dn=OJOsoft+Total+Video+Converter+v2.6.10+Portable+%5BBit-Byte%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ProDvDRipper","files":2,"time":1249536266,"description":"OJOsoft Total Video Converter is the best video format converter which can convert video files at super fast speed and best video quality. It can convert video file between any video format such as converting AVI to MPEG, WMV to AVI, WMV to MPEG, MKV to AVI, MKV to MP4, etc.\n\nOJOsoft Total Video Converter can be used like iPhone video converter, 3GP video converter, PSP video converter, iPod video converter, and Zune video converter to convert any video format to your mobile phone, Sony PSP, video iPod, Apple iPhone, Zune video player and other portable video players.\n\nAdditionally, it provides an easy way to convert video files to popular audio file, like MP3, WMA, AC3, M4A, AAC etc.\n\nSupported source file formats\nVideo Formats: 3GP/3GPP, 3G2/3GP2, MJPEG, AVI, DivX, Xvid, MPG, MPEG (MPEG-1/2), DAT, FLV, MKV (Matroska), QuickTime (MOV,QT), MP4, M4V, VOB, WMV, ASF, TS, MPEG-4 AVC, DVR-MS, H.263, H.264, X.264\n\nSupported target file formats\nVideo Formats: MP4, MOV, 3GP, 3G2, MPEG, MPG, VOB, AVI, ASF, WMV, FLV, H.264, MJPEG, TS\nAudio Formats: MP3, WMA, M4A, AAC, AC3, MP2\nPortable Players: Sony PSP, Apple iPod nano/video/classic/touch/TV Out, Apple TV, iPhone, Zune, Smartphones, PDAs, Other Portable Media Players\n\n\nTotal Video Converter Features:\n* Support converting video files from one format to another\n* Support converting video files to popular audio formats\n* Support batch converting files with a task list\n* Support the latest popular video formats - MKV, TS, h.264, x.264, vc-1\n* Unmatchable converting speed, wonderful output quality\n* Windows Vista supported\n* You can select video size, bit rate, NTSC/PAL, frame rate, audio codec, sample rate etc\n* So easy to modify the name and path of output files\n* When converting files, you can pause, stop and continue at any moment\n* With the user- friendly interface, OJOsoft Total Video Converter is suited for both veterans and beginners you can complete your conversion as easy as 1-2-3\n* All decoders and encoders are built in. Once you download and install OJOsoft Total Video Converter, all supported formats can be converted without downloading any more codec\n* Safe to install and viruses-free. We respect your privacy. So there are no spyware and adware in OJOsoft Total Video Converter\nMore Details - http://www.ojosoft.com/video-converters/total-video-converter.html\n\n\n\n\n\n*installation*\n1.Unpack with any archiver\n2.Install setup.exe\n3.Enjoy!","torrent":{"xt":"urn:btih:cef7dccaca4b0cf15ebb7dbb5dffcf90d7b84a1d","amp;dn":"OJOsoft+Total+Video+Converter+v2.6.10+Portable+%5BBit-Byte%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cef7dccaca4b0cf15ebb7dbb5dffcf90d7b84a1d","infoHashBuffer":{"type":"Buffer","data":[206,247,220,202,202,75,12,241,94,187,125,187,93,255,207,144,215,184,74,29]},"announce":[],"urlList":[]}}