{"title":"Hocus Pocus(PAL)(Multi)2Lions-Team","uid":5076850,"size":4001587029,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d10c0b8141b4808cbaf2f706030cb1d599ad3daa&amp;dn=Hocus+Pocus%28PAL%29%28Multi%292Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pioen","files":-1,"time":1251922966,"description":"Hocus Pocus (1993)       \n \n \n  Verenigde Staten\nKomedie / Fantasy\n96 minuten\n\ngeregisseerd door Kenny Ortega\nmet Bette Midler, Sarah Jessica Parker en Thora Birch\n\n1693, Salem, Massachusetts. Drie heksen brouwen een afschuwelijk drankje waarmee ze alle kinderen van Salem willen doden. Zo zouden ze de jeugd van de kinderen overnemen en zelf onsterfelijk worden. Binx, een dertienjarige jongen, kan de plannen van de heksen verijdelen, maar wordt zelf in een kat veranderd. Als wraak spreken de heksen een vloek uit over de inwoners van Salem... 1993. Jaren later op Halloweennacht vergezelt Max zijn negenjarig zusje op de traditionele bedelronde. Tijdens hun tocht komen ze bij het huis van Allison, een schoolmeisje op wie Max verliefd is. Om indruk te maken op Allison, brengt Max de twee meisjes naar het oude huis van de heksen...\n\n\nEnglish\n\nIn the year 1693, 3 sisters, Winifred, Mary and Sarah were executed for their unforgivable witchcraft. One fateful Halloween night, that unpleasant honor went to adorable little Emily Binx, sister of teenage Thackery, who immediately ran to his sibling's aid when he heard she'd been lured by Sarah Sanderson to the witches' home in the woods. This was not a well thought out plan though, and the cost was not only the life of his sister Emily, but his own humanity as well. Emily's lifeforce was drained from her body by the three Sanderson witches, and big brother Thackery Binx was transformed into an immortal black cat, cursed to live forever with the guilt of his failure to save his sister! Luckily for the rest of the children of Salem, the Sanderson sisters were captured that night and hung for their crimes, but not before their living book of spells revealed to them a curse to bring the three back from the dead on All Hallow's Eve when a virgin lights the black flame candle. 300 years later, teenager Max Dennison is a newcomer to Salem, struggling to adjust after growing up in a California lifestyle. It isn't going well for Max. Bullies are stealing his sneakers right off his feet, the girl of his dreams snubs him due to his lack of interest in Halloween, and his little sister, Dani, is ever the pest. Now, he must spend the evening escorting her door to door for trick or treating while their parents enjoy the town Halloween dance. Things are about to go from bad to worse for Max, however. Just when he believes things are looking up after he and Dani convince dream-girl Allison to take them to the old Sanderson house, Max's efforts to impress the girl lead him to light the black-flame candle himself, bringing Sarah, Mary, and Winifred Sanderson back from the dead! From there on out, it's a non-stop, fun-filled chase as the witches pursue the children, determined to make sassy-mouthed Dani the subject of their next youth spell, which must be performed before dawn or else the witches will be gone forever! With the immortal, talking black cat Binx guiding them along, Max, Dani, and Allison work together to outrun, outwit, and outlast the evil trio and their magical arsenal, with the fate of all the children of Salem hanging in the balance! \n\nBron: Retail\nAudio: Eng Frans, Italiaans5.1 DD\nSubs: Ned\nMenu: Ja\noriginele poster Shabri. \nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands, English (instelbaar)\n \nGenre : Komedie\nFantasiefilm\n \nWeblink : http://www.moviemeter.nl/film/2205\nWeblink : http://www.imdb.com/title/tt0107120\n\n*****************************************\n\nBrought to you by\nPioen\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum\n         &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n\n******************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.\t\t\n","torrent":{"xt":"urn:btih:d10c0b8141b4808cbaf2f706030cb1d599ad3daa","amp;dn":"Hocus+Pocus%28PAL%29%28Multi%292Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d10c0b8141b4808cbaf2f706030cb1d599ad3daa","infoHashBuffer":{"type":"Buffer","data":[209,12,11,129,65,180,128,140,186,242,247,6,3,12,177,213,153,173,61,170]},"announce":[],"urlList":[]}}