{"title":"Winger - Easy Come Easy Go","uid":5085079,"size":166610948,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d1485b1a5f3b855c01ecd5e3bc077a32c42283c7&amp;dn=Winger+-+Easy+Come+Easy+Go&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1252651303,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nEasy Come Easy Go is a single released by the American glam metal/hard rock band Winger, from their album In the Heart of the Young. Released in 1990, the song charted at #41. According to Kip Winger the song was a late addition to the track listing, written because it was felt that there were not enough rock songs on the album. &quot;Can't Get Enuff&quot; came about the same way.\n\nIn the Heart of the Young was the second album by American glam metal band Winger. It was released by Atlantic Records in 1990.\n\nMusically, In the Heart of the Young followed closely in the footsteps of the band's debut album. Once again produced by Beau Hill, the album features hook driven, progressive-tinged, radio friendly pop metal. There are, however, also some notable changes from the debut. In the second half of the album the lyrics take on a more serious approach than was typical for the genre and the band also stretches out into longer and more complex progressive passages than on the first Winger album.\n\nThe album was certified platinum and produced such hits as &quot;Can't Get Enuff&quot;, &quot;Easy Come Easy Go&quot; and &quot;Miles Away&quot;, the latter of which made the Top 20 at Billboard's single chart. According to Kip Winger, &quot;Can't Get Enuff&quot; and &quot;Easy Come Easy Go&quot; were late additions to the track listing, written because it was felt there were not enough rock songs on the album. The album itself peaked at #15 at the album chart.\n\nWinger followed the release of the album with a 13 month world tour, playing with KISS, Scorpions, ZZ Top, Extreme and Slaughter.\n\nA collection of music videos with the same title was released the following year in two separate VHS volumes.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:d1485b1a5f3b855c01ecd5e3bc077a32c42283c7","amp;dn":"Winger+-+Easy+Come+Easy+Go","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1485b1a5f3b855c01ecd5e3bc077a32c42283c7","infoHashBuffer":{"type":"Buffer","data":[209,72,91,26,95,59,133,92,1,236,213,227,188,7,122,50,196,34,131,199]},"announce":[],"urlList":[]}}