{"title":"Coast to Coast AM - Oct 06 2009 - Prophetic Dreams &amp; ET Disclosu","uid":5118532,"size":55730085,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d3042de29116d7c1e9d015aa6ef1683b26f1fcf2&amp;dn=Coast+to+Coast+AM+-+Oct+06+2009+-+Prophetic+Dreams+%26+ET+Disclosu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1255191900,"description":"Prophetic Dreams &amp; ET Disclosure\n\nDate: 10-06-09\nHost: George Noory\nGuests: David Wilcock, Richard C. Hoagland\n\nIntuitive researcher and lecturer David Wilcock discussed his prophetic dreams and confirmations of major social realignment beginning this fall, potential for an ET disclosure from the U.S. government, and new information that evolution is driven by galactic energy fields. His series of dreams depicted an asteroid being moved into position in order to wipe out part of the Earth's population, and then a huge apparition of the Virgin Mary stopping the asteroid with her hand. He views this imagery symbolically, and suggested that it represents the Illuminati's plan to reduce the world's population through economic collapse, Swine Flu, and war &amp; conflagration. His &quot;inside sources&quot; have informed him that America is on the verge of a horrific set of economic events, including the dismantling of the Federal Reserve.\n\nBut the Illuminati's agenda could be halted by a full-scale disclosure of the ET presence, Wilcock asserted. His sources have told him that such a disclosure is planned to occur before the end of 2009, and a 2-hour international TV special has already been booked that will introduce an alien species, similar to humans, to the world. Yet, a variety of ET species are visiting the Earth, including the Annunaki, who are reptilian in appearance, and a controlling force behind the Illuminati, he continued.\n\nThe entire solar system is undergoing change as a galactic wave or energy field comes in, making the planets hotter, brighter and more magnetic, said Wilcock. This wave is pushing humanity to evolve to the next level or frequency, he added. But according to his sources, a spacecraft was secretly sent out to study the wave, and it was determined it will lead to planetary cataclysm between 2012-2017.\n\nLunar Impact Mission\n\nLast hour guest, Richard C. Hoagland commented on NASA's upcoming Moon crash mission. He believes there's an occupied base on the moon (set up by the secret space program), and the planned explosion could disclose or reveal its existence. The collision will also cause a bigger plume than expected, as well as a large amount of water coming out of the impact site, he suggested.\n\nWebsite(s):\ndivinecosmos.com\nenterprisemission.com\ndarkmission.net\n\nBook(s):\nThe Reincarnation of Edgar Cayce\nDark Mission\n\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224","torrent":{"xt":"urn:btih:d3042de29116d7c1e9d015aa6ef1683b26f1fcf2","amp;dn":"Coast+to+Coast+AM+-+Oct+06+2009+-+Prophetic+Dreams+%26+ET+Disclosu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3042de29116d7c1e9d015aa6ef1683b26f1fcf2","infoHashBuffer":{"type":"Buffer","data":[211,4,45,226,145,22,215,193,233,208,21,170,110,241,104,59,38,241,252,242]},"announce":[],"urlList":[]}}