{"title":"Kid Rock - I Am The Bullgod (2nafish)","uid":5591190,"size":152311812,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d36f83625bd9036c8558e38a43dda474c0b33977&amp;dn=Kid+Rock+-+I+Am+The+Bullgod+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1274872146,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;I Am the Bullgod&quot; is a song by Kid Rock  released as the second single from his album Devil Without a Cause in 1999.\n\n&quot;I Am the Bullgod&quot; was written as a tribute song to Monster Magnet, as they were his favorite group during that time period in the early 90s when the song was written. The &quot;Bullgod&quot; motif appears on Monster Magnet's Spine of God, Superjudge, Dopes to Infinity and God Says No albums, as well as the Monster Magnet  and Tab EPs, and several single covers. It is also a recurring lyrical theme of Monster Magnet's. Kid Rock would ironically open for Monster Magnet on the White Trash on Dope Tour after &quot;I Am the Bullgod&quot; was released as a single on Devil Without A Cause.\n\nThere have been numerous versions of the song through the years, the first being the &quot;Talkbox version&quot; which only had a few lines and was mostly instrumental. This version only appeared on the December 1994 issue from Kid Rock's &quot;Bootleg Series&quot; of cassette tapes he made for fans in the early to mid 90s. The next version was released in 1993 on the Fire It Up EP. A much slower version appeared on his album The Polyfuze Method Revisited. Kid Rock would rerecord the song and change one line in the lyrics (&quot;I would like to learn but I can't be taught&quot; to &quot;You can bet all day but I can't be bought&quot;) and release it on his album Devil Without A Cause in 1998. It was also included on a promotional give away cassette that was handed out at music stores in the Boston area in December of 1993. The cassette was called &quot;Concrete Music Bloc&quot; and was part of s series of free music samplers that were handed out. The December 1993 edition of the tape included Iron Maiden, Voivod, I Mother Earth, Greg Ginn, Engines of Aggression, and others along with Kid Rock.\n\nThere is a bonus hip hop style remix of the song after &quot;Black Chick, White Guy&quot; ends, on Devil Without A Cause. An electro acoustic version of the song was released on the Cowboy single. There is also a live version on the Japanese release of Devil Without A Cause, with &quot;Welcome 2 The Party&quot; included as the intro to the song. A live remix version was released on the MTV compilation The Hard And Heavy called the Lucursi Live Remix.\n\nI Am The Bullgod was included in Madden 10 as well as the soundtrack.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:d36f83625bd9036c8558e38a43dda474c0b33977","amp;dn":"Kid+Rock+-+I+Am+The+Bullgod+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d36f83625bd9036c8558e38a43dda474c0b33977","infoHashBuffer":{"type":"Buffer","data":[211,111,131,98,91,217,3,108,133,88,227,138,67,221,164,116,192,179,57,119]},"announce":[],"urlList":[]}}