{"title":"Rocky.DVD-R.Collection","uid":5109109,"size":27379685376,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d3b3e19b071d42fe1c93c00386451c45ac82caf8&amp;dn=Rocky.DVD-R.Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiagofavi2612","files":6,"time":1254618922,"description":"Sinopse\n\nUm boxeador medÃƒÂ­ocre tem a grande chance de sua vida quando lhe oferecem uma luta pelo tÃƒÂ­tulo mundial, contra o grande campeÃƒÂ£o americano. Dirigido por John G. Avildsen (KaratÃƒÂª Kid) e com Sylvester Stallone, Talia Shire, Burt Young, Carl Weathers e Burgess Meredith no elenco. Vencedor de 3 Oscars.Rocky Balboa (Sylvester Stallone), um lutador de boxe medÃƒÂ­ocre que trabalha como &quot;cobrador&quot; de um agiota, tem a chance de enfrentar Apollo Creed (Carl Weathers), o campeÃƒÂ£o mundial dos pesos-pesados, que teve a idÃƒÂ©ia de dar oportunidade a um desconhecido como um golpe publicitÃƒÂ¡rio. Mas Rocky decide treinar de modo intensivo, sonhando apenas em terminar a luta sem ter sido nocauteado pelo campeÃƒÂ£o\n\n\nRocky Balboa\n\nUma simulaÃƒÂ§ÃƒÂ£o de computador faz com que Rocky retorne aos ringues, para enfrentar o campeÃƒÂ£o mundial dos pesos pesados.\nDirigido e estrelado por Sylvester Stallone (Os Embalos de SÃƒÂ¡bado ÃƒÂ  Noite Continuam) e com Burt Young no elenco. \nA glÃƒÂ³ria faz parte do passado para Rocky Balboa (Sylvester Stallone). Dono do restaurante Adrian's, batizado em homenagem ÃƒÂ  sua falecida esposa, Rocky passa as noites contando aos clientes histÃƒÂ³rias de sua ÃƒÂ©poca de lutador. Rocky Jr. (Milo Ventimiglia), seu filho, nÃƒÂ£o dÃƒÂ¡ muita atenÃƒÂ§ÃƒÂ£o ao pai, preferindo cuidar de sua prÃƒÂ³pria vida. Sua vida muda apÃƒÂ³s uma simulaÃƒÂ§ÃƒÂ£o de computador colocar Mason Dixon (Antonio Tarver), o atual campeÃƒÂ£o mundial dos pesos pesados, enfrentando Rocky em seu auge. Dixon fez fama pela facilidade com a qual conseguiu o tÃƒÂ­tulo, mas como nunca encarou um oponente que realmente o desafiasse ÃƒÂ© considerado por muita gente como um lutador muito tÃƒÂ©cnico, mas sem alma. A simulaÃƒÂ§ÃƒÂ£o faz com que o agente de Dixon resolva realizar a luta, oferecendo a Rocky uma nova chance de voltar aos ringues. \n\nRocky 2 - A Revanche\n\nApÃƒÂ³s prometer ÃƒÂ  sua esposa abandonar os ringues de boxe, Rocky Balboa enfrenta uma sÃƒÂ©rie de problemas financeiros e ÃƒÂ© obrigado a enfrentar mais uma vez Apollo Creed. Dirigido e estrelado por Sylvester Stallone e com Talia Shire, Burt Young, Carl Weathers e Burgess Meredith no elenco. \n\nApÃƒÂ³s o tÃƒÂ©rmino do confronto contra Apollo Creed (Carl Weathers), Rocky (Sylvester Stallone) promete ÃƒÂ  Adrian (Talia Shire), sua esposa grÃƒÂ¡vida, que irÃƒÂ¡ largar os ringues de boxe. PorÃƒÂ©m, Apollo quer provar que Rocky nÃƒÂ£o foi nocauteado por acaso e, como este estÃƒÂ¡ sem dinheiro, promovem outra luta entre os dois pugilistas.\n\nRocky 3 - O Desafio Supremo\n\nRocky Balboa decide largar sua carreira, atÃƒÂ© ser desafiado e insultado por um desafiante. Ainda abalado pela morte de seu treinador e recebendo a ajuda de seu ex-adversÃƒÂ¡rio Apollo Creed, Rocky decide retornar aos ringues para enfrentÃƒÂ¡-lo. Dirigido e estrelado por Sylvester Stallone e com Talia Shire, Burt Young, Carl Weathers e Burgess Meredith no elenco. Recebeu uma indicaÃƒÂ§ÃƒÂ£o ao Oscar. Rocky Balboa decide largar sua carreira, atÃƒÂ© ser desafiado e insultado por um desafiante. Ainda abalado pela morte de seu treinador e recebendo a ajuda de seu ex-adversÃƒÂ¡rio Apollo Creed, Rocky decide retornar aos ringues para enfrentÃƒÂ¡-lo. Dirigido e estrelado por Sylvester Stallone e com Talia Shire, Burt Young, Carl Weathers e Burgess Meredith no elenco. Recebeu uma indicaÃƒÂ§ÃƒÂ£o ao Oscar. \n\nRocky 4 \n\nO campeÃƒÂ£o mundial de boxe Rocky Balboa parte para a SibÃƒÂ©ria, onde enfrentarÃƒÂ¡ o campeÃƒÂ£o soviÃƒÂ©tico, um superatleta criado pela tecnologia russa. Dirigido e estrelado por Sylvester Stallone e com Talia Shire, Dolph Lundgren, Carl Weathers e Burt Young no elenco. Apollo (Carl Weathers) morre em uma luta com Drago (Dolph Lundgren), um invencÃƒÂ­vel lutador russo. Assim, Rocky (Sylvester Stallone) decide ir atÃƒÂ© a UniÃƒÂ£o SoviÃƒÂ©tica para enfrentÃƒÂ¡-lo e vingar o amigo.\n\n\nRocky 5\n\nNa luta com Drago, o lutador russo, Rocky (Sylvester Stallone) acabou recebendo uma lesÃƒÂ£o permanente. Assim ÃƒÂ© forÃƒÂ§ado a se retirar do boxe e, para piorar as coisas, descobre que seu contador roubou sua fortuna. Sem dinheiro e nÃƒÂ£o podendo voltar a lutar, ele comeÃƒÂ§a a treinar um jovem (Tommy Morrison) que promete ser um grande lutador. Mas seu trabalhado nÃƒÂ£o ÃƒÂ© terminado, pois um empresÃƒÂ¡rio atrai o jovem pugilista com um alto salÃƒÂ¡rio, mas mestre e aluno ainda vÃƒÂ£o se reencontrar como rivais.","torrent":{"xt":"urn:btih:d3b3e19b071d42fe1c93c00386451c45ac82caf8","amp;dn":"Rocky.DVD-R.Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3b3e19b071d42fe1c93c00386451c45ac82caf8","infoHashBuffer":{"type":"Buffer","data":[211,179,225,155,7,29,66,254,28,147,192,3,134,69,28,69,172,130,202,248]},"announce":[],"urlList":[]}}