{"title":"Black Sabbath - Iron Man","uid":5086191,"size":204713988,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d3d0514bdb83004c0ed8b25736606dca6399b12e&amp;dn=Black+Sabbath+-+Iron+Man&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1252736218,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Iron Man&quot; is a song by British heavy metal band Black Sabbath from their second studio album Paranoid released in 1970. It was later included on their initial greatest hits compilation We Sold Our Soul for Rock 'n' Roll (1976), as well as all subsequent greatest hits compilations. Many musical acts have recorded cover versions of the song, and the song is frequently used and referenced during sporting events and in television shows and films. A live performance of this song was made for the program Beat-Club.\n\nThe title of the song was conceived by Ozzy Osbourne. Geezer Butler took to writing the lyrics around the title. To avoid copyright infringement involving the superhero of the same name, he made it the story of a vengeful villain instead of a hero. Nonetheless, instrumental sections of the song would be used decades later in the 2008 feature film Iron Man at the beginning of the credits, and in the television commercials.\n\nThe lyrics tell the story of a man who time travels into the future of the world, and sees the apocalypse. In the process of returning to the present, he is turned into steel by a magnetic field. He is rendered mute, unable verbally to warn people of his time of the impending destruction. His attempts to communicate are ignored and mocked. This causes Iron Man to become angry, and have his revenge on mankind, causing the destruction seen in his vision.\n\n    * In 2000, 30 years after the song was first released, it won the Grammy Award for Best Metal Performance.\n    * &quot;Iron Man&quot; also won spot #310 in Rolling Stone's list of the 500 Greatest Songs of All Time.\n    * &quot;Iron Man&quot; was awarded the #1 spot on VH1's 40 Greatest Metal Songs in 2006.\n    * The song peaked at #52 in 1972.\n    * The song returned to the charts in 2008 peaking at number 5 on Billboard's Hot Ringtones chart.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:d3d0514bdb83004c0ed8b25736606dca6399b12e","amp;dn":"Black+Sabbath+-+Iron+Man","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3d0514bdb83004c0ed8b25736606dca6399b12e","infoHashBuffer":{"type":"Buffer","data":[211,208,81,75,219,131,0,76,14,216,178,87,54,96,109,202,99,153,177,46]},"announce":[],"urlList":[]}}