{"title":"Scream.3.2000.INTERNAL.DVDRip.XviD-FiNaLe","uid":5027566,"size":1451780848,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d75187e98cb95eba63f0eafd87a9fe7707d11a3e&amp;dn=Scream.3.2000.INTERNAL.DVDRip.XviD-FiNaLe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"fanebabanu","files":8,"time":1248775363,"description":"The final Scream is going to be the loudest!\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0134084/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0134084/&lt;/a&gt;\n\nAfter the terrifying events that occurred around Windsor College, Sidney is now living alone in a secluded Northern California mountainside. Still haunted by her past, frightening images of her dead mother reappear time after time in her head as she tries to get on with her life. She now gives advice, under a fictional name for safety, to women in crisis via telephone. Soon enough though, her comfort turns to fear as she receives a threatening phone call from an anonymous source who informs her on the recent murders committed around the Hollywood set of &quot;Stab 3: Return to Woodsboro, the third and final chapter to the 'Stab' series. Sidney decides to visit the set when she finds out that with every victim, the new killer leaves behind a different photo of Sidney's deceased mother, Maureen Prescott. Eventually the cast of &quot;Stab 3&quot; start dying one by one and more photos of Maureen appear. Mark Kincaid, an LAPD detective, is sent to investigate the strange murder and becomes friendly with Sidney. Meanwhile, Gale visits the set of &quot;Stab 3,&quot; after she hears of the murders. Ironically, she meets up with Dewey, who is now working behind the film alongside his actress/girlfriend Jennifer. Gale, Dewey, and Sidney rejoin along with the actors and actresses of &quot;Stab 3,&quot; who are all shaken up by the rest of the cast being killed off. As the secret to Sidney's past unfolds, the three discover that in the trilogy, anything can happen.","torrent":{"xt":"urn:btih:d75187e98cb95eba63f0eafd87a9fe7707d11a3e","amp;dn":"Scream.3.2000.INTERNAL.DVDRip.XviD-FiNaLe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d75187e98cb95eba63f0eafd87a9fe7707d11a3e","infoHashBuffer":{"type":"Buffer","data":[215,81,135,233,140,185,94,186,99,240,234,253,135,169,254,119,7,209,26,62]},"announce":[],"urlList":[]}}