{"title":"Joe Locke - 4 Walls of Freedom w:Gary Novak","uid":5096268,"size":152476707,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d76e388417eab4a1c0346d81a7a742a491c7bf3c&amp;dn=Joe+Locke+-+4+Walls+of+Freedom+w%3AGary+Novak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BozoJones","files":10,"time":1253597928,"description":"This music qualifies as &quot;envelope pushing&quot; neo-bebop very much in the &quot;pure jazz&quot; realm.\n\n------------------------------------------------------------------\n\nThe band on this tyre-shredding session played Ronnie Scott's, London, in September of 2002 - and three months later its powerful saxophonist Bob Berg was gone, killed in a road accident. Berg's loss makes the burning energy of this music all the more telling.\n\nThe newly-formed quartet, led by vibraphonist Joe Locke, gets off to a dramatic start that promises to take the usual scattershot methods of neo-bop to far more interesting destinations. The music here is presented as two suites, the first in seven parts and bearing the band's name.\n\nThat title is drawn from the musical notions of melody, rhythm, harmony and form. But it can as easily convey the notion of freedoms emerging from the mature identities of four equal-status players. James Genus and Gary Novak on bass and drums join Locke and Berg, and there's a bonus in the guest presence of the subtle and equally technically formidable British trumpeter Gerard Presencer.\n\nGary Novak's scalding drumming sustains a restless dynamism; Genus mingles a luxurious tone with fresh, agile and provocative bass phrasing; Locke has both a traditional vibes-player's rich glow and a guitarist's crisp attack; and Berg combines a guttural Coltranesque tenor thunder with something close to Wayne Shorter's lateral delicacy. The latter characteristic particularly emerges in the episodes of slow playing, but Berg's saxophone had taken on a singing, impassioned quality that was softening the impassive fierceness of his sound in earlier years, so that muscular lyricism is a powerful presence throughout. The melodies are not always up to the playing, but as 21st-century straightahead jazz, it can't be beat. \n\nReviewed by: John Fordham\n-----------------------------\n\nThis was Bob's last session before his tragic death in December of 2002. The unbelievable Gary Novak (also a member of Bob's last quartet) is along for the ride. Enjoy...\n\nTracks:\n\n4 WALLS OF FREEDOM SUITE:\n\n01. Movement #1 - Surfacing\n02. Movement #2 - Prayer\n03. Movement #3 - Searching\n04. Movement #4 - Ballet of the Storni\n05. Movement #5 - Helping Hands\n06. Movement #6 - Look To This Day\n\n07. Crescent Street\n\nSUITE DI MORFEO:\n\n08. Movement #1 - Now I Lay Me Down\n09. Movement #2 - Now in Darkness I Dream\n10. Movement #3 - Waking Now, I Wonder\n\nLineup:\n\nJoe Locke - Vibes, Midi Vibes, Marimba\nBob Berg - Tenor Saxophone\nJames Genus - Acoustic Bass\nGary Novak - Drums\n\nSpecial Guest:\n\nGerard Presencer - Flugelhorn\n\nRoadtest Download courtesy of fusionsnob\n\nHigh Quality 320mpbs iTunes compatible ACC audio files\n\nAnd remember to SUPPORT THE ARTISTS!!! If you really like it BUY IT! Also see the artist's live shows and tell all your friends about it!","torrent":{"xt":"urn:btih:d76e388417eab4a1c0346d81a7a742a491c7bf3c","amp;dn":"Joe+Locke+-+4+Walls+of+Freedom+w%3AGary+Novak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d76e388417eab4a1c0346d81a7a742a491c7bf3c","infoHashBuffer":{"type":"Buffer","data":[215,110,56,132,23,234,180,161,192,52,109,129,167,167,66,164,145,199,191,60]},"announce":[],"urlList":[]}}