{"title":"Slum Dog Millionaire","uid":5112220,"size":732831744,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d788721e29efa0a90e0af6f32742b8414246621a&amp;dn=Slum+Dog+Millionaire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"kjulien95","files":1,"time":1254868460,"description":"The story of Jamal Malik, an 18 year-old orphan from the slums of Mumbai, who is about to experience the biggest day of his life. With the whole nation watching, he is just one question away from winning a staggering 20 million rupees on India's &quot;Kaun Banega Crorepati?&quot; (2000) (Who Wants To Be A Millionaire?) But when the show breaks for the night, police arrest him on suspicion of cheating; how could a street kid know so much? Desperate to prove his innocence, Jamal tells the story of his life in the slum where he and his brother grew up, of their adventures together on the road, of vicious encounters with local gangs, and of Latika, the girl he loved and lost. Each chapter of his story reveals the key to the answer to one of the game show's questions. Each chapter of Jamal's increasingly layered story reveals where he learned the answers to the show's seemingly impossible quizzes. But one question remains a mystery: what is this young man with no apparent desire for riches really doing on the game show? When the new day dawns and Jamal returns to answer the final question, the Inspector and sixty million viewers are about to find out. At the heart of its storytelling lies the question of how anyone comes to know the things they know about life and love. Written by Fox Searchlight Pictures\n\nEighteen year old Jamal Malik is having an amazing answering streak on &quot;Kaun Banega Crorepati?&quot; (2000), the Indian version of the television game show &quot;Who Wants to Be a Millionaire&quot; (1998). He's only one correct question away from the big prize. However, some, including those associated with the game show, question how someone like Jamal, a self confessed non-genius who grew up in the slums of Mumbai, can be doing so well on the show when others who are brighter, more educated and wealthier than him have failed. Is Jamal cheating? Is it purely luck that they have asked him the questions to which he knows the answers? Seeing Jamal's life journey to this point ultimately answers these questions. His life journey includes being orphaned at an early age; growing up with an older brother, Salim, who was both his guardian/protector and antagonist; and having a relationship since childhood with another orphaned child, a girl named Latika. His motivation for being on the show also may provide some answers to his success. Perhaps it was all just meant to be. Written by Huggo\n\nIn Mumbai, the eighteen year-old orphan from the slums Jamal Malik is tortured by the policemen in a precinct accused of cheating a game show. Jamal, who has no education and works in a call center serving tea, is close to wining twenty million rupees in the show &quot;Kaun Banega Crorepati?&quot; (2000) (Who Wants To Be A Millionaire?) hosted by Prem Kumar, giving precise answers to the questions and raising suspicion of fraud. The police inspector shows the videotape and after each question, Jamal tells parts of his childhood with his brother Salim, his crush for Latika and their fight to survive on the streets to justify each correct answer, guided by his common sense and past experience, and prove his innocence. Written by Claudio Carvalho, Rio de Janeiro, Brazil\n\nMumbai's Police Sergeant Srinivas and his Superior detain and interrogate a suspect by the name of Jamal Malik, who they suspect of cheating a popular Indian TV game show &quot;Kaun Banega Crorepati?&quot; (2000). They have evidence that Jamal has had no formal education and has been a career-thief as a youngster, and are determined to question him using any method to find out how he even came close to winning anything. Written by rAjOo (&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;a4c3d1cad3c5cad0cde4cccbd0c9c5cdc88ac7cbc9&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;)\n","torrent":{"xt":"urn:btih:d788721e29efa0a90e0af6f32742b8414246621a","amp;dn":"Slum+Dog+Millionaire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d788721e29efa0a90e0af6f32742b8414246621a","infoHashBuffer":{"type":"Buffer","data":[215,136,114,30,41,239,160,169,14,10,246,243,39,66,184,65,66,70,98,26]},"announce":[],"urlList":[]}}