{"title":"RealHideIP v3.6.2.2 Portable","uid":5574428,"size":5558523,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d82947cdf15a4040667381e0aa2bae6c17d6c712&amp;dn=RealHideIP+v3.6.2.2+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NoExcuses","files":4,"time":1274351266,"description":"RealHideIP v3.6.2.2 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Crack are included. Copy the Crack file in the Install Dir...\n\n\nReal Hide IP - Hide Your IP to Protect Your Privacy\n\nAre you aware that your IP address is exposed every time you visit a website? Do you know that many websites and hackers use your IP address to monitor your home address and other personal information?\n\nReal Hide IP allows you to surf anonymously, keep your IP address hidden, protect your personal information against hackers and provide full encryption of your online activity, all with a simple click of a button.\n\nKey Features\n\n    * Hide Your Real IP Address\n      Be assigned fake IP addresses from different countries to conceal your real IP.\n\n    * Anonymous Web Surfing\n      Surf anonymously with fake IP, whenever you want to.\n\n    * Protect Your Identity Against Hackers\n      Protect you from hackers and identity thieves who will be tricked by your fake IP.\n\n    * Un-ban Yourself from Forums or Restricted Websites\n      Real Hide IP allows you to access any forums, blogs or websites that have ever banned you.\n\n    * Prevent Websites from Tracking Your Online Activities\n      Hide your real IP when you are surfing the Internet to prevent you from being tracked by websites.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.real-hide-ip.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.real-hide-ip.com/&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. It's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you like it and it's useful for you, show your support buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:d82947cdf15a4040667381e0aa2bae6c17d6c712","amp;dn":"RealHideIP+v3.6.2.2+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d82947cdf15a4040667381e0aa2bae6c17d6c712","infoHashBuffer":{"type":"Buffer","data":[216,41,71,205,241,90,64,64,102,115,129,224,170,43,174,108,23,214,199,18]},"announce":[],"urlList":[]}}