{"title":"021-Coast to Coast-Ian Punett with Lauren Weinstein-10 May 10.m4","uid":5670043,"size":96410750,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d9193b3de3aa1cffe5a59af608603ff03c3963bb&amp;dn=021-Coast+to+Coast-Ian+Punett+with+Lauren+Weinstein-10+May+10.m4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"panzerfaust69","files":1,"time":1278307410,"description":"The Dangers of ACTA\n\nDate:05-09-10\n\nHost:Ian Punnett\n\nGuests:Lauren Weinstein\n\nIan Punnett welcomed privacy and technology expert Lauren Weinstein, during the first two and a half hours of the program, for a discussion on the controversial Anti-Counterfeiting Trade Act (ACTA), which may pose a serious threat to civil liberties. He explained that ACTA originated as a plan to develop a unified method of dealing with counterfeiting amongst numerous countries. However, over time, the emphasis of the act began to focus more on intellectual property issues, notably Internet piracy, rather than physical counterfeiting.\n\nDetailing some of the troubling aspects of ACTA, Weinstein noted that the plan, itself, has remained shrouded in secrecy as it has been evolved over the last three years. The secret nature of the act's development, he claimed, allowed for it to become a &quot;potpourri wish list for intellectual property owners&quot; at the expense of individual citizen's rights. Additionally, since it is an international agreement, it could be adopted by the United States via an executive order rather than ratification through Congress. In turn, this would create a legal quagmire in America as the plan &quot;specifies what governments are required to do in their national laws&quot; and contains aspects which could violate the Constitution, such as warrantless searches.\n\nWeinstein pointed out that another danger of ACTA is its potential effect on search engines and Internet service providers. Based on his research, he surmised that the goal of the plan is to put an overwhelming amount of liability on the &quot;Internet intermediaries,&quot; who will be responsible for the actions of their users. In turn, they would be required to police their users' actions as well as provide that information if a user is declared to be in violation of ACTA standards. This forced responsibility would have a &quot;suffocating impact&quot; on the Internet, Weinstein observed. Ultimately, he said, it is important to weigh the true cost of fighting Internet piracy, declaring, &quot;you really don't want to create a police state to protect Iron Man 2.&quot;\n\nThe remaining 90 minutes of the program featured Open Lines.\n","torrent":{"xt":"urn:btih:d9193b3de3aa1cffe5a59af608603ff03c3963bb","amp;dn":"021-Coast+to+Coast-Ian+Punett+with+Lauren+Weinstein-10+May+10.m4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9193b3de3aa1cffe5a59af608603ff03c3963bb","infoHashBuffer":{"type":"Buffer","data":[217,25,59,61,227,170,28,255,229,165,154,246,8,96,63,240,60,57,99,187]},"announce":[],"urlList":[]}}