{"title":"District 9 Deutsch - German uncutt","uid":5090547,"size":722114560,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d953af3aa0fe1b2ce1be8a46ac0f0d88e67d0865&amp;dn=District+9+Deutsch+-+German+uncutt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BenHardn","files":-1,"time":1253106881,"description":"film 688 mb in mpg in deutsch T&amp;B soweit ok kein HD ;-))\n &lt;a href=&quot;\nhttp://de.wikipedia.org/wiki/District_9&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://de.wikipedia.org/wiki/District_9&lt;/a&gt;\n\n\n\nIm Jahr 1982 stoppt ein riesiges auÃƒÅ¸erirdisches Raumschiff ÃƒÂ¼ber Johannesburg in SÃƒÂ¼dafrika. Nachdem sich vermutlich ein Kommando-Modul vom Schiff gelÃƒÂ¶st hat und auf die Erde gefallen ist, ohne jemals gefunden zu werden, verharrt das Raumschiff seit seiner Ankunft unbeweglich ÃƒÂ¼ber der Stadt. Nach dreimonatigem ereignislosem Warten entschlieÃƒÅ¸en sich die Menschen, einen Weg in das Raumschiff zu schneiden. Dort finden sie ÃƒÂ¼ber eine Million insektoide AuÃƒÅ¸erirdische in einem gesundheitlich sehr schlechten Zustand vor. Ein Kommandant des Schiffes wird nie gefunden. Die extraterrestrischen Wesen werden in einem behelfsmÃƒÂ¤ÃƒÅ¸igen FlÃƒÂ¼chtlingslager untergebracht, welches den Namen District 9 trÃƒÂ¤gt und sich rasch zu einem Slum entwickelt\n\nIn the year 1982, a gigantic alien spaceship stops over Johannesburg in South Africa. After a command-module came off presumably from the ship and fell on the earth without ever being found, the spaceship pauses immovable over the city since his/its arrival. According to three-month uneventful attendant, the people decide to cut a way in the spaceship. There, they find over one million insektoide aliens condition very bad in a health. A commander of the ship never is found. The extraterrestrial natures are accommodated in a makeshift refugee-camp, which carries the name District in 9 and develops quickly into a slum","torrent":{"xt":"urn:btih:d953af3aa0fe1b2ce1be8a46ac0f0d88e67d0865","amp;dn":"District+9+Deutsch+-+German+uncutt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d953af3aa0fe1b2ce1be8a46ac0f0d88e67d0865","infoHashBuffer":{"type":"Buffer","data":[217,83,175,58,160,254,27,44,225,190,138,70,172,15,13,136,230,125,8,101]},"announce":[],"urlList":[]}}