{"title":"W.A.S.P. - The Real Me  (2nafish)","uid":5577406,"size":129187844,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d964588b409db6f8c85cf9a0d22864931795614e&amp;dn=W.A.S.P.+-+The+Real+Me++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1274429502,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;The Real Me&quot; is a song written by Pete Townshend on The Who's second full-scale rock opera, Quadrophenia  in 1973. This is the second track on the album. It concerns a boy named Jimmy, a young English Mod with four distinct personalities. The song describes how he angrily deals with several individuals to identify &quot;the real me.&quot;\n\nThe song features an impressive bass performance by John Entwistle. According to a 1996 interview with Entwistle by Goldmine Magazine, the bass part was recorded on the first take. Entwistle claimed he was &quot;joking around&quot; when he played the part, but the band loved it and used it in the final version.\n\n&quot;The Real Me&quot; was also featured in the 1979 movie based on the Quadrophenia album as well as the soundtrack album, with a new bass track and a &quot;finished ending&quot; as opposed to the ending on the Quadrophenia album (&quot;Can you see the real mememememe...&quot;). It was also featured on the 2002 Who compilation The Ultimate Collection, with a slightly modified opening\n\nTownshend has always referred to it as &quot;Can You See the Real Me&quot;, rather than the more accepted abbreviated title.\n\nAfter not performing it for several years after John Entwistle's death in 2002, the band began including it in their live shows again in 2007 with the bass part, performed by Pino Palladino, being less prominent than the original version.\n\nThe song was covered by heavy metal band W.A.S.P. in 1989, along with its own music video. It was also covered by Pearl Jam during The Who Tribute on VH1 in 2008. In August 2009, Pearl Jam performed the song at the Shepherds Bush Empire, with Simon Townshend. nov 17 on adelaide\n\nThe Eric Burdon Band released a different song with the same title, also in 1974.\n\nThe Headless Children was the fourth studio album by American heavy metal band W.A.S.P., released by Capitol Records in 1989. It is now actually the highest selling W.A.S.P. album to date.\n\nThe cover shows a string of historical figures, prominently featuring a picture of Jack Ruby shooting Lee Harvey Oswald.\n\nThe album was the last studio album to feature guitarist Chris Holmes in nearly a decade until he rejoined W.A.S.P. in late 1997 to record Kill F*** Die.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:d964588b409db6f8c85cf9a0d22864931795614e","amp;dn":"W.A.S.P.+-+The+Real+Me++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d964588b409db6f8c85cf9a0d22864931795614e","infoHashBuffer":{"type":"Buffer","data":[217,100,88,139,64,157,182,248,200,92,249,160,210,40,100,147,23,149,97,78]},"announce":[],"urlList":[]}}