{"title":"Krokus - Our Love","uid":5119455,"size":172271620,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d9fa4aac779a28d69702c4643479f46341b27885&amp;dn=Krokus+-+Our+Love&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":-1,"time":1255251144,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nKrokus is a hard rock/heavy metal band from Switzerland. According to music website Blabbermouth.net, they have sold over 13 million albums worldwide, including one Platinum Record and one Gold Record in the United States.\n\nKrokus was founded in Solothurn in 1974 by bassist (and original lead vocalist) Chris von Rohr and guitarist Tommy Kiefer. Former Eazy Money vocalist Marc Storace joined the band as frontman in time for their Metal Rendez-vous album in 1980.\n\nKrokus enjoyed popularity in the 1980s in parts of Europe and the USA. They toured with Nazareth in Europe and with AC/DC, MotÃƒÂ¶rhead, Rainbow, Rush, Def Leppard, Judas Priest and Sammy Hagar in the United States.\n\nChris von Rohr, who used to be the drummer, switched to lead singer in the late 1970s. With that formation, they were successful in Switzerland and toured throughout the country. After they saw AC/DC in concert, they decided to change their musical direction and became a riff-rock band. Since von Rohr was not capable of hitting the third octave, the search for a new lead singer began. Eventually, Marc Storace from TEA and Eazy Money was hired, and the band recorded Metal Rendez-vous in 1980, which led to huge international recognition.\n\nThe follow-up album from 1981, Hardware, was recorded at the Hammersmith studios in London and features such songs as &quot;Easy Rocker&quot; and &quot;Rock City&quot;, which are still a part of the band's live repertoire today.\n\nThe band name &quot;Krokus&quot; evolved from the word for a flower common to the region of southern Europe, the crocus. Early in the spring of 1975, band founder Chris von Rohr observed a field of these flowers while traveling by train. He was returning from L'Ecole des Chefs located in France after an aborted career in the culinary arts, and it was around this time the idea for a Metal band was formed. The band members stated that it was the perfect name, since it features &quot;Rock&quot; right in the middle.\n\nThe Blitz is heavy metal and hard rock band Krokus' eighth album. It became a gold album in the United States. While preparing to record it, Patrick Mahassen had been tapped to join the band on guitar, Mark Kohler having switched to bass. Mahassen did not join, and the album was recorded as a quartet; Tommy Keiser played bass on the subsequent tour.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:d9fa4aac779a28d69702c4643479f46341b27885","amp;dn":"Krokus+-+Our+Love","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9fa4aac779a28d69702c4643479f46341b27885","infoHashBuffer":{"type":"Buffer","data":[217,250,74,172,119,154,40,214,151,2,196,100,52,121,244,99,65,178,120,133]},"announce":[],"urlList":[]}}