{"title":"Queen - Crowing Glory 1986, [LOSSY Mp3 320 kbps] Bootleg","uid":5116241,"size":188775080,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:da9a57c06b34f863d190aadb0333f305b79ed9e0&amp;dn=Queen+-+Crowing+Glory+1986%2C+%5BLOSSY+Mp3+320+kbps%5D+Bootleg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Duracell72","files":19,"time":1255084518,"description":"L'estate del 1986 vede i Queen ancora padroni dell'Europa con il grandioso &quot;Magic Tour&quot;, iniziato il 6 giugno al Rasunda \n\nStadium di Stoccolma e conclusosi a Knebworth il 9 agosto. La macchina live dei Queen raggiunge nel corso di questo \n\ntour il suo apice; il palco ÃƒÂ¨ il piÃƒÂ¹ grande mai costruito, come anche l'impianto luci, e il set di canzoni preparato per la \n\ntournÃƒÂ© ÃƒÂ¨ un mix ben studiato di brani nuovi e del passato, tutti riarrangiati in versioni particolarmente potenti, sorta di \n\ncarrellata sulla storia del gruppo che attira sia i fans piÃƒÂ¹ accaniti sia chi li conosce poco. Una data particolarmente \n\nimportante ÃƒÂ¨ quella al Nepstadium di Budapest il 27 luglio; ÃƒÂ¨ la prima volta che oltre la cortina di ferro il rock viene \n\npresentato in grandi spazi. Freddie e compagni danno vita a uno spettacolo memorabile, come documenta il relativo \n\nvideo, riuscendo a conquistare in un attimo un pubblico assolutamente nuovo, in particolare quando eseguono in segno \n\ndi gratitudine una canzone popolare ungherese duettando con la folla.\n\nIn patria, i Queen raccolgono in sole sei date piÃƒÂ¹ di 400.000 spettatori, stabilendo un record assoluto, con due concerti \n\nconsecutivi al Wembley Stadium (11 e 12 luglio) da cui verrÃƒÂ  tratto un doppio album. Freddie chiude lo spettacolo vestito \n\nda re, con manto di pelliccia e corona, e smentisce ogni voce di problemi nel gruppo con parole che risultano purtroppo \n\nprofetiche: &quot;Non siamo poi tanto male per essere quattro vecchie regine del rock, staremo assieme finchÃƒÂ©, ca**o!, non \n\nsaremo morti!&quot;. Il &quot;Magic Tour&quot; si chiude il 9 agosto a Knebworth davanti a quasi 200.000 persone; ÃƒÂ¨ l'ultimo concerto dei \n\nQueen, che lasciano al loro pubblico il ricordo della loro esibizione piÃƒÂ¹ spettacolare e grandiosa e l'immagine di un \n\ngruppo che ha saputo esaltare la dimensione live come nessun altro. Freddie saluta per sempre i suoi fans alzando la \n\ncorona con queste parole: Ã‚Â«Arrivederci, bellissime bellezze! Siete stati un pubblico straordinario, buonanotte, sogni d'oro, \n\nvi amo!&quot;. In questo periodo, Freddie ha giÃƒÂ  contratto il virus dell'Aids sebbene i test cui si sottopone diano ancora esito \n\nnegativo.\n\nQuesto Bootleg, assolutamente inedito e dal soud accattivante, ÃƒÂ¨ una sorta di &quot;Greatest Hits&quot; di tutte le migliori \n\ninterpretazioni tenute dallo storico gruppo londinese nell'arco dell'intero Tour, definito anche &quot;Live In Europe&quot;, che \n\nrisveglia la memoria, se mai dovesse esserci il bisogno, riportandoci indietro col tempo in quei meravigliosi anni in cui il \n\nfantastico ed indimenticato Freddie ci faceva sognare con la sua voce e con le sue performance degne di un vero ed \n\nincontrastato Re del Rock! (Duracell72)\n\nTrack list\n\n1. One Vision \n2. Tie Your Mother Down \n3. (You're So Square) Baby I Don't Care \n4. Hello Mary Lou (Goodbye Hert) \n5. Tutti Frutti \n6. In The Lao Of The  Gods - Seven Seas of Rhye \n7. Tear It Up \n8. A Kind Of Magic \n9. Under Pressure \n10. Another One Bites The Dust \n11. Who Wants To Live Forever \n12. I Want To Break Free \n13. Improvising Jam \n14. Now I'm Here \n15. Love Of My Life \n16. Bohemian Rhapsody \n17. Hammer To Fall \n18. Crazy Little Thing Called Love\n19. We Are The Champions","torrent":{"xt":"urn:btih:da9a57c06b34f863d190aadb0333f305b79ed9e0","amp;dn":"Queen+-+Crowing+Glory+1986%2C+%5BLOSSY+Mp3+320+kbps%5D+Bootleg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da9a57c06b34f863d190aadb0333f305b79ed9e0","infoHashBuffer":{"type":"Buffer","data":[218,154,87,192,107,52,248,99,209,144,170,219,3,51,243,5,183,158,217,224]},"announce":[],"urlList":[]}}