{"title":"World.of.Warcraft.Addon.Pack.3.1-MoffeOsbourne1337","uid":5036055,"size":346025083,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:daa667f0eb1bd2ca0cb2c594b19fab1d23cf88e0&amp;dn=World.of.Warcraft.Addon.Pack.3.1-MoffeOsbourne1337&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MoffeOsbourne1337","files":1,"time":1249084884,"description":"World of Warcraft Addon Pack.\n\nIncludes:\n\nX-Pearl Unit Frames - Makes your WoW look better.\n\nAchivementFaker - Make achievements look like you have them, anyone can see it. (Useful for faking achivements to get into raids that the leader require the achievement. As far as I know, this addon is not bannable.)\n\nCartographer - Your map shows more info about places, coords etc, levelling requirements for zones.\n\nSexy Map - Makes your minimap looks better.\n\nBejeweled - A minigame inside WoW that you can play when you're bored.\n\nAuctioneer - You can see sell, buy prices when not at a store etc, also helps you to sell items on AH for a good price.\n\nRecount Damage Meter - Collects all damage done for you/raid/group, dps and much more.\n\nDBM (Deadly Boss Mods) - Raid Addon that displays boss events, spells etc.\n\nAll Blizzard addons - You MUST have them. Always in your game but whatever.\n\nEPGP - Raiding addon, used by guilds who are serious with raiding, it's like an economy to &quot;buy&quot; gear with your EP Points.\n\nGatherer - Everything you gather through mining, herbalism and skinning collects as small icons where you can see where you were before, also go back and gather the item later.\n\nQuestHelper - You know what it is. It helps you questing, makes it easier, shows you where to go etc.\n\nInFlight - Following with QuestHelper, show's you the time left for a flight.\n\nLightHeaded - A quest addon which is full of WoWHead comments that helps you questing. (Some comments are not helping you) \n\nMusicPlayer - Plays music in your game, learn how to use it yourself.\n\nMyRolePlay - Helps your Roleplaying (Outdated)\n\nRPHelper - Helps Roleplaying (Outdated)\n\noRA2 - Raid Addon, you can use it if your guild leader uses it in your guild, they have a keyword to make you invited. Then you just whisper the leader for example &quot;Naxx&quot; and you instantly get an invite. Pretty Useful.\n\nOmen Threat Meter - Shows your threat and the others in your group/raid.\n\n\n---- That was all, hope you like it. Tested last time on patch 3.1.0 - Probably works on 3.1.3 too.\n","torrent":{"xt":"urn:btih:daa667f0eb1bd2ca0cb2c594b19fab1d23cf88e0","amp;dn":"World.of.Warcraft.Addon.Pack.3.1-MoffeOsbourne1337","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"daa667f0eb1bd2ca0cb2c594b19fab1d23cf88e0","infoHashBuffer":{"type":"Buffer","data":[218,166,103,240,235,27,210,202,12,178,197,148,177,159,171,29,35,207,136,224]},"announce":[],"urlList":[]}}