{"title":"John Mellencamp - A Ride Back Home","uid":5052673,"size":109158404,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dab499bd8d6ce106ae72177705d06f522d65c571&amp;dn=John+Mellencamp+-+A+Ride+Back+Home&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1250249872,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nLife, Death, Love and Freedom is a Folk rock album by singer-songwriter John Mellencamp and produced by T-Bone Burnett. It was released on July 15, 2008. At the end of 2008, Rolling Stone magazine named Life, Death, Love and Freedom No. 5 on its list of the 50 best albums of the year. The song &quot;Troubled Land&quot; was number 48 on Rolling Stone's list of the 100 Best Singles of 2008.\n\nMellencamp has characterized the album as a collection of &quot;modern electric folk songs.&quot; The album's first single was &quot;My Sweet Love,&quot; and it was serviced to radio on June 10, 2008. &quot;Troubled Land&quot; was the second single and was named by Rolling Stone magazine as the 48th best single of '08.\n\nJohn Mellencamp, previously known by the stage names Johnny Cougar, John Cougar and John Cougar Mellencamp, (born October 7, 1951) is a Grammy-winning American rock singer-songwriter, musician, painter and occasional actor known for his rootsy, organic brand of heartland rock that is infused with catchy pop hooks and evocative, introspective lyrics about such hot-button subjects as politics, racism, poverty and mortality. Mellencamp has brought together rock, folk, country, blues and R&amp;B into his eclectic body of work.\n\nHe has sold over 40 million albums worldwide and has amassed 22 Top 40 hits in the United States. In addition, he holds the record for the most tracks by a solo artist to hit number-one on the Hot Mainstream Rock Tracks chart, with seven, and he has been nominated for 13 Grammy Awards, winning one.\n\nMellencamp is also one of the founding members of Farm Aid, an organization that began in 1985 with a star-studded concert in Champaign, Illinois to raise awareness about the loss of family farms and to raise funds to keep farm families on their land. The Farm Aid concerts have remained an annual event over the past 24 years, and as of 2009 the organization has raised more than $33 million to promote a strong and resilient family farm system of agriculture.\n\nMellencamp was inducted into the Rock and Roll Hall of Fame on March 10, 2008, by Billy Joel. His biggest musical influences are Bob Dylan, Woody Guthrie and The Rolling Stones. Mellencamp began a six-week tour of minor league ballparks with Dylan and Willie Nelson on July 2, 2009, in Sauget, Ill., just outside of St. Louis. The tour will conclude on August 15 in Stockton, Calif.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:dab499bd8d6ce106ae72177705d06f522d65c571","amp;dn":"John+Mellencamp+-+A+Ride+Back+Home","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dab499bd8d6ce106ae72177705d06f522d65c571","infoHashBuffer":{"type":"Buffer","data":[218,180,153,189,141,108,225,6,174,114,23,119,5,208,111,82,45,101,197,113]},"announce":[],"urlList":[]}}