{"title":"The Go-Go's - Head Over Heels","uid":5087562,"size":134172676,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dad18145ab4c2917a40fa756b0532660635a75a4&amp;dn=The+Go-Go%5C%27s+-+Head+Over+Heels&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1252801481,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Head over Heels&quot; is a 1984 single, released by the all-female pop rock/new wave band The Go-Go's, written by Charlotte Caffey and Kathy Valentine. The song was released as the first single from their third album, Talk Show, and was the most successful of the album's three singles, peaking at #11 on the U.S. Billboard Hot 100.\n\nThe song appeared in the Gary Winick 2004 movie 13 Going on 30, starring Jennifer Garner.\n\nThe song's music video was the last video played on the Cable Music Channel before it went off air.\n\nTalk Show is the third studio album by rock band The Go-Go's, released on the I.R.S. label, in 1984. Although many critics called it an inspired return to form after the sophomoric Vacation, other than the #11 hit single &quot;Head over Heels,&quot; the album was a relative commercial disappointment, peaking at number 18, and selling fewer than 500,000 copies. This would be the last all original album by the group, until 2001's God Bless The Go-Go's.\n\nMany of the songs on this album were not performed regularly by the band in concert. It has been speculated that the songs bring back painful memories from this time. Only &quot;Head over Heels&quot; has been played live on a regular basis (also often in Belinda Carlisle's solo shows). Some songs haven't been played since the 1984 Prime Time tour. Overall song quality is far better than on the Vacation album, and some fans credited Kathy Valentine's increased input during these sessions, as a key factor.\n\nThe music video for &quot;Turn to You&quot; (the second single, which peaked at #32 in the U.S. chart) featured a starring role for then up-and-coming actor Rob Lowe (the song, incidentally, was written about baseball pitcher Bob Welch, a one-time boyfriend of Charlotte Caffey). The video's director, Mary Lambert, went on to work on several other videos, including hits by Madonna, and on films, such as Pet Sematary. The promo for the third track, taken from the LP, &quot;Yes or No,&quot; was released shortly before the group's breakup was announced, possibly hurting the sales of the single, which bombed at #84. A man looking like French actor Tcheky Karyo appeared in the video.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:dad18145ab4c2917a40fa756b0532660635a75a4","amp;dn":"The+Go-Go%5C%27s+-+Head+Over+Heels","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dad18145ab4c2917a40fa756b0532660635a75a4","infoHashBuffer":{"type":"Buffer","data":[218,209,129,69,171,76,41,23,164,15,167,86,176,83,38,96,99,90,117,164]},"announce":[],"urlList":[]}}