{"title":"Whatever.The.Science.Of.Teens.Series.01","uid":5091742,"size":1221073921,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:db59c2822c5e855d53bfd9eda8c1ef36e5aa8053&amp;dn=Whatever.The.Science.Of.Teens.Series.01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alyssha","files":6,"time":1253206031,"description":"&quot;Whatever! The Science of Teens&quot; (2009)   SERIES 01 \n\n5 Episodes (complete series)  about 26 minutes each episode. \n\nFrom:   ABC TV  - Australian Broadcasting Commission \n\nAir Date:   (Australia)  July and August 2009 \n\nMore at http://www.imdb.com/title/tt1468698/\n\n\nHave you ever asked your teenager to do something, or tried to tell them something important and been answered with that standard teen answer &quot;Whatever&quot;? \n\n\nGenerations of parents have wondered why their children turn into obnoxious, argumentative, angst- ridden, reckless, lazy and rebellious monsters in their teenage years. \n\nWhatever! has the answers. Using a series of ground-breaking on-screen scientific tests, we will tread where adults fear to go. This series will combine observational documentary of family life and teens behaving badly, with carefully designed scientific challenges that put our teenagers to the test. \n\nExperts will be on hand to give physical, physiological and psychological analysis of the way teenagers behave while we talk to teenagers and parents to give us a 360 degree view of the experiments and what they could mean in everyday life. \n\nThis is a compilation of downloads from various sources, to rebuild it into a complete 5 part series.\n\nAll AVI files (not compressed/ No RAR's) and all working well as at time of upload. \n\nThanks to the original uploaders - whoever they may be.  \n\nHope you enjoy it. \n\n(my upload bandwidth is narrow, so upload initially will be slow, but I will leave it seeding for some time to ensure it gets completed several times to other seeders, so hang in there - it will complete after a while. Dont be in too much of a hurry!)\n","torrent":{"xt":"urn:btih:db59c2822c5e855d53bfd9eda8c1ef36e5aa8053","amp;dn":"Whatever.The.Science.Of.Teens.Series.01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db59c2822c5e855d53bfd9eda8c1ef36e5aa8053","infoHashBuffer":{"type":"Buffer","data":[219,89,194,130,44,94,133,93,83,191,217,237,168,193,239,54,229,170,128,83]},"announce":[],"urlList":[]}}