{"title":"HARRY-POTTER.And-the-Half-Blood-Prince.DVDrip[vice]","uid":5128814,"size":700429766,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dc0beb24fad2aeb81fa6f283d11733920aa71eae&amp;dn=HARRY-POTTER.And-the-Half-Blood-Prince.DVDrip%5Bvice%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vicerock","files":-1,"time":1255965698,"description":"HARRY POTTER AND THE HALF\nBLOOD PRINCE DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x272[wide screen]\nruntime 142:27mins\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\ncast\n\nDaniel Radcliffe\nRupert Grint\nEmma Watson\nMichael Gambon\nJim Broadbent\nAlan Rickman\nTom Felton\nHelena Bonham Carter\n\nplot\nHaving returned to power, Death Eaters attack both the Muggle and Wizarding worlds, while Lord Voldemort has given Draco Malfoy an assignment. Bellatrix Lestrange goads Severus Snape into making an Unbreakable Vow with Draco's mother, Narcissa, to protect Draco and carry out the assignment if he fails. Scarred by his experience at the Ministry of Magic with Voldemort, Harry is reluctant to return to school. Dumbledore brings Harry to entice former Potions Professor Horace Slughorn to return to Hogwarts. Later, while leaving Fred and George's new shop in Diagon Alley, Harry, Ron and Hermione notice Draco associating with Bellatrix Lestrange, Fenrir Greyback and Narcissa Malfoy in Borgin and Burkes, leaving Harry suspicious. He attempts to eavesdrop on Malfoy on the Hogwarts Express, but Draco Petrifies Harry. He is rescued by Luna Lovegood and her Spectrespecs.\n\nAt Hogwarts, Harry and Ron borrow school textbooks for Slughorn's Potions class. The previous owner of Harry's copy, the &quot;Half-Blood Prince&quot;, has annotated the book with additional instructions that allow Harry to excel in class and win a vial of the luck potion Felix Felicis. After making it as Keeper on the Quidditch team, Ron becomes a hero and he forms a relationship with Lavender Brown, which leaves Hermione heartbroken. After Harry finds her sobbing in a corridor, he confesses to having feelings for Ginny Weasley and admits that he is feeling distraught over her relationship with Dean Thomas. He hides his feelings from all but Hermione, however, knowing Ron is protective of Ginny and would never allow a relationship between them. Harry spends Christmas with the Weasleys, during which he discusses the situation at Hogwarts with Order of the Phoenix members Arthur Weasley, Remus Lupin and Nymphadora Tonks. He becomes closer to Ginny, who has broken up with Dean. They nearly share a kiss but Bellatrix Lestrange and Fenrir Greyback attack the Burrow and attempt to kidnap Harry. The Order is able to keep everyone safe, but the Death Eaters set fire to the Burrow.\n\nDraco continues eluding Harry while perfecting the use of a Vanishing Cabinet inside the Room of Requirement. Harry suspects Draco is behind two attempts on Dumbledore's life, one of which nearly kills Ron. In his semi-comatose state, Ron mumbles Hermione's name, causing his relationship with Lavender to deteriorate. Confronting Draco, Harry hits him with a curse from the Half-Blood Prince's book which severely wounds him. Snape heals Draco as Harry retreats. Fearing the book may be filled with more Dark Magic, Ginny convinces Harry to leave the book in the Room of Requirement so that he won't use it again. While Harry's eyes are closed, Ginny hides the book and kisses him, starting a relationship between them.\n\nDuring private meetings held throughout the year, Dumbledore shows Harry memories of a young Tom Riddle and reveals Slughorn retains a memory critical to Voldemort's defeat. Harry retrieves the memory using Felix Felicis. It reveals that Voldemort had been seeking information for creating as many as seven Horcruxes, devices that safeguard a portion of the creator's soul, granting him immortality unless the Horcruxes are destroyed. Two of Voldemort's Horcruxes have already been destroyed: Tom Riddle's diary, and his grandfather's ring. After locating another Horcrux, Dumbledore requests Harry's help to retrieve it. Inside a cave, Harry is forced to make Dumbledore drink a mind-altering potion that hides the Horcrux, a locket. Though gravely weakened, Dumbledore defends them from a horde of Inferi and Apparates himself and Harry back to the Astronomy Tower at Hogwarts. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0417741/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0417741/&lt;/a&gt;\n\n\nPLEASE SEED AND ENJOY THANKS","torrent":{"xt":"urn:btih:dc0beb24fad2aeb81fa6f283d11733920aa71eae","amp;dn":"HARRY-POTTER.And-the-Half-Blood-Prince.DVDrip%5Bvice%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc0beb24fad2aeb81fa6f283d11733920aa71eae","infoHashBuffer":{"type":"Buffer","data":[220,11,235,36,250,210,174,184,31,166,242,131,209,23,51,146,10,167,30,174]},"announce":[],"urlList":[]}}