{"title":"salix-lxde-13.1.iso","uid":5676950,"size":486903808,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:dc18a5809733b0bb0df1124707655872f7f9ad76&amp;dn=salix-lxde-13.1.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cestpasgagne2","files":1,"time":1278580369,"description":"Salix LXDE edition 13.1 has been released! Based on Slackware 13.1, it features the Lightweight X11 Desktop Environment, &quot;an extremely fast-performing and energy-saving desktop environment&quot;, with a clean look and feel. The main applications that complete the LXDE experience are the lightweight and fast PCManFM file manager and the popular Openbox window manager.\nAs with the standard, XFCE edition, this iso allows installation to be performed in three different modes, core, basic and full. The core mode installation is identical to the one you get from the XFCE edition. Basic will only install a minimal LXDE desktop with only midori and gslapt installed as extra and full will install everything that is included in the iso. That includes the lightweight Midori web browser, that uses the powerful webkit engine and the Claws-mail e-mail client, along with the Transmission torrent client and the Pidgin instant messaging client. Also included are the Abiword word processor, the Gnumeric spreadsheet and the epdfview pdf reader. The Whaawmp! Media Player is used as the main media application and is accompanied by the powerful Exaile music player/manager and the Brasero disc burning application. Viewnior is the default image file viewer and mtpaint can be used for editing them. The full set of the Salix system tools are of course included in this release.\nUsers are able to use the Gslapt package manager, or the command line equivalent slapt-get, to install extra software in their systems from Slackware and Salix repositories, with complete support for dependency resolution.\n\nmd5sum : 261e043d58809bbd525bb8490ba0317d  salix-lxde-13.1.iso","torrent":{"xt":"urn:btih:dc18a5809733b0bb0df1124707655872f7f9ad76","amp;dn":"salix-lxde-13.1.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc18a5809733b0bb0df1124707655872f7f9ad76","infoHashBuffer":{"type":"Buffer","data":[220,24,165,128,151,51,176,187,13,241,18,71,7,101,88,114,247,249,173,118]},"announce":[],"urlList":[]}}