{"title":"Bromwell High - The Complete Season","uid":5572262,"size":3526716843,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dc398424e07cd8804b6c4ab4f704e735275a2e04&amp;dn=Bromwell+High+-+The+Complete+Season&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"theanonymousentity","files":35,"time":1274280401,"description":"A rip from my good friend Bandit Keith. His comments:\n\n================================\n\nThe complete series of Bromwell High, ripped from the DVDs.\n\nI made this rip because the only active torrents of Bromwell High I could find\nbefore were full of staticy TV rips and broken WMVs and I thought people might\nenjoy a decent, consistent quality DVD rip of the show.\n\nThe episodes are split into two separate parts because, well, that's how they\nwere done up on the DVDs and I figure it'd make it easier on anyone wanting to\nchapter break it (or something) to leave them apart instead of joining them\ntogether during the encoding process, not to mention saving myself alot of time\nand hassle on sound sync issues.\n\nThe DVDs were ripped using DVD Decrypter. The video was processed through\nAvidemux and the audio streams were directly copied from the DVDs. The audio and\nvideo streams were combined together using AVIMux.\n\nAs far as the french audio and episode titles go, I'm sorry, but I don't speak a\nlick of french - hell, I's don't evin speaks english that all decent - so I\ndon't know whether or not the french audio track are syncing up right or not.\nThey appear as if they're syncing, what with voices matching when characters are \ntalking, but I don't know for certain. Plus what with it being animated and all.\n\nAs far as the episode titles go; I know they're wrong, but I just copied them\n(more or less) verbatim from the back of the box. I did try to match them up to\nthe right episodes as it is painfully obvious they're not listed in the proper\norder, but I don't know if I got them all in the correct order. And as far as\nthe spelling goes; Like I said, verbatim (cept for the all caps.)\n\nVideo::\n    MPEG-4 ASP (Xvid).\n    560x420 (4:3 Aspect)\n    Two-pass.\n    Target Bitrate: 1200.\n    Cartoon Mode.\n    Filters:\n        DBob.\n        MPlayer Resize.\n    \n\nDual Audio: English and French.\n\nNo Subtitles.\n\nIn America!\n","torrent":{"xt":"urn:btih:dc398424e07cd8804b6c4ab4f704e735275a2e04","amp;dn":"Bromwell+High+-+The+Complete+Season","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc398424e07cd8804b6c4ab4f704e735275a2e04","infoHashBuffer":{"type":"Buffer","data":[220,57,132,36,224,124,216,128,75,108,74,180,247,4,231,53,39,90,46,4]},"announce":[],"urlList":[]}}