{"title":"Coast to Coast AM - Aug 18 2009 - Unified Theory &amp; the Universe","uid":5063082,"size":55588436,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:dc415221404784baff7d19d8604df44a83c4b2b7&amp;dn=Coast+to+Coast+AM+-+Aug+18+2009+-+Unified+Theory+%26+the+Universe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1250797318,"description":"Nassim Haramein shared his Unified Theory about the structure of the universe, drawing from such fields as theoretical physics, cosmology, quantum mechanics, biology, chemistry, and anthropology. We could be part of a multiverse, he noted, in the sense that our universe is probably embedded into a larger universe, which itself is embedded in a larger universe, and so on, scaling into infinity. While the material world makes up less than 99.9% of our universe, the space around it is not empty-- rather it's a vacuum that's filled with energy and only appears empty because it's everywhere, he explained. \nHaramein suggested that all organized matter from black holes to atoms share basic properties and structures on different scales. Inside a single proton is the energy of the universe, and since all protons are connected (in what is called entanglement), everything that exists is part of a oneness, he stated. Access to infinity is within ourselves, through the very atoms of our being, he continued.\nEliminating the strong and weak forces of the atomic world, Haramein's Unified Theory is based on the fundamental forces of gravity and the electromagnetic, which are in a feedback loop, and cause the universe to expand and contract at the same time. He has formed the Resonance Project to bring scientists and physicists together to further research unified theories and applications.\nSymbolism &amp; Money\nFirst hour guest, researcher Jordan Maxwell talked about the symbolism on the US dollar. The eye in the pyramid represents the Jewish Messiah, as well as Jesus-- it stands for &quot;the chief cornerstone the builders rejected,&quot; he said. The 13 stars in the hexagram reference the Messiah and his chosen 12 disciples, he added. He also spoke about the symbolism and terminology associated with money and banking.\n\n[This information has been shared to spread knowledge to those who otherwise would not have access to it.  If you can afford it please support www.coasttocoast.com]","torrent":{"xt":"urn:btih:dc415221404784baff7d19d8604df44a83c4b2b7","amp;dn":"Coast+to+Coast+AM+-+Aug+18+2009+-+Unified+Theory+%26+the+Universe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc415221404784baff7d19d8604df44a83c4b2b7","infoHashBuffer":{"type":"Buffer","data":[220,65,82,33,64,71,132,186,255,125,25,216,96,77,244,74,131,196,178,183]},"announce":[],"urlList":[]}}