{"title":"Roller Coaster Factory 3","uid":5062205,"size":149113164,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dc96b224c633de101081d47719e9e88602ec0c3e&amp;dn=Roller+Coaster+Factory+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Brianinmd","files":-1,"time":1250759971,"description":"Build it and they will come. Such is the philosophy behind Roller Coaster Factory 3, a simulation game that affords players the opportunity to engineer the roller coaster of their dreams. Seven types of coasters are available, including Stand Up, Floorless Steel, Inverted, Steel Freeform, Wooden, Mouse, and Suspended Flying. With an additional ten inversion variations (Heartline, Heartline Loops, Cutback, Camel Backs, Cobras, Pretzel Loops, Corkscrews, Incline Loops, Batwings, and Helix), players are free to construct the wildest roller coaster gravity will allow.Once built and thoroughly tested, players are able to ride their creation from any seat or car in order to truly &quot;feel&quot; what the roller coaster has to offer.\n\nAdditionally, snapshots can be taken while riding the roller coaster and saved for future viewing. Aesthetics are an important part of any successful coaster design and to that end, players can customize their rides with a variety of decals and colors. Two modes of play allow designers to either build without time and budgetary constraints or tackle the 20 pre-designed missions, each with specific parameters and budgetary limits.","torrent":{"xt":"urn:btih:dc96b224c633de101081d47719e9e88602ec0c3e","amp;dn":"Roller+Coaster+Factory+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc96b224c633de101081d47719e9e88602ec0c3e","infoHashBuffer":{"type":"Buffer","data":[220,150,178,36,198,51,222,16,16,129,212,119,25,233,232,134,2,236,12,62]},"announce":[],"urlList":[]}}