{"title":"Red Room 2 (2000) - Eng Hard Subs","uid":5571182,"size":561440768,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dca37effe4303730d905ec9a9908ec2db01a5469&amp;dn=Red+Room+2+%282000%29+-+Eng+Hard+Subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Horrorspoke","files":1,"time":1274256869,"description":"After Red Room 1, the director clearly thought that he hadn't repulsed enough people or gone over the line enough. There were still boundaries to be tampered with and unchartered taboos to explore.\n\nCue Red Room 2, a rather sick experiment in just how far cinema can go before losing all of its artistic merit and becoming purely an experiment in how thoroughly we can sicken ourselves. Unfortunately all our 'loved' characters bar one from the last installment are next to dead, so we're now presented with four fresh hopefuls.\n\nThe drill is exactly the same as the last film - four contenders sit in a room and draw cards. The outcome of the draws decides who will receive a certain 'punishment' as part of the game, who will administer it, who will just watch, and who will decide what it is. The one left alive at the end of all the rounds wins the game. The punishments themselves are all the more intense and immoral than in Red Room 1, involving toothbrushes, hammers, a bowl of vomit [which looks too much like porridge] and one particular scene involving a pregnant girl which is totally over the mark.\n\nThe only problem with this film is that it tries so hard to shock its audience that it's very easy to see it for exactly what it is, an exercise in violence and bad taste, so labeling it as 'horror' is giving it too much credit. As well as this, the budget is so obviously low and the effects so unconvincing that we are more sickened by the concepts of the actions taking place than by their physical representations, which at times are laughably fake. Still, the only reason anyone would watch this film is out of some form of twisted curiosity. It nevertheless succeeds in what it sets out to do - to thoughtlessly repulse and to sicken - making it a totally shallow and merit less piece of filming, although it doesn't pretend to be anything else.\n\nIMDB info: http://www.imdb.com/title/tt0371945/\n\nSame as always guys, comment, seed and enjoy!","torrent":{"xt":"urn:btih:dca37effe4303730d905ec9a9908ec2db01a5469","amp;dn":"Red+Room+2+%282000%29+-+Eng+Hard+Subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dca37effe4303730d905ec9a9908ec2db01a5469","infoHashBuffer":{"type":"Buffer","data":[220,163,126,255,228,48,55,48,217,5,236,154,153,8,236,45,176,26,84,105]},"announce":[],"urlList":[]}}