{"title":"Adventureland.2009.iTAL.MD.DVDRip.XviD-SiLENT[volpebianca]","uid":5041559,"size":1254412834,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dcd8ece82465dd3df1712433f371b5faaf48efe8&amp;dn=Adventureland.2009.iTAL.MD.DVDRip.XviD-SiLENT%5Bvolpebianca%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Volpebianca","files":2,"time":1249396778,"description":"::: Scheda del film :::\n\nUn film di Greg Mottola. Con Jesse Eisenberg, Kristen Stewart, Martin Starr, Bill Hader, Kristen Wiig.\nRyan Reynolds, Margarita Levieva, Josh Pais, Kevin Breznahan, Michael Zegen, Mary Birdsong, Matt Bush, Paige Howard, Alana Hixson\nGenere:Commedia\ndurata 107 min.\n\n\n::: Trama del film :::\n\nUna premessa necessaria: Greg Mottola, il regista di Superbad, ha effettivamente lavorato nell'estate del 1987 come responsabile di uno stand di giochi all'Adventureland di Pittsburgh. James Brennan, che ha un padre alcolizzato, cerca di guadagnare qualche soldo in attesa di poter andare alla Columbia. James ÃƒÂ¨ uscito dal college ancora vergine e il grande Luna Park diventa il luogo della sua crescita in tutti i sensi. ÃƒË† qui infatti che conosce Em Lewin che invece ha cercato quel lavoro solo per stare lontana dal padre che si ÃƒÂ¨ risposato con una donna dal carattere impossibile.\nMottola, sceneggiatore del suo film, utilizza i ricordi personali e si identifica con James (un Jesse Eisenberg che abbiamo giÃƒÂ  apprezzato nell'indipendente Il calamaro e la balena), con le sue incertezze ma anche con le sue aspettative e la sua voglia di vita nuova. Il parco divertimenti in un'America marcatamente reaganiana (il presidente appare anche in tv) diventa cosÃƒÂ¬ una metafora della vita. Con il bisogno di un'illusione temporanea ma anche con la prepotenza di chi, grazie al possesso di un'arma, pretende e ottiene il peluche piÃƒÂ¹ grande. Accanto a lui c'ÃƒÂ¨, giÃƒÂ  in stato di grazia (non solo per quanto riguarda l'aspetto esteriore) Kristen Stewart. La giovane attrice non aveva ancora girato il film che l'avrebbe resa famosa in tutto il mondo (Twilight) ma era giÃƒÂ  in grado di offrire una recitazione che dÃƒÂ  la misura di come si possa innervare un film di uno spleen tutto particolare. Quello che avrebbe potuto diventare l'ennesimo teen movie corroborato da una colonna sonora ricca di citazioni d'epoca diventa, grazie a lei e ad Eisenberg, un film sulla complessa e non facile ricerca di una felicitÃƒÂ  possibile.\n\nQualitÃƒÂ  audio 7.5 video 8/9","torrent":{"xt":"urn:btih:dcd8ece82465dd3df1712433f371b5faaf48efe8","amp;dn":"Adventureland.2009.iTAL.MD.DVDRip.XviD-SiLENT%5Bvolpebianca%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcd8ece82465dd3df1712433f371b5faaf48efe8","infoHashBuffer":{"type":"Buffer","data":[220,216,236,232,36,101,221,61,241,113,36,51,243,113,181,250,175,72,239,232]},"announce":[],"urlList":[]}}