{"title":"Taxi Derrape Total Spanish.avi","uid":5036185,"size":732442624,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dd52fffa9f9b461bdef27fc100ad4d222d0d174a&amp;dn=Taxi+Derrape+Total+Spanish.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1249133773,"description":"Belle Williams (Queen Latifah) es un diablo de la velocidad. Yendo a toda pastilla por las ca-lles de Nueva York en su taxi tuneado, se ha ganado la reputaciÃƒÂ³n de ser la taxista mÃƒÂ¡s rÃƒÂ¡-pida de Nueva York. Pero conducir un taxi es ÃƒÂºnicamente un alto en el camino en pos de su verdadero sueÃƒÂ±o: Belle quiere ser campeona en una carrera de coches. Y estÃƒÂ¡ muy bien encaminada, hasta que descarrila por culpa del espÃƒÂ­dico poli-cÃƒÂ­a Andy Washburn (Jimmy Fallon), cuyas habilidades secretas sÃƒÂ³-lo tienen parangÃƒÂ³n con su total ineptitud detrÃƒÂ¡s del volante. Wash-burn, cuya falta de destreza al conducir le hace aterrizar en una pe-rrera precintada, estÃƒÂ¡ loco por atrapar a una banda de bellas ladro-nas de bancos de origen brasileÃƒÂ±o, a cuyo frente figura Vanessa (Gisele BÃƒÂ¼ndchen), frÃƒÂ­a, calculadora y con unas piernas larguÃƒÂ­si-mas. Para atrapar a estas evasivas delincuentes sin permiso de conducir, Washburn convence a Belle para que se una a ÃƒÂ©l en la persecuciÃƒÂ³n de Vanessa y de su equipo. Belle tiene con ÃƒÂ©l carta blanca para conducir a la velocidad que le dÃƒÂ© la gana y saltarse a la torera todas las leyes. Un policÃƒÂ­a sin coche y una taxista loca por la velocidad, dos compaÃƒÂ±eros de faena inusuales en Nueva York, empiezan a jugar a toda velocidad al gato y al ratÃƒÂ³n con las ladro-nas. AsÃƒÂ­ va a ser, al menos, si Belle y Washburn no terminan antes matÃƒÂ¡ndose el uno al otro.","torrent":{"xt":"urn:btih:dd52fffa9f9b461bdef27fc100ad4d222d0d174a","amp;dn":"Taxi+Derrape+Total+Spanish.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd52fffa9f9b461bdef27fc100ad4d222d0d174a","infoHashBuffer":{"type":"Buffer","data":[221,82,255,250,159,155,70,27,222,242,127,193,0,173,77,34,45,13,23,74]},"announce":[],"urlList":[]}}