{"title":"Boy Meets Girl - Oh Girl.mpg","uid":5094412,"size":70899716,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dd8f82404a3e9787c347a1d76413d57794f8225f&amp;dn=Boy+Meets+Girl+-+Oh+Girl.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"claudeq","files":1,"time":1253432791,"description":"Boy Meets Girl is a duo consisting of keyboardist and vocalist George Merrill and singer Shannon Rubicam. They are perhaps best known for their hit song &quot;Waiting For A Star To Fall&quot; from 1988.\n\nThe members of Boy Meets Girl, George Merrill and Shannon Rubicam, wrote a number of songs for other artists. Most famous are their two number one hits written for Whitney Houston, &quot;How Will I Know&quot; and &quot;I Wanna Dance With Somebody (Who Loves Me)&quot;. They also wrote the songs &quot;Don't Tell Me We Have Nothing&quot; and &quot;Haunting Me&quot; for Deniece Williams and the song &quot;I Know You By Heart&quot;, performed by Bette Midler on the Beaches soundtrack. The duo also performed backing vocals on Deniece Williams' number one hit, &quot;Let's Hear It For The Boy&quot;. Merrill also sang backing vocals on Bette Midler's Some People's Lives album.\n\nDespite writing songs for others, Boy Meets Girl usually produces a demo version, or, in some cases, such as &quot;Don't Tell Me We Have Nothing&quot;, a studio version, before the song is handed to the intended artist.\n\nThe duo's first album was self titled and its lead off song &quot;Oh Girl,&quot; a bitter tell off of a failed relationship, was released as a single by A&amp;M Records. The song reached #39 on the Billboard Hot 100 singles chart in May of 1985. The Boy Meets Girl album peaked at #76 on the album charts.\n\nThree years later, the group released their follow-up album, Reel Life, which featured the single &quot;Waiting for a Star to Fall.&quot; With this tune, after years of writing songs for other artists, the duo would earn mainstream success in their own right. In the United States, &quot;Waiting For A Star To Fall&quot; peaked at #5 on the Billboard Hot 100 and at #1 on the Billboard Adult Contemporary chart. The song reached #9 in the UK and was also a top ten Australian hit in April 1989. It was featured in the movie Three Men and a Little Lady. Reportedly, the song was inspired by an actual falling star that Merrill and Rubicam saw at a Whitney Houston concert at the Greek Theatre. The duo submitted the song to Houston for consideration on her next album, but it was rejected, possibly because it was too &quot;pop&quot;-sounding and Houston's camp was looking to re-establish her credibility with R&amp;B audiences.[citation needed] The song was also recorded by Belinda Carlisle for her 1987 release Heaven On Earth at the insistence of her label, but Belinda disliked the song, and it was ultimately not included on the album, though it has circulated in her trading circles for years on a disc of that album's outtakes.\n\nBoy Meets Girl's follow-up single, &quot;Bring Down The Moon&quot;, peaked at #47 on the Billboard Hot 100 (and #28 Adult Contemporary). The Reel Life album contained both singles and spent several weeks at #50 in the United States and peaked at #75 in the United Kingdom.\n\nBoy Meets Girl's third album, New Dream, was scheduled for release in 1990 but was shelved by RCA Records during a label reorganization. The album became a much sought-after collectible, with the promotional copy CD selling for more than $700 on eBay.[citation needed] It was finally released through the band's own website in 2004.\n\nIn the early 2000s, the couple divorced, but continued their musical collaboration. In 2003, they released their fourth album, The Wonderground, on their own label, and arranged for RCA Records to re-release their two RCA albums. Recently they re-released their debut album recorded for A&amp;M Records. In the works are new versions of their demo tapes done originally for Whitney Houston. The various artists album Number One With A Bullet also contains their original demo tape for &quot;I Wanna Dance With Somebody (Who Loves Me).&quot;\n\nIn 2005, &quot;Waiting For A Star To Fall&quot; was involved in a &quot;sample battle.&quot; Two electronic music groups, Cabin Crew and Sunset Strippers, both wanted to sample the song and remix it to become a hit again. Sunset Strippers, from the UK, won the right for the samples from the band's record label, releasing &quot;Falling Stars&quot;. However, Cabin Crew, from Australia, had met Boy Meets Girl, and vocalist George Merrill re-recorded the vocals for the remixed song, entitled &quot;Star To Fall&quot; or &quot;Star2Fall&quot;. In the same year, Scottish electronic musician Mylo had also used samples of the song, mixing it with &quot;Bette Davis Eyes&quot; by Kim Carnes for his song entitled &quot;In My Arms&quot;.\n\nIn the past few years, George Merrill has been working with artist Ian Hopkinson (from Australia) in both a production and writing capacity on Hopkinson's debut release Strangers To Ourselves. It's slated for release in November 2009\n\n\n\nEnjoy - it screams 80's - fashion and sound","torrent":{"xt":"urn:btih:dd8f82404a3e9787c347a1d76413d57794f8225f","amp;dn":"Boy+Meets+Girl+-+Oh+Girl.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd8f82404a3e9787c347a1d76413d57794f8225f","infoHashBuffer":{"type":"Buffer","data":[221,143,130,64,74,62,151,135,195,71,161,215,100,19,213,119,148,248,34,95]},"announce":[],"urlList":[]}}