{"title":"Strongarm Discography","uid":5567361,"size":151722821,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:de7e6df2f4d768e954874189d7ee162803b68f2e&amp;dn=Strongarm+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"soulvice","files":24,"time":1274028061,"description":"&quot;Strongarm started in 1993 with Nick Dominguez (guitar) and Joshua Colbert (guitar) from the band Endure, Chris Carbonell (drums), Chad Neptune (bass) and Jason Berggren (vocals) from Ikthus. While recording These Times That Try Men's Souls the band signed with Tooth &amp; Nail Records.The original line-up remained the same for the release of their debut album Atonement in early 1995. Shortly after the release of this album there were personal differences in the band, and Nick (who went on to form Tension) and Chris were asked to leave the band. They were replaced by Bob Franquiz on guitar (Amboogalard) and Steve Kleisath on drums (Pull).\n\nSoon after the release of The Advent of a Miracle the band broke up. Colbert and Neptune went on to form the christian hardcore band Further Seems Forever with vocalist Chris Carrabba. Drummer Steve Kleisath went to to become a full time drummer of the metalcore band Shai Hulud and then, the drummer for Further Seems Forever.[1]\n\nIn 2000, Strongarm made a reunion appearance at Furnace Fest. It was the same line-up as it was when they broke up. On the song &quot;Trials&quot;, they had their long time friend Matt Fox from Shai Hulud on drums.&quot;\n\n\n\nThe Advent of a Miracle - 1997\nAtonement - 1995\nThese Times That Try Men's Souls (Demo) - 1993\n\n\n\nI'm missing their first demo tape and their two 7&quot; releases, Division and Trials\nIf anyone has a digital copy of any of these and could upload them that would be great :)","torrent":{"xt":"urn:btih:de7e6df2f4d768e954874189d7ee162803b68f2e","amp;dn":"Strongarm+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de7e6df2f4d768e954874189d7ee162803b68f2e","infoHashBuffer":{"type":"Buffer","data":[222,126,109,242,244,215,104,233,84,135,65,137,215,238,22,40,3,182,143,46]},"announce":[],"urlList":[]}}