{"title":"Divinyls - Boys In Town (Live)","uid":5064752,"size":102395908,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:de9772d4b4413012db2d3c723c27be904bcb2be1&amp;dn=Divinyls+-+Boys+In+Town+%28Live%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1250917043,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nDivinyls are an Australian rock band formed in Sydney in 1980 and featuring vocalist Christina Amphlett and guitarist Mark McEntee. As the focal point, Amphlett performed on stage wearing a school uniform and fishnet stockings, often using an illuminated neon tube as a prop and displaying aggression towards band members and the audience. The band, originally a five-piece, underwent numerous lineup changes with Amphlett and McEntee as the core members, before breaking up in 1996.\n\nIn May 2001 the Australasian Performing Right Association (APRA), as part of its 75th Anniversary celebrations, named &quot;Science Fiction&quot; as one of the Top 30 Australian songs of all time. The band was inducted into the Australian Recording Industry Association (ARIA) Hall of Fame in 2006 and in late 2007 Amphlett and McEntee reconvened to record a new single and begin working on a new album. The band played a short series of live gigs in Australia in late 2007 and early 2008.\n\nDivinyls have released five studio albums, with four of them reaching the Top 10 in Australia and one, &quot;Divinyls&quot;, reaching #15 in the US. Their biggest-selling single, &quot;I Touch Myself&quot; (1991) achieved #1 in Australia, #4 in the US and #10 in the UK.\n\nGreatest Hits is the 2006 collection of the Divinyls music since their career lifted off in the early 80's. This album was inspired by the Divinyls' entry into the 2006 Aria Hall Of Fame. This album also marks their 25 years in music. It features some of their biggest hits including &quot;Boys in Town&quot;, &quot;Pleasure and Pain&quot; and their #1 smash hit &quot;I Touch Myself&quot;.\n\nAmphlett is the cousin of 1960s Australian pop icon Little Pattie and closely related to pioneer rocker Col Joye and his brother, leading promoter Kevin Jacobsen. In her autobiography Pleasure and Pain (2005), Amphlett described breaking into the music scene from the age of fourteen, being arrested for busking when seventeen and travelling in Spain, and how her performances drew upon childhood pain.\n\nAmphlett and McEntee (ex-Air Supply) met at the Sydney Opera House where Amphlett was singing in a choral concert in 1980. They recruited Jeremy Paul (ex-Air Supply), Bjarne Ohlin and Richard Harvey, and for almost two years they performed in pubs and clubs in Sydney's Kings Cross. Australian film director Ken Cameron saw Divinyls in a club, he asked them to provide the soundtrack for 1982's Monkey Grip and also had Amphlett acting. The group released two singles from the soundtrack EP, &quot;Boys in Town&quot;, which reached #8 on the national singles chart, and &quot;Only Lonely&quot;. Original bassist Jeremy Paul left before the movie or first single were released. He was replaced on bass, briefly by Ken Firth (ex-The Ferrets) and more permanently by Rick Grossman (ex Matt Finish). Grossman left in 1987 to replace Clyde Bramley in Hoodoo Gurus. By early 1988, Divinyls were reduced to the founding duo of Amphlett and McEntee with augmentation by additional musicians when recording or touring.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:de9772d4b4413012db2d3c723c27be904bcb2be1","amp;dn":"Divinyls+-+Boys+In+Town+%28Live%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de9772d4b4413012db2d3c723c27be904bcb2be1","infoHashBuffer":{"type":"Buffer","data":[222,151,114,212,180,65,48,18,219,45,60,114,60,39,190,144,75,203,43,225]},"announce":[],"urlList":[]}}