{"title":"Alien Worlds [ADULT]","uid":5112660,"size":146732442,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:dee9af939f60cb0a947766a420d60c57009a0def&amp;dn=Alien+Worlds+%5BADULT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"brodahisou","files":-1,"time":1254885837,"description":"Alien Worlds was a science fiction anthology comic book published by Pacific Comics and, later, Eclipse Comics, in the early 1980s. The title was edited by Bruce Jones and April Campbell.\n\nNearly all of the stories in Alien Worlds were written by Jones, with only a few exceptions (notably Jan Strnad's &quot;Stoney End&quot; in Issue # 8 and Frank Brunner's &quot;The Reading!&quot; in Issue # 9). Jones had developed a skill for the short genre tale, often with a twist ending, during his years with Warren Publishing while writing for their Creepy and Eerie titles. He was heavily influenced by the horror and science fiction movies of the 1950s, adding graphic violence and sexuality to the mix, complete with copious female nudity; several issues sported a 'Recommended For Mature Readers' warning on the cover. However, for the most part Alien Worlds avoided the more intensely gruesome subject matter of Jones' other Pacific comic, Twisted Tales, which was being published at the same time.\n\nFront covers for the comic were by, among others, John Bolton, Dave Stevens, Frank Brunner, and Joe Chiodo. Contributing interior artists included Bolton, Stevens, Al Williamson, Richard Corben, Roy Krenkel, Val Mayerik, and Rand Holmes, as well as two stories written and illustrated by editor Jones himself.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:dee9af939f60cb0a947766a420d60c57009a0def","amp;dn":"Alien+Worlds+%5BADULT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dee9af939f60cb0a947766a420d60c57009a0def","infoHashBuffer":{"type":"Buffer","data":[222,233,175,147,159,96,203,10,148,119,102,164,32,214,12,87,0,154,13,239]},"announce":[],"urlList":[]}}