{"title":"CopyToDVD 4.2.2.26-serial incl","uid":5045474,"size":12341741,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dfefd407ca9b88918783fc465deb9888a46c6484&amp;dn=CopyToDVD+4.2.2.26-serial+incl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jmb2012","files":2,"time":1249603946,"description":"CopyToDVD's brand new interface makes it easy to create or copy data, audio or video DVDs or CDs including double layer. Access all of VSO-Software's products from within one interface. CopyToDVD supports a wide range of third party software making it a complete suite for all your burning needs. Suitable for beginners as well as the advanced user, CopyToDVD brings together a number of specialized tools such as a backup scheduler, a media player and a new starter. A must have for your burning needs.\n\n\nSupported operating systems:\nWin98, WinME, Windows2000, WinXP, Windows2003, Windows Vista Starter, Windows Vista Home Basic, Windows Vista Home Premium, Windows Vista Business, Windows Vista Enterprise, Windows Vista Ultimate, Windows Vista Home Basic x64, Windows Vista Home Premium x64, Windows Vista Business x64, Windows Vista Enterprise x64, Windows Vista Ultimate x64\n\n\nSupported languages: English, Arabic, Chinese, ChineseSimplified, ChineseTraditional, Czech, Finnish, French, German, Greek, Hungarian, Italian, Japanese, Korean, Polish, Portuguese, Russian, Spanish\n\n","torrent":{"xt":"urn:btih:dfefd407ca9b88918783fc465deb9888a46c6484","amp;dn":"CopyToDVD+4.2.2.26-serial+incl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfefd407ca9b88918783fc465deb9888a46c6484","infoHashBuffer":{"type":"Buffer","data":[223,239,212,7,202,155,136,145,135,131,252,70,93,235,152,136,164,108,100,132]},"announce":[],"urlList":[]}}