{"title":"Mumbai Trapped In Terror - India","uid":5040286,"size":93936283,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e01a14fe8f21ce0811d9f51cfc93635891f49938&amp;dn=Mumbai+Trapped+In+Terror+-+India&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"the_Phyrexian","files":1,"time":1249337888,"description":"August 2009\n\nOn 26th November 2008, the world watched as Mumbai was struck by absolute terror. Trapped in their hotel room while gunmen roamed the corridors, Australian victims recall their fears and ultimate rescue.\nHiding for his life, Garrick Harvison captured those chilling moments on his mobile. Gunshots are heard in the background. 'The most difficult part is not knowing what is going on the other side of that door', he whispers. Then his phone rings: terrorists trying to lure him outside. Debra Bayne, another trapped Australian, had to listen while her neighbours were killed. The nights were hard, listening to explosions next to your room. Still shaken by the memory, Debra recalls her rescue: When we came out of my room we had to walk over all the people who had been killed. Then we had to go down a fire escape in the dark, nineteen stories The gunmen also rampaged through hospitals and slums, killing many Indians. Like Garrick and Debra, the people of Mumbai are trying to move on.\n\nProduced By ABC Australia, distributed by Journeyman Pictures ","torrent":{"xt":"urn:btih:e01a14fe8f21ce0811d9f51cfc93635891f49938","amp;dn":"Mumbai+Trapped+In+Terror+-+India","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e01a14fe8f21ce0811d9f51cfc93635891f49938","infoHashBuffer":{"type":"Buffer","data":[224,26,20,254,143,33,206,8,17,217,245,28,252,147,99,88,145,244,153,56]},"announce":[],"urlList":[]}}