{"title":"Celebrity Apprentass (2009 - DVDR) - parody porn","uid":5110456,"size":4726378022,"categoryP":"porn","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e07b5477d3d02dc5cf0ed705cb75f3e43d9044c8&amp;dn=Celebrity+Apprentass+%282009+-+DVDR%29+-+parody+porn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"pure_screens","files":4,"time":1254697558,"description":"Celebrity.Apprentass.XXX.COMPLETE.NTSC.DVDR\n\n\n\nscreens (+ DVD-covers): &lt;a href=&quot;\nhttp://www.cmylink.com/CelebrityApprentass&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cmylink.com/CelebrityApprentass&lt;/a&gt;\n\n\n\n\nThese horny sluts are all competing for the same thing: the job of a life time! \nTo get that job they're going to have to do some serious sucking and fucking!\n\n\nActresses\n\n    * Brooke Belle\n    * Kelly Skyline\n    * Kylee Reese\n    * Misty Stone\n    * Nicki Hunter\n    * Vannah Sterling\n\n   \nScene Breakdowns\n\n    * Scene 1. Brooke Belle, Jack Vegas\n    * Scene 2. Hershel Savage, Kylee Reese\n    * Scene 3. Devlin Weed, Vannah Sterling\n    * Scene 4. John Strong, Kelly Skyline\n    * Scene 5. Brooke Belle, Kelly Skyline, Kylee Reese, Misty Stone, Nicki Hunter, Vannah Sterling\n    * Scene 6. Evan Stone, Misty Stone, Nicki Hunter\n\n\n\nGenre: Feature, HD - Shot In High Def, Spoof / Funny Porn Titles\nDuration: 02:51:10\nDirector: Maestro Claudio\nStudio: Red Light District\nReleased:  2009\nLanguage:  English\n\n\nREVIEW:\n\nMaestro Claudio &amp; Schlomo Mortichay are the current sitcum parody experts over at Red Light District, their recent attempt to jumpstart sales in the huge parody market falling somewhat short of expectations but still appreciated as something different than the generic gonzo the company made its mark with over the last several years. Their second attempt making it my way is called Celebrity Apprentass, a takeoff on the Donald Trump show where he abuses marginal celebrities on national television to see if any of them can stand his ego long enough to &quot;win&quot; a spot on his business development team. This time the company wisely cast long time comedy porn performer Kyle Stone as the lead, calling him &quot;Donald Hump&quot;, joined by Kylee &quot;Iskanka Hump&quot; Reese and Dex &quot;Donald Hump Jr.&quot; Magnum as the judges of who deserved to stay during the competition. While all in good fun, this was another sitcum parody in need of polishing up, the sexual action decent enough though a lot of the dialogue either improvised or hastily jotted down to the point where it could have been much better. Here's a brief look at the scenes by cast and action, noting that no condoms were used for those still interested:\n\n\nScene One: Brooke Belle,a busty brunette wearing a sleek black dress and neon pink mesh panties, was up first as she impressed Jack Vegas with her curvy figure. Her clothing hit the floor faster than you can say &quot;slutty fuck&quot; and she stepped right up to his mike to sing a little tune he enjoyed, her blowjob leading to some vaginal plowing I appreciated. He did go down on her after awhile but she was the star of this particular get together, her taste testing and active riding setting her apart from some of the others screwing later on in the flick. The pop shot showed his load landing on his boot, Brooke licking the sole of it clean of his genetic juice and winning a few points in my book to stick around during the competition.\n\nScene Two: Kylee Reese, a curvy blond playing Donald's skanky daughter, was up next after the pair argued, Herschel Savage stepping in as an Andrew Dice Clay wannabe upset at the broad. He wanted to beat her senseless but settled on choking her as he went down on her, Kylee demanding he whip out his cock while he resisted. The two compromised and undressed themselves as they pawed one another, the humor actually working pretty well before they did each other orally and fucked vaginally. Herschel stayed in character better than she did, blathering on endlessly during the sex but she was eye candy enough and a solid enough performer to make it work sexually as well. Her active riding style brought home the goods with his wad of population pudding soon gracing the table, Kylee slurping it up like she wanted a salty snack.\n\nScene Three: Vannah Sterling, looking like a chunky version of Sativa Rose (as the &quot;Cocomom&quot; having had eight babies), was up next with obnoxious Devlin Weed, his Dennis Rodman clone not very accurate despite his trying very hard. They were on the office couch and he promised her 16 more kids, this working for her as she slowly began to spread her legs for him. Her patterned blouse was low rent and her black skirt was raised to reveal her fat ass, Devlin going down on her after some spanking and rimming; the guy continuing to go down on her until she dropped to her knees to slob his knob. She sucked him off like she had seen hundreds of cocks in her time, the sloppy hummer leading to a couple of vaginal positions but she was only an active ride when she was on top of him. The scene ended without any chemistry and when his wad of spew landed on her chin and neck, a small deposit left on her tongue.\n\nScene Four: Kelly Skyline, a cute blond with a few extra curves these days, was up next as John &quot;Jizz Simmons&quot; Strong took advantage of her personal turmoil to get some action. He was in the kabuki makeup as seen on the front cover, his attempt to play Gene Simmons falling as flat as any of the others here (Kyle seemed to be the only one truly nailing his role in the show), but his erection as strong as any of the others since the guy knew what his strengths were. She inhaled his cock aggressively while kneeling before him too, the sloppy streamers landing on her pierced tits before she bent over on the bed to do some vaginal doggy penetration. The lighting was overdone here but she weakened it a lot more by being such a passive ride, even allowing John to do all the work when she was on top of him. Still, she was cute and showed an oral aptitude worthy of his seed, the mouth pop closing things up when they were finished.\n\nScene Five: Misty Stone, Nikki Hunter, and Kyle Stone, were up last, the ladies having participated in a silly, ill conceived contest to shove huge dildos up their twats. Nikki won as far as I was concerned but regardless of the outcome, the ending scene was largely a lesbian tryst as Kyle watched them, the two gals giving the appearance that they hated one another. Misty was the sexy black gal seen on the front cover and Nikki was the busty blond spotted on the upper middle of the back row on the cover, the ladies both showing their acting chops as well as how sexually heated they could be. Most of the trysts to this point had been decent (except the last one) but somewhat unexceptional, these two literally saving the day as they plied their trade with energy, enthusiasm, and yes, a bit of chemistry as Kyle joined them. There was a wealth of oral by all three of them and a moderate amount of vaginal screwing, Misty choking Nikki a little but both ladies worth watching fuck. There was some taste testing and Misty took the load on her leg for Nikki to lick up and share at the end, leading to the plotted portions finishing up in kind as the contestants learned their fate.\n\nSummary: \nCelebrity Apprentass by directors Maestro Claudio &amp; Schlomo Mortichay for Red Light District was another parody sitcum that could have been better but still managed to elicit a number of laughs, half the time at the attempts to imitate the pseudo-celebrities and the other half laughing with them as they managed to hit the mark. Sexually, most of the scenes had some replay value and strokability too, a wider variation than expected but enough to squeak by with a rating of Recommended all the same. In short, Celebrity Apprentass again showed that the company could pull off a comedic effort mixed with some sex on a reasonable level, the potential hampered more by the rushed nature of the production than genuine lack of talent. I look forward to seeing if the company will hone and polish a truly worthy competitor in the future though because frankly, there is no doubt in my mind that they have shown enough ability to surpass a lot of wannabe contenders.\n\n\n\n\n\n3,700+ porn torrents: &lt;a href=&quot;\nhttp://thepiratebay.se/user/pure_screens&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pure_screens&lt;/a&gt;\n\n(ALWAYS with honest screens &amp; detailed info)\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:e07b5477d3d02dc5cf0ed705cb75f3e43d9044c8","amp;dn":"Celebrity+Apprentass+%282009+-+DVDR%29+-+parody+porn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e07b5477d3d02dc5cf0ed705cb75f3e43d9044c8","infoHashBuffer":{"type":"Buffer","data":[224,123,84,119,211,208,45,197,207,14,215,5,203,117,243,228,61,144,68,200]},"announce":[],"urlList":[]}}