{"title":"Roswell s1e16-18","uid":5097080,"size":1095776256,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e08d81ffd2ed2f33fddd350ff9c2d2fbd82bd9f5&amp;dn=Roswell+s1e16-18&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":3,"time":1253659322,"description":"Roswell s1e16-18  [Tntvillage.Scambioetico]\n\nVisit this link: http://www.tntvillage.scambioetico.org/?act=allreleases&amp;st=0&amp;filter=Roswell%20s1e16-18%20&amp;sb=1&amp;sd=0&amp;cat=0\n\nRoswell s1e16-18\n\nby IoRiA\n\n[font=Optima]-&gt;Locandina&lt;-[/font]\n\n Visit this link: http://img228.Imageshack.us/img228/3599/roswellseason1episodes1vt9.jpg\n\n Visit this link: http://img248.Imageshack.us/img248/9418/roswellstagione1coverdvuj4.th.jpg\n\n[font=Optima]-&gt;Trama&lt;-[/font]\n\nNella piccola cittÃƒÂ  di Roswell, nel New Mexico (U.S.A.), i giovani   Liz Parker e   Max Evans si conoscono quando lui salva la vita di lei a rischio della propria. Mentre serve ai tavoli del locale di suo padre, il &quot;Crashdown CafÃƒÂ©&quot;, Liz resta coinvolta in una discussione tra due clienti e le viene sparato un colpo di pistola. Max, studente alla Roswell High, misteriosamente cura la ferita di Liz con il semplice tocco della sua mano.\n\nIl mondo di Liz cambia aspetto quando la ragazza viene a sapere che Max, sua sorella Isabel e il suo amico Michael Guerin sono i discendenti degli alieni che sono precipitati con la loro astronave nel deserto americano nel famoso incidente del 1947. I tre giovani sono cresciuti normalmente tra gli abitanti di Roswell, con tutte le esperienze e problemi dell'adolescenza umana.\n\nNel momento in cui Max si fa avanti e salva la vita di Liz, il giovane cambia per sempre la sua vita e le vite delle persona che gli stanno attorno. Anche Liz ÃƒÂ¨ cambiata, e il legame tra i due ÃƒÂ¨ misterioso e spaventoso: la vita e il cuore di Max sono nelle mani di Liz.\nCon il suo gesto impulsivo, Max ha messo a rischio anche le vite di Isabel e Michael. Il segreto che i tre giovani hanno saputo a lungo mantenere ÃƒÂ¨ adesso a rischio, e i tre devono imparare a fidarsi di Liz e della sua migliore amica Maria De Luca. Presto l'FBI e gli agenti del luogo cominciano ad indagare, con a capo lo sceriffo Valenti, che ÃƒÂ¨ spinto da un bisogno molto personale di trovare la veritÃƒÂ  dietro quella misteriosa notte del 1947.\n\nIl pericolo aumenta quando i giovani affrontano il loro bisogno vitale di scoprire realmente chi sono e dove possa essere la loro vera casa. La scoperta che un altro di loto forse ÃƒÂ¨ sopravvissuto al disastro del luglio 1947 dÃƒÂ  loro una nuova speranza per capire finalmente la veritÃƒÂ .\n\nIl quotidiano rischio per la scoperta che Max, Isabel e Michael condividono inizia a separarli da Liz e Maria. Il grande segreto esclude anche Alex Whitman, amico d'infanzia di Liz e Maria, e Kyle Valenti, figlio dello sceriffo di Roswell e fidanzato di Liz, che si ritrovano molto confusi in questa strana situazione.\n\n&quot;Roswell&quot; si lega al filone inaugurato con il popolare telefilm &quot;X-Files&quot;, mettendo perÃƒÂ² enfasi piÃƒÂ¹ sugli aspetti romantici della storia che su quelli fantascientifici.\nLa vita del telefilm ÃƒÂ¨ stata abbastanza travagliata: l'episodio pilota ÃƒÂ¨ stato ordinato dalla TV americana FOX, ma la serie ÃƒÂ¨ finita poi per essere trasmessa dal canale WB. Dopo due stagioni, nel 2000 la WB ha chiuso la serie, e proprio quando si pensava che &quot;Roswell&quot; sarebbe stato cancellato per sempre la serie ÃƒÂ¨ stata presa dalla UPN per una terza stagione.\nI produttori esecutivi della serie &quot;Roswell&quot; sono stati, nel corso delle varie stagioni, David Nutter (giÃƒÂ  di &quot;X-Files&quot; e &quot;Millennium&quot;), Jason Katims, Kevin Kelly Brown, Jonathan Frakes e Lisa Olin. Tra i registi Jonathan Frakes, Tucker Gates, Chris Long, David Nutter, James Whitmore. Le musiche sono di Snuffy Walden.\nLa serie ÃƒÂ¨ tratta e ispirata alla collana di libri &quot;Roswell High&quot; di Melinda Meltz...\n\n Visit this link: http://img222.Imageshack.us/img222/3457/roswellisofi5.jpg\n\n[font=Optima]-&gt;Cast&lt;-[/font]\n\n - Shiri Appleby ... Liz Parker\n - Jason Behr ... Max Evans\n - Katherine Heigl ... Isabel Evans\n - Majandra Delfino ... Maria De Luca\n - Brendan Fehr ... Michael Guerin\n - Colin Hanks ... Alex Whitman\n - Emilie De Ravin ... Tess Harding (dall'episodio 1.17)\n - Nick Wechsler ... Kyle Valenti\n - William Sadler ... Sceriffo Jim Valenti\n\n\n\n[font=Optima]-&gt;Cast Tecnico&lt;-[/font]\n\n\n - Serie sviluppata da Jason Katims\n - Creata da Bryce Zabel e Kim Friedman\n - Coproduttori: Tracy D'Arcy, Emily Whitesell\n - Produttore: Barry Pullman\n - Prodotta da Carol Dunn Trussell\n - Consulente alla produzione: Jon Harmon Feldman\n - Coproduttore esecutivo: Thania St. John\n - Produttori esecutivi: Jonathan Frakes, Lida J. Olin, Kevin Kelly Brown, David Nutter\n\n Visit this link: http://img65.Imageshack.us/img65/1488/roswellyq4.jpg\n\n\n[font=Optima]-&gt;Guida agli episodi&lt;-[/font]\n\n\n[font=Optima]Amore alieno[/font]\n\nTitolo originale: &quot;Sexual Healing&quot;\nGuest star:Michael Chieffo (Prof. Seligman, insegnante di biologia), Rosie Taravella (Insegnante di educazione fisica), Fernando Negrette (Uomo ispanico), Tara Boger (Ragazza), Channing Carson (Liz da giovane), Dan Martin\nAltri attori apparsi: Mary Ellen Trainor (Diane Evans), Garrett M. Brown (Phillip Evans), Jo Anderson (Nancy Parker), John Doe (Jeffrey Parker)\n\nDopo essersi evitati per settimane, Liz e Max cedono finalmente ai loro sentimenti, e i loro baci li connettono telepaticamente tra loro. Durante un intenso bacio, Liz vede delle immagini di una stella che possono aiutare Max a risolvere il mistero del suo passato, mentre Max ha delle visioni del passato di Liz. Michael e Isabel capiscono che Liz puÃƒÂ² essere un collegamento al loro passato e cercano di convincere Max ad usare le sue visioni, ma Max si preoccupa per Liz e non vuole ferirla. Per capire cosa vogliono dire le visioni, Liz e Max viaggiano fuori cittÃƒÂ  e trovano una misteriosa roccia risplendente sepolta nel terreno. Dopo aver trascorso la notte insieme, i due devono tornare a Roswell per affrontare i loro genitori... Anche Michael e Maria cedono ai loro sentimenti, e Isabel si dispera nella sua solitudine e riesce a farsi baciare da Alex...\n\nPrima trasmissione USA: 1 marzo 2000\nPrima trasmissione italiana: 25 dicembre 2000\nSceneggiatura: Jan Oxenbergl\nRegia:   David Semel\n\n\n[font=Optima]Follia[/font]\n\nTitolo originale: &quot;Crazy&quot;\nGuest star: Kevin Cooney (Dott. Margolin), Hugh Benjamin (Fattorino), Yelyna De Leon (Cameriera)\nAltri attori apparsi:  Julie Benz (Agente Kathleen Topolsky)\n\nCapendo che gli alieni sono in pericolo, l'agente dell'FBI Topolsky torna a Roswell per avvertire Liz che un cacciatore di alieni sotto copertura sta cercando Max e i suoi amici, e nulla lo fermerÃƒÂ  prima che lui ci riesca. Tuttavia, Max e Liz temono che la donna sia un loro nemico e non le credono; la Topolsky ÃƒÂ¨ allora costretta a rivolgersi allo Sceriffo Valenti per chiedergli di proteggere i ragazzi. In seguito, la sig.na Topolsky avverte anche Michael del loro nemico, e dice a Michael e Maria che ha una sfera simile a quella in possesso da loro: Michael le crede, ma la Topolsky viene rapita prima che possa incontrarsi con Michael. Valenti rivela a Michael, Maria e Max che la Topolsky ÃƒÂ¨ fuggita da una clinica ed ÃƒÂ¨ completamente pazza... A scuola, Isabel fa amicizia con Tess Harding, una nuova e bella studentessa, con cui scopre di avere molto in comune. Tuttavia, Max e Michael sono molto sospettosi di Tess temendo che possa scoprire il loro segreto.\n\nPrima trasmissione USA: 10 aprile 2000\nPrima trasmissione italiana 1 gennaio 2001\nSceneggiatura: Thania St. John\nRegia: James Whitmore Jr.\n\n\n[font=Optima]Tess, bugie e videotape[/font]\n\nTitolo originale:  &quot;Tess, lies and videotape&quot;\nGuest star: Robert Katims (Giudice), Eddie Kehler (Autista), Fernando Negrette (Uomo ispanico), Amy Connolly (Insegnante)\nAltri attori apparsi: Jim Ortlieb (Ed Harding/Nasedo)\n\nMax sviluppa una inspiegabile e incontrollabile attrazione verso Tess e inizia a fare intensi sogni su di lei; nonostante cerchi di reprimere questa attrazione, Max finisce per baciare Tess davanti a Liz sotto la pioggia. Dopo una telefonata all'ospedale psichiatrico della Topolsky, lo Sceriffo Valenti capisce che i ragazzi possono davvero essere in pericolo. Per guadagnarsi la fiducia degli alieni, Valenti rivela la scioccante notizia che la Topolsky ÃƒÂ¨ stata uccisa in un misterioso incendio, a quanto pare da un alieno che ha mutato il suo aspetto in quello del medico Dott. Margolin, e consegna a Max il trasmettitore alieno, chiedendogli di rivelargli ciÃƒÂ² che sa. Nel frattempo, Michael scopre una videocamera segreta nel suo appartamento (con cui Nasedo lo controlla) e chiede a Liz di installarla a casa di Tess. Liz si mette in pericolo quando Ed Harding, il padre di Tess, la trova a curiosare in una scatola di fotografie che lui ha di Max. Tutti sono sconvolti quando la videocamera mostra che esiste un quarto alieno tra loro: Tess sembra proprio avere dei poteri...\n\nPrima trasmissione USA: 17 aprile 2000\nPrima trasmissione italiana:  8 gennaio 2001\nSceneggiatura:    Richard Whitley e Toni Graphia\nRegia: Paul Shapiro\n\n Visit this link: http://img222.Imageshack.us/img222/9369/roswellzd2.jpg\n\n[font=Optima]-&gt;Elenco Episodi&lt;-[/font]\n\n1 - Roswell (Pilot)\n2 - Segreti (The Morning After)\n3 - Il Bivio (Monsters)\n4 - Una Vita normale (Leaving normal)\n5 - Scomparsi (Missing)\n6 - Statale Sud 285 (285 South)\n7 - River Dog\n8 - Fratello di sangue (Blood brother)\n9 - Ondata di caldo (Heat wave)\n10 - Un passo indietro (The Balance)\n11 - Ricordi (The toy house)\n12 - Nel bosco (Into the woods)\n13 - Il cacciatore di alieni (The convention)\n14 - Appuntamento al buio (Blind date)\n15 - Independence day\n16 - Amore alieno (Sexual Healing)\n17 - Follia (Crazy)\n18 - Tess, bugie e videotape (Tess, lies and videotape)\n19 - Il simbolo (Four Square)\n20 - Max contro Max (Max to the Max)\n21 - La stanza Bianca (White Room)\n22 - Destino (Destiny)\n\n Visit this link: http://img405.Imageshack.us/img405/3567/indexbild550x350as0.jpg\n\n[font=Optima]-&gt;Scheda tecnica del DivX&lt;-[/font]\n\n[font=Optima]Dati Gspot[/font]\n\nDimensione: 345 MB (or 354,302 KB or 362,805,248 bytes)\nDurata: 00:44:02 (63,334 fr)\n\nVideo Codec: DivX 5.0\nVideo Bitrate: 901 kb/s\nRisoluzione: 576x320 (1.80:1) [=9:5]\nFPS (Frames/sec): 23.976\nQF (Frame quality): 0.204 bits/pixel\n\nAudio Codec: 0x0055(MP3) ID'd as MPEG-1 Layer 3\nAudio Bitrate: 192 kb/s (96/ch, stereo) CBR \nFreq Audio:  44100 Hz\n \n\n[font=Optima]Dati Analyzer DRF[/font]\n\nDivX DRF Analyzer v0.9.5 Report!\nFile Name: Roswell s1e1-3Roswell.-.1x01.-.Pilot.-.DVDRip.ITA.avi\nFourCC: DX50\nCodec: DivX503b1031p\nResolution: [ Width: 576 Height: 320 ]\nFrame Rate: 23.976 frames per second\nThe Video has 63334 frames [ 00:44:01 ]\n\nAverage Frame quality is  MEDIUM\t[Average DRF/quantizer is 3.21]\nStandard Deviation: Quality is HIGH\t[Std. Deviation is 0.68]\nImage Resolution is MEDIUM\n\nThe file has Packeted Frames!\n\nThere are NO frame drops ( NO drops is better )\n\nRecomended Resolution: [528x288] \t(Target DRF/quantizer=2.8)\n\nPerformance Caracteristics: \nMacroblocks per frame: 720\nThe Width is multiple of 32\n\nKilobits per Second: 876.43\nKilobits per Frame: 36.55\nKilobits per Macroblock: 0.051\nBits per Pixel: 0.20\n\nFrame Type Statistics :\nI Frames: 1.54%\nP Frames: 50.11%\nB Frames: 48.35%\nS Frames: 0.00%\nN Frames: 0.00%\n(More Advanced Codecs use B and S frames)\nFrame Quality Statistics :\n\nDRF=1&amp;2:\t8794\t14.1%\nDRF=3:\t\t31103\t49.9%\nDRF=4:\t\t22460\t36.0%\nDRF=5:\t\t0\t0.0%\nDRF=6:\t\t0\t0.0%\nDRF=7:\t\t0\t0.0%\nDRF=8:\t\t0\t0.0%\nDRF=9:\t\t0\t0.0%\nDRF&gt;9:\t\t0\t0.0%\nKeyF/DeltaF:\t\t1.57%\nKeyDRF&lt;4:\t977\nKeyDRF=4:\t0\nKeyDRF&gt;4:\t0\n\nAverageKeyDRF:\t2.16\nMAXDRF:\t4\nAverageDRF:\t3.21\nDeviation:\t0.68\n\n\n Visit this link: http://img71.Imageshack.us/img71/8020/imagesmoviesroswellki2.jpg\n\n[font=Optima]-&gt;Ringraziamenti&lt;-[/font]\n\n Visit this link: http://www.antoniogenna.net/roswell/roswell.htm per informazione sul telefilm\n Visit this link: http://imageshack.us/ per l'hosting gratuito\n Visit this link: http://it.wikipedia.org/\n\n\n[font=Optima]-&gt;Note&lt;-[/font]\n\nBanda disponibile intorno ai 30 k per i primi 20 completi.\nSeed disponibile dalle 10 fino alle 23 circa\n\n\n[font=Optima]Buon Download[/font]\n\nIoRiA  :()\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:e08d81ffd2ed2f33fddd350ff9c2d2fbd82bd9f5","amp;dn":"Roswell+s1e16-18","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e08d81ffd2ed2f33fddd350ff9c2d2fbd82bd9f5","infoHashBuffer":{"type":"Buffer","data":[224,141,129,255,210,237,47,51,253,221,53,15,249,194,210,251,216,43,217,245]},"announce":[],"urlList":[]}}