{"title":"S10 E05 FC De Kampioenen  - Werk aan de winkel.avi","uid":5133674,"size":396332844,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e0cce9fa26f509b3bd70d3e9d26e01ac4c4027c1&amp;dn=S10+E05+FC+De+Kampioenen++-+Werk+aan+de+winkel.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xkissie","files":1,"time":1256326196,"description":"PLEASE SEED... ALSO THE OTHER SEASONS OF F.C. DE KAMPIOENEN! THANK YOU!\n\n\n\nVerhaallijnen\n\n    * Boma organiseert &quot;De Gulden Schoen '99&quot; voor de beste speler. BTW gebruikt deze wedstrijd om de Kampioenen tegen elkaar op te zetten. Hij wil namelijk het veld kopen om zijn restaurant uit te breiden om een ster te krijgen van de Fijnproeversgids.\n    * Boma wil, na een bezoek van zijn vriend Charles, het veld ombouwen tot golfterrein. Hij krijgt het aan de stok met de Kampioenen. Pascale steunt eerst Boma's idee, tot ze verneemt dat hij van het restaurant van BTW een golfclub wil maken en niet van haar cafÃƒÂ©.\n    * Pascale wil dat Bieke en Marc trouwen.\n    * BTW probeert Marc aan Doortje te koppelen.\n    * Carmen wil een restaurant openen. Na een mislukte poging in haar winkeltje probeert ze het in het cafÃƒÂ©. Ze wordt gesteund door Boma die Pascale een loer wil draaien.\n    * Bieke, BTW, Carmen en Boma wil een televisieprogramma krijgen op de regionale zender.\n    * Karl Vermeire, de eigenaar van de TV-zender wil Bieke verleiden.\n    * De Kampioenen moeten op medische controle bij dokter Saskia Hengelen, een kennis van Marc. Ze vragen Marc om een goed woordje te doen bij haar.\n    * BTW en de Kampioenen dingen naar de cultuurprijs van de gemeente. BTW organiseert een &quot;BTW goes classic&quot;-avond, de Kampioenen voeren het toneelstuk Romeo en Julia op.\n    * Een Nederlandse voetbalploeg komt op stage bij de Kampioenen. Het blijkt om een vrouwenteam te gaan. De vrouwen pikken het niet dat de mannen rond de Nederlandse dames hangen.\n    * Nero krijgt de hoofdrol in een reclamefilmpje. Carmen waant zich een echte ster. Ze schakelt Marc in als bodyguard voor Nero. Boma verzorgt de publiciteit.\n    * De vader van BTW (Bernard-Victor) komt op bezoek. BTW maakt hem wijs dat hij een nieuwe vriendin heeft.\n    * Bernard-Victor zorgt voor problemen tussen Xavier en Carmen.\n    * Carmen wil een oude schoolvriendin de loef afsteken door te zeggen dat haar man kolonel is.\n    * Marc is tijdelijk hulpagent. BTW ziet hierin nieuwe kansen om de Kampioenen te pesten.\n    * Pascale leert met de auto rijden. Wanneer ze een aanrijding heeft, komt ze voor de eerste keer in contact met voddenkoopman Fernand Costermans.\n    * Pascale krijgt de oude meubels van Madeleine. Er zit echter ook een waardevol beeldje tussen. het beeldje belandt via Boma bij kolonel Vandesijpe. Pascale wil het terugkrijgen.\n    * BTW wil dat Boma investeert in zijn restaurant. Boma kan maÃƒÂ®tre d'hÃƒÂ´tel worden.\n    * Het huis van Fernand wordt afgebroken door de gemeente. Wanneer hij iedereen vertelt dat &quot;Bij Mij&quot; wordt afgebroken denken de Kampioenen dat het over het restaurant gaat. BTW probeert in allerijl zijn eigendom te verkopen. Fernand koopt het restaurant voor een spotprijs.\n","torrent":{"xt":"urn:btih:e0cce9fa26f509b3bd70d3e9d26e01ac4c4027c1","amp;dn":"S10+E05+FC+De+Kampioenen++-+Werk+aan+de+winkel.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0cce9fa26f509b3bd70d3e9d26e01ac4c4027c1","infoHashBuffer":{"type":"Buffer","data":[224,204,233,250,38,245,9,179,189,112,211,233,210,110,1,172,76,64,39,193]},"announce":[],"urlList":[]}}