{"title":"Beyonce Knowles - One Night Only","uid":5087355,"size":154009604,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e212cee2cca62514dc8bf9ed0e709a9a7c30f7d3&amp;dn=Beyonce+Knowles+-+One+Night+Only&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1252831837,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;One Night Only&quot; is a song from the 1981 Broadway musical Dreamgirls, with lyrics by Tom Eyen and music by Henry Krieger. In the context of the musical, &quot;One Night Only&quot; is performed twice in succession, as differing versions of the song - a soul ballad by the character Effie White and a disco version by her former bandmates Deena Jones &amp; the Dreams - compete on the radio and the pop charts.\n\nBoth versions of &quot;One Night Only&quot; appear as one track on the original 1982 Dreamgirls Broadway cast album, performed by Jennifer Holliday as Effie and Sheryl Lee Ralph, Loretta Devine, and Deborah Burrell as Deena Jones &amp; the Dreams. &quot;One Night Only&quot; was later covered on album by Elaine Paige and Sylvester. Actor Hugh Jackman performed the song while hosting the 2004 Tony Awards ceremony, in a large production number featuring girl groups from the musicals Caroline, or Change, Hairspray, and Little Shop of Horrors.\n\nDreamgirls was adapted by writer/director Bill Condon into a motion picture for DreamWorks SKG and Paramount in 2006. For this version, the two versions of &quot;One Night Only&quot; were performed by Jennifer Hudson as Effie and BeyoncÃƒÂ© Knowles, Anika Noni Rose, and Sharon Leal as Deena Jones &amp; the Dreams. R&amp;B production team The Underdogs served as the producers of &quot;One Night Only&quot; and the other songs from the film's score. A club remix of Deena's version of the song, produced by Eric Kupper &amp; Richie Jones, was issued by Music World Entertainment and Columbia Records as a promo single for the Dreamgirls film soundtrack in August 2006, four months before the release of the film. The song was also sampled by Lil Wayne for his version of &quot;One Night Only&quot;. The dance crew Breaksk8 danced to this song on America's Best Dance Crew as a part of their Broadway Challenge.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:e212cee2cca62514dc8bf9ed0e709a9a7c30f7d3","amp;dn":"Beyonce+Knowles+-+One+Night+Only","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e212cee2cca62514dc8bf9ed0e709a9a7c30f7d3","infoHashBuffer":{"type":"Buffer","data":[226,18,206,226,204,166,37,20,220,139,249,237,14,112,154,154,124,48,247,211]},"announce":[],"urlList":[]}}