{"title":"UpdatePatrol v2009 Update 1 retail.","uid":5075910,"size":4312767,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e27b60a1793222fdf1061e29d40d9197775e0a9a&amp;dn=UpdatePatrol+v2009+Update+1+retail.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"adjinpiva","files":2,"time":1251834377,"description":"UpdatePatrol is a tool that works invisibly on your PC, quietly monitoring the Internet for you. When changes to your tracked sites are detected, you are politely notified that websites that interest you have been updated. You can view the updated pages with changes highlighted in UpdatePatrol's built-in web browser - see an example here. UpdatePatrol has a user friendly interface but still plenty of advanced features that will satisfy both novice and power users. UpdatePatrol supports HTML, XML, RSS, RDF, Atom and text files and can access them both using normal HTTP and HTTPS (SSL).\n\nFeatures:\n Monitor an unlimited number of sites\n Detect changes in ordinary web pages and text files\n Detect changes in web pages using HTML Frames\n Detect changes in blogs (news feeds) in RSS, RDF and Atom formats\n Detect changes in password protected web pages (HTTP authentication supported)\n Detect changes in page text and optionally changed links\n Shows pages with changes highlighted in the internal browser\n Alert you of found updates by desktop notification, sound or email\n Automatically save a copy of the changed page to disk\n See text that was removed or changed within a page as well as newly added text\n Organize websites in groups\n Use automated web page update checking at scheduled intervals or manual checking\n Use shared (user definable) schedules to check groups of sites with the same interval\n Drag a URL to the Drop Window to quickly add the URL to UpdatePatrol","torrent":{"xt":"urn:btih:e27b60a1793222fdf1061e29d40d9197775e0a9a","amp;dn":"UpdatePatrol+v2009+Update+1+retail.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e27b60a1793222fdf1061e29d40d9197775e0a9a","infoHashBuffer":{"type":"Buffer","data":[226,123,96,161,121,50,34,253,241,6,30,41,212,13,145,151,119,94,10,154]},"announce":[],"urlList":[]}}