{"title":"JoJo - How To Touch A Girl","uid":5059792,"size":151957508,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e2c5c0efffc5419c89474505b32634cb774e1d6d&amp;dn=JoJo+-+How+To+Touch+A+Girl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1250653190,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;How to Touch a Girl&quot; is a song by American singer JoJo from her second studio album, The High Road (2006). Released as the album's second single to Top 40 radio in December 2006, the song was written by JoJo, Billy Steinberg, and Josh Alexander and produced by Steinberg and Alexander. Its release marks the first time a single with a writing credit from JoJo was eligible to chart. The song contains an uncredited sample of Whitney Houston's 1985 classic hit &quot;Saving All My Love for You&quot;.\n\nThe music video, directed by Syndrome, premiered on MTV's TRL on December 7, 2006. The video shows clips of JoJo sitting in a room filled with old vinyl records, sitting on a staircase, and singing on a rooftop at sunset. There are also scenes of her in an apartment in a green dress; special effects allow JoJo to be seen multiple times in the same shot. There is also a storyline involving a young couple on a date. Near the end of the video, a boy, seemingly her boyfriend, meets JoJo in her room with the albums, and the two embrace.\n\nThe song was well received by critics. Chuck Taylor of Billboard said that &quot;'How to Touch a Girl' again casts the youngster with a crafty melody, albeit strikingly similar in structure to the previous hit. Despite the bizarre, almost perverse title, this track could propel the burgeoning talent all the way.&quot; In a review of The High Road, Bill Lamb called the song &quot;a near perfect piece of teen pop.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:e2c5c0efffc5419c89474505b32634cb774e1d6d","amp;dn":"JoJo+-+How+To+Touch+A+Girl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2c5c0efffc5419c89474505b32634cb774e1d6d","infoHashBuffer":{"type":"Buffer","data":[226,197,192,239,255,197,65,156,137,71,69,5,179,38,52,203,119,78,29,109]},"announce":[],"urlList":[]}}