{"title":"Maxprog.iCash.v5.4.Multilingual.WinALL.Incl.Keygen.[WwW.PorTorre","uid":5117892,"size":12175942,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e43195c5d1f94bdd2c0bf9b529f33f9464b0c114&amp;dn=Maxprog.iCash.v5.4.Multilingual.WinALL.Incl.Keygen.%5BWwW.PorTorre&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gamolama","files":1,"time":1255165429,"description":"11.62 MB | Windows ME/NT/2000/XP/2003/Vista | 04150409\n\niCash es un programa especialmente diseÃƒÂ±ado para controlar sus finanzas personales, registrando sus ingresos, gastos, deudas y transacciones bancarias. Es tan simple como crear las cuentas que vaya a necesitar y transferir importes entre ellas. Ni siquiera le harÃƒÂ¡ falta tener conocimientos de contabilidad.\n\niCash es un completo programa de gestiÃƒÂ³n personal para Macintosh y Windows muy versÃƒÂ¡til y fÃƒÂ¡cil de utilizar. iCash ha sido diseÃƒÂ±ado con el objetivo de controlar todo tipo de asuntos financieros sin tener conocimientos previos de contabilidad. iCash proporciona una manera muy sencilla de controlar los ingresos, gastos y transacciones bancarias tanto a nivel personal como profesional. iCash es ideal para clubs, asociaciones, trabajadores autÃƒÂ³nomos, pequeÃƒÂ±as empresas o simplemente para gestionar su contabilidad domÃƒÂ©stica. En pocos minutos puede empezar a crear cuentas y registrar transacciones entre ellas.\n\niCash es ante todo un programa sencillo de manejar que no requiere conocimientos previos de contabilidad. Por esta razÃƒÂ³n no utiliza el sistema de contrapartida de la contabilidad estÃƒÂ¡ndar. De hecho iCash no es un programa de contabilidad pero mÃƒÂ¡s bien de gestiÃƒÂ³n. Basta con crear cuentas para sus gastos, ingresos, Bancos...etc... y empezar a traspasar dinero entre ellas. iCash le proporciona todo un completo conjunto de herramientas para averiguar rÃƒÂ¡pidamente de dÃƒÂ³nde viene y adÃƒÂ³nde va su dinero y en que proporciÃƒÂ³n. iCash lleva integrado un motor de base de datos SQL avanzado con un sistema de consultas e informes automÃƒÂ¡ticos. Todas las cuentas estÃƒÂ¡n perfectamente organizadas en categorÃƒÂ­as predefinidas y subcategorÃƒÂ­as creadas por el usuario. Esta estructuraciÃƒÂ³n permite consultar transacciones segÃƒÂºn ciertos criterios o generar informes en segundos.\n\nCaracterÃƒÂ­sticas\n\n    * Detecta y utiliza su lengua si disponible.\n    * No se requieren conocimientos previos de contabilidad.\n    * Interfaz amigable todo-en-uno de fÃƒÂ¡cil utilizaciÃƒÂ³n.\n    * Compatibilidad total de los documentos entre Mac y PC.\n    * CreaciÃƒÂ³n ilimitada de cuentas, categorÃƒÂ­as y contactos.\n    * ClasificaciÃƒÂ³n de las cuentas por categorÃƒÂ­as y tipos.\n    * Soporte para divisas y editor de tipos de cambio.\n    * Seguimiento de la conciliaciÃƒÂ³n de las transacciones.\n    * ProgramaciÃƒÂ³n de transacciones periÃƒÂ³dicas.\n    * Soporte para la creaciÃƒÂ³n de presupuestos.\n    * ClasificaciÃƒÂ³n de transacciones por proyectos.\n    * GeneraciÃƒÂ³n de informes detallados por periodo.\n    * Sistema de bÃƒÂºsqueda de transacciones segÃƒÂºn criterios mÃƒÂºltiples.\n    * CreaciÃƒÂ³n de grÃƒÂ¡ficos por cuenta, tipo de cuenta o categorÃƒÂ­a.\n    * ImportaciÃƒÂ³n y exportaciÃƒÂ³n de cuentas, categorÃƒÂ­as y transacciones. (OFX, QIF, CSV)\n    * Motor de base de datos SQL avanzado con sistema de back-up automÃƒÂ¡tico.\n    * Multi-documento con protecciÃƒÂ³n por palabra clave.\n    * Versiones nativas para Mac OS X (Universal) and Windows.","torrent":{"xt":"urn:btih:e43195c5d1f94bdd2c0bf9b529f33f9464b0c114","amp;dn":"Maxprog.iCash.v5.4.Multilingual.WinALL.Incl.Keygen.%5BWwW.PorTorre","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e43195c5d1f94bdd2c0bf9b529f33f9464b0c114","infoHashBuffer":{"type":"Buffer","data":[228,49,149,197,209,249,75,221,44,11,249,181,41,243,63,148,100,176,193,20]},"announce":[],"urlList":[]}}