{"title":"DISTRICT.9.2009.NORDIC.DD5.1.DTS.PAL.RETAIL.DVDR9-ALWAYSQUALITY","uid":5559857,"size":7471012908,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e44ac3df98b0acbc69c6d1befac6257e6dece8fe&amp;dn=DISTRICT.9.2009.NORDIC.DD5.1.DTS.PAL.RETAIL.DVDR9-ALWAYSQUALITY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"AlwaysQuality","files":152,"time":1273798102,"description":"PLEASE DO NOT GRAB AND RUN!\n\nSEED SO EVERYONE, NOT JUST YOU, GET THE FILES AND FILMS WE ALL WANT!\n\n\n-----------------------------------------------------------------------------------\n\n\nI Always go for the best Quality DVD uploads! No fucking shitty looking 700mb or 1.3gb .avi movie files here. I Always go for the PAL (720x576) RETAIL versions. Sometimes NTSC (720x480) RETAIL versions. It depends on what I get my hands on, but mostly it's PAL versions. If I have both the PAL and NTSC RETAIL versions of some particular films I go for the PAL versions, because of the better resolution and many subs.\n\nIf I for example have the NTSC Criterion Edition versions and the PAL versions of some films I go for the PAL versions of the film itself if it's the completely same film as the NTSC Criterion Edition (if not I use the NTSC film) and then put the NTSC Criterion Editons extras together with the PAL version film on a DVDR9 disc!\n\nWhen ripping and encoding DVD9/DVDR9 RETAIL versions to DVDR5 I use RipIt4Me+DVD Decrypter and DVDSHRINK to remake the DVD and then DVD Rebuilder+CCE 9 passes for encoding. I Always, if possible, keep: all the subs, the Directors Comments (it's beyond me why people removes Directors Comments and all the subs, because a Directors Comments file have a max file size at around 100-200mb and the subs file size is nothing to write home about and they will not have any impact on the final DVD Quality) and DD5.1 and DTS. I ONLY keep the original language and removes the menu completely!. If the DVDR5 goes under 70-75% in Quality using DVD Rebuilder+CCE 9 passses I make a Full Quality DVDR9! If there's space on a DVDR5 and the % rule I use is not comprimised I keep all the extras I can with Behind The Movie extras as priority. If it's a movie I love I keep all the extras and if it comprimises my DVDR5 % rule I put it all on a DVDR9 disc. AlwaysQuality runs through my ripping and encoding.\n\nFor some unknown reason DVD Rebuilder+CCE 9 passes sometimes makes, on my computer system at least, the final files a little to big for the DVDR5 disc. So I therefore run the files through DVDSHRINK (without any DVD remaking or encoding), because it makes the files just the right maximum size for the DVDR5.\nSo if the files/discs Source Media Implementation Identifier says DVDSHRINK it's just because of that. NOT that I have encoded using DVDSHRINK. DVDSHRINK does NOT make as good a quality encoding as DVD Rebuilder+CEE 9 passes does. Especially if the DVDR5 % quality is around 70-75% or even much lower!\n\nMy earlier rips of movies (3-5 years back) was made only with DVD Decrypter and DVDSHRINK with me putting any DVD RETAIL RIP on a DVDR9 if the quality was under 80% in DVDSHRINK.\n\nI have around 700-800 AlwaysQuality movies. I will upload them in my own tempo in the coming future.\n\nAlwaysQuality comes first in any DVD RIP I make!\n\nWhy?\n\nBecause I love watching movies on my 50 inch Pioneer 5090H plasma with my Denon AVR 2310 Surround Reciever upscaled to 1080p with 7.1 surround sound. Try watching a fucking 700mb or 1.3gb .avi encoded movie on that system and you wanna go kill all the .avi files around afterwards. :o) Also it's pissing and shitting on the people who made the film compressing it so much! You do not see it the way it was intended!\n\nIf you wanna shrink my DVDR9 releases to DVDR5 or even, god forbid, to a 700mb/1.3gb .avi file then use whatever software you want, but if I was you I would use the software I use. It gets the job done with AlwaysQuality. I will NOT guide you in how you use the software. Use Google (I did) and look at how the scene does it. Burn the .iso file with IMGBURN using Always a VERBATIM disc setting the write rate to 2.4 or 4 and put it in your DVD player. If you wanna extract the .iso file to VIDEO_TS file then use ULTRAISO. It works for me. You can also use DAEMON TOOLS to mount your .iso and for example use VLC (the same goes for the VIDEO_TS directory) to watch the movie on your computer or your computer via HDMI cable to your TV.\n\nAlways SEED! At least 1:1 ratio! Do not grab and run. If there's only a few SEEDERS and you grab and run, then you are an egoistic arsehole. SEED so EVERYONE, not just you, get the files we all want!\n\nComments on release is very much appreciated!\n\nENJOY &amp; SEED!\n\nP.S If NORDIC-T users finds my releases interesting then feel free to send me an invite to: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;f0919c879189838185919c998489999e86998495b0979d91999cde939f9d&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nI really would like to upload to places like that and as I don't know any other way to get an invite I'll try this way.  \n\n\n-----------------------------------------------------------------------------------\n\nDISTRICT 9\n\nA new release from AlwaysQuality. \n\nSpecs:\n\n                     \n                     AlwaysQuality Proudly Presents\n\n\n    DISTRICT.9.2009.NORDIC.DD5.1.DTS.PAL.RETAIL.DVDR9-ALWAYSQUALITY\n                                                 \n                 \n\n\n                 Release Date: 05/14/2010\n                 Playtime    : 112 min                  \n                 Genre       : Sci-fi / Thriller                \n                 IMDB Rating : 8.3/10 (135,790 votes)               \n                 IMDB-Link   : http://www.imdb.com/title/tt1136608/ \n                 US-Release  : 08/14/2009                       \n                 DVD-Source  : Retail DVD, Region 2                 \n                                                                     \n                                                                     \n                                ASPECT &amp; STANDARD                  \n                                                                  \n                      [X] Anamorphic PV 16:9 [ ] 1.78:1         \n                      [X] PAL   [ ] NTSC     [X] 1 85:1        \n                                             [ ] 2.35:1       \n                      [X] Region/Macrofixed  [ ] 1.33:1 (4:3)  \n                                                               \n                                                                \n                                     AUDIO                       \n                                                                 \n                      [X] English    [X] Dolby Digital 5.1        \n                      [ ] Danish     [X] DTS                      \n                      [ ] Norwegian  [ ] Dolby Sorround 2.0       \n                      [ ] Swedish    [X] Directors Comments      \n                      [ ] Finish                                     \n                      [ ] French       \n\n\n                                     VIDEO\n\n                      [X] EXTRAS      \n\n                               \n                                  SUBTITLES                       \n                                                                      \n                 [ ] English       [ ] Icelandic      [X] Swedish  \n                 [X] Danish        [ ] Spanish        [ ] German   \n                 [X] Norwegian     [ ] Polish         [ ] French   \n                 [ ] Czech         [ ] Hungarian      [ ] Italian   \n                 [ ] Portuguese    [ ] Dutch          [X] Finnish","torrent":{"xt":"urn:btih:e44ac3df98b0acbc69c6d1befac6257e6dece8fe","amp;dn":"DISTRICT.9.2009.NORDIC.DD5.1.DTS.PAL.RETAIL.DVDR9-ALWAYSQUALITY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e44ac3df98b0acbc69c6d1befac6257e6dece8fe","infoHashBuffer":{"type":"Buffer","data":[228,74,195,223,152,176,172,188,105,198,209,190,250,198,37,126,109,236,232,254]},"announce":[],"urlList":[]}}