{"title":"ULTRA FORCE, COMPLETE TV SERIES","uid":5090546,"size":2291580527,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e475c3f29583cc86e1a27c5600ed6ed9f2446ce0&amp;dn=ULTRA+FORCE%2C+COMPLETE+TV+SERIES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"blah6","files":15,"time":1253106620,"description":"SHOW IS IN DECENT/FAIR QUALITY.  I AM REUPLOADING THIS since the tracker it was on before was down. Apparently when i deleted the other torrent from the site, it deleted it out of my preferences but kept the torrent on the site. Sigh, whatever.\nIf piratebay admins would delete the other torrent, much appreciate it.\n\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Ultraforce_(comics)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Ultraforce_(comics)&lt;/a&gt;\n\n\n &lt;a href=&quot;\nhttp://www.retrojunk.com/details_tvshows/297-ultraforce/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.retrojunk.com/details_tvshows/297-ultraforce/&lt;/a&gt;\n\n\nAired: 1995 - 1995\nShow Type: Animated\nCountry of Origin: US\n\nBased off the Malibu comic series, this cartoon takes place in the Ultraverse, where new, super-powered beings, called Ultras, are slowly making their presence known to mankind. Some are ancient entities, others, recently transformed into their altered states. But all seem to have a larger purpose in the world. Contrary, a mysterious and exotic woman, assembles a team of Ultras to combat the forces that would see the destruction of Earth and its people, while investigating the origins of Ultras and why they exist.\n\nPrime - A young adolescent granted the ability to create a bio-shell of a large, muscle-bound brute named Prime, an idealized image of adulthood and strength.\n\nHardcase - A former struggling actor, now an invulnerable action star with great strength.\n\nPrototype - A young recruit to utilize an advanced suit of armor for a corporation, who may hold more power than was originally thought.\n\nGhoul - A former hero who died and came back, Ghoul is not only haunted by the horrors of his past, but also the precognitive visions he receives of the future. His necro physiology also grants him some advantages.\n\nTopaz - An alien warrior woman transported here by unknown means, she seeks to return to her world by aiding Contrary, hoping to earn a way back. She wields an energy pole and can sheild herself in alloy skin.\n\nContrary - The mysterious founder and benefactor of Ultraforce, her beautiful exterior hides a precise intellect and years of experience. She has considerable resources at her disposal, and a few mental tricks to throw around.","torrent":{"xt":"urn:btih:e475c3f29583cc86e1a27c5600ed6ed9f2446ce0","amp;dn":"ULTRA+FORCE%2C+COMPLETE+TV+SERIES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e475c3f29583cc86e1a27c5600ed6ed9f2446ce0","infoHashBuffer":{"type":"Buffer","data":[228,117,195,242,149,131,204,134,225,162,124,86,0,237,110,217,242,68,108,224]},"announce":[],"urlList":[]}}