{"title":"When Steptoe Met Son","uid":5654414,"size":145629443,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e4a6659807c0d65f70b981dc4fb562d56f5f0abc&amp;dn=When+Steptoe+Met+Son&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NickManch","files":5,"time":1277740088,"description":"When film-maker David Barrie decided to make a documentary about the sitcom Steptoe and Son, he had no idea it would uncover the story of one of the strangest and most tortured double acts in TV history\n\nWhen Wilfrid Brambell and Harry H Corbett, stars of the hit BBC sitcom Steptoe and Son, first met each other in 1962, it marked the beginning of one of the most successful double acts in the history of British television. By the time Corbett died in 1982, the two wished that they had never set eyes on one another. But the extraordinary story behind their bizarre relationship has never, until now, been fully told. I was brought up watching Steptoe and Son and, ever since, I've wondered what the magic ingredient was that made the show so hugely successful. Finally I decided to make a film about it. And the truth was stranger than I could have imagined. \n\nWhen Steptoe Met Son is a 2002 Channel 4 documentary about the personal lives of Wilfrid Brambell and Harry H. Corbett, the stars of the longrunning BBC situation comedy, Steptoe and Son. It aired on 20 August 2002.\n\nThe programme reveals how Brambell and Corbett were highly dissimilar to their on-screen characters. Corbett felt he had a promising career as a serious actor, but was trapped by his role as Harold and forced to keep returning to the series after typecasting limited his choice of work. Brambell, meanwhile, was a homosexual, something that in the 1960s was still frowned upon and, until the Sexual Offences Act 1967, illegal, and was thus driven underground. The documentary went on to describe an ill-fated final tour of Australia, during which the already strained relationship between Corbett and Brambell finally broke down for good\n\n\nVery interesting documentary about Wilfrid Brambell and Harry H. Corbett (Steptoe and Son) \n\nPlease seed and help share this so others get to see this, And leave a comment.\n\nEnjoy!!\tAnd finally, thank you to Welshguy for allowing me to 'borrow' the above description. This is the whole documentary but without the adverts. :)\t","torrent":{"xt":"urn:btih:e4a6659807c0d65f70b981dc4fb562d56f5f0abc","amp;dn":"When+Steptoe+Met+Son","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4a6659807c0d65f70b981dc4fb562d56f5f0abc","infoHashBuffer":{"type":"Buffer","data":[228,166,101,152,7,192,214,95,112,185,129,220,79,181,98,213,111,95,10,188]},"announce":[],"urlList":[]}}