{"title":"(PSX-PSP) WipEout converted properly [ResourceRG Games by KloWn]","uid":5030167,"size":458011159,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:e4b53913f6fa9d575feb3bdcd7681e1f85b88f79&amp;dn=%28PSX-PSP%29+WipEout+converted+properly+%5BResourceRG+Games+by+KloWn%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"toxicjuggalo","files":2,"time":1248878241,"description":"WipEout:\n\nSet in the year 2052, players compete in the F3600 anti-gravity racing league, piloting one of a selection of craft in races on several different tracks. There are four different racing teams to choose from, each ship with its own distinct characteristics of acceleration, top speed, mass, and turning radius. By piloting their craft over power-up pads found on the tracks, the player can pick up shields, turbo boosts, mines, shock waves, rockets, or missiles, which protect the player's craft or disrupt the competitors' craft.\nThere are seven racetracks in the game total, six of them located in futuristic versions of countries such as Canada and Japan, with a seventh, hidden track set on Mars.\n\nTested and working on all CFW's 5.00 m33 and above using the 500 popsloader pack set on 3.72 POPS... Like my work?? Please read the NFO and support me ;)\n\nHave you been looking for that classic PSX game but just can't seem to find it anywhere? How about those &quot;rare&quot; titles that were only released in certain regions? Better yet, would you like to be able to have those games playable on your PSP so you can play them anywhere you want? Want to get those conversions directly from the source instead of through &quot;unsafe&quot; torrent browsers? Come and request them at\n\n                         www.reputation-resource.com","torrent":{"xt":"urn:btih:e4b53913f6fa9d575feb3bdcd7681e1f85b88f79","amp;dn":"%28PSX-PSP%29+WipEout+converted+properly+%5BResourceRG+Games+by+KloWn%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4b53913f6fa9d575feb3bdcd7681e1f85b88f79","infoHashBuffer":{"type":"Buffer","data":[228,181,57,19,246,250,157,87,95,235,59,220,215,104,30,31,133,184,143,121]},"announce":[],"urlList":[]}}