{"title":"Cheap Trick - Can't Stop Fallin' Into Love (2nafish)","uid":5676827,"size":129921028,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e55f31901d83d6edc5f4fb72bad89b646de9f5ef&amp;dn=Cheap+Trick+-+Can%5C%27t+Stop+Fallin%5C%27+Into+Love+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1278573189,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nBusted is an album by Cheap Trick, which was released in 1990 and peaked at #44 on the US album charts. After the success of &quot;The Flame&quot; from the previous album Lap of Luxury, the band recorded Busted with a similar format, especially on the single &quot;Can't Stop Fallin' Into Love.&quot; The single peaked at #12 on the US charts. The album failed to be as successful as the label had hoped, and about a year after the release of Busted  Epic Records dropped Cheap Trick from their label. There were three videos shot for this LP; &quot;Can't Stop Fallin' Into Love,&quot; &quot;If You Need Me,&quot; and &quot;Wherever Would I Be.&quot;\n\nPhysical copies of the album have been out of print for several years (with the exception of Japan), but it will be reissued in 2010 in the US along with the previous album Lap of Luxury in a 2-CD set.\n\nCheap Trick is an American rock  band from Rockford, Illinois, formed in 1974. The band consists of members Robin Zander (lead vocals, rhythm guitar), Rick Nielsen (lead guitar, backing vocals), Tom Petersson (electric bass, backing vocals), and Bun E. Carlos (drums, percussion).\n\nCheap Trick created a substantial fan base through its own brand of power pop music with a hard-edged yet melodic pop sound that combined the catchiness of The Beatles with the speed and energy of punk rock. The Los Angeles Times has remarked that &quot;Cheap Trick gained fame by twisting the Beatlesque into something shinier, harder, more American.&quot; Their biggest hits include &quot;Surrender&quot;, &quot;I Want You to Want Me&quot;, &quot;Dream Police&quot;, and &quot;The Flame&quot;. Cheap Trick also performed a cover version of Big Star's &quot;In the Street&quot; as the theme song for That '70s Show from the second season onward and the theme song &quot;Baby Muggles&quot; for The Colbert Report.\n\nAs of 2009[update], Cheap Trick continues to tour with their most well known lineup. They have often been referred to in the Japanese press as the &quot;American Beatles&quot;. The Illinois State Senate has declared April 1 to be &quot;Cheap Trick Day&quot; in the State. The band was also ranked #25 in VH1's list of the 100 Greatest Artists of Hard Rock.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:e55f31901d83d6edc5f4fb72bad89b646de9f5ef","amp;dn":"Cheap+Trick+-+Can%5C%27t+Stop+Fallin%5C%27+Into+Love+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e55f31901d83d6edc5f4fb72bad89b646de9f5ef","infoHashBuffer":{"type":"Buffer","data":[229,95,49,144,29,131,214,237,197,244,251,114,186,216,155,100,109,233,245,239]},"announce":[],"urlList":[]}}