{"title":"Monty Python: the Holy Grail (1975) Deluxe Edition PAL DVD9","uid":5087998,"size":11131928006,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e59ad2389aa74b5d71727ca098ebe5bfc7e810f0&amp;dn=Monty+Python%3A+the+Holy+Grail+%281975%29+Deluxe+Edition+PAL+DVD9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ubehage","files":-1,"time":1252877012,"description":"Monty Python and the Holy Grail (1975) Extraordinarily Deluxe Edition\n---------------------------------------------------------------------\n&quot;And now! At Last! Another film completely different from some of the other films which aren't quite the same as this one is.&quot;\n\nIMDB:  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0071853/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0071853/&lt;/a&gt;\n\nAudio: English (DD5.1), Hungarian (DD5.1), Polish (DD5.1)\n\nSubs: Danish, Swedish, Norwegian, Finnish, English, Bulgarian, Croatian, Czech, Greek, Hungarian, Icelandic, Polish, Romanian, Slovene.\n\nExtra Materials:\n- Disc 1:\n  - THE FILM re-mastered for High Definition widescreen.\n  - 5.1 Dolby Digital sound.\n  - Subtitles for People who don't like this film (from Shakespeare's Henry IV, Part II).\n  - On-Screen Screenplay: Read the screenplay while you watch the film (or vise verca).\n  - Elightening comentaries by Terry Gilliam &amp; Terry Jones with complaints and back-biting from John Cleese, Eric Idle &amp; Michael Palin.\n  - Extraordinary Animated Menus with very loud 5.1 Dolby Digital sound.\n  - Fascinating Scene Selection feature: all moving, all singing, no dancing.\n  - Exciting &quot;Follow the Killer Rabbit&quot; Feature.\n  - Special feature for the Hard of Hearing.\n\n- Disc 2:\n  - NEW: A Taste of Spamalot - and animated medley of songs from the hit Broadway.\n  - NEW: The Holy Grail Challenge - more perilous than the bridge of Death.\n  - NEW: Secrets of the Holy Grail - reveals even more than you already thought you knew.\n  - NEW: Extraordinary Deluxe Menus.\n  - NEW to those who haven't seen it before:\n    - Three inspiring Sping-Alongs.\n    - Michael Paling &amp; Terry Jones take you on The Quest for the Holy Grail Locations.\n    - &quot;How to Use Your Coconuts&quot; (Government education film).\n    - &quot;Monty Python and the Holy Grail&quot; in Japanese.\n    - &quot;Knights of the Round Table&quot; in LEGO.\n    - Film Night: original 1974 location report by BBC TV.\n    - Interactive Cast Directory: Who got all the best parts.\n    - Behind-the-Scenes Photos.\n    - A Load of Rubbish: a surprise package for the mentally challenged.\n    - Unused Locations: How the directors spent the budget.\n    - Unused ideas.\n    - Theatrical Trailers.\n\n\nPlot outline:\nThe movie starts out with Arthur, King of the Britons, looking for knights to sit with him at Camelot. He finds many knights including Sir Galahad the pure, Sir Lancelot the brave, the quiet Sir Bedevere, and Sir Robin the Not-Quite-So-Brave-as-Sir Lancelot. They do not travel on horses, but pretend they do and have their servants bang coconuts to make the sound of horse's hooves. Through satire of certain events in history (witch trials, the black plague) they find Camelot, but after literally a quick song and dance they decide that they do not want to go there. While walking away, God (who seems to be grumpy) come to them from a cloud and tells them to find the Holy Grail. They agree and begin their search. While they search for the Grail, scenes of the knight's tales appear and why they have the name they have. Throughout their search they meet interesting people and knights along the way. Most of the characters die; some through a killer rabbit (which they defeat with the holy hand grenade), others from not answering a question right from the bridge of Death, or die some other ridiculous way. In the end, King Arthur and Sir Bedevere are left and find the Castle Arrrghhh where the Holy Grail is. They are met by some French soldiers who taunted them earlier in the film, so they were not able to get into the castle.","torrent":{"xt":"urn:btih:e59ad2389aa74b5d71727ca098ebe5bfc7e810f0","amp;dn":"Monty+Python%3A+the+Holy+Grail+%281975%29+Deluxe+Edition+PAL+DVD9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e59ad2389aa74b5d71727ca098ebe5bfc7e810f0","infoHashBuffer":{"type":"Buffer","data":[229,154,210,56,154,167,75,93,113,114,124,160,152,235,229,191,199,232,16,240]},"announce":[],"urlList":[]}}