{"title":"Mission Impossible 3 - Fan Edit - The Casmir Cut","uid":5130136,"size":1256951808,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e633d654f5ae803048d7af2dc3c9f5ae7d7f91dd&amp;dn=Mission+Impossible+3+-+Fan+Edit+-+The+Casmir+Cut&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CasmirRadon","files":1,"time":1256013379,"description":"This is a Fan Edit of Mission Impossible III, not the original film.  I kept the plot largely the same, but improved it in many ways by removing and restructuring scenes.  \n\nOriginal Run time: 125 min\nNew Run time: 114 min\n\nI loved Mission Impossible III, and the movie completely sucked me in when I first viewed it in the theater. Still, I always had a few complaints. First and foremost, the entire idea for this edit was my hatred of the flash-forward prologue. For God knows what reason, J.J. Abrams decided to show us the entire climatic scene of the movie, as the opening sequence. This distracted me a lot from the rest of the movie up until that point, and removed a lot of the suspense, instead of adding to it. After moving the prologue to the climax where it belonged, I trimmed annoying dialogue, removed the poorly conceived hasty wedding, removed Simon Peg's stupid guesses about what the Rabbit's Foot is, and fixed up some continuity errors along the way. Mission Impossible III was already a great movie, I simply feel I've fixed a bunch of annoyances.\n\n\n[B]XVID info[/B]\n5.1 ac3 audio at 192 kbps\n624 x 352 resolution\n\n\n\nCuts removed/added/extended [B]MAJOR SPOILERS FOLLOW!!!!![/B]\n\n-Removed Flash-forward prologue and moved these scenes to the ending where they belonged in the first place.\n\n-Moved the title, opening credits, and Mission Impossible theme music to after Ethan accepts his mission. Which I believe makes it feel a lot more like a Mission Impossible movie.\n\n-Moved the title to the end of the actor credits, instead of hidden within them. This required using the soundtrack to extend the theme music a few seconds, but I think was worth it to highlight the movie's title properly.\n\n-Trimmed some of the more over-the-top and annoying parts of the mission debriefing with Brassel giving Ethan and Musgrave the third degree. Now the point still gets across, but he doesn't come off as just an asshole boss for the audience to resent.\n\n-Slight trim during the funeral while Ethan is flashing back to training Lindsey Farris. Cut one of the montage scenes of fighting with sticks. Apparently according to this montage 90% of IMF training is learning to fight one-on-one with sticks. I trimmed what little I could.\n\n-Cut Luther making a bad joke about Ethan sleeping with his little sister. It just didn't work.\n\n-Cut Simon Peg going off on his ridiculous sidebar about the Rabbit's Foot possibly being the &quot;anti-God.&quot; This doesn't make sense as a guess, and doesn't make sense that he would say it at all. Now we can all enjoy a real McGuffin.\n\n-Cut the improvised wedding in the Hospital. I really felt that this was unnecessary. Plus, it simply felt false to me. She trusts him, but wants reassurance... so they get married 20 minutes later with plastic rings in her nurse's scrubs? I didn't like how this scene worked. Which is too bad, because it meant a handful of other cuts later in the movie to erase all mentions to them being married. Especially lots of cut dialogue where Luther warned Ethan about the perils of marriage, which I actually didn't miss at all.\n\n-Cut most scenes in the Vatican of Luther making the mask of Davian. The special effects for these scenes are very poor.\n\n-Cut one of Davian's lines while he was held captive on the plane. A little too over the top when he says &quot;you saw what I did with your friend at the warehouse. That was nothing. That was fun.&quot; Now he's a little more cool and collected, instead of goading his captors.\n\n-Trimmed a couple seconds of Luther yelling at Ethan to stop threatening Davian in the airplane. It will still feel like forever though.\n\n-Fixed blatant continuity error while Ethan is running through the streets of Shanghai. He stops just short of getting hit by a truck at high speed... then turns around the corner and we see that the &quot;street&quot; the truck came from is a narrow alley blocked with walking pedestrians.\n\n-Trimmed a couple seconds of Julia performing really fake CPR on Ethan in China. But it's still going to feel like she's doing it forever.\n\n-Cut happy ending back at IMF. Too hokey, and didn't add a single shred of information or value to the movie in my opinion. Now the film cuts to credits as we fade out on Ethan and Julia in China.\n\n-Replaced the last two songs during credits with my own selections.","torrent":{"xt":"urn:btih:e633d654f5ae803048d7af2dc3c9f5ae7d7f91dd","amp;dn":"Mission+Impossible+3+-+Fan+Edit+-+The+Casmir+Cut","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e633d654f5ae803048d7af2dc3c9f5ae7d7f91dd","infoHashBuffer":{"type":"Buffer","data":[230,51,214,84,245,174,128,48,72,215,175,45,195,201,245,174,125,127,145,221]},"announce":[],"urlList":[]}}