{"title":"The Radicals - Story Of The Anabaptists [1990] PAL-DVD.iso","uid":5053094,"size":4511694848,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e6e2c9addf3af4a05308995e5224511eb1835f01&amp;dn=The+Radicals+-+Story+Of+The+Anabaptists+%5B1990%5D+PAL-DVD.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"verifire","files":-1,"time":1250267062,"description":"Hi there..\n\nThen it finally happened. TPB's trackers are down. But I've been anticipating something like this for a while. So for those who'll want to download torrents I've made and will make in the future, I'm moving nearly all of them to another torrent-site, maybe two. I guess it'll be at least: &lt;a href=&quot;\nhttp://www.torrentbox.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentbox.com&lt;/a&gt;\n\nJust browse for the torrents on that site, and all uploads will come up, just give me some days.. :-)\n\nAnd you can still start your download from this site!! Just add these trackers to the torrent, and we'll find each other again.\n &lt;a href=&quot;\nhttp://tracker.publicbt.com:80/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.publicbt.com:80/announce&lt;/a&gt;\n &lt;a href=&quot;\nhttp://tracker.torrentbox.com:2710/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.torrentbox.com:2710/announce&lt;/a&gt;\n \nNow don't click on the &quot;links&quot; above, that won't work. Copy and paste them to add them to your trackers in the torrent-file.\n\nAnd be sure to enable DHT. It tracks too..\n  \nAnyway, they should also all be available by search on my alias, verifire, on for instance: &lt;a href=&quot;\nhttp://www.isoHunt.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.isoHunt.com&lt;/a&gt;\n \n- because they search the contents and comments on the upload for tags as well as the title of the torrent.. Just give me some time..\n\nSee you later, when things are settled and (maybe) there's a working tracker on the site again, and I'll miss it terribly, but I hope for, and guess this isn't the last word on the matter. I'll upload stuff here anyway, as well as on the other sites...\n\nTPB WILL ALWAYS RULE!! THANK YOU, GUYS. YOU'VE BEEN A PLEASURE TO BE SHIPWRECKED WITH. IT'S AN HONOUR...\n\nVerifire.\n____________________________________________________________________________\n\n\nI'm at the moment being constantly monitored and hindered in sharing Christian material. For instance uTorrent shows that there's three(!) seeders on every torrent I upload when they've been published for a few minutes, and I have shared maybe 1% of the file. How's that possible? A month ago it showed &quot;only&quot; two..\n\nThe people who hate what I do block my listening port and slows down my bandwidth to an extreme low, and I'm being bombarded in comments on uploads and mails. The only thing I can do, is to appeal to you who are Christians, to help me seed these torrents, because I don't know how much longer I'm able to do this. Not for long, I fear. And I live in Norway, a so called &quot;free Nation&quot; of the western world..\nAnd then I'm accused of being a &quot;conspiracy-theorist&quot;.. :-)\n\nWell. This is a re-loaded version of a movie I've uploaded before, but the quality wasn't very good. It was one of my first uploads, so...\nThis time I've made it a full PAL DVD image, or .iso, so it's just: (double?)Click on the finished downloaded file, and it'll mount in what ever program you've assigned for burning DVD's.. :-)\n\nAnd you don't even have to remove the finished download from it's folder! Isn't that great!? Cause then others might have the chance to see this true story.. That's called sharing.. And sharing is caring...at least this kind of stuff.. :-)\n\nThis is the little known story of a small group of Christians,\nwho came to be known as the &quot;Anabaptists&quot;, meaning &quot;baptizing again&quot;,\nbecause they felt it should be an adult choice to enter into the New and Holy\nCovenant with Jesus through the act of baptism.\n\nMartin Luther may well have got rid of the practice of buying your way out\nof the so called &quot;purgatory&quot; of the Catholic &quot;church&quot;, via donations to the pope's \ntreasurer, but he held on to infant baptism and the practices of the mass and a whole lot of other not so good teachings from &quot;the mother church&quot;.\n\nFor introducing baptism for grown-ups and the blasphemy of not accepting any earthly means of defense against their enemies, but depending only on the help from their One and Only Saviour and His teachings, the Anabaptists were persecuted, tortured and burned as &quot;heretics&quot;.\n\nThe ever present actuality of this movie is precious for those of us who still believe in the Lord Jesus' teachings even concerning our time and what we're about to face as the days of His return in the sky draws near. Be strong, and fear not for them, for He that lives in you is far greater than he who rules the lords of this planet at present..\n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;265043544f404f54434b474f4a66414b474f4a0845494b&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:e6e2c9addf3af4a05308995e5224511eb1835f01","amp;dn":"The+Radicals+-+Story+Of+The+Anabaptists+%5B1990%5D+PAL-DVD.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6e2c9addf3af4a05308995e5224511eb1835f01","infoHashBuffer":{"type":"Buffer","data":[230,226,201,173,223,58,244,160,83,8,153,94,82,36,81,30,177,131,95,1]},"announce":[],"urlList":[]}}