{"title":"PocketGod 1.24","uid":5079523,"size":11008590,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:e6fe578279888f203f8b91fe0018e20ad274e2ef&amp;dn=PocketGod+1.24&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Paaaaaaaaaaul","files":1,"time":1252165574,"description":"Pocket God\n\nPocket God is a game for the iPhone/iPod Touch developed by Bolt Creative. It was programmed by Dave Castelnuovo and designed by Allen Dye.[1] Originally released on January 9th, 2009, Pocket God has been in the App Store's Top 100 Charts for over 238 days.\n\nPocket God is a smaller version of a god game, meaning that the player takes the role of an omnipotent being who rules over an island and controls everything present. The primitive islanders, known as Pygmies, are subject to the player's god powers. These range from summoning a hurricane to levitating the Pygmies. Some powers are docile; however, such as giving the islanders a rod to catch fish with. Built-in features of the iPod touch and iPhone OS are used, such as the accelerometers to simulate gravity and earthquakes. Most of these features can be toggled on the games menu bar. The &quot;March of the Fire Ants&quot; update also added a new feature known as OpenFeint where players can access chat rooms, leaderboards, and announcements during gameplay. The episode &quot;A New Home&quot; added a slightly larger second island to the game. This island contains an outhouse for the Pygmies. Players can toggle between islands from the menu bar.\n\n","torrent":{"xt":"urn:btih:e6fe578279888f203f8b91fe0018e20ad274e2ef","amp;dn":"PocketGod+1.24","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6fe578279888f203f8b91fe0018e20ad274e2ef","infoHashBuffer":{"type":"Buffer","data":[230,254,87,130,121,136,143,32,63,139,145,254,0,24,226,10,210,116,226,239]},"announce":[],"urlList":[]}}