{"title":"Michou - Discography [2010]","uid":5670185,"size":121920189,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e7513817f70118c83efeb03f0634efbdf987264c&amp;dn=Michou+-+Discography+%5B2010%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"XaioSheen","files":-1,"time":1278312485,"description":"A scientist from the future made a quantum leap back to the year 1974 and conducted an experiment in which one man would impregnate 4 separate women with 4 separate children. The 4 children were all born male, and therefore brothers from separate mothers. Following in their father's footsteps they became inner city cowboys and started a gang known to all as &quot;the downtown rumblers&quot;. They were feared for their frequent attacks on the innocent, and their calling card: cooked macaroni noodles stuffed in shirt pockets. Citizens would walk around fearing the call &quot;MICHOU!&quot;, which the gang would shout as they jumped from near by ice cream trucks.\n\nThe scientist, realizing the damage and randomness of his experimentation, took the inner city cowboys back into the future; the year 2009. The rumblers used their post teenage/futuristic angst to compose delicate indie music with pop sensibilities. Now their music is daring to take over the world, as the scientist sits back and collects 15% publishing rights, and an additional 5% on any gross over $200,000. The band, paying homage to their previous attack call, &quot;michou&quot; decided to name the group as such. Now we look to the future and watch their destinies unfold.\n\nMichou - Cardona [2010] [Album]\n\nSome very very very poppy folk. One of this bands songs is even played on Much Music, but some how theyve managed to stay small with under 600 listeners on last.fm. This is a band you can play when youre with that girl who likes top 40 music because youll both be able to appreciate it. She'll like it because it very catchy and youll like it because its actually good. So here you go download this up and coming Canadian band.\n\nTracklist:\n\n01 Growing Younger.mp3 4.84 MB\n02 Eavesdropping.mp3 5.30 MB\n03 Windsor.mp3 5.41 MB\n04 Summer Night.mp3 5.11 MB\n05 Numbers.mp3 4.69 MB\n06 Struggling to Connect.mp3 4.32 MB\n07 The Coast.mp3 4.76 MB\n08 Where I Used to Be.mp3 4.89 MB\n09 Still Wandering.mp3 4.14 MB\n10 Spectre.mp3 5.05 MB\n\nMichou - Myshkin [2008] [Album]\n\nThis is Michou's first full-length album, entitled 'Myshkin' which was released on June 5th, 2008. The songs were produced, engineered and mixed by Joel Bruyere of Thousand Foot Krutch and The Drawing Room. They have been critically acclaimed for their unique folk rock sound.\n\nTracklist:\n\n01. Michou Medea.mp3 6.50 MB\n02. Michou Rocks in the Dryer.mp3 5.43 MB\n03. Michou In Passing.mp3 6.53 MB\n04. Michou Control.mp3 7.74 MB\n05. Michou From Friends to Lovers.mp3 5.69 MB\n06. Michou Imperfect.mp3 4.54 MB\n07. Michou Only Half Conscious.mp3 4.72 MB\n08. Michou The Moon and the Sun.mp3 5.47 MB\n09. Michou The Anti Hero Makes His Way.mp3 7.92 MB","torrent":{"xt":"urn:btih:e7513817f70118c83efeb03f0634efbdf987264c","amp;dn":"Michou+-+Discography+%5B2010%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7513817f70118c83efeb03f0634efbdf987264c","infoHashBuffer":{"type":"Buffer","data":[231,81,56,23,247,1,24,200,62,254,176,63,6,52,239,189,249,135,38,76]},"announce":[],"urlList":[]}}