{"title":"The Typing of the Dead II (JP)","uid":5026889,"size":579692998,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e7de7883a414bb7844c6418d7f7152643d538482&amp;dn=The+Typing+of+the+Dead+II+%28JP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PurpleWhiteOut","files":44,"time":1248732954,"description":"RUN THIS GAME USING APPLOCALE\n\nDirections: Unrar the ISO, mount it and install the game. Copy the updater from the &quot;crack&quot; directory found on the ISO into the game folder and update the game. Then copy the cracked .exe from the &quot;crack&quot; folder. Play and enjoy.\n\n&quot;This is a game that blends the exhilarating elements of shooting games and educational objectives together. To kill a zombie, instead of pulling a trigger, you type the words that appear on the screen.&quot;\n\nThe Typing of the Dead II is a zombie shooting game, where instead of using guns you use your keyboard to kill zombies by typing the words that appear. The Typing of the Dead II was released on Mar 04, 2008 by Sega as a sequel to The Typing of the Dead. Just as The Typing of the Dead was based off of The House of the Dead 2, The Typing of the Dead II is based off of The House of the Dead III.\n\nThe game is in Japanese but can be played without a Japanese keyboard with few problems. The words that appear are written in Japanese and also written using the Latin alphabet to be typed properly. Setting up a profile in Story Mode can be difficult, so if you have any questions leave them in the comments and I will try my best to answer.\n\n&quot;The game modes include a tutorial mode where complete novices can train themselves, a story mode where the player selects his/her routes toward a different ending. The drill mode is where players type repeatedly until they reach perfection, a mission mode where the players clear a stage after they have reached a certain criteria. The words or sentences prompted by the game require a quick mind and not just reflexes, for example, the players are prompted in certain parts of the game to input a word from backwards. &quot;\n\nCracked by NETSHOW","torrent":{"xt":"urn:btih:e7de7883a414bb7844c6418d7f7152643d538482","amp;dn":"The+Typing+of+the+Dead+II+%28JP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7de7883a414bb7844c6418d7f7152643d538482","infoHashBuffer":{"type":"Buffer","data":[231,222,120,131,164,20,187,120,68,198,65,141,127,113,82,100,61,83,132,130]},"announce":[],"urlList":[]}}