{"title":"Joran van der Sloot (NL) 2Lions-Team","uid":5660265,"size":1597314723,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e7ec89c5cad38d040d5bd9bb4ed9f73b84b4b6dc&amp;dn=Joran+van+der+Sloot+%28NL%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rocco64","files":-1,"time":1277946294,"description":"\nMediacircus rond Joran\n\nJoran van der Sloot beheerst al vijf jaar de media. Eerst was er de geruchtmakende verdwijning van Natalie Holloway, daarna volgde de veelbesproken reportage van Peter R. de Vries. De laatste maand is Joran echt niet meer van de televisie weg te slaan.\n\nStephany Flores\nDe meest recente commotie rond hem begon met de vondst van het lichaam van de Peruaanse Stephany Flores in zijn hotelkamer. De jonge vrouw was doodgeslagen en het bewijs tegen Van der Sloot was overweldigend. Er waren camerabeelden, getuigenverklaringen en DNA-sporen die er allemaal op wezen dat hij achter de dood van het meisje zat.\n\nMoeder\nHet wereldwijde mediacircus dat daarop losbarstte was overweldigend. In Nederland, Latijns Amerika en de V.S. konden kranten en tv-rubrieken geen genoeg krijgen van de laatste ontwikkelingen in de zaak. Beelden van zijn arrestatie gingen de hele wereld over, er waren interviews met de directeur van de gevangenis en zelfs Jorans moeder kwam aan het woord.\n\nSmeekbede\nIn een ingelaste documentaire zet SBS 6 de gebeurtenissen van de afgelopen maand nog even overzichtelijk op een rijtje. Ook zijn er beelden vanuit de Castro Castro-gevangenis en is er een interview met een vriendin van Joran. Deze Melody Granadillo vertelt dat Joran op de dag van de moord op Stephany Flores nog contact met haar heeft gezocht. Hij vroeg haar om geld, de bekende smeekbede die hij ook bij vele anderen gebruikt zou hebben. Melody weigerde dit, maar denkt nu dat Stephany misschien nog wel geleefd zou hebben als ze Joran het geld wel geleend had.\n\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : TV\n \nOndertitels : Nederlands (ingebakken)\n \nGenre : Misdaad\n \nWeblink : http://www.google.nl/search?hl=nl&amp;q=Joran+van+der+Sloot%3A+een+maand+na+de+moord+op+Stephany+30-6-10 \n\n\n\n\n\n******************************************\n\nBrought to you by Dorien van\n2Lions-Team\n\n\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n\n******************************************\nwanna see more check our Forum\n\n\n\n\n\n\n\n\n\nEnjoy \n2Lions-Team\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n********************************************* \n\n\n","torrent":{"xt":"urn:btih:e7ec89c5cad38d040d5bd9bb4ed9f73b84b4b6dc","amp;dn":"Joran+van+der+Sloot+%28NL%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7ec89c5cad38d040d5bd9bb4ed9f73b84b4b6dc","infoHashBuffer":{"type":"Buffer","data":[231,236,137,197,202,211,141,4,13,91,217,187,78,217,247,59,132,180,182,220]},"announce":[],"urlList":[]}}