{"title":"Fable 2 GOTY [X360][ojuegos.eu]","uid":5084716,"size":6600003067,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:e7f0330e5b2ab6bd12648aaf865b02e9af6b6be2&amp;dn=Fable+2+GOTY+%5BX360%5D%5Bojuegos.eu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Morck22","files":68,"time":1252623138,"description":"Fable 2: Gold Edition incluirÃƒÂ¡ ademÃƒÂ¡s del propio juego, las dos ÃƒÂºltimas expansiones, &quot;Knothole Island&quot; y &quot;See the Future&quot;.\n\nFable 2 Fable II es la esperadÃƒÂ­sima secuela del gran ÃƒÂ©xito que vendiÃƒÂ³ mÃƒÂ¡s de tres millones de copias. El nuevo juego toma el nÃƒÂºcleo del original y lo amplÃƒÂ­a para ofrecer aun mÃƒÂ¡s opciones: cada una de tus decisiones va dando forma poco a poco a la persona en la que te conviertes. Fable II, ambientado 500 aÃƒÂ±os despuÃƒÂ©s del original, presenta una historia ÃƒÂ©pica y un innovador sistema en tiempo real que concede una enorme libertad para explorar la vasta colecciÃƒÂ³n de mazmorras, catacumbas y tabernas del mundo de AlbiÃƒÂ³n.\nKnothole Island Es un territorio muy particular, pues el estado climatolÃƒÂ³gico es controlado por sus propios habitantes. Con estos cambios de clima, el estado de la isla cambia completamente abriendo o limitando el camino a nuevas zonas dependiendo del estado actual de la isla. El jugador y protagonista deberÃƒÂ¡ adentrarse en los espectaculares diferentes santuarios para salvar a los habitantes de la isla. En total, esta expansiÃƒÂ³n cuenta con 3 misiones, cada una relacionada con cada uno de los santuarios del clima.\nSee the Future En esta expansiÃƒÂ³n, el jugador es devuelto al amado universo de AlbiÃƒÂ³n, donde un conjunto de objetos encantados por Murgo, el Comerciante, desencadenarÃƒÂ¡ nuevos retos que deberÃƒÂ¡n resolver los jugadores, incluyendo encuentros con fantasmas burlones, aterradores nigromantes, y con un caballero condenado en el Coliseum, del que sÃƒÂ³lo los mayores hÃƒÂ©roes de AlbiÃƒÂ³n saldrÃƒÂ¡n victoriosos para reclamar un trofeo definitivo.\nEn la versiÃƒÂ³n Fable II: Game of the Year, El perro fiel de &quot;Fable II&quot; regresa en tres encarnaciones diferentes que permiten decidir la raza de su compaÃƒÂ±ero de viaje. Un husky, un dÃƒÂ¡lmata o un sabueso. AdemÃƒÂ¡s de estas fantÃƒÂ¡sticas nuevas pruebas, criaturas, personajes, sucesos y artefactos legendarios, &quot;Conoce el Futuro&quot; ofrece objetos ÃƒÂºnicos para todo el mundo, entre ellos, un yelmo de soldado, un tocado trenzado con un peinado de cola de caballo, una nueva expresiÃƒÂ³n heroica, el truco de la voltereta hacia atrÃƒÂ¡s para nuestro canino camarada y una estatua coleccionable de Murgo labrada en oro.\n","torrent":{"xt":"urn:btih:e7f0330e5b2ab6bd12648aaf865b02e9af6b6be2","amp;dn":"Fable+2+GOTY+%5BX360%5D%5Bojuegos.eu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7f0330e5b2ab6bd12648aaf865b02e9af6b6be2","infoHashBuffer":{"type":"Buffer","data":[231,240,51,14,91,42,182,189,18,100,138,175,134,91,2,233,175,107,107,226]},"announce":[],"urlList":[]}}