{"title":"El Rey Mono - The Lost Empire Miniserie Completa DVDRip Spanish","uid":5061237,"size":1571769510,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e8a73fe4fb9bdeaf31f0befd12de7d3553db2a1c&amp;dn=El+Rey+Mono+-+The+Lost+Empire+Miniserie+Completa+DVDRip+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":3,"time":1250714239,"description":"Miniserie protagonizada por el actor Kabir Bedi, famoso por su papel de SandokÃƒÂ¡n, en la que una bella diosa china encarga a un periodista la misiÃƒÂ³n de encontrar un antiguo manuscrito en un plazo de tres dÃƒÂ­as.\n\nEsta superproducciÃƒÂ³n televisiva, dirigida por Peter MacDonald y en la que actÃƒÂºan tambiÃƒÂ©n Ling Bai, Thomas Gibson, Russell Wong, Ric Young, y Eddie Marsan, entre otros, estÃƒÂ¡ basada en una obra clÃƒÂ¡sica de la literatura china del siglo XVI.\n\nLa historia cuenta como durante una excavaciÃƒÂ³n arqueolÃƒÂ³gica de tumbas chinas, Nick Orton, un periodista estadounidense, conoce a Kwan Ying, una hermosa diosa, enviada por los &quot;guerreros de terracota&quot;, que le encomienda la misiÃƒÂ³n de rescatar un valioso manuscrito en el plazo de tres dÃƒÂ­as o, de lo contrario, llegarÃƒÂ¡ el fin del mundo.\n\nCuando Orton se plantea la posibilidad de declinar la oferta de la deidad china, la tierra empieza a temblar y su cuerpo cae por una sima hasta llegar a las tumbas lo que provoca que el poderoso rey mono, un dios que ha permanecido atrapado durante mÃƒÂ¡s de 500 aÃƒÂ±os, sea liberado de su encierro. Desde ese momento, se inicia entre ellos una relaciÃƒÂ³n profesor y alumno, de forma que el rey mono le enseÃƒÂ±a a Orton las habilidades y destreza de un guerrero y este a aquel descubrir aspectos desconocidos sobre el corazÃƒÂ³n humano.","torrent":{"xt":"urn:btih:e8a73fe4fb9bdeaf31f0befd12de7d3553db2a1c","amp;dn":"El+Rey+Mono+-+The+Lost+Empire+Miniserie+Completa+DVDRip+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8a73fe4fb9bdeaf31f0befd12de7d3553db2a1c","infoHashBuffer":{"type":"Buffer","data":[232,167,63,228,251,155,222,175,49,240,190,253,18,222,125,53,83,219,42,28]},"announce":[],"urlList":[]}}