{"title":"Damn Small Linux 4.4.10","uid":5052301,"size":52328448,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:e955ae1b2456d7e3d18d9bb0026bff57b7171fd3&amp;dn=Damn+Small+Linux+4.4.10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"harry711","files":1,"time":1250228546,"description":" &lt;a href=&quot;http://www.damnsmalllinux.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.damnsmalllinux.org/&lt;/a&gt;\n\n\nDamn Small Linux is a very versatile 50MB mini desktop oriented Linux distribution.\n\nDamn Small is small enough and smart enough to do the following things:\n\n    * Boot from a business card CD as a live linux distribution (LiveCD)\n    * Boot from a USB pen drive\n    * Boot from within a host operating system (that's right, it can run *inside* Windows)\n    * Run very nicely from an IDE Compact Flash drive via a method we call &quot;frugal install&quot;\n    * Transform into a Debian OS with a traditional hard drive install\n    * Run light enough to power a 486DX with 16MB of Ram\n    * Run fully in RAM with as little as 128MB (you will be amazed at how fast your computer can be!)\n    * Modularly grow -- DSL is highly extendable without the need to customize\n\nDSL was originally developed as an experiment to see how many usable desktop applications can fit inside a 50MB live CD. It was at first just a personal tool/toy. But over time Damn Small Linux grew into a community project with hundreds of development hours put into refinements including a fully automated remote and local application installation system and a very versatile backup and restore system which may be used with any writable media including a hard drive, a floppy drive, or a USB device.\n\nDSL has a nearly complete desktop, and a tiny core of command line tools. All applications are chosen with the best balance of functionality, size and speed. Damn Small also has the ability to act as an SSH/FTP/HTTPD server right off of a live CD. In our quest to save space and have a fully functional desktop we've made many GUI administration tools which are fast yet still easy to use. What does DSL have?\n\nXMMS (MP3, CD Music, and MPEG), FTP client, Dillo web browser, Netrik web browser, FireFox, spreadsheet, Sylpheed email, spellcheck (US English), a word-processor (Ted), three editors (Beaver, Vim, and Nano [Pico clone]), graphics editing and viewing (Xpaint, and xzgv), Xpdf (PDF Viewer), emelFM (file manager), Naim (AIM, ICQ, IRC), VNCviwer, Rdesktop, SSH/SCP server and client, DHCP client, PPP, PPPoE (ADSL), a web server, calculator, generic and GhostScript printer support, NFS, Fluxbox and JWM window managers, games, system monitoring apps, a host of command line tools, USB support, and pcmcia support, some wireless support.\n\n\n\n\n\nEnjoy this tasty, and free, software. :)","torrent":{"xt":"urn:btih:e955ae1b2456d7e3d18d9bb0026bff57b7171fd3","amp;dn":"Damn+Small+Linux+4.4.10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e955ae1b2456d7e3d18d9bb0026bff57b7171fd3","infoHashBuffer":{"type":"Buffer","data":[233,85,174,27,36,86,215,227,209,141,155,176,2,107,255,87,183,23,31,211]},"announce":[],"urlList":[]}}