{"title":"South Park [ s13e14 ] - Pee [ NL Sub ]","uid":5678541,"size":185473024,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e961df08ebe55637ef1ec12e5c4a09e2f8520f02&amp;dn=South+Park+%5B+s13e14+%5D+-+Pee+%5B+NL+Sub+%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1278703203,"description":"South Park s13e14 - &quot;Pee&quot; met Nederlandse ondertiteling [ ingebakken ].\n\nSeizoen: 13\nAflevering: 14\nBeeld: HD\n\n*** unscensored ***\n\nSorry voor de Fuck'd up ondertiteling in het begin, maar ik heb et eenmaal al er in gebakken en het is veel werk om het over te doen, sorry daar voor.\n\n***** PLOT *****\n\nCartman, Stan, Kyle, Kenny, Butters and Jimmy arrive at Pi Pi's\nSplashtown waterpark. Cartman is distraught to discover that most\nof the park's attendants are people of different races, while\nKyle is disgusted to learn so many people freely urinate in the\npools. Based on his observance of more minorities at the park\nthan white people, Cartman calculates there will be no white\npeople left by the year 2012, and interprets this as a sign that\nMayans accurately predicted the world would end the same year.\nMeanwhile, a scientist tests the park's water and discovers it is\n98 percent urine. He urges Pi Pi, the park's Venetian owner, to\nimmediately close and evacuate his park, claiming the high urine\ncontent will soon trigger a cataclysmic event. Pi Pi dismisses the\nwarning, but the park is soon overcome by tsunamis of urine and\nvolcanic eruptions. Hundreds drown in the subsequent flood,\nincluding Kenny, but the other boys manage to survive.\n\nThe park is quarantined, and the scientist advises against a\nmission to rescue those trapped inside, fearing their exposure\nto &quot;pee contamination&quot; has turned them into dangerous,\nhate-filled mutants. To prove his theory, the scientist urinates\nonto a test monkey, which promptly becomes agitated. An antidote\nto this reaction is then tested on other monkeys, but proven\nunsuccessful when the monkeys still become angered when urinated\non. Meanwhile, Cartman clings to debris to stay afloat, while\nthe other boys have reached higher ground. Cartman is rescued\nby the occupants of an inflatable raft. Noticing he is the only\nwhite person in the raft, Cartman assumes he is the &quot;last of his\nspecies&quot;, and that his envisioned 2012 scenario has occurred\nthree years early. He imagines a world in which he must speak in\nminority slang, is paid lower wages, and eventually forced to\nlive in a concentration camp.\n\nThe other boys find Pi Pi, who informs them the park can be\ndrained of the inundation if someone can swim through the pee\nto reach an emergency release valve. Kyle reluctantly agrees to\ndo the job as he said at the start of the episode that he could\nhold his breath for the longest, but is horrified to learn he must\ndrink the urine in order to offset the fluid pressure he will\nencounter at the depths. Outside, an antidote that keeps the\nmonkeys calm during yet another urination test is discovered:\nbananas. Back inside the park, Kyle reluctantly drinks a jarful of\nurine in preparation for his plunge into the flood. Just after he\nfinishes the jar, helicopters arrive as part of the rescue mission.\nJust as Kyle complains that eating a banana would be the only ordeal\nmore disgusting than what he has just been through, he is ordered\nat gunpoint to consume the antidote.\n\nSource: http://en.wikipedia.org/wiki/Pee_(South_Park)\n\n\n\n*** Subs + sync by: DA_BuZter ****\n\n*****   Keep on seeding 1:1  *****\n\n***** DO NOT HIT AND RUN !!! *****","torrent":{"xt":"urn:btih:e961df08ebe55637ef1ec12e5c4a09e2f8520f02","amp;dn":"South+Park+%5B+s13e14+%5D+-+Pee+%5B+NL+Sub+%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e961df08ebe55637ef1ec12e5c4a09e2f8520f02","infoHashBuffer":{"type":"Buffer","data":[233,97,223,8,235,229,86,55,239,30,193,46,92,74,9,226,248,82,15,2]},"announce":[],"urlList":[]}}