{"title":"DEVONthink","uid":5043336,"size":7601957,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:e9b85f1a73ddec720138bb84ae01a68af82b9355&amp;dn=DEVONthink&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"troweprice05","files":1,"time":1249499505,"description":"MacUpdate:\n\nDEVONthink... Everything is digital today. But where to store all these e-mails, PDFs, Word documents, images and multimedia files you accumulate every day? How to organize them, and find the right one when you need it?\n\nDEVONthink is the solution for the digital age, the one database for all your documents. And it's flexible. It adapts to your personal needs. Use it as your document repository, your filing cabinet, your e-mail archive or your project organizer. Collect and organize data from the web for a publication, enrich it with sound and movie files, and export everything as a web site, drag it to an Apple Pages document for publishing in print, or copy it to your iPod.\nThe Database for the Internet Age: DEVONthink keeps your important data in one database, regardless of where the data is physically located. Integrate both local documents and live content from the Internet to keep all project-related information together. Seamlessly mix local documents, clippings and live web pages.\nYour Digital Workplace: DEVONthink is not only a simple database, it's a flexible work environment with powerful management features. It provides you with all the tools you need for effectively working with your documents. Use the integrated RTF editor to write new documents, or open them in a third party application.\nIntelligent Assistant: DEVONthink is based on a powerful AI architecture that helps you organize and navigate your information collection. It assists you with filing documents and with finding similar items. Master even huge data collections with a few simple clicks.\n\nFYI: Personal edition, not pro\n\nApp + serial.\n\nLeopard only.\n","torrent":{"xt":"urn:btih:e9b85f1a73ddec720138bb84ae01a68af82b9355","amp;dn":"DEVONthink","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9b85f1a73ddec720138bb84ae01a68af82b9355","infoHashBuffer":{"type":"Buffer","data":[233,184,95,26,115,221,236,114,1,56,187,132,174,1,166,138,248,43,147,85]},"announce":[],"urlList":[]}}