{"title":"Coast to Coast AM - July - 2009","uid":5063059,"size":1733709865,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:e9bf487f80edefc8f5035e43dd7e719215c03935&amp;dn=Coast+to+Coast+AM+-+July+-+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":124,"time":1250797043,"description":"Maitreya Update &amp; Open Lines\nFriday July 31, 2009\nBenjamin Creme, the official spokesperson for the &quot;world teacher&quot; Maitreya, appeared in the first hour of the program to provide an update on the alleged spiritual leader's &quot;imminent&quot; arrival. During Open Lines, topics... \nHost: George Noory\nGuest(s): Open Lines, Benjamin Creme\n\nCrop Circles &amp; Anomalies\nThursday July 30, 2009\nLive from the U.K., investigative reporter Linda Moulton Howe and various witnesses and researchers, shared news about recent crop formations and associated anomalies in the Wiltshire, England area. First hour guest, dowser Raymon Grace... \nHost: George Noory\nGuest(s): Linda Moulton Howe, Raymon Grace\n\nFederal Reserve Revealed\nWednesday July 29, 2009\nDuring the first three hours, writer and documentary film producer G. Edward Griffin explained how the Federal Reserve system is primarily responsible for our economic crisis. He shared facts about the secret meeting where the Fed was created,... \nHost: George Noory\nGuest(s): G. Edward Griffin, Lionel Fanthorpe\n\nDNA &amp; Intelligent Design\nTuesday July 28, 2009\nA former geophysicist and college professor, Stephen C. Meyer argued for the existence of intelligent design based upon DNA, and scientific evidence from such fields as biology, physics, chemistry, and cosmology. First hour guest, planetary... \nHost: George Noory\nGuest(s): Stephen Meyer, Daniel Durda\n\nSpirit Attachment\nMonday July 27, 2009\nDuring the middle two hours, Kelly Kiernan Ray, an expert in hauntings, discussed the various ways that ghosts and entities can share our space and cause physical, mental and emotional problems as well as addictions. During the first... \nHost: George Noory\nGuest(s): Kelly Kiernan Ray, Katherine Albrecht, Nick Pope\n\nUFOs &amp; Nukes\nSunday July 26, 2009\nNoted UFO researcher Robert Hastings discussed his investigation into a decades-long connection between UFOs and nuclear weapon activity. He was joined by former US serviceman Patrick McDonough, who shared his story of witnessing a stunning UFO... \nHost: George Knapp\nGuest(s): Robert Hastings, Patrick McDonough, Alejandro Rojas\n\nMadame Blavatsky &amp; The Secret Doctrine\nSaturday July 25, 2009\nHistorian, author, and the librarian at the New York Lodge of the Theosophical Society, Michael Gomes (book link) discussed the life and works of Helena Petrovna Blavatsky, who paved the way for esoteric ideas on the origin and evolution of the... \nHost: Ian Punnett\nGuest(s): Michael Gomes\n\nArt Bell: Somewhere in Time\nSaturday July 25, 2009\nArt Bell: Somewhere in Time returned to November 21, 2002 for a conversation with Gordon Michael Scallion on demonic possession and the numerous exorcisms that he attended. \nHost: Art Bell - Somewhere In Time\nUnderstanding Anger\nFriday July 24, 2009\nFilling in for George, Ian Punnett welcomed Dr. Les Carter, during the first two and a half hours of the program, for a discussion on the nature of anger, how to use it constructively and avoid being consumed by it. The remainder of the show... \nHost: Ian Punnett\nGuest(s): Dr. Les Carter\n\nBipedal Canine Creatures\nThursday July 23, 2009\nAuthor, artist and researcher of the strange, Linda Godfrey discussed her most recent work on true encounters with beast-men and upright-walking canine creatures. &quot;I still get one to three a week,&quot; she said of the many reports of these... \nHost: George Noory\nGuest(s): Linda Godfrey, Paul Pantone\n\nAtlantis, Cayce, &amp; Artifacts\nWednesday July 22, 2009\nExpert on the American prophet Edgar Cayce, Greg Little discussed new discoveries in the search for Atlantis, mounds in ancient America, as well as findings in Egypt. First hour guest, Prof. Bart Kosko talked about efforts to create an... \nHost: George Noory\nGuest(s): Gregory Little, Bart Kosko\n\nWeb Bot Predictions\nTuesday July 21, 2009\nGeorge Ure &amp; 'Clif' discussed their web bot technology which has continued to give archetype descriptors of the future. They foresee a number of negative cycles/events converging over the next few years: In the first hour, researcher and... \nHost: George Noory\nGuest(s): Clif -, George Ure, Suzanne Taylor, Ron Paul\n\nApollo &amp; Space Missions\nMonday July 20, 2009\nOn the 40th anniversary of the moon landing, space historian Robert Zimmerman discussed the history and triumph of the Apollo space program &amp; how the U.S. was able win the race to put a man on the moon. First hour guest, Tim Miller with... \nHost: George Noory\nGuest(s): Robert Zimmerman, Tim Miller\n\nIntelligence &amp; Terrorism\nSunday July 19, 2009\nGeorge Knapp was joined by investigative reporter Peter Lance for a discussion of how America's intelligence services have fumbled in the pursuit of terrorists. The FBI and and the U.S. Attorney's Office were more interested in bringing down the... \nHost: George Knapp\nGuest(s): Peter Lance\n\nDiet &amp; Nutrition\nSaturday July 18, 2009\nPresident of the Physician's Committee for Responsible Medicine, Dr. Neal Barnard, M.D., shared some of the latest medical research on diet and nutrition, as well as discussed how certain foods trigger the release of natural opiates in the brain... \nHost: Ian Punnett\nGuest(s): Dr. Neal Barnard\n\nArt Bell: Somewhere in Time\nSaturday July 18, 2009\nArt Bell: Somewhere in Time returned to July 17, 1995 for an Open Lines program with a variety of topics, including weather and earthquakes. Followed by Ray Santilli discussing the film Alien Autopsy. \nHost: Art Bell - Somewhere In Time\nNight Terrors &amp; Spirit Communications\nFriday July 17, 2009\nIn the first half of the program, George spoke with researcher and author Rosemary Ellen Guiley about night terrors and spirit communications. During Open Lines, Todd in California told George that as a child he was a victim of 'Old Hag... \nHost: George Noory\nGuest(s): Rosemary Ellen Guiley, Open Lines\n\nCosmology &amp; the Universe\nThursday July 16, 2009\nProfessor of Science Writing at MIT and award winning author, Marcia Bartusiak discussed the birth of modern cosmology that came with Edwin Hubble's announcement in 1925 that our universe was far larger than previously believed, and filled with... \nHost: George Noory\nGuest(s): Marcia Bartusiak, Craig Nelson\n\nParapsychology &amp; Spirituality\nWednesday July 15, 2009\nKnown for his pioneering work on altered states of consciousness, Dr. Charles Tart talked about the connections between science, parapsychology, and spirituality. First half-hour guest, Dr. Brooks Agnew shared an update on his planned North... \nHost: George Noory\nGuest(s): Dr. Charles Tart, Brooks Agnew\n\nMothman: Theories &amp; Reports\nTuesday July 14, 2009\nFilmmaker and paranormal researcher Travis Shortt discussed his extensive research into the Mothman sightings. During the evening, filmmaker Charlie McCracken and author L.A. Marzulli joined the conversation. First hour guest, trends analyst... \nHost: George Noory\nGuest(s): Travis Shortt, L A Marzulli, Charlie McCracken, Gerald Celente\n\nAlien Abduction &amp; EMP Attacks\nMonday July 13, 2009\nIn the first half of the show, abduction investigator Budd Hopkins discussed his new memoir, in which he explores his life as an artist, and as a pioneer in the field of UFO research Appearing in the second half of the program, Professor... \nHost: George Noory\nGuest(s): Budd Hopkins, William R. Forstchen\n\nUndercover Hit Man\nSunday July 12, 2009\nIan Punnett welcomed veteran police officer Jack Ballentine (book link), who discussed his life as the country's most successful undercover hit man for hire. He shared how he convincingly infiltrated the worlds of organized crime, jealous... \nHost: Ian Punnett\nGuest(s): Jack Ballentine, David B. Williams\n\nManson Connections &amp; Conspiracies\nSaturday July 11, 2009\nIan welcomed investigative journalist and author Adam Gorightly, who discussed his astonishing research into the connections and conspiracy theories surrounding mass murderer Charles Manson. In the first hour James 'Tappy' Wright, a former... \nHost: Ian Punnett\nGuest(s): Adam Gorightly, James 'Tappy' Wright\n\nArt Bell: Somewhere in Time\nSaturday July 11, 2009\nArt Bell: Somewhere in Time featured an Open Lines show from May 16, 1997, covering such topics as morals &amp; transplants, the heart &amp; soul, and spontaneous human combustion. \nHost: Art Bell - Somewhere In Time\nGuest(s): Open Lines\n\nParanormal Investigations\nFriday July 10, 2009\nDuring the first half of the program, George spoke with documentary producer Bill Murphy, who shared details from his various paranormal investigations in Louisiana, aboard the Queen Mary, and at the the Stanley Hotel in Estes Park, Colorado.... \nHost: George Noory\nGuest(s): Bill Murphy, Open Lines\n\nParanormal Update\nThursday July 9, 2009\nAppearing in the latter half of the show, paranormal investigator Joshua P. Warren shared updates on a number of different topics. He was able to successfully extract recordings from a mysterious Cold War-era spy watch, and heard a group of men... \nHost: George Noory\nGuest(s): Damien Broderick, Tom Cryer, Joshua P. Warren\n\nRemote Viewing Program\nWednesday July 8, 2009\nWriter and physicist Russell Targ discussed his role as co-founder of a remote viewing/ESP research program for the CIA at the Stanford Research Institute (SRI) during the Cold War. First hour guest, Anthony H. Davidson (book link) talked... \nHost: George Noory\nGuest(s): Russell Targ, Anthony H. Davidson\n\nLunar &amp; NASA Secrets\nTuesday July 7, 2009\nC2C science advisor, Richard C. Hoagland discussed how a current NASA return to the Moon has already led to a major new confirmation of the &quot;lunar dome model,&quot; and shared evidence for the existence of a &quot;secret space... \nHost: George Noory\nGuest(s): Richard C. Hoagland, Andrew Gause\n\nReconnective Healing\nMonday July 6, 2009\nDr. Eric Pearl spoke about his technique called reconnective healing, a kind of &quot;hands off healing.&quot; The unique method works by reconnecting strings or strands, and tapping into a healing spectrum. First hour guest, cryptozoologist... \nHost: George Noory\nGuest(s): Dr. Eric Pearl, Loren Coleman\n\nCrop Circles &amp; UFOs\nSunday July 5, 2009\nInternationally known UFO and crop circle experts Ed &amp; Kris Sherwood talked about interactive UFO experiences, as well as their research into crop formations and their meanings. First hour guest, physicist James McCanney talked about how... \nHost: George Noory\nGuest(s): Ed Sherwood, Kris Sherwood, James McCanney\n\nCounterterrorism\nSaturday July 4, 2009\nIan spoke with counterterrorism agent Fred Burton, who provided behind-the-scenes details of his work tracking down the people responsible for terror attacks against the United States and its interests abroad. In the first hour, author Lynn... \nHost: Ian Punnett\nGuest(s): Fred Burton, Lynn Picknett\n\nArt Bell: Somewhere in Time\nSaturday July 4, 2009\nArt Bell: Somewhere in Time returned to 12/10/01 for a discussion with remote viewer Maj. Ed Dames on the 9-11 attacks, and the Anthrax killer. \nHost: Art Bell - Somewhere In Time\nGuest(s): Major Ed Dames\n\nMysteries, Monsters &amp; Open Lines\nFriday July 3, 2009\nDuring the first half of the program, George Noory spoke with investigators and authors Ed Craft &amp; Lisa Carmody about Mysteries &amp; Monsters. Craft reported on an enormous winged creature called Congomatu, as well as provided details from... \nHost: George Noory\nGuest(s): Ed Craft, Lisa Carmody, Open Lines\n\nAncient Wisdom &amp; Mythologies\nThursday July 2, 2009\nA lifelong student of world mythology and the pre-Christian Mysteries, John Lash discussed the ancient Gnostic texts known as the Nag Hammadi, as well as the Gaia Hypothesis, Archons, origins, and calendars. First hour guest, paranormal... \nHost: George Noory\nGuest(s): John Lash, Dean Warsing\n\nConspiracies, Nazis, &amp; UFOs\nWednesday July 1, 2009\nAward-winning journalist Jim Marrs discussed the JFK assassination, UFOs, and the Nazi connection to secret technology &amp; the power elite. There was a technology swap between Germany and the US after the war under such classified programs as... \nHost: George Noory\nGuest(s): Jim Marrs\n\n[This information has been shared to spread knowledge to those who otherwise would not have access to it.  If you can afford it please support www.coasttocoast.com]","torrent":{"xt":"urn:btih:e9bf487f80edefc8f5035e43dd7e719215c03935","amp;dn":"Coast+to+Coast+AM+-+July+-+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9bf487f80edefc8f5035e43dd7e719215c03935","infoHashBuffer":{"type":"Buffer","data":[233,191,72,127,128,237,239,200,245,3,94,67,221,126,113,146,21,192,57,53]},"announce":[],"urlList":[]}}