{"title":"Flo Rida - Right Round (Live)","uid":5056077,"size":105095172,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:eb29bf3c405868b099669ca20406433df3b653d8&amp;dn=Flo+Rida+-+Right+Round+%28Live%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1250382498,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nA live performance by Flo Rida - Right Round from BET Spring Bling 2009. This video has no logos.\n\n\n&quot;Right Round&quot; is Flo Rida's first single from his second studio album, R.O.O.T.S. The song was released for airplay on January 20, 2009, and reached number one in the United States, Canada, Australia, Ireland, and the UK. It is heavily based around Dead or Alive's 1984 single &quot;You Spin Me Round (Like a Record).&quot;\n\nThe song is featured in the 2009 movies Ice Age: Dawn of the Dinosaurs and is played during the closing credits of both The Hangover, and The Ugly Truth. It can also be heard in the trailer and TV spots in the latter.\n\n&quot;Right Round&quot; debuted at number 74 on the Billboard Hot 100 and peaked at number 1 the week ending February 28, 2009, selling 636,000 digital copies in its first week. This was the biggest first-week sales in digital history, even breaking the previous record Flo Rida had set with &quot;Low&quot; in December 2007. In its second week, the song sold an additional 460,000 downloads, the third highest one-week total ever, topping the one million mark in paid downloads in just two weeks and becoming the fastest million-selling download ever in the US. The song also became the fastest 2 million-selling download ever, topping the 2 million mark in just 5 weeks of release. After eleven weeks, the song topped the 3 million mark, becoming the fastest 3 million-selling download ever, breaking his own record, set in February, 2008 when &quot;Low&quot; hit the 3 million mark in 17 weeks. Flo Rida is only the fourth lead artist to have two songs reach the 3 million download mark. &quot;Right Round&quot; held the #1 spot on the Billboard 100 for 6 consecutive weeks before being succeeded by &quot;Poker Face&quot; by Lady Gaga.\n\nIn Canada, it debuted at number 75 on the Canadian Hot 100 and rose to number 47 the next week, and number one the week after, for being the &quot;Airplay Gainer&quot;. It was beaten off the number-one position by the Black Eyed Peas' single &quot;Boom Boom Pow&quot;, from April 18 until April 25, when it regained the top spot on the chart.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:eb29bf3c405868b099669ca20406433df3b653d8","amp;dn":"Flo+Rida+-+Right+Round+%28Live%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb29bf3c405868b099669ca20406433df3b653d8","infoHashBuffer":{"type":"Buffer","data":[235,41,191,60,64,88,104,176,153,102,156,162,4,6,67,61,243,182,83,216]},"announce":[],"urlList":[]}}