{"title":"Rare Air: Primeval; Space Piper","uid":5671105,"size":166158630,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eb6cecdedfd1f27d5367f84bfbd7082c306dfb3d&amp;dn=Rare+Air%3A+Primeval%3B+Space+Piper&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Psychodad149","files":21,"time":1278351277,"description":"Two albums from the Canadian band Rare Air, a ecelectic group which played a distinctive combination of bagpipes, folk, electric folk, and jazz, to name only a few. \n\nRare Air\nFrom Wikipedia, the free encyclopedia\nRare Air, formerly Na Cabarfeidh, was a Canadian band that played an eccentric mix of instruments, including bagpipes, flutes, whistles, bombardes, bass guitar, and keyboards. The group, founded in the late 1970s as a celtic folk music band, was originally led by bagpipe virtuosos Grier Coppins and Pat O'Gorman. Its first two albums were released under the name Na Cabarfeidh and the following four under the new name, Rare Air. The name Na Cabarfeidh means &quot;of Cabarfeidh&quot; in Gaelic, referring to the fact that the Coppins and O'Gorman were from the Cabar Feidh Pipe Band.\nIn 1982, Na Cabarfeidh released an album produced by Sometimes We Do This Musical Productions. At the time of album, the band included Ian Goodfellow, Grier Coppins, Richard Murai, Patrick O'Gorman, and Trevor Ferrier. The instruments on this album were Great Highland Bagpipes, acoustic guitar, long drum, whistle, bombarde, biniou koz, peaucloche, voices, cylinder drums, and tabla. The song Bretonia was based on a melody of a Breton love song, &quot;J'ai travaillÃƒÂ© la longue des jours,&quot; as sung to the band by Pierrig Hercelin of Les Fougerets.\nRare Air toured the world, and was especially popular in the southern United States. Their early music took the sounds of Celtic music from Ireland, Brittany and North America and combined it with funky bass rhythms and driving Polynesian percussion. In 1990, two of the four founding members, Trevor Ferrier and Richard Murai, left to pursue their own musical interests, and the band changed musical direction with the addition of Christian Frappier, Jeff Gill and Rich Greenspoon. Rare Air's music became more jazz-oriented and it was soon tagged with the &quot;jazz fusion&quot; label.\nAfter the last album, Space Piper, the group disbanded.\n\nPrimeval\nThe entertaining thing about this album is that you can shove it into any number of niches -- Celtic, modern Irish, folk, jazz, new age, soft rock, you name it. There's no drum kit to be found, that's for sure, but there's any number of other percussion instruments -- on the other hand, percussionist Trevor Ferrier is also the lead vocalist. On yet another hand, they don't actually have lyrics -- it's vocalese, using the voice as an instrument. The Celtic and jazz influences predominate, to the point that they cover Roland Kirk's &quot;Volunteer Slavery&quot; with bagpipes playing the sax lines -- the insane thing is that this works somehow. From the opening &quot;Fourth World Reel&quot; to the closing &quot;Dreaming of the Other Side,&quot; this is an unusual, entertaining, and friendly album that throws a lot of elements into a listenable stew of influences. It's a good guess that they had a good time playing it; you'll had a good time listening. ~ Steven McDonald\n\nRecorded at Comfort Sound Studios, Toronto, Canada in the Fall of 1988.\n\nPersonnel: Grier Coppins (vocals, whistling, bagpipe, keyboards, percussion); Dick Murai (vocals, electric guitar, electric bass); Patrick O'Gorman (vocals, wooden flute, bagpipe); Trevor Ferrier (vocals, snare drum, shaker, percussion, bells); Dave Hillier (guitar); Paul Cram (saxophone); Andrew St. George (percussion).\n\nAudio Mixer: Andrew St. George.\n\nRecording information: Comfort Sound Studios, Toronto, Canada (1988); Comfort Studios, Toronto, Canada (1988).\n\nPhotographers: Mike Foster; Michael Foster.\n\nUnknown Contributor Role: Grier Coppins.\n\nArrangers: Trevor Ferrier; Dick Murai; Rare Air.\n\nRare Air: Dick Murai (vocals, guitar, bass); Patrick O' Gorman (vocals, bagpipes, flutes); Grier Coppins (vocals, keyboards, bagpipes, whistles, percussion); Trevor Ferrier (vocals, drums, percussion).\n\nAdditional personnel: Dave Hillier (guitar); Paul Cram (saxophone); Andrew St. George (percussion).\n\nSpace Piper\n\nArtist: Rare Air\n\nTitle: Space Piper\n\nDate: 1991\n\nLabel: Green Linnet Records   GLCD 1115\n\nPainting: Dave Scott \n\nPhotography: Michael Foster\n\n \n\nNotes:  OK folks, here we have a disc that was recorded in Toronto by four fellows with a hankering for wind blown music. I picked it up for the cover painting, but to my surprise it is actually full of wonderful music. Not quite progressive rock, not traditional bagpipe songs, but somehow a clever mixing of sounds and cultures produces a very listenable collection of songs. The cover art of a lone (space) piper is one of song and story.\n\n \n\nLine Up:\n\nPatrick O'Gorman: highland bagpipes, wooden flutes, whistles, wordspace\nGrier Coppins: highland bagpipes, whistles, bombarde, keyboards\nChristian Frappier: furlanetto six-string bass, bass, keyboards, vocals\nRichard Greenspoon: drums, percussion, vocal\n \n\nTrack Listing\n\nTreebranch\nMammoth No Arms\nAstral Jig\nSnake MacMurray\nLa Marche De Tintin to India\nC'est Fou, C'est Toi, C'est Tout\nMadhouse\nDeath of a Space Piper\n\n\nHere's a few notes contributed by Jeffery Gill:\n\n\nI played guitar on that CD and was actually the fifth member. I left Rare Air just prior to the recording of Space Piper to pursue a career in aviation (although I went on the road with them a few more times, as well as playing on the recording). Thus my writing credits did not make it on the back of the CD. \n\nRare Air started in the late seventies as Na Cabarfeidh. At that time, they were strictly a celtic folk music group. They were lead by Grier Coppins and Pat O'Gorman, whom more or less, were prodigies of the Highland Bagpipes and an array of other 'traditional instruments'. Soon they became quite popular and were touring the world. They released one album under that name and the following five under their new name Rare Air. \n\nRare Air were relatively big in the Southern States, especially North\nCarolina. In 1989, two of the original members left the band. I was acquainted with Pat and Grier, as I lead Grier's wife, Sara Craig's band. Moreover, I was all over Toronto during that time playing with everyone. They called me, we played together and I joined. I soon called my friend Rich Greenspoon, a well known jazz drummer and he joined. Christian Frappier was a young jazz player, fresh out of Berkley, actively looking for work in Toronto.\n\nWe were on the road for two years and had a great time. We played every type of venue you could think of from Jazz festivals to Universities.\n\nRare Air is no more. They dissolved the year after this CD was released.\n\nI'm now a captain of a transport aircraft in the frozen Canadian north. Grier has a band in Toronto called Taxi Chain and owns a well known bar. Rich produces music and gigs steadily in Toronto. Christian is in Montreal playing with 'the who's who' of French Canadian music and Pat still tours the USA and Canada. The artist, David Scott, lives in Toronto and paints. He has his most recent work hanging at the Becket Gallery in Toronto.\n\nHere's a link to their work via the Pop Encyclopedia: &lt;a href=&quot; http://www.canoe.ca/JamMusicPopEncycloPagesR/rare_air.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.canoe.ca/JamMusicPopEncycloPagesR/rare_air.html&lt;/a&gt;\n\nAnd here's bit more info provided by Doug McClement:\n\nThe Space Piper album was recorded at Comfort Sound in Toronto. I owned the studio at that time. I engineered the &quot;Na Caberfaidh&quot; album and the first Rare Air album. I believe Space Piper was engineered by Andrew St. George,during midnight till dawn sessions. Band leader Grier Coppins met his wife, Sara Craig at the studio, where she was an apprentice engineer at the time. She went on to do several solo albums that were reasonably successful in Canada, sounding a bit like Kate Bush.","torrent":{"xt":"urn:btih:eb6cecdedfd1f27d5367f84bfbd7082c306dfb3d","amp;dn":"Rare+Air%3A+Primeval%3B+Space+Piper","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb6cecdedfd1f27d5367f84bfbd7082c306dfb3d","infoHashBuffer":{"type":"Buffer","data":[235,108,236,222,223,209,242,125,83,103,248,75,251,215,8,44,48,109,251,61]},"announce":[],"urlList":[]}}