{"title":"TVO - The Agenda with Steve Paikin - October 19, 2009: Quantum t","uid":5131230,"size":108444802,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:eb896b715932e58181a3593af89e9f8e908a2ff4&amp;dn=TVO+-+The+Agenda+with+Steve+Paikin+-+October+19%2C+2009%3A+Quantum+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Temptation","files":1,"time":1256107603,"description":"[b]TVO - The Agenda with Steve Paikin - October 19, 2009: Quantum to Cosmos (Q2C) Festival - Are We Bound For Space?[/b]\n\n[u]The Debate: Are We Bound For Space?[/u]\n\nApril 12, 1961: Yuri Gagarin becomes the first person to leave earth and travel into space. But in the near half-century since that day, only 500 others have taken that special voyage. Is that now about to change? Do problems here on earth mean we should start thinking about a new home in outer space? \n\n[u]Guests:[/u]\n\n[b]Chris Hadfield[/b] is a Canadian astronaut, engineer, and pilot. He has made two space flights--one in 1995 and one in 2001--and he is currently training for a future stay on the International Space Station.\n\n[b]Chris McKay[/b] is a planetary scientist with the Space Science Division of NASA Ames. His research focuses on the evolution of the solar system and the origin of life. He is playing a significant role in the planning of the MSL mission for 2011 and is also the deputy program scientist for Constellation--the NASA program for future human exploration of the Moon and Mars.\n\n[b]Bob Richards[/b] is the founder and CEO of Odyssey Moon Ltd., a commercial lunar enterprise based in the Isle of Man, and the first official registrant in the $30M Google Lunar X Prize competition. He is also the Director of Space Technology at Optech Incorporated of Canada, where he presided over the first commercial lidar scanner flown in space.\n\n[b]Donna Shirley[/b] is a former manager of Mars Exploration at the NASA Jet Propulsion Laboratory, and the author of the book Managing Martians. She managed the team that built Sojourner, the Microrover, which was landed by the highly successful Mars Pathfinder project on the surface of Mars in 1997.\n\n[b]Lawrence Krauss[/b] is an internationally known theoretical physicist and author of several bestselling books including The Physics of Star Trek. His research interests include the interface between elementary particle physics and cosmology. He writes regularly for various newspapers and magazines, and appears frequently on radio and television.\n\n[b]Karl Schroeder[/b] is a science fiction author of several popular books, including, The Sunless Countries: Book Four of Virga. He also consults in the area of Strategic Foresight (technology foresight, chiefly in scenario design).\n\nFor more information on this episode, including information on the guests and various other resources and links, visit the [url=http://www.tvo.org/cfmx/tvoorg/theagenda/index.cfm?page_id=7&amp;bpn=104104&amp;ts=2009-10-19%2020:00:00.0]episode webpage[/url]\n\n-----\n\nNote:  This is an iPod video podcast that is available for free download from the website.  Quality is good.  Audio podcasts (mp3 format) are also available for free download for the individual segments.    \n\nType: mp4 file\nSize: 103MB\nRuntime: 00:52:18\nVideo: MPEG4 Video (H264) 320x240 \nAudio: AAC 32000Hz mono 48Kbps \n\nDownload this episode using the attached torrent file or download it directly using this link: &lt;a href=&quot;\nhttp://feeds.tvo.org/~r/tvo/TxZN/~5/Gf8CVxIMxjA/TAWSP_Dbt_20091019_104104_0_320x240_304k.mp4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://feeds.tvo.org/~r/tvo/TxZN/~5/Gf8CVxIMxjA/TAWSP_Dbt_20091019_104104_0_320x240_304k.mp4&lt;/a&gt;\n\nYou can also watch a flash video of this episode through your web-browser here: &lt;a href=&quot;\nhttp://www.tvo.org/cfmx/tvoorg/theagenda/index.cfm?page_id=7&amp;bpn=104104&amp;ts=2009-10-19%2020:00:00.0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tvo.org/cfmx/tvoorg/theagenda/index.cfm?page_id=7&amp;bpn=104104&amp;ts=2009-10-19%2020:00:00.0&lt;/a&gt;\n\n-----\n\n[b]Quantum to Cosmos: Ideas for the Future (Q2C)[/b]\n\nFOR 10 EXCITING DAYS THIS OCTOBER, [url=http://www.qtocfestival.com/]Perimeter Institute's Quantum to Cosmos: Ideas for the Future (Q2C)[/url] will take a global audience from the strange world of subatomic particles to the outer frontiers of the universe. All events will occur on-site in Waterloo, Ontario and online at [url=http://www.qtocfestival.com/]q2cfestival.com[/url] and TVO.org.\n\nQ2C's extensive program features more than 50 events - including panel discussions, keynote presentations, special screenings, exhibits including the full-scale model of the next Mars Rover (named Curiosity), and recorded sessions with Honorary Festival President Professor Stephen Hawking.\n\nQ2C will transcend traditional festivals by streaming events live and on demand, offering virtual interaction with exhibits, and providing special opportunities for students and teachers.\n\n[b]THE AGENDA WITH STEVE PAIKIN[/b] will be broadcasting live for 5 nights from Perimeter Institute in Waterloo. The themes that The Agenda is planning to explore in these programs include:\n\n\n* Monday, October 19 Ã‚Â» Plan B: Colonize Space?\n  Stephen Hawking thinks it's a good idea, given the multiple problems facing earth. Can we imagine a human future off earth?\n\n* Tuesday, October 20 Ã‚Â» Does/Does Not Compute\nSo you think technology controls your life now? From nanotechnology to quantum computing, what the future has in store.    \n\n* Wednesday, October 21 Ã‚Â» Designer Genetics\nThe legal, social, and medical implications of trying to engineer humans without defects.    \n\n* Thursday, October 22 Ã‚Â» Robotics\nArtificial Intelligence, evolution, and the man/machine interface.    \n\n* Friday, October 23 Ã‚Â» The Importance of Science\nDo we still believe that science is the path to progress and a better life?\n\n\nFOR ADDITIONAL INFORMATION on Q2C festival events, programs, speakers, and tickets, go to their [url=http://www.qtocfestival.com/]website.[/url]\n\n[b]Resources and links to related material[/b]\n\nTVO's Quantum to Cosmos (Q2C) Festival webpage: http://www.tvo.org/TVOsites/WebObjects/TvoMicrosite.woa?scientific_literacy\n\nWatch video on demand of lectures from all Q2C sessions: http://www.tvo.org/cfmx/tvoorg/literacy/index.cfm?page_id=616&amp;action=blog&amp;blog_id=484\n\n-----\n\n[b]TVO - The Agenda with Steve Paikin[/b]\n\n[i]The Agenda with Steve Paikin[/i] is TVO's flagship current affairs program - devoted to exploring the social, political, cultural and economic issues that are changing our world, at home and abroad. The Agenda airs weeknights at 8:00 PM EST on TVO - Canada's largest educational broadcaster.\n\nTVO's [i]The Agenda with Steve Paikin[/i] website:  [url]http://www.tvo.org/agenda/[/url]","torrent":{"xt":"urn:btih:eb896b715932e58181a3593af89e9f8e908a2ff4","amp;dn":"TVO+-+The+Agenda+with+Steve+Paikin+-+October+19%2C+2009%3A+Quantum+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb896b715932e58181a3593af89e9f8e908a2ff4","infoHashBuffer":{"type":"Buffer","data":[235,137,107,113,89,50,229,129,129,163,89,58,248,158,159,142,144,138,47,244]},"announce":[],"urlList":[]}}