{"title":"Hi-De-Hi Series 3 &amp; 4 DVDRip","uid":5565071,"size":4007425377,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ec55b352cd3c00f2acaad967e7be302b5f834fff&amp;dn=Hi-De-Hi+Series+3+%26+4+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shogun55","files":15,"time":1273955388,"description":"TV : Comedy : DVD quality : English\nTV : Comedy : DVD quality : English\nHi-de-Hi! is a British sitcom that aired on BBC1 from 1980 to 1988. Set in a 1950s holiday camp, it was written by Jimmy Perry and David Croft, who had previously written Dad's Army and It Ain't Half Hot Mum. The title was the phrase used to greet the campers at events, and in early episodes was written Hi de Hi. \n\nThe inspiration for the series was drawn from the real-life experiences of writers Perry and Croft. After being demobilised from the Army, Perry had spent his holidays as a Redcoat at Butlins. During its nine-year run, the series gained large audience figures and won a BAFTA as Best Comedy Series in 1984. In 2004, it came 40th in Britain's Best Sitcom and in a 2008 poll on Channel 4, &quot;Hi-de-Hi!&quot; was voted the 35th most popular comedy catchphrase. \n\nHi-de-Hi! is set in Maplins, a holiday camp owned by entrepreneur, Joe Maplin, in the fictional seaside town of Crimpton-on-Sea, Essex, which is loosely based on Butlins, the real-life holiday camp empire of Billy Butlin, with his Redcoats replaced with Yellowcoats. In 1959, a Cambridge University archaeology professor, Jeffrey Fairbrother, tires of his life in academia and applies to become the entertainment manager of the holiday camp, a position that he duly achieves. This annoys the portly camp entertainer, Ted Bovis, who wants the job. In the pilot episode, Fairbrother discovers he is not really suited to his new job, but after an elderly couple, who have not had a happy life, approach him at the end to thank him for a lovely time, he decides to stay on. Joe Maplin himself is never seen. \n\nMost episodes involve Ted Bovis and his dimwitted but kind-hearted sidekick Spike Dixon attempting to scam the well-meaning Fairbrother, who also has to avoid the romantic approaches of sharp-tongued senior Yellowcoat and sports organiser, Gladys Pugh, from the Rhondda Valley, as he is currently divorcing his wife. Fairbrother left Maplin's after the 1959 season and is replaced by Clive Dempster, to whom Gladys turns her attentions for the 1960 season (from series 6). They eventually marry. \n\nMost of the characters in the show were out-of-work actors and entertainers awaiting the elusive &quot;big break&quot;. \n\nOther characters include: Peggy Ollerenshaw, the chalet maid and wannabe Yellowcoat; Barry and Yvonne Stuart-Hargreaves, a pair of snobbish dance instructors; jockey Fred Quilly; various leggy Yellowcoat girls; and alcoholic, child-hating Punch and Judy man, Mr Partridge, who was played by Leslie Dwyer. By the time the BBC began filming the sixth series, Dwyer's health was already deteriorating and Dwyer filmed most of his scenes over the space of three days. When it was decided his ill-health would mean Dwyer would not be able to fulfil his obligations to the show, the last episode was changed and the &quot;Who Killed Mr Partridge?&quot; story line was written. The two episodes involved in the storyline were among the most watched episodes. Dwyer died 18 months later. \nWell as promised, I'm re-releasing all series of this superb comedy, ripped from DVD &amp; converted to DIVx for your viewing pleasure, all thanx go to Delgado for his superb knowledge in ripping &amp; encoding, and thus any complaints can go in that direction... \nenjoy &amp; a thankyou or any other comments are always appreciated. ","torrent":{"xt":"urn:btih:ec55b352cd3c00f2acaad967e7be302b5f834fff","amp;dn":"Hi-De-Hi+Series+3+%26+4+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec55b352cd3c00f2acaad967e7be302b5f834fff","infoHashBuffer":{"type":"Buffer","data":[236,85,179,82,205,60,0,242,172,170,217,103,231,190,48,43,95,131,79,255]},"announce":[],"urlList":[]}}