{"title":"INXS - The One Thing (Live)","uid":5064786,"size":129550340,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ecf7f6a0e13de9177fee7e4dc6be759bf6741f54&amp;dn=INXS+-+The+One+Thing+%28Live%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"2nafish","files":-1,"time":1250933441,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;The One Thing&quot; is the first single from the INXS album Shabooh Shoobah.\n\nShabooh Shoobah was released in the United States in February 1983 and peaked at number 46 on the Billboard 200 album chart. &quot;The One Thing&quot; brought INXS their first Top 40 hit in the US, reaching number 30 on the Billboard Hot 100 in May 1983. It was a big hit on album-oriented rock radio, reaching number 2 on the Billboard Top Tracks chart, and was also a top 20 hit in Canada.\n\n&quot;The One Thing&quot; is notably featured in Grand Theft Auto: Vice City Stories on the fictional radio station Flash FM.\n\nINXS (pronounced &quot;in excess&quot;) is an Australian rock band, formed as The Farriss Brothers in 1977 in Sydney. Mainstays are Garry Gary Beers on bass, Andrew Farriss on keyboards, Jon Farriss on drums, Tim Farriss on lead guitar and Kirk Pengilly on guitar/sax. For twenty years, they were fronted by Michael Hutchence on lead vocals, whose &quot;sultry good looks&quot; and magnetic stage presence made him the focal point of the band. Initially known for their New Wave/ska/pop style, they later developed a harder pub rock style, including funk and dance elements.\n\nINXS achieved international success with a series of hit recordings through the 1980s and 1990s, including the albums Listen Like Thieves, Kick, X and Welcome to Wherever You Are and the singles &quot;Original Sin&quot;, &quot;Need You Tonight&quot;, &quot;Devil Inside&quot; and &quot;New Sensation&quot;.\n\nHutchence died in 1997 and INXS did not perform publicly for a year,. The band made appearances with several guest singers including Jimmy Barnes, Terence Trent D'Arby, and Jon Stevens; Stevens formally joined the band for a tour and recording session in 2002.\n\nIn 2005, members of INXS participated in a reality television series, broadcast worldwide, culminating in the selection of their new lead singer, Canadian J. D. Fortune, and the release of &quot;Pretty Vegas&quot; and &quot;Afterglow&quot; as singles, and its album Switch.\n\nINXS has won six Australian Recording Industry Association awards including three for 'Best Group' in 1987, 1989 and 1992, and was inducted into the ARIA Hall of Fame in 2001. To date INXS have sold more than 30 million records.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ecf7f6a0e13de9177fee7e4dc6be759bf6741f54","amp;dn":"INXS+-+The+One+Thing+%28Live%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecf7f6a0e13de9177fee7e4dc6be759bf6741f54","infoHashBuffer":{"type":"Buffer","data":[236,247,246,160,225,61,233,23,127,238,126,77,198,190,117,155,246,116,31,84]},"announce":[],"urlList":[]}}