{"title":"WinAbility.MySecretFolder.v4.34-YAG","uid":5058033,"size":1423419,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ed15c676aae77cbd2351dfe5fbe5831088db2b78&amp;dn=WinAbility.MySecretFolder.v4.34-YAG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"[HB]","files":-1,"time":1250526174,"description":"TEAM YAG presents:\n                      WinAbility MySecretFolder v4.34\n\n\nRelease-Date: 2009-08-15\nProgram Typ : folder guard\nURL         : http://www.winability.com\n\nDescription: MySecretFolder is a software utility that you can use\nto hide your private folder from other users, hide it so that no one \nwill even suspect that your secret folder exists! Yet the folder \nwould be easily accessible to you, when you need it: just press the \nhot key,enter your password, and it will open in a window, just like \na regular Windows folder. While the folder is unprotected, you can \nwork with the files and documents it contains, just like with any \nother folder you have. When you are done, enter your password, and \nthe folder will disappear again, until you need it next time.\n\nMySecretFolder offers many ways of customizing its operation to suit your preferences:\n\n* You can enable the stealth mode of operation to prevent other users from detecting the presence of MySecretFolder on your computer;\n\n* You can set up a hot key to run the commands of MySecretFolder and quickly protect or unprotect your secret folder.\n\n* You can configure MySecretFolder to display a taskbar icon for quick access to your secret folder, as well as as to serve as an indicator of the status of its protection.\n\nRelease-Notes:\n==============\n\n\nMySecretFolder lets you hide or protect with password your personal\nfolder with private files and documents. Other users of your computer\nwill not be able to see or open the folder without knowing your\npassword. MySecretFolder can protect your files on both the NTFS\nan FAT/FAT32 disks. It supports the stealth mode of operation, the hot\nkey activation, and more.\n\n\nInstall-Notes:\n==============\n\nInstall as trial and import .reg\n\n","torrent":{"xt":"urn:btih:ed15c676aae77cbd2351dfe5fbe5831088db2b78","amp;dn":"WinAbility.MySecretFolder.v4.34-YAG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed15c676aae77cbd2351dfe5fbe5831088db2b78","infoHashBuffer":{"type":"Buffer","data":[237,21,198,118,170,231,124,189,35,81,223,229,251,229,131,16,136,219,43,120]},"announce":[],"urlList":[]}}