{"title":"WET [MULTI5][XBOX360][DEMO][gamerguuy]","uid":5071636,"size":662425600,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:ed36e3ce9db845ad2ad17e4df9ca79e92c149ee1&amp;dn=WET+%5BMULTI5%5D%5BXBOX360%5D%5BDEMO%5D%5Bgamerguuy%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gamerguuy","files":-1,"time":1251458563,"description":"Category: XBOX360\nLanguage: EspaÃƒÂ±ol,English,French,Italian,German\nType:Action\nFormat: RAR\nSize: 631.74 MB\nDate: 28-08-2009\n\nWhen Ruby Malone, a holster for pay, agrees to help a rich man in a bind finding and returning to his troubled son, believes the work will be a cinch. Nothing is further from the truth. The issue ends up being more complicated than expected and the man who hired her is not who appears to be. Rubi leaves behind a huge trail of corpses in their wake, fly, and once, looking for the man who betrayed her. \nWET is an action game in the third person with an elegant design that perfectly combines shooting, sword fighting and causing a sensational acrobatics fantastic action-packed interactive experience. The game allows you to shoot at any time, anywhere. You will have the ability to shoot while running, you glide through stairs or on the floor, or perform acrobatics. Contains an ironic mix of humor and violence, a unique approach to retro movie and a soundtrack inspired by the '70s.\nFeatures: \nÃ‚Â· Three game types: blends together three game types: mechanical movement aiming at 360 degrees, sword fighting and acrobatic skills. \nÃ‚Â· Laureate writer Duppy Demitrius: written by Demitrius known for his work on the TV series Action 24. \nÃ‚Â· Interactive action experience fantastic: stunning acrobatics with constant action. \nÃ‚Â· Style cinema: film style exclusive retro, sleek cone design characters and a soundtrack inspired by the 70s, plus scenarios over three continents.","torrent":{"xt":"urn:btih:ed36e3ce9db845ad2ad17e4df9ca79e92c149ee1","amp;dn":"WET+%5BMULTI5%5D%5BXBOX360%5D%5BDEMO%5D%5Bgamerguuy%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed36e3ce9db845ad2ad17e4df9ca79e92c149ee1","infoHashBuffer":{"type":"Buffer","data":[237,54,227,206,157,184,69,173,42,209,126,77,249,202,121,233,44,20,158,225]},"announce":[],"urlList":[]}}