{"title":"Mini Ninjas [PCISO][ojuegos.eu]","uid":5084207,"size":5629539086,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ed3d00df63e24f7149c44c673168940d4480413a&amp;dn=Mini+Ninjas+%5BPCISO%5D%5Bojuegos.eu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Morck22","files":59,"time":1252590188,"description":"PrepÃƒÂ¡rate para vivir una aventura ninja como nunca antes la habÃƒÂ­as visto. AcompaÃƒÂ±a a Hiro, el hÃƒÂ©roe mÃƒÂ¡s pequeÃƒÂ±o del mundo en su gran aventura ÃƒÂ©pica, y embÃƒÂ¡rcate en una emocionante cruzada, destinada a restaurar la armonÃƒÂ­a a un mundo que se encuentra al borde del caos.\nUtiliza tus habilidades y poderes Ninja para luchar contra el ejÃƒÂ©rcito mÃƒÂ¡gico del malvado Samurai. Aplica el poder de tu magia Kuji y aprovecha las habilidades especiales de tus amigos Mini Ninjas, a medida que te sumerges en peligrosos mundos para culminar la lucha final contra el malvado SeÃƒÂ±or de la Guerra Samurai en su Fortaleza de PerdiciÃƒÂ³n.\n\nCuando el Malvado SeÃƒÂ±or de la Guerra Samurai, con la ayuda de una antigua magia, convierte a los animales del bosque en un ejÃƒÂ©rcito infernal en pos de la dominaciÃƒÂ³n del mundo, Hiro debe liderar su pequeÃƒÂ±o pandilla de Ninjas hacia una fascinante aventura a travÃƒÂ©s de un mundo desintegrado, para luchar contra las hordas mÃƒÂ¡gicas del retorcido Samurai hasta enfrentarse al SeÃƒÂ±or de la Guerra y su Fortaleza de la Muerte.\nTodo comienza con los planes para apoderarse del mundo del Malvado SeÃƒÂ±or de la Guerra Samurai. Una vez mÃƒÂ¡s ha comenzado a utilizar el antiguo arte de la Magia Kuji para convertir a los inocentes animales del bosque en obedientes guerreros Samurai centrados en su causa. Tras conseguir juntar un ejÃƒÂ©rcito de estos soldados, los envÃƒÂ­a a conquistar los castillos como punto de partida para aterrorizar a todo los territorios circundantes.\nSu plan es brillante. Infalible. Bueno... excepto por un pequeÃƒÂ±o y casi insignificante detalle... Al utilizar la Magia Kuji de tal forma, el SeÃƒÂ±or de la Guerra ha cambiado el equilibrio de la naturaleza y despertado la ira de los dioses con la tierra, que se apreciarÃƒÂ¡ en forma de devastadoras tormentas. Inundaciones, terremotos, ventiscas amenazan con acabar con el mundo. Cuando mÃƒÂ¡s crecen sus ejÃƒÂ©rcitos peores tormentas se desatan.\nEn el lugar mÃƒÂ¡s alejado del Imperio, el Maestro Ninja aguarda en los acantilados de la MontaÃƒÂ±a Ninja. Echando un vistazo contempla como todo estÃƒÂ¡n sucediendo cosas extraÃƒÂ±as, sabe que el equilibrio de la naturaleza sido desestabilizado, pero Ã‚Â¿por quÃƒÂ©? No sabe, todavÃƒÂ­a, que su vieja pesadilla del pasado ha vuelto, pero al menos sabe que su juramento de proteger el equilibrio de la naturaleza debe ser retomado.\nHa tomado una decisiÃƒÂ³n. El Maestro Ninja escoge a su Ninja mÃƒÂ¡s hÃƒÂ¡bil para enviarlo en una aventura para descubrir el origen de las tormentas. El tiempo pasa pero no hay noticias del Ninja. Una vez mÃƒÂ¡s, el Maestro Ninja escoge a otro de sus mejores Ninja, pero de nuevo no regresa. AsÃƒÂ­, uno y otra vez se ve obligado a enviar a sus pupilos a una misiÃƒÂ³n de la que no acaban regresando.\nAl final, sÃƒÂ³lo quedan dos Ninjas en el pueblo, y son los ÃƒÂºltimos que habrÃƒÂ­a elegido para vivir esta peligrosa aventura. Hiro, el mÃƒÂ¡s joven de todos los Ninjas y su mejor amigo Futo, el mÃƒÂ¡s grande y lento... Hiro ni siquiera ha podido completar su fase de entrenamiento, pero la urgencia es vital. El Maestro Ninja sabe que debe prepararlos rÃƒÂ¡pidamente. Se embarcarÃƒÂ¡n en un viaje que les llevarÃƒÂ¡ al corazÃƒÂ³n de este misterio... para encontrar a sus amigos perdidos... y enfrentarse con el Malvado SeÃƒÂ±or de la Guerra en su Fortaleza de la Muerte...\n\nCaracterÃƒÂ­sticas:\nÃ‚Â· FrenÃƒÂ©tica acciÃƒÂ³n Ninja en un viaje ÃƒÂ©pico.\nÃ‚Â· Jugar en el papel de unos singulares Mini Ninjas con autÃƒÂ©nticas armas ninja, golpes especiales y poderosos hechizos.\nÃ‚Â· Utiliza tu gorro de Ninja como escudo o como barca.\nÃ‚Â· Enormes jefes finales.\nÃ‚Â· Un estilo grÃƒÂ¡fico distinto, original y muy bello.\nÃ‚Â· No se mata: los enemigos abatidos recuperan sus inocentes formas animales.\nÃ‚Â· Toma el control del juego. Realiza un hechizo para controlar a los animales y a los enemigos, muy ÃƒÂºtiles para realizar labores de rastreo, combate y para encontrar elementos coleccionables.\nÃ‚Â· Juega como uno de los 6 personajes Ninjas, con poderes y personalidades completamente diferentes.\nÃ‚Â· Explora y descubre los perdidos hechizos de la Magia Kuji para ayudarte a acabar con el Malvado Samurai.","torrent":{"xt":"urn:btih:ed3d00df63e24f7149c44c673168940d4480413a","amp;dn":"Mini+Ninjas+%5BPCISO%5D%5Bojuegos.eu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed3d00df63e24f7149c44c673168940d4480413a","infoHashBuffer":{"type":"Buffer","data":[237,61,0,223,99,226,79,113,73,196,76,103,49,104,148,13,68,128,65,58]},"announce":[],"urlList":[]}}