{"title":"The Tudors S04E06 720p HDTV X264-DIMENSION","uid":5586909,"size":1172387028,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:ee29fb1388a2df09da6c441553d32229e09d4124&amp;dn=The+Tudors+S04E06+720p+HDTV+X264-DIMENSION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"CHD242522","files":-1,"time":1274726751,"description":"The Tudors is a joint Irish/Canadian-produced historical fiction television series created by Michael Hirst. The series is based upon the reign of English monarch Henry VIII, and is named after the Tudor dynasty. The series is produced by Peace Arch Entertainment for Showtime in association with Reveille Productions, Working Title Films, and the Canadian Broadcasting Corporation, and is filmed in Ireland. The first two episodes debuted on DirecTV, Time Warner Cable OnDemand, Netflix, Verizon FiOS On Demand, Internet Movie Database and on the series' website before the official series premiere on Showtime. The Tudors' premiere on 1 April 2007 was the highest rated Showtime series in three years. In April 2007, the show was renewed for a second season, and in that month the BBC announced it had acquired exclusive United Kingdom broadcast rights for the series, which began airing there on 5 October 2007. Canada's CBC began broadcasting the show on 2 October 2007. Season Two debuted on Showtime on 30 March 2008, and on BBC 2 on 1 August 2008. Production on Season Three began on 16 June 2008 in Bray, County Wicklow Ireland, and that season premiered on Showtime on 5 April 2009. ","torrent":{"xt":"urn:btih:ee29fb1388a2df09da6c441553d32229e09d4124","amp;dn":"The+Tudors+S04E06+720p+HDTV+X264-DIMENSION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee29fb1388a2df09da6c441553d32229e09d4124","infoHashBuffer":{"type":"Buffer","data":[238,41,251,19,136,162,223,9,218,108,68,21,83,211,34,41,224,157,65,36]},"announce":[],"urlList":[]}}