{"title":"Los Abrazos Rotos DVDRip Spanish 2009","uid":5069706,"size":1463739558,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ee5a73684a263cd1f91d6f4979d7747cf1d84b46&amp;dn=Los+Abrazos+Rotos+DVDRip+Spanish+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":3,"time":1251291715,"description":"Un hombre escribe, vive y ama en la oscuridad. Catorce aÃƒÂ±os antes sufriÃƒÂ³ un brutal accidente de coche, donde no sÃƒÂ³lo perdiÃƒÂ³ la vista sino que tambiÃƒÂ©n muriÃƒÂ³ Lena (PenÃƒÂ©lope Cruz), la mujer de su vida. Este hombre tiene dos nombres, Harry Caine (LluÃƒÂ­s Homar), lÃƒÂºdico seudÃƒÂ³nimo bajo el que firma sus trabajos literarios, relatos y guiones, y Mateo Blanco, su nombre de pila real, con el que vive y firma las pelÃƒÂ­culas que dirige. DespuÃƒÂ©s del accidente, Mateo Blanco se convierte en su seudÃƒÂ³nimo, Harry Caine. Si ya no puede dirigir pelÃƒÂ­culas, prefiere sobrevivir con la idea de que Mateo Blanco ha muerto con Lena en el accidente. En la actualidad, Harry Caine vive gracias a los guiones que escribe y a la ayuda de su antigua y fiel directora de producciÃƒÂ³n, Judit GarcÃƒÂ­a (Blanca Portillo), y de Diego (Tamar Novas), el hijo de ÃƒÂ©sta, secretario, mecanÃƒÂ³grafo y lazarillo. Desde que decidiera vivir y contar historias, Harry es un ciego muy activo y atractivo que ha desarrollado todos sus otros sentidos para disfrutar de la vida, a base de ironÃƒÂ­a y una amnesia autoinducida, autoimpuesta serÃƒÂ­a mÃƒÂ¡s exacto. Ha borrado de su biografÃƒÂ­a todo lo ocurrido catorce aÃƒÂ±os antes. No vuelve a hablar de ello, ni a hacer preguntas; el mundo se olvidÃƒÂ³ pronto de Mateo Blanco y ÃƒÂ©l es el primero en no querer resucitarlo. Pero, una noche, Diego tiene un accidente y Harry se hace cargo de ÃƒÂ©l. En las largas noches en que Harry cuida del chico (su madre, Judit, estÃƒÂ¡ fuera de Madrid y deciden no comunicarle nada para no alarmarla) le cuenta la fÃƒÂ¡bula de su propia historia, para entretenerle, como un padre le cuenta un cuento a un hijo pequeÃƒÂ±o para que se duerma.","torrent":{"xt":"urn:btih:ee5a73684a263cd1f91d6f4979d7747cf1d84b46","amp;dn":"Los+Abrazos+Rotos+DVDRip+Spanish+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee5a73684a263cd1f91d6f4979d7747cf1d84b46","infoHashBuffer":{"type":"Buffer","data":[238,90,115,104,74,38,60,209,249,29,111,73,121,215,116,124,241,216,75,70]},"announce":[],"urlList":[]}}