{"title":"Product Key Explorer v2.2.4.0 Portable","uid":5070575,"size":3544636,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ee635c514b6f3fc854d92a3bfd42e7d86ff7a2a0&amp;dn=Product+Key+Explorer+v2.2.4.0+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoExcuses","files":3,"time":1251368588,"description":"NsaSoft Product Key Explorer v2.2.4.0 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and Crack are included.\n\n\nProduct Key Explorer - Find over 1000 popular software product keys instantly!\n\nProduct Key Explorer displays product key for Windows, MS Office, Adobe, SQL Server and more than 1000 popular software products installed on your local or remote network computers.\n\nIn order to install or reinstall Microsoft Office, Windows, or other commercial software, you must have access to a product serial key (CD Key) for that product. Product Key Explorer retrieves serial keys from network computers and allows to protect your company from having pirated software on your network. \n\nWith this software you will be able to track the number of software licenses installed in your business, find and recover a lost or forgotten product keys, save and keep an up-to-date backup of all your software license keys in a central location. Excellent tool for network administrators, or businesses undergoing a software license compliancy.\n\nYou can save product keys as Tab Delimited Txt File (.txt), Excel Workbook (.xls), CSV Comma Delimited (.csv), Access Database (.mdb), Web Page (.html) or XML Data (.xml) file, Print or Copy to Clipboard.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.nsauditor.com/product_key_finder.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nsauditor.com/product_key_finder.html&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis also has been built on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=34&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=34&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n\n\n","torrent":{"xt":"urn:btih:ee635c514b6f3fc854d92a3bfd42e7d86ff7a2a0","amp;dn":"Product+Key+Explorer+v2.2.4.0+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee635c514b6f3fc854d92a3bfd42e7d86ff7a2a0","infoHashBuffer":{"type":"Buffer","data":[238,99,92,81,75,111,63,200,84,217,42,59,253,66,231,216,111,247,162,160]},"announce":[],"urlList":[]}}