{"title":"Love_Thy_Neighbour season 1 classic tv","uid":5654974,"size":1413985766,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ee85aa7169a75513a73dcc8ad2b4161f66ea9b23&amp;dn=Love_Thy_Neighbour+season+1+classic+tv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bozo1234","files":9,"time":1277762660,"description":"for fast speeds and all other classic tv and uptodate tv shows  join xtremetv.org\n\n\n'Love Thy Neighbour' was a British sitcom which ran from 13 April 1972 to 19 February 1976, made by Thames Television for ITV. It starred Jack Smethurst, Rudolph Walker, Nina Baden-Semper and Kate Williams. There was later a movie spin-off, also entitled Love Thy Neighbour, and a brief sequel set in Australia.\n\nThe series (and movie) was created and largely written by Vince Powell and Harry Driver, and was based around a suburban white working class couple who unwittingly found themselves living next door to a black couple, and the white couple's attempts to come to terms with this.\n\nLove Thy Neighbour was hugely popular in the 1970s. During that era, Britain struggled to come to terms with its recently arrived population of black immigrants, and Love Thy Neighbour exemplified this struggle. It aroused great controversy for many of the same reasons as the earlier Till Death Us Do Part. The views of the white male character (Eddie Booth, played by Smethurst) were presented in such a way as to make him appear stupid and bigoted, and were contrasted with the more tolerant attitude of his wife. His use of terms such as nig-nog to refer to his black neighbour, despite being intended as ironic by the script-writers, attracted considerable criticism from viewers. The male black character was, in contrast educated and sophisticated, although stubborn and also capable of racism using the terms Honky, Snowflake, Paleface or Big White Chief to describe his white neighbour.\n\nThe first series was released on Region 2 DVD in October 2003. Series 2 followed in May 2004. The film version was released on DVD in 2004. In the original version of the pilot episode, which has never been screened, the role of Joan was played by Gwendolyn Watts. It is featured on the series one DVD.\n\nThe series has since been shown in the UK on satellite television with warnings about content at the start of each show.","torrent":{"xt":"urn:btih:ee85aa7169a75513a73dcc8ad2b4161f66ea9b23","amp;dn":"Love_Thy_Neighbour+season+1+classic+tv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee85aa7169a75513a73dcc8ad2b4161f66ea9b23","infoHashBuffer":{"type":"Buffer","data":[238,133,170,113,105,167,85,19,167,61,204,138,210,180,22,31,102,234,155,35]},"announce":[],"urlList":[]}}