{"title":"Peter Bruntnell...Ends Of The Earth(2003)[FLAC]","uid":5670264,"size":244486326,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ef49395cd6e8b8a6018bbce86546e7caf04ae177&amp;dn=Peter+Bruntnell...Ends+Of+The+Earth%282003%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"dickspic","files":15,"time":1278315045,"description":"released March 10 2003\nloose records VJCD139\nalternate cover\n\nPeter Bruntnell has been quietly building up a reputation as one of the country's most promising singer-songwriters, while sensibly manoeuvring his music away from the Britpop-tinged sound of early albums such as Cannibal and Camelot in Smithereens, towards the more understated alt.country tones of this album and its predecessor, the acclaimed Normal for Bridgwater.\n\nNormal for Bridgwater helped to establish Bruntnell in the American market which, given his melancholy country rock and weary, weather-beaten drawl, is surely his natural domain, a second home as familiar to him as Kingston upon Thames, where he grew up playing in pubs and hoping to emulate After the Goldrush. Not surprisingly, a keen sense of place underpins his songs, several of them dealing obliquely with the emotional displacement resulting from what might be considered substitute roots. &quot;Like coming from the wrong town/ Is sure to raise a frown/ Co-ordinates let you down&quot;, he observes in &quot;Laredo Kent&quot; (whose title may be an inverted pun on Paris, Texas); while &quot;Ends of the Earth&quot; employs long-haul travel as a metaphor for such longings, with lines such as &quot;Wishes nose about out there like airplanes on the ground&quot; evoking the frisson of freedom experienced in slipping between cultures, the open-ended possibilities afforded by peripatetic anonymity. &quot;City Star&quot; and &quot;Downtown&quot;, meanwhile, exhibit the ambivalence towards urban values that is country rock's fated position, simultaneously drawn by the good times and bright lights, but repelled by the wastefulness and frigid values.\n\nWith the young lead guitarist James Walbourne displaying an impressive picking style reminiscent of the late Clarence White, and Son Volt's Eric Heywood adding a glint of pedal steel guitar to some tracks, there's more than a hint of The Byrds about such songs as the venomous put-down &quot;Tabloid Reporter&quot; and especially the eco-anthem &quot;Rio Tinto&quot;, where jangly guitars underscore imagery of leaded clouds, blackened fields and stained riverbeds. Elsewhere, there's a more traditional country cast to &quot;One Drink Away&quot;, a classic barfly weepie about being left behind by love (&quot;I've got the heart, but I'm running out of time&quot;), and &quot;Murder in the Afternoon&quot;, an oddly dispassionate murder ballad set against a backdrop of lonely, plunking banjo, rain and bird noises, and the distant roll of thunder.\n\nPerhaps the best track, however, is the opener &quot;Here Come the Swells&quot;, in which an alienated loner is nettled by the cheeriness of passers-by: &quot;I don't eat now, I don't sleep, I don't need anyone telling me what's fun.&quot; A cutting exercise in offhand misanthropy, it's the kind of idiosyncratic song that places Peter Bruntnell alongside David Gray and Tom McRae in the pantheon of new Brit singer-songwriters. \n\n\n\n\n1 Here Come the Swells  4:53 \n2 City Star  3:57 \n3 Laredo Kent  2:20 \n4 Downtown  4:30 \n5 One Drink Away  2:52 \n6 Tabloid Reporter  2:51 \n7 Rio Tinto  3:56 \n8 Ends of the Earth  5:47 \n9 Black Aces  3:32 \n10 Murder in the Afternoon  3:50 \n\ncd ripped by dBpoweramp\n\nplease seed\n","torrent":{"xt":"urn:btih:ef49395cd6e8b8a6018bbce86546e7caf04ae177","amp;dn":"Peter+Bruntnell...Ends+Of+The+Earth%282003%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef49395cd6e8b8a6018bbce86546e7caf04ae177","infoHashBuffer":{"type":"Buffer","data":[239,73,57,92,214,232,184,166,1,139,188,232,101,70,231,202,240,74,225,119]},"announce":[],"urlList":[]}}