{"title":"The Agronomist.2003.Doucumentary by Jonathan Demme","uid":5570386,"size":1324417744,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ef73d65e9623d5dd5674224190818639dff46571&amp;dn=The+Agronomist.2003.Doucumentary+by+Jonathan+Demme&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"cwwpg","files":-1,"time":1274232782,"description":"The Agronomist is about Jean Leopold Dominique who hosted Radio Haiti-Inter, Haiti's first independent radio station. Jonathan Demme puts together this documentary with historical footage and interviews. The result is a serious recount of Haiti during its numerous regimes.\n\nRadio Haiti-Inter was Radio Haiti in 1960 and in 1969, it became Radio Haiti-Inter. It finally ended its broadcast three years after the assassination of Jean Dominique. His broadcasts were primarily for the struggle of democracy and he was able to capture the feelings of those who were poor and powerless.\n\nThe remarkable account of Jean Dominique and his radio hosting days is that his struggle was able to last as long as it lasted. While almost a majority of any repressive society would silence its critics, Radio Haiti-Inter wasn't silenced for decades. Even after his assassination, his wife and fellow journalist, MichÃƒÂ¨le Montas, tried to keep the radio broadcast going until it finally collapsed 3 years after his assassination.\n\nThe documentary starts with an interview where Jean Dominique recounts a day when he was able to broadcast gunfire outside Radio Haiti-Inter.\n\n__________________________________________________________\n\n\n","torrent":{"xt":"urn:btih:ef73d65e9623d5dd5674224190818639dff46571","amp;dn":"The+Agronomist.2003.Doucumentary+by+Jonathan+Demme","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef73d65e9623d5dd5674224190818639dff46571","infoHashBuffer":{"type":"Buffer","data":[239,115,214,94,150,35,213,221,86,116,34,65,144,129,134,57,223,244,101,113]},"announce":[],"urlList":[]}}