{"title":"Ben 10: Alien Force - Volume 2 (2008) DVDRip Eng Xvid AC3 AVI [B","uid":5127279,"size":958462063,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ef787a539748f3e360edf86414973dfe5480f180&amp;dn=Ben+10%3A+Alien+Force+-+Volume+2+%282008%29+DVDRip+Eng+Xvid+AC3+AVI+%5BB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Bigjazz.h33t","files":5,"time":1255744016,"description":"-------------------------------------------------------------------\n-------------------------------------------------------------------\n\nBen 10: Alien Force - Volume 2 [2008] DVDRip Eng Xvid AC3 AVI\n\nTitle:\t\tBen 10: Alien Force\nRelease:\t2008\nSeason:\t\tVolume 2, Season 1, Episodes 6-9\nRuntime:\t~22 mins\n\nEncoding\n\nVideo;\nResolution:\t576x432\nBitrate:\t~1224kbps @ 25fps\nCodec:\t\tXvid, v1.2.2\nFormat:\t\tAudio Video Interleave (.avi)\n\nAudio;\nTrack 1:\t2.0 Channel AC3 @ 224kbps\n\nFile Size:\t~225MB\n\nSubtitles:\tNone\n\nSource:\t\tPAL DVD, Region 4\n\nCast:\nYuri Lowenthal ...  Ben Tennyson\nGreg Cipes ...  Kevin Levin \nAshley Johnson ...  Gwen Tennyson\nDee Bradley Baker ...  Chromastone\n\nBen 10: Alien FOrce - Volume 2\n\n106 - Max Out\nGwen's older brother, Ken, is missing and Gwen asks for Ben and Kevin's help to find him. In their search, the gang stumbles upon a Highbreed base that manufactures Xenocytes: facehugger-like parasites that mutate humans into DNAliens. Ken has been infected by one of the Xenocytes, but Ben is able to remove it with the help of the now-talking Omnitrix. With Ken in tow, the gang finds Grandpa Max inside the base. He explains that the Xenocyte eggs will be shipped across the country, and asks the gang to destroy them. While they comply, he sets about destroying the factory while searching for the egg-laying machine. The gang finds Max locked in battle with a Highbreed commander upon their return. In an act of self-sacrifice, Max uses an unfocused Null Void warp projector to destroy the Highbreed base. With his last words, he tells Ben to &quot;Take it from here&quot;. Then everything, except Ben, Gwen, Kevin and Ken, is sent to the Null Void. In the aftermath, a group of disguised DNAliens are shown gathering surviving Xenocytes from the wreckage of the base.\n\n107 - Pier Pressure\nBen goes on a date with Julie at the local fair, but it is ruined when a dog-like Galvanic Mechomorph named Ship takes control of the rides and kidnaps Julie. Ben rushes to save her, accidentally revealing his secret to her. Julie, however, finds Ben's secret impressive, and assures him his powers are unique. Ship manages to lead Ben back to his ship, where its wounded owner is trapped. After freeing the Galvanic Mechomorph, it decides to leave Ship with Ben. On their walk home, Ship takes off after a passing truck. After Ship disappears, Ben and Julie walk home, holding hands.\n\n108 - What Are Little Girls Made Of?\nGwen learns where her powers come from when she meets her alien grandmother Verdona. Verdona offers to take Gwen back to her home planet, where she can learn to fully control her powers. When Gwen refuses, Verdona decides to destroy Gwen's body, releasing the energy being inside. After a short battle, Gwen firmly tells Verdona that she wants to stay on Earth and stay the way she is. Verdona accepts this and leaves, though she promises to check up on Gwen occasionally.\n\n109 - The Gauntlet\nAfter Ben stands up to JT and Cash, and making Cash look stupid in the process, the two decide to wreck Kevin's car to repair their reputation. After pushing it down a cliff, the trunk is knocked open, and they make off with a laser-firing glove from a robot the group had defeated the previous night. When Cash puts the glove on, it begins to reform into the original robot around his body, compelling him to fight Ben. Ben is able to overpower Cash as Chromastone, and JT manages to convince Cash to fight the robot's influence, reverting it back into the glove. JT reconciles with Ben and walks away with Cash.\n\n-------------------------------------------------------------------\n-------------------------------------------------------------------","torrent":{"xt":"urn:btih:ef787a539748f3e360edf86414973dfe5480f180","amp;dn":"Ben+10%3A+Alien+Force+-+Volume+2+%282008%29+DVDRip+Eng+Xvid+AC3+AVI+%5BB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef787a539748f3e360edf86414973dfe5480f180","infoHashBuffer":{"type":"Buffer","data":[239,120,122,83,151,72,243,227,96,237,248,100,20,151,61,254,84,128,241,128]},"announce":[],"urlList":[]}}