{"title":"AVATAR por memitoxxx etorrents.org ( ingles - latino )dvdfull","uid":5557378,"size":4508999680,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f12564248c1b9e294362e31eaabc6e21756bece2&amp;dn=AVATAR+por+memitoxxx+etorrents.org+%28+ingles+-+latino+%29dvdfull&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"memitoxxx","files":-1,"time":1273731087,"description":"Directed by \tJames Cameron\nProduced by \tJames Cameron\nJon Landau\nWritten by \tJames Cameron\nStarring \tSam Worthington\nZoe Saldana\nStephen Lang\nSigourney Weaver\nMichelle Rodriguez\nJoel David Moore\nMusic by \tJames Horner\nCinematography \tMauro Fiore\nEditing by \tJames Cameron\nJohn Refoua\nStephen E. Rivkin\nStudio \tLightstorm Entertainment\nDune Entertainment\nIngenious Film Partners\nDistributed by \t20th Century Fox\nRelease date(s) \tDecember 10, 2009 (2009-12-10)\n(London premiere)\nDecember 18, 2009\n(United States)\nRunning time \t162 minutes\nCountry \tUnited States\nBudget \t$237 million\nGross revenue \t$2,727,990,164\n\nThe story takes place in the year 2154 on Pandora, a lush, Earth-like moon of the planet Polyphemus[29]  in the Alpha Centauri star system.[9]  The RDA corporation is mining a valuable mineral called unobtanium. Administrator Parker Selfridge (Giovanni Ribisi) heads the mining operation of the RDA colony, which has a private security force called Sec-Ops.[30]  Pandora's atmosphere is toxic to humans, forcing them to use breathing masks.\n\nPandora is inhabited by the Na'vi, a ten-foot-tall (3 m) blue-skinned species of sapient humanoids,[31] who live in harmony with nature, worshiping a mother goddess called Eywa. To facilitate relations with the Na'vi and research of Pandora's biosphere, scientists grow Na'vi-human hybrid bodies called avatars that are operated via mental link by genetically matching humans.[32] Jake Sully (Sam Worthington), a paraplegic former Marine, replaces his twin brother, a scientist trained as an avatar operator who was murdered in a robbery. Dr. Grace Augustine (Sigourney Weaver), head of the Avatar Program, considers Sully an inadequate replacement for his brother and assigns him as a bodyguard.\n\nAs Grace, scientist Norm Spellman (Joel David Moore) and Jake collect biological samples and data in the forest in their avatar forms, a thanator's attack separates Jake from the group. Neytiri (Zoe Saldana), a female Na'vi, rescues Jake from predators in the forest, and seeing portents from Eywa, brings him to Hometree, where her clan, the Omaticaya, live. Neytiri's mother Mo'at (C. C. H. Pounder), the clan's spiritual leader, shows interest in the &quot;warrior dreamwalker&quot; and instructs her daughter to teach Jake their ways.\n\nThe head of Sec-Ops, Colonel Miles Quaritch (Stephen Lang), promises Jake restorative treatment for his paraplegia in exchange for intelligence that would enable Quaritch to force the cooperation of the Na'vi.[33] Hometree is on top of massive deposits of unobtanium, and RDA wants the site. As Jake starts delivering information to Quaritch, Grace becomes suspicious and relocates herself, Jake and Norm to a remote outpost with avatar link units. Over three months, Jake grows close to Neytiri and the Omaticaya, eventually rejecting RDA's agenda. After Jake is initiated into the Omaticaya, he and Neytiri choose each other as mates. Jake reveals his change of allegiance when he attempts to disable a bulldozer as it destroys the tribe's Tree of Voices. Quaritch presents Selfridge with Jake's video diary, in which Jake admits that the Omaticaya will never abandon Hometree. Selfridge orders Hometree destroyed.\n\nDespite Grace's argument that the destruction of Hometree could affect the bio-botanical neural network to which Pandoran organisms are connected, Selfridge gives Jake and Grace one hour to convince the Na'vi to leave Hometree. Jake reveals his original mission to the Omaticaya, and Neytiri accuses him of betrayal. Jake and Grace's avatars are taken captive. Quaritch's forces destroy Hometree, killing Neytiri's father, the clan chief Eytucan (Wes Studi), and many others. Jake, Grace and Norm are imprisoned for betraying the RDA. Trudy ChacÃƒÂ³n (Michelle Rodriguez), a security force pilot disgusted with Quaritch's methods, breaks them out, flies them to the outpost and helps relocate it. During the escape Quaritch shoots Grace, seriously wounding her.\n\nTo regain the Omaticaya's trust, Jake tames a Toruk, a powerful flying predator that only five Na'vi have ever tamed. Jake finds the Omaticaya at the sacred Tree of Souls and pleads with Mo'at to heal Grace. The clan attempts to transfer Grace from her dying human body into her unconscious avatar with the aid of the Tree, but she succumbs to her injuries before the transfer is complete. Mo'at declares that &quot;she is with Eywa now&quot;.\n\nAssisted by Neytiri and the new leader of the Omaticaya Tsu'tey (Laz Alonso), Jake unites thousands of warriors from many Na'vi clans in a bid to repel the humans. Jake prays to Eywa, via neural connection to the Tree of Souls, to intercede on behalf of the Na'vi in the coming battle. Quaritch notes the mobilization of the Na'vi and convinces Selfridge to authorize a preemptive strike on the Tree of Souls, reckoning that the destruction of this hub of Na'vi religion and culture will demoralize them into submission.\n\nAs the security forces attack, the Na'vi retaliate but suffer heavy casualties, including Tsu'tey and Trudy. The Pandoran wildlife suddenly joins the attack on the corporation's forces, overwhelming them, an event that Neytiri interprets as Eywa answering Jake's prayer. Jake destroys the bomber before it can reach the Tree of Souls. Quaritch finds and attacks the avatar link unit where Jake's human body is located, exposing Jake to Pandora's atmosphere. Neytiri kills Quaritch and locates Jake in time to save him. With the attack repelled, Neytiri and Jake reaffirm their love as she sees his human body for the first time.\n\nSelfridge and the remaining corporate personnel are expelled from Pandora, while Jake, Norm, and other scientists are allowed to remain. Jake is seen wearing the insignia of the Omaticaya leader. The clan performs the ritual that permanently transfers Jake from his human body into his Na'vi body.\n\n\nIMAGENES\n &lt;a href=&quot;\nhttp://foros.mxcomparte.com/uploads/images/1273722167-U11442.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://foros.mxcomparte.com/uploads/images/1273722167-U11442.png&lt;/a&gt; &lt;a href=&quot;\nhttp://foros.mxcomparte.com/uploads/images/1273722241-U11442.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://foros.mxcomparte.com/uploads/images/1273722241-U11442.png&lt;/a&gt; &lt;a href=&quot;\nhttp://foros.mxcomparte.com/uploads/images/1273722292-U11442.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://foros.mxcomparte.com/uploads/images/1273722292-U11442.png&lt;/a&gt;","torrent":{"xt":"urn:btih:f12564248c1b9e294362e31eaabc6e21756bece2","amp;dn":"AVATAR+por+memitoxxx+etorrents.org+%28+ingles+-+latino+%29dvdfull","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f12564248c1b9e294362e31eaabc6e21756bece2","infoHashBuffer":{"type":"Buffer","data":[241,37,100,36,140,27,158,41,67,98,227,30,170,188,110,33,117,107,236,226]},"announce":[],"urlList":[]}}