{"title":"HAR2009 anti counterfeiting agreement Ante Wessels ogg","uid":5056847,"size":78831314,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:f1a21ed7118e876773418433e32b57ae2cc0c1d7&amp;dn=HAR2009+anti+counterfeiting+agreement+Ante+Wessels+ogg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"saperski","files":1,"time":1250466841,"description":"Ante Wessels talk at HAR2009\nSaturday - 2009-08-15\nThe Two Envelopes Tent\nStart time \t15:00\n\n\n75MB OGG file format\nVideo: 360x288  24bpp  25.000 fps Theora\nAudio: 48000Hz 2ch s16le Vorbis\n\nFrom https://har2009.org/program/events/49.en.html:\n\n\nNew legislation for a billion people, made behind closed doors\n\n&quot;Stringent intellectual property rules could hamper the spread of technology needed to fight climate change.&quot; Paul David, professor of economics at Stanford University, California\n\n&quot;If Hollywood could order intellectual property laws for Christmas, what would they look like? This is pretty close.&quot; David Fewer, staff counsel at the Canadian Internet Policy and Public Interest Clinic, University of Ottawa, after looking at leaked ACTA documents.\n\nBehind closed doors, the U.S., EU, Japan, Canada and some other countries are negotiating ACTA. No drafts are published. ACTA will contain new rules for the enforcement of copyrights, trade mark rights, patents and other exclusive rights. ACTA will also contain a chapter on &quot;Intellectual Property Rights Enforcement in the Digital Environment&quot;. Other countries will be forced to join later.\n\nCriminal measures against non commercial infringements are discussed. ACTA may limit access to the Internet, limit access to generic medicine and give patent trolls free reign.\n\nIn the U.S., ACTA is to be adopted as an Executive Agreement, it will bypass normal processes of Congressional oversight. Obama declared ACTA a state secret. In the EU, the EU Council (governments of the Member States) will decide. The European Parliament asked for ACTA documents twice, but did not get access. It is unclear whether the final draft will be published prior to adoption.\n\nLobbyists have access to documents Members of Parliaments do not have access to. The Member States of the EU and the European Parliament have vetoes on aspects of ACTA. The parliaments of the Member States can make parliamentary scrutiny reservations. This way the parliaments can block silent adoption in the Council and enforce transparency.\n\n4 political questions:\n\n    * is it OK to make new legislation for billions of people behind closed doors?\n    * do we want to criminalise the young generation?\n    * are patents more important than human lives?\n    * do we want to give rights holders harsh measures against competitors, beyond cases of counterfeiting?\n\n","torrent":{"xt":"urn:btih:f1a21ed7118e876773418433e32b57ae2cc0c1d7","amp;dn":"HAR2009+anti+counterfeiting+agreement+Ante+Wessels+ogg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1a21ed7118e876773418433e32b57ae2cc0c1d7","infoHashBuffer":{"type":"Buffer","data":[241,162,30,215,17,142,135,103,115,65,132,51,227,43,87,174,44,192,193,215]},"announce":[],"urlList":[]}}