{"title":"Japanorama.TVRip-BBC.Complete","uid":5030343,"size":5944598148,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f294e9a5caaf6d1a5d3231c878781e906e0a1d1e&amp;dn=Japanorama.TVRip-BBC.Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Japanorama","files":-1,"time":1248886106,"description":"Japanorama is a series of documentaries presented by Jonathan Ross, exploring various facets of popular culture and trends of modern-day Japan.\n\nEach episode of Japanorama has a theme, around which Jonathan Ross presents cultural phenomena, films, music, and art that exemplify facets of Japan. The series is colorful in both its creative use of subject matter, and its use of bright colors that helps accent the action on screen rather than distract from it. Subjects were separated by eye catches that often featured the artwork of Junko Mizuno. Ross hosts each episode in suits so bright and stylised they could have been stolen from an anime character.\n\nFans have credited the series for the care that both Ross and the BBC have placed in its production. Time was given to delve into each subject, and Ross was able to interview various figureheads of culture and industry, including Hayao Miyazaki, Mamoru Oshii, Takashi Murakami, Takashi Miike, and Takeshi Kitano.\n\nThe theme song of the show is Kiyoshi no zundoko bushi by Kiyoshi Hikawa.\n\nJapanorama consists of three series, each with six episodes. The first series was shown on BBC Choice in 2002, while series two and three were shown on BBC Three in 2006 and 2007 respectively.","torrent":{"xt":"urn:btih:f294e9a5caaf6d1a5d3231c878781e906e0a1d1e","amp;dn":"Japanorama.TVRip-BBC.Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f294e9a5caaf6d1a5d3231c878781e906e0a1d1e","infoHashBuffer":{"type":"Buffer","data":[242,148,233,165,202,175,109,26,93,50,49,200,120,120,30,144,110,10,29,30]},"announce":[],"urlList":[]}}