{"title":"VA - Digital Beings - 2010 [Progressive Trance]","uid":5657575,"size":108056707,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f300723c3870e6de35cde0eb1b2b42866cb1e284&amp;dn=VA+-+Digital+Beings+-+2010+%5BProgressive+Trance%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ClydeL","files":-1,"time":1277860770,"description":"VA - Digital Beings\n\n\nGenre: Progressive Trance, Full Power\nYear: 2010\nLabel: ECHOES RECORDS\nCatalog#: ECH1CD011\nAudio: MP3\nTracks: 9\nQuality: VBR 192-320 kbps\nPlaytime: 72:45\n\nTracklist:\n\n01 Earsugar - Age Of The 6th Sun 08:03\n02 Ritmo - Process 08:32\n03 Easy Riders - Kelman Gates 10:00\n04 Gaudium - Scandonavian 07:32\n05 Zen Mechanics &amp; Ace Ventura - Digital Beings 08:10\n06 Quantize - The Path 07:16\n07 FREq - Revenge 08:12\n08 Lish Feat. Michele Adamson - Concrete Jungle (Rocky Remix) 07:46\n09 Human Element - Yin And Yang 07:14\n\nEchoes Records and the new exciting Easy Riders duo Ace Ventura and Rocky present a full-power progressive bonanza of a compilation for the summer 'Digital Beings'.\n\nBehind the new project Easy Riders we find two of the most important ambassadors for Israeli progressive trance scene, Yoni Oshrat, better known as Ace Ventura (and previously a member of Psysex), and Rocky Tilbor, better known as Rocky. Both have a string of classic tunes and albums behind them, and after only a few releases with their Easy Riders project, expectations are already sky-high for their upcoming album on Echoes Records.\n\nOn the 'Digital Beings' compilation the two have handpicked no less than 9 previously unreleased tunes, combining basically all the best ambassadors for the powerful psyprog sound. From influential trendsetters FREq and Earsugar (Liquid Soul and Human Element) to rocking Israeli acts like Quantize and Ritmo and Gaudium from Sweden.\n\nOf course Yoni and Rocky are also very present on the compilation themselves, and their track 'Kelman Gates' is probably their strongest output so far. Rocky also adds some punch to Lish's groovy summer-anthem 'Concrete Jungle' and last but not least Yoni has been in the studio with Dutch Zen Mechanics for a long-awaited collaboration on the title-track 'Digital Beings'.\n\nAll in all the compilation can best be described as a lethal weapon in every progressive DJ's arsenal, some tunes rely on powerful, driving progressive trance leads and bass lines, while others have a groovier, understated techno-approach. The glue that binds them all together though is consistent high quality and massive dance floor potential for the upcoming outdoor experiences this summer.","torrent":{"xt":"urn:btih:f300723c3870e6de35cde0eb1b2b42866cb1e284","amp;dn":"VA+-+Digital+Beings+-+2010+%5BProgressive+Trance%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f300723c3870e6de35cde0eb1b2b42866cb1e284","infoHashBuffer":{"type":"Buffer","data":[243,0,114,60,56,112,230,222,53,205,224,235,27,43,66,134,108,177,226,132]},"announce":[],"urlList":[]}}