{"title":"Coast to Coast AM - Aug 09 2009 - Runes Stones &amp; Lost History","uid":5063016,"size":56800956,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:f304fa96401ac234aa57fbc4b471d8d93b1983d4&amp;dn=Coast+to+Coast+AM+-+Aug+09+2009+-+Runes+Stones+%26+Lost+History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1250795518,"description":"Geologist and author Scott Wolter discussed his groundbreaking research into the origins of the Kensington Rune Stone and its connections to other rune stones in America, and the lost history of explorers who came to America before Columbus. The Kensington Rune Stone found in Minnesota contains Runic (letters in the old Norse alphabet) inscriptions with the date 1362. He believes the inscriptions were made by explorers from Gotland, an island off Sweden that had a military monastic order that was possibly the Knights Templar.\n\nHis latest research focused on the enigmatic Hooked X symbol, seen in the Kensington stone. This symbol, which was used in the medieval era, also appeared in runic stones found in Maine and other locations, such as Rosslyn Chapel, he noted. Further, the mysterious Newport Tower in Rhode Island, which may have been built by Templars, has a notched keystone through which a line points exactly in the direction of the Kensington Rune Stone.\n\nThe Hooked X symbol is one of the runes in GRAL, an early spelling for grail, as in the Holy Grail, Wolter said. For more, see the photos below, as well as a recap of Wolter's previous C2C appearance. Additionally, his work will be featured in an upcoming History Channel special, Holy Grail in America.\n\nRosslyn Connections\nAppearing during the second hour, researcher Steven St. Clair talked about his efforts to trace the genealogy/DNA of his family back to William Sinclair, who founded the mysterious Rosslyn Chapel in the mid-15th century. The Chapel is like a &quot;book in stone&quot; with unusual carvings and codes, he said, and some believe Knights Templar treasures are buried underneath the building.\n\nJ.C. Phone Call\nDuring the first hour, notorious Open Lines caller, J.C., &quot;God's 10-star General,&quot; phoned in, accusing Ian of &quot;disputating the Bible.&quot;\n\n[This information has been shared to spread knowledge to those who otherwise would not have access to it.  If you can afford it please support www.coasttocoast.com]","torrent":{"xt":"urn:btih:f304fa96401ac234aa57fbc4b471d8d93b1983d4","amp;dn":"Coast+to+Coast+AM+-+Aug+09+2009+-+Runes+Stones+%26+Lost+History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f304fa96401ac234aa57fbc4b471d8d93b1983d4","infoHashBuffer":{"type":"Buffer","data":[243,4,250,150,64,26,194,52,170,87,251,196,180,113,216,217,59,25,131,212]},"announce":[],"urlList":[]}}