{"title":"Lady Godiva Rides Again (1951 Alastair Sim (uncredited))","uid":5498041,"size":630855770,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f36fdf449cd1f5904e2c3a5fd8b536950223d6a2&amp;dn=Lady+Godiva+Rides+Again+%281951+Alastair+Sim+%28uncredited%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"renman","files":-1,"time":1271380732,"description":"This isn't an Alastair Sim movie though he does appear in this movie albeit in \n\nan uncredited part. \n\nDespite its lighthearted title, Lady Godiva Rides Again is a fairly potent \n\nindictment of the darker side of beauty contests. Waitress Marjorie (Pauline \n\nStroud) enters one competition after another, hoping for fame and fortune. She \n\nmanages to make the finals of a &quot;Lady Godiva&quot; contest, never suspecting that \n\nthe outcome has been rigged. By accident, Marjorie wins First Prize, a huge \n\nsum of money and a movie contract. Alas, she hasn't the talent to parlay her \n\nwin into a lasting career, and soon Marjorie is scrounging around for any \n\n&quot;girlie show&quot; job she can find. Only when reduced to performing nude in a \n\nFrench cabaret review is Marjorie rescued by her Australian boyfriend Larry \n\nBurns (John McCallum), who makes her promise to stop all this nonsense and \n\nsettle down to domesticity. The well-chosen cast includes Dennis Price as a \n\nlascivious movie star and Stanley Holloway and Gladys Henson as the girl's \n\nnonplus ed parents. Featured in smaller roles are such future leading ladies as \n\nKay Kendall, Diana Dors, Dagmar (later Dana) Wynter and, in an uncredited bit, \n\nJoan Collins.ALso an appearance from Ruth Ellis (who was the last person to be \n\nhanged in Britain in 1955) as one of the beauty contestants.\n\nPlease Seed Thank you","torrent":{"xt":"urn:btih:f36fdf449cd1f5904e2c3a5fd8b536950223d6a2","amp;dn":"Lady+Godiva+Rides+Again+%281951+Alastair+Sim+%28uncredited%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f36fdf449cd1f5904e2c3a5fd8b536950223d6a2","infoHashBuffer":{"type":"Buffer","data":[243,111,223,68,156,209,245,144,78,44,58,95,216,181,54,149,2,35,214,162]},"announce":[],"urlList":[]}}