{"title":"Coast to Coast AM - Sep 17 2009 - Martian Glyphs, Space Travel,","uid":5100043,"size":55824550,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:f4c8bd478179e0094443f3d4945362f985985ef5&amp;dn=Coast+to+Coast+AM+-+Sep+17+2009+-+Martian+Glyphs%2C+Space+Travel%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1253901823,"description":"Martian Glyphs, Space Travel, &amp; Energy\n\nDate: 09-17-09\nHost: George Noory\nGuests: Robert Zubrin, George J. Haas, William R. Saunders\n\nDuring the first half of the program, founding investigator of The Cydonia Institute, George Haas, and geoscientist Bill Saunders discussed their analysis of geoglyphic formations on Mars and how they have correlations to the cultures of Meso-America, such as the Mayans. For instance, analyzing NASA images of the &quot;Face on Mars&quot; from 1976 to a Mars Reconnaissance Orbiter's HiRISE shot in 2007, the two have concluded that it's a split-faced structure which resembles a set of temple masks in Mexico.\n\nOther structures in the Cydonia region of Mars, like the D &amp; M Pyramid, have elements that resemble specific gods and characters from the creation mythology of the Mayan and Mesoamerican people, such as recorded in the sacred book, the Popol Vuh, they said. One Martian land form, dubbed the Parrot Formation, was said by a veterinarian specialist to have 18 points of anatomical similarity to the bird, said Saunders, who noted that the parrot was a deity in Mesoamerican mythology.\n\nHass and Saunders suggested that an ET civilization, such as proposed by Zecharia Sitchin, may have visited both Earth and Mars, and left the large art forms on the Martian surface. Their civilization could conceivably still live underground on Mars, they added. For more, see the related images below.\n\n----------------------------------\n\n\nIn the latter half of the show, Dr. Robert Zubrin gave an update on Obama's latest plans for space exploration, NASA, and Mars colonization, and also discussed energy policy. He was critical of the recent Augustine Commission's findings on the amounts of money needed to continue the Bush Moon/Mars Initiative, and suggested they overestimated the costs for items such as the Heavy Lift Vehicle.\n\nZubrin also spoke about the urgent need to free America of its dependence on foreign oil, via making all cars flex fuel, so they can run on methanol. People can get involved in this effort at setamericafree.org. He also argued that controlled fusion, if properly developed, could solve our energy problems both on Earth and in space.\n\nWebsite(s):\nthecydoniainstitute.com\nmarssociety.org\nenergyvictory.net\n\nBook(s):\nThe Martian Codex: More Reflections from Mars\nEnergy Victory: Winning the War on Terror by Breaking Free of Oil\nHow to Live on Mars\nThe Case for Mars: The Plan to Settle the Red Planet\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224","torrent":{"xt":"urn:btih:f4c8bd478179e0094443f3d4945362f985985ef5","amp;dn":"Coast+to+Coast+AM+-+Sep+17+2009+-+Martian+Glyphs%2C+Space+Travel%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4c8bd478179e0094443f3d4945362f985985ef5","infoHashBuffer":{"type":"Buffer","data":[244,200,189,71,129,121,224,9,68,67,243,212,148,83,98,249,133,152,94,245]},"announce":[],"urlList":[]}}