{"title":"Keel - Tears Of Fire","uid":5135595,"size":154970116,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f4f0f28de22945d3f21c79e0420393d7fd7f296f&amp;dn=Keel+-+Tears+Of+Fire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":1,"time":1256458166,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nKeel is an American heavy metal band founded in 1984 in Los Angeles, California. They were known for their rock anthem &quot;The Right to Rock.&quot; The band was active until 1989, with a brief reunion in 1998. Keel reunited in 2008 and is currently touring for their 25th anniversary.\n\nKeel was formed by former Steeler vocalist Ron Keel. The original members were Ron Keel on vocals, David Michael Phillips on guitar, Marc Ferrari on lead &amp; rhythm guitars, Bobby Marks on drums and Kenny Chaisson on bass guitar. Within months, Phillips left to join King Kobra and was replaced by Bryan Jay. This was the lineup for their 1984 debut album Lay Down the Law. After the album's release, Marks left and was replaced by Steven Riley, who subsequently left early in the recording of the band's second album to join W.A.S.P., and was in turn replaced by Dwain Miller, forming a lineup which would remain stable for almost 4 years. Their second album, which caught the eye of Kiss's Gene Simmons was The Right To Rock, released on March 26, 1985. Their Simmons-produced third album The Final Frontier was released on April 30, 1986. It included the single &quot;Because the Night&quot;, a song that was co-written by Patti Smith and Bruce Springsteen and had been a hit for Smith in 1978.\n\nIn 1986, Keel actually won the Best Band of the Year award in the 2nd annual Metal Edge magazine reader's poll, beating such noted bands as Iron Maiden &amp; Judas Priest.\n\nThe Final Frontier is a 1986 album by the heavy metal band Keel. It was the band's second album to be produced by KISS bassist Gene Simmons. Videos were filmed for the tracks &quot;Because the Night&quot; (a Patti Smith Group cover) and &quot;Tears of Fire.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:f4f0f28de22945d3f21c79e0420393d7fd7f296f","amp;dn":"Keel+-+Tears+Of+Fire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4f0f28de22945d3f21c79e0420393d7fd7f296f","infoHashBuffer":{"type":"Buffer","data":[244,240,242,141,226,41,69,211,242,28,121,224,66,3,147,215,253,127,41,111]},"announce":[],"urlList":[]}}