{"title":"Kiss - Rock And Roll All Nite (Dazed And Confused Version)","uid":5116312,"size":137213956,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f52352141b8a0393347edf13677fe6a1edad8966&amp;dn=Kiss+-+Rock+And+Roll+All+Nite+%28Dazed+And+Confused+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1255086828,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video Kiss - Rock And Roll All Nite is the Dazed And Confused - Original Motion Picture Soundtrack Version.\n\n\n&quot;Rock and Roll All Nite&quot; is a song by Kiss, originally released on their 1975 album Dressed to Kill. It was released as the A-side of their fifth single, with the album track &quot;Getaway.&quot; The studio version of the song peaked at #57 on the Billboard singles chart, besting the band's previous charting single, &quot;Kissin' Time&quot; (#79). A subsequent live version released as a single in October 1975, eventually reached #12, the first of six Top 20 songs for Kiss in the 1970s. Since then, it has become Kiss's most identifiable song, and has served as one of the group's closing concert numbers in almost every concert since 1976. In 2009 it was named the 16th greatest hard rock song of all time by VH1.\n\nThe song is featured in the movie Dazed and Confused.\n\n&quot;Rock and Roll All Nite&quot; was written by Paul Stanley and Gene Simmons while Kiss was still in Los Angeles, as part of their Hotter Than Hell tour although during the groups concert at Cobo Hall in Detroit on January 26, 1976, Stanley states to the audience before the group begin the song that it was written in and for Detroit. The tour ended early (February 1975), when Casablanca Records founder and president Neil Bogart ordered Kiss to return to the studio to record a follow up to Hotter Than Hell, which had stalled on the charts and failed to meet Casablanca's sales expectations. One of Bogart's instructions to the band was to compose an anthem, something he felt the band needed. The song itself was inspired by the Slade song Cum on Feel the Noize, and is often referred to as the Rock And Roll National Anthem (for instance, Stanley states during Kiss' performance at the 1996 MTV Video Music Awards that &quot;there's only one nation, that's Kiss Nation, there's only one Rock &amp; Roll national anthem: Rock and Roll All Nite, party everyday!&quot;)\n\nStanley wrote the chorus, and Simmons wrote the verses, borrowing parts of a song he had previously written, entitled &quot;Drive Me Wild.&quot; The song was one of two the group recorded toward the end of the Hotter Than Hell tour, prior to returning to Electric Lady Studios for the proper Dressed to Kill recording sessions. For the choruses, the band and Bogart brought in a large group of outside contributors to sing and clap, including members of the Kiss road crew, studio musicians, and Peter Criss's wife Lydia. Some of the road crew used their jacket zippers to create sound.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:f52352141b8a0393347edf13677fe6a1edad8966","amp;dn":"Kiss+-+Rock+And+Roll+All+Nite+%28Dazed+And+Confused+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f52352141b8a0393347edf13677fe6a1edad8966","infoHashBuffer":{"type":"Buffer","data":[245,35,82,20,27,138,3,147,52,126,223,19,103,127,230,161,237,173,137,102]},"announce":[],"urlList":[]}}