{"title":"Shay Elliott - Cycle of Betrayal.avi","uid":5039260,"size":642097736,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f5aeea616220bd1789f766f50550c5b99896cf79&amp;dn=Shay+Elliott+-+Cycle+of+Betrayal.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1249294558,"description":"A new documentary chronicling the life of Ireland's first professional cyclist, Shay Elliott, will be broadcast on the Setanta Ireland channel on Sunday July 26th next. The programme called 'Shay Elliott: Cycle of Betrayal' will air at 7.45pm.\n\nElliott was a hero of cycling and enjoyed the financial rewards and trappings of sporting stardom. But as his professional career came to a close, his personal life began to unravel, costing him his wealth and his marriage, ultimately concluding in his untimely death in 1971.\n\nThe documentary includes interviews with friends, colleagues and team-mates of Elliott with extensive archive footage from the 1950s and 60s. It reveals a career distinguished by many firsts.\n\nElliott was the first English speaking cyclist to win stages in the three major Tours, the first English speaking cyclist to finish on the podium in a major Tour and the first Irishman to wear the coveted Yellow Jersey of race leader in the 1963 Tour De France, 24 years before Stephen Roche's glorious victory.\n\nBut it wasn't all firsts; in 1962 he lost out on the title of World Champion in controversial circumstances, finishing second. It was just one of a number of near misses in a career that promised even more than it delivered and which led to recrimination and bitter regre","torrent":{"xt":"urn:btih:f5aeea616220bd1789f766f50550c5b99896cf79","amp;dn":"Shay+Elliott+-+Cycle+of+Betrayal.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5aeea616220bd1789f766f50550c5b99896cf79","infoHashBuffer":{"type":"Buffer","data":[245,174,234,97,98,32,189,23,137,247,102,245,5,80,197,185,152,150,207,121]},"announce":[],"urlList":[]}}