{"title":"Red Cilff 1 &amp; 2 [Thai audio Movie]","uid":5131187,"size":1869050776,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f5cead16ef8f5c09cff5d5139531fb4601478858&amp;dn=Red+Cilff+1+%26+2+%5BThai+audio+Movie%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"poothaijaa","files":-1,"time":1256105462,"description":"Title: Red Cliff\nAKA: The Battle of Red Cliff / Chibi\nYear: 2008\nDirector: John Woo\nGenre: Hirtorical Drama / Action\nRuntime: 280 mins (Part I &amp; II)\nCountry: China\nAudio: Thai Dubbed\nSubtitle: none\n\nStarring:\n\nTony Leung Chiu-Wai as Zhou Yu\nTakeshi Kaneshiro as Zhuge Liang\nZhang Fengyi as Cao Cao\nChang Chen as Sun Quan\nZhao Wei as Sun Shangxiang\nHu Jun as Zhao Yun\nLin Chi-ling as Xiao Qiao\nNakamura Shido II as Gan Xing(fictional character based on Gan Ning)\nYou Yong as Liu Bei\nSong Jia as Li Ji (fictional concubine of Cao Cao's)\nTong Dawei as Sun Shucai (fictional soldier of Cao Cao's)\nHou Yong as Lu Su\nBa Sen Zha Bu as Guan Yu\nZang Jinsheng as Zhang Fei\nZhang Shan as Huang Gai\nWang Hui as Cao Hong\nMa Jing as Wei Ben (fictional character based on Wen Pin)\nHu Xiaoguang as Xiahou Jun (fictional character based on Xiahou Yuan)\nShi Xiaohong as Jiang Gan\nWang Yuzhang as Cheng Pu\nYi Zhen as Cai Mao\nHe Yin as Lady Mi\nXie Gang as Hua Tuo\nLi Hong as Lady Gan\nMenghe Wuliji as Guan Ping\nZhang Yi as Zhang Zhao\nWu Qi as Gu Yong\nChen Changhai as Qin Song\nWang Ning as Emperor Xian of Han\nZhao Chengshun as Xun You\nWang Zaolai as Cheng Yu\nWang Qingxiang as Kong Rong\nJia Hongwei as Zhang Yun\nJiang Tong as Li Tong\nGuo Chao as Yue Jin\nCui Yugui as Xu Chu\nXu Fengnian as Zhang Liao\nYe Hua as Tian Tian (fictional maid of Xiao Qiao's)\n\nIMDB: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0425637/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0425637/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1326972/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1326972/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Red_Cliff_(film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Red_Cliff_(film)&lt;/a&gt; &lt;a href=&quot;\nhttp://www.siamzone.com/movie/m/5139&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.siamzone.com/movie/m/5139&lt;/a&gt; &lt;a href=&quot;\nhttp://www.siamzone.com/movie/m/5335&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.siamzone.com/movie/m/5335&lt;/a&gt;\n\nSource: 2 DVDs\nFile Format: AVI\n\nPlot:\nPart 1\n\nIn the summer of 208 CE during the Eastern Han Dynasty, the imperial army led by Chancellor (or Prime Minister) Cao Cao embarks on a campaign to eliminate the southern warlords Sun Quan and Liu Bei in the name of eliminating rebels, with the reluctant approval of the Emperor. Cao Cao's mighty army swiftly conquers the southern province of Jingzhou and the Battle of Changban is ignited when Cao Cao's cavalry unit starts attacking the civilians who are on an exodus led by Liu Bei. During the battle, Liu Bei's followers, including his sworn brothers Guan Yu and Zhang Fei, give an excellent display of their legendary combat skills by managing to hold off the enemy while buying time for the civilians to retreat. The warrior Zhao Yun fights bravely to rescue his lord Liu Bei's entrapped family but only succeeded in rescuing Liu's infant son.\n\nFollowing the battle, Liu Bei's chief advisor Zhuge Liang sets forth on a diplomatic mission to Eastern Wu to form an alliance between Liu Bei and Sun Quan to deal with Cao Cao's invasion. Sun Quan was initially in the midst of a dilemma of whether to surrender or resist, but his decision to resist Cao Cao hardens after Zhuge Liang's clever persuasion and a subsequent tiger hunt with his Grand Viceroy Zhou Yu and his sister Sun Shangxiang. Meanwhile, naval commanders Cai Mao and Zhang Yun from Jingzhou pledge allegiance to Cao Cao and were received warmly by Cao, who placed them in command of his navy.\n\nAfter the hasty formation of the alliance, the forces of Liu Bei and Sun Quan call for a meeting to formulate a plan to counter Cao Cao's army, which is advancing slowly towards Red Cliff at godspeed from both land and water. The battle then begins with Sun Shangxiang leading a light cavalry unit to lure Cao Cao's vanguard army into the Eight Trigrams Formation laid down by the allied forces. Cao Cao's vanguard army is utterly defeated by the allies but Cao Cao shows no disappointment and proceeds to lead his main army to the riverbank directly opposite the allies' main camp where they laid camp. While the allies throw a banquet to celebrate their victory, Zhuge Liang thinks of a plan to send Sun Shangxiang to infiltrate Cao Cao's camp and serve as a spy for them. The duo maintain contact by sending messages via a pigeon. The film ends with Zhou Yu lighting his miniaturised battleships on a map based on the battle formation, signifying his plans for defeating Cao Cao's navy.\n\nPart 2\n\nSun Shangxiang has infiltrated Cao Cao's camp and she has been secretly noting details and sending them via a pigeon to Zhuge Liang. Meanwhile, Cao Cao's army is seized with a plague of typhoid fever which kills a number of his troops. Cao Cao cunningly orders the corpses to be sent to the allies' camp, hoping to pass the plague on to his enemies. The allied army's morale is affected when some unsuspecting soldiers let the plague in, and eventually a disheartened Liu Bei leaves with his forces while Zhuge Liang stays behind to assist the Eastern Wu forces. Cao Cao hears that the alliance had collapsed and is overjoyed. At the same time, his naval commanders Cai Mao and Zhang Yun propose a new tactic of interlocking the battleships together with iron beams to minimize rocking when sailing on the river and reduce the chances of the troops falling seasick.\nThe Eastern Wu forces look on as Liu Bei leaves the alliance. From front to back: Zhou Yu (Tony Leung), Sun Quan (Chang Chen), Lu Su (Hou Yong).\n\nSubsequently, Zhou Yu and Zhuge Liang make plans on how to eliminate Cao Cao's naval commanders Cai Mao and Zhang Yun, and produce 100,000 arrows respectively. They agreed that whoever fails to complete his mission will be punished by execution under military law. Zhuge Liang's ingenious strategy of borrowing of arrows with straw boats brought in over 100,000 arrows from the enemy and aroused Cao Cao's suspicions about the loyalty of Cai and Zhang towards him. On the other hand, Cao Cao sends Jiang Gan to persuade Zhou Yu to surrender, but Zhou Yu tricks Jiang Gan instead, into believing that Cai Mao and Zhang Yun are planning to assassinate their lord Cao Cao. Both Zhuge Liang and Zhou Yu's respective plans complement each other when Cao Cao is convinced, despite earlier having doubts about Jiang Gan's report, that Cai and Zhang were indeed planning to assassinate him by deliberately 'donating' arrows to the enemy. Cai and Zhang are executed and Cao Cao realised his folly afterwards but it was too late.\n\nIn the Eastern Wu camp, Sun Shangxiang returns from Cao Cao's camp with a map of the enemy formation. Zhou Yu and Zhuge Liang decide to attack Cao Cao's navy with fire after knowing that there is a special climatic condition known only to Eastern Wu's forces, that the South-East Wind (to their advantage) would blow sometime soon. As the Eastern Wu forces made preparations for the fire attack, Huang Gai proposes to Zhou Yu the Self-Torture Ruse to increase their chances of success, but Zhou Yu does not heed it. Before the battle, the forces of Eastern Wu have a final moment together, feasting on glutinous rice balls to celebrate the Winter Festival. Meanwhile, Zhou Yu's wife Xiao Qiao heads towards Cao Cao's camp alone secretly, in hope of persuading Cao Cao to give up his ambitious plans but she fails and decides to distract him instead to buy time for the Eastern Wu forces.\n\nThe battle begins when the South-East Wind starts blowing in the middle of the night and the Eastern Wu forces launch their full-scale attack on Cao Cao's navy. On the other hand, Liu Bei's forces, which had apparently left the alliance, start attacking Cao Cao's forts on land. By dawn, Cao Cao's entire navy has been destroyed. The allied forces launch another offensive on Cao Cao's ground army, stationed in his forts, and succeeded in breaking through using testudo formation despite suffering heavy casualties. Although Cao Cao is besieged in his main camp, he manages to holds Zhou Yu hostage after catching him off guard together with Cao Hong. Xiahou Jun appears as well holding Xiao Qiao hostage and causes the allied forces to hesitate. In the nick of time, Zhao Yun manages to reverse the situation by rescuing Xiao Qiao with a surprise attack and put Cao Cao at the mercy of the allied forces instead. Eventually, the allied forces decide to spare Cao Cao's life and tell him never to return before leaving for home. In the final scenes, Zhou Yu and Zhuge Liang are seen having a final conversation before Zhuge Liang walks away into the far distance with the newborn foal Mengmeng.","torrent":{"xt":"urn:btih:f5cead16ef8f5c09cff5d5139531fb4601478858","amp;dn":"Red+Cilff+1+%26+2+%5BThai+audio+Movie%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5cead16ef8f5c09cff5d5139531fb4601478858","infoHashBuffer":{"type":"Buffer","data":[245,206,173,22,239,143,92,9,207,245,213,19,149,49,251,70,1,71,136,88]},"announce":[],"urlList":[]}}