{"title":"German White Paper-Polish Documents Issued by Berlin Foreign Off","uid":5569323,"size":142700,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5eda5286730c8cfe824b263e4c0c37530743da3&amp;dn=German+White+Paper-Polish+Documents+Issued+by+Berlin+Foreign+Off&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"red_gonzo","files":1,"time":1274214902,"description":"This is the amazing booklet The German White Paper - Full Text of the Polish Documents Issued by the Berlin Foreign Office (1940) which is a compilation of archives of the Polish Foreign Office which had fallen into German hands on March 30, 1940 after the occupation of Warsaw. In September 1939 an SS brigade commanded by Freiherr von Kuenberg seized the Polish Foreign Ministry as Warsaw fell to invading German troops. Upon capturing the Foreign Ministry, the Germans halted efforts by Polish officials to destroy various sensitive documents prepared by Polish diplomats for the Warsaw government. In 1940, the German Foreign Office compiled these Polish documents into book form. The importance of the documents is that they prove conclusively that Franklin D. Roosevelt played a major role in instigating hostilities among the various European nations. Roosevelt responded with a massive disinformation campaign aimed at discrediting the Polish documents as frauds and to suppress any mention of them. In a more innocent age before the political lies and hypocrisy of Vietnam and Watergate, Roosevelt succeeded, at least for the duration of the war. However over the years more and more evidence has accumulated to authenticate the documents beyond a shadow of doubt. Various noted historians considered the documents genuine. In 1970 their authenticity was further confirmed by the book Diplomat in Paris 1936 - 1939. This work consists of the papers and memoirs of Juliusz Lukasiewicz, the former Polish ambassador to Paris who wrote several of the reports. He considered the documents genuine and quoted from several of them. But by the time the Polish documents were finally verified both by neutral historians and the Polish officials involved, Roosevelt had been elevated to sainthood and the powers that be showed no interest whatsoever in tarnishing FDR's unearned halo. Here now then are the long suppressed facts proving Roosevelt's role in starting World War II and exposing the forces behind him. 40 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:f5eda5286730c8cfe824b263e4c0c37530743da3","amp;dn":"German+White+Paper-Polish+Documents+Issued+by+Berlin+Foreign+Off","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5eda5286730c8cfe824b263e4c0c37530743da3","infoHashBuffer":{"type":"Buffer","data":[245,237,165,40,103,48,200,207,232,36,178,99,228,192,195,117,48,116,61,163]},"announce":[],"urlList":[]}}