{"title":"[H264-AAC-ITA]x-Men[survivalofmisa]","uid":5082450,"size":545235582,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f6353aa55be553e503f72f92a879c26f3c357565&amp;dn=%5BH264-AAC-ITA%5Dx-Men%5Bsurvivalofmisa%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mitimex","files":1,"time":1252447672,"description":"\n\nLa pellicola prende ispirazione dall'omonima serie a fumetti edita dalla Marvel Comics, creata nel 1963 dallo scrittore Stan Lee e dal disegnatore Jack Kirby.\nPer l'umanitÃƒÂ  il momento ÃƒÂ¨ delicato. I mutanti, esseri il cui DNA ÃƒÂ¨ corredato da un gene X che garantisce loro poteri sovrumani, sono in procinto di sopravanzare l'uomo. Il senatore Kelly, preoccupato, cerca di far approvare dal congresso degli Stati Uniti una legge che permetta la schedatura di tutti gli esseri sui quali sia stato riscontrato un gene mutante. L'iniziativa scatena violente reazioni sul fronte dei mutanti, che si dividono in due fazioni. Da un lato la Fratellanza dei mutanti malvagi, con a capo Magneto, che non ha intenzione di farsi schedare come bestiame ed ÃƒÂ¨ pronta a combattere la guerra contro l'umanitÃƒÂ . Dall'altra c'ÃƒÂ¨ il gruppo guidato dal genetista professor Xavier, paraplegico, che si sforza di cercare una via di convivenza con gli umani. In attesa di questa soluzione perÃƒÂ² i suoi uomini vivono come terroristi. Ciclope, Tempesta, Jean Grey si dedicano con molti rischi alla loro missione, e con loro ci sono altri due appena arrivati: l'adolescente Rogue, e Wolverine, essere dall'indole bestiale capace di guarire subito da qualsiasi ferita e dotato di micidiali artigli nelle mani. La lotta tra i due gruppi e contro il senatore Kelly prosegue senza esclusione di colpi. Il senatore cade prigioniero dei mutanti, e Magneto poi rapisce Rogue. Per liberarla si scatena una battaglia spaziale di grandi proporzioni. Poi Wolverine affronta Magneto, e Rogue ÃƒÂ¨ salva. Ora Magneto e Xavier sono di fronte e giocano a scacchi. Magneto vorrebbe la guerra. Xavier lo conduce alla calma, e lo congeda con parole di pace e di amicizia. ","torrent":{"xt":"urn:btih:f6353aa55be553e503f72f92a879c26f3c357565","amp;dn":"%5BH264-AAC-ITA%5Dx-Men%5Bsurvivalofmisa%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6353aa55be553e503f72f92a879c26f3c357565","infoHashBuffer":{"type":"Buffer","data":[246,53,58,165,91,229,83,229,3,247,47,146,168,121,194,111,60,53,117,101]},"announce":[],"urlList":[]}}