{"title":"Mobiion MagiCall For The Pocket PC","uid":5085924,"size":352793,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:f73be50af141db5e6a8f606129d377cc4936f270&amp;dn=Mobiion+MagiCall+For+The+Pocket+PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxThugxx","files":-1,"time":1252710645,"description":"\n                          *******   *    *  *     *   *****\n                             *      *    *  *     *   *\n                             *      ******  *     *   *\n                             *      *    *  *     *   * ****\n                             *      *    *  *     *   *    *\n                             *      *    *  *******   ******\n\n\n                                Mobiion MagiCall v2.2.2\n\n\n\n                                                             \nMagiCall is a smart tool for bidirectional calls filtering and SMS filtering. It is the only product in the world that can not only filter incoming calls but also filter outgoing calls. With MagiCall, you have the ability to block unwanted \ncallers, automatically hang up on someone bothering you, and more! Stop anyone you just don't feel like speaking to at the moment from disturbing you. Automatically add prefix number in front of the original dialing number based on your \nrule. Hang up predefined outgoing numbers such as international calls. In addition, you can also take control of your incoming SMS Messages. Reply back or forward SMS to someone or launch an application when a rule is being triggered. And it can log detail information about all triggered events to the log file.\n\n\n\n                                  Changelog Version 2.2.2\n  \n\n* Added new contextual parameter - {msg-clip}, which represents the content of a received SMS but excluding the matched keyword\n\n* Now supports negative logic in the [Phone #] field, by using a leading letter '~'\n\n* Now the notification window for ignoring will be kept after the remote party ends the call\n\n* Added a new command line parameter &quot;-lv&quot;, used to show Log Viewer\n\n* Added supports to filter SMS sent from contacts' email addresses\n\n* Fixed: SMS Move causes exceptions when checked [Show notification] but not checked [Log events]\n\n* Fixed: Data connection lost for CDMA devices after hanging up a number of incoming calls\n\n* Fixed: Email Account option is not saved for the Smartphone version\n\n* Fixed: Keep Login Minutes option is not saved for the Smartphone version\n\n* Fixed: Program crashes when using Change Dialed Number: {phone}[-x,y], while the original phone number's length is equal to x+y\n\n* Fixed: An incompatible issue between MagiCall home plug-in and SBSH Facade\n\n* Fixed: Upgrades may cause the Today plugin and SMS filtering features not working\n","torrent":{"xt":"urn:btih:f73be50af141db5e6a8f606129d377cc4936f270","amp;dn":"Mobiion+MagiCall+For+The+Pocket+PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f73be50af141db5e6a8f606129d377cc4936f270","infoHashBuffer":{"type":"Buffer","data":[247,59,229,10,241,65,219,94,106,143,96,97,41,211,119,204,73,54,242,112]},"announce":[],"urlList":[]}}