{"title":"XP x86 LLTD KB922120 Version6 for Service Pack 3","uid":5111745,"size":539688,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f75412ac21031fbb2ee16e99eb5278efb3337df0&amp;dn=XP+x86+LLTD+KB922120+Version6+for+Service+Pack+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"3TTE","files":1,"time":1254855762,"description":"Link-Layer Topology Discovery (LLTD) Version 6.0 for XP Service Pack 3\n\nOverview:\n\nThis package contains the Link Layer Topology Discovery (LLTD) responder. The network map on a computer running Windows Vista shows a graphical view of the computers and devices on your network and how they are connected by using the LLTD protocol. The LLTD responder must be installed on a computer running Windows XP before it can be detected and appear on the network map. After you install this item, you may have to restart your computer.\n\n\nArticle:\n\nNetwork Map Does Not Display Computers Running Windows XP\n\nUpdated: July 9, 2009\n\nApplies To: Windows Vista\n\nWhen you run Network Map in Windows VistaÃ‚Â®, computers that are running WindowsÃ‚Â® XP do not appear on the completed diagram.\nCause\n\nNetwork Map in Windows Vista diagrams the connections between network devices to help you troubleshoot connectivity problems. Network Map uses a discovery protocol called Link-Layer Topology Discovery (LLTD) in order to query the other devices on the network to determine how the network is organized. Computers that are running Windows Vista include the software components that implement the LLTD protocol. For network computers that are running Windows XP to appear on the map, they must have a discovery protocol enabled that can respond to the mapping computer's requests.\nSolution on Windows XP\n\nFor computers running Windows XP to appear on the Network Map diagram, you must download and install the LLTD Responder component. By installing the LLTD Responder, and enabling File and Printer Sharing in Windows Firewall, a computer running Windows XP can respond to other Windows Vista computers on the network that are attempting to create a network map.\n\nThe following procedures are performed on a computer running Windows XP.\n\nTo install the LLTD Responder onto a computer running Windows XP\n\n   1. Download the update appropriate for your version of Windows:\n\n          * If you are running Windows XP with no service pack, with Service Pack 1 (SP1), or with SP2, download the update from here: http://go.microsoft.com/fwlink/?LinkId=70582.\n\n   2. Run the update on the computer running Windows XP that you want to appear on the Network Map.\n\n   3. On the Software Update Installation Wizard, click Next.\n\n   4. On the License Agreement page, read the license agreement, and if you agree to the terms, click I Agree, and then click Next.\n\n   5. On the final page of the wizard, click Finish.\n\n   6. If you are prompted to do so, restart your computer.\n\nLLTD Responder\n\nYou can verify that the LLTD Responder is successfully installed and running.\n\nTo verify the LLTD Responder is installed and running\n\n   1. On a computer running Windows XP, click Start, click Control Panel, and then click Network Connections.\n\n   2. Click Local Area Network Connection, click Properties, and then view the list of items used by the network connection.\n\n   3. Ensure that the Link-Layer Topology Discovery Responder check box is selected.\n\nFile and Printer Sharing\n\nPrior to generating a new Network Map in Windows Vista you must ensure that Print and File Sharing is excluded from Windows Firewall filtering.\n\nTo exclude File and Printer Sharing from Windows Firewall\n\n   1. On a computer running Windows XP, click Start, click Control Panel, and then click Network Connections.\n\n   2. Click Windows Firewall Settings, and then click the Exceptions tab.\n\n   3. If necessary, click Edit, and then select the File and Printer Sharing check box.\n\nSolution on Windows Vista\n\nAfter performing the procedures in the preceding section, you can generate a new Network Map for all computers on the network, including those running Windows XP.\n\nTo generate a new Network Map and connect to all network computers\n\n   1. On a computer running Windows Vista, perform the following steps to generate a new Network Map:\n\n          * Start Network and Sharing Center.\n\n          * On the right side of the Status section, click View full map.\n\n   2. Right-click the computer running Windows XP, and then click Open.\n\n   3. If connectivity issues persist, perform the following steps:\n\n          * Ensure that File and Printer Sharing is excluded from Windows Firewall on the computer running Windows Vista.\n\n   4. Consider excluding other services from Windows Firewall on the computer running Windows Vista.\n","torrent":{"xt":"urn:btih:f75412ac21031fbb2ee16e99eb5278efb3337df0","amp;dn":"XP+x86+LLTD+KB922120+Version6+for+Service+Pack+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f75412ac21031fbb2ee16e99eb5278efb3337df0","infoHashBuffer":{"type":"Buffer","data":[247,84,18,172,33,3,31,187,46,225,110,153,235,82,120,239,179,51,125,240]},"announce":[],"urlList":[]}}