{"title":"The magical legend of the leprechauns (eng)(nl subs)  2Lions-Tea","uid":5096589,"size":4684326402,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f7a8e3ec6efd05d3ec3fdb240840fb693f347064&amp;dn=The+magical+legend+of+the+leprechauns+%28eng%29%28nl+subs%29++2Lions-Tea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":7,"uploader":null,"files":-1,"time":1253626031,"description":"The magical legend of the leprechauns      \n  \n \n  Magische Legende van de Dwergen\n\nVerenigde Staten / Verenigd Koninkrijk / Duitsland\nKomedie / Fantasy\n172 minuten\n\ngeregisseerd door John Henderson\nmet Randy Quaid, Whoopi Goldberg en Roger Daltrey\n\n\n\nBeschrijving\nZakenman Jack Woods is voor zijn werk op bezoek in Ierland. Zijn eerste avond logeert hij in een klein huisje en ziet daar plotseling een dwerg. Jack gelooft zijn ogen niet, maar de volgende dag ziet hij de dwerg bijna verdrinken in de rivier. Jack redt de dwerg, die Muldoon heet en ze sluiten vriendschap.\n\nJack komt te weten dat de dwergen ervoor moeten zorgen dat de seizoen wisselen. De elfen zijn hun aartsvijand, want ze maken teveel natuur en gebruiken teveel bladeren. Ze veroorzaken daarmee te veel werk voor de dwergen, maar tot een gevecht kan het niet komen, want dat heeft De Grote Banshee verboden... \n\nDat weet Mickey, de zoon van Muldoon, stiekem binnen te komen op een elfenfeest en wordt hals over kop verliefd op de mooie prinses Jessica, de dochter van de elfenkoning Boric. Jessica is echter uitgehuwelijkt aan Graaf Grogin. Mickey's vriend Barney besluit een handje te helpen en raakt in gevecht met de graaf. De Grote Banshee ziet zich genoodzaakt om in te grijpen en laat Barney verdwijnen.\nBoric zweert wraak en er dreigt een oorlog uit te breken. Terwijl de dwergen Jack in hun leger rekruteren, gaat Mickey op zoek naar zijn geliefde die spoorloos is verdwenen. Uiteindelijk lijkt alles af te hangen van de liefde tussen Mickey en Jessica...\n\nEnglish\n\nAmerican businessman Jack Woods rents a cottage on the enchanted Emerald Isle which is occupied by a family of leprechauns. Leprechaun Seamus Muldoon's son and son's friends crash the fairies' costume ball and Muldoon's son falls in love with fairy Princess Jessica. Their love re-ignites a feud between the leprechauns and the fairies, which escalates into a war. The Grand Banshee warns of terrible consequences and Jack Woods is chosen to make peace. Woods interrupts his own romance with an Irish beauty to help, and becomes involved in a strange and wonderful magical adventure.\n\n\n\n\n\nbron: DVD 9\nBeeldformaat: 4:3\nOverige kenmerken: Interactief menu | ScÃƒÆ’Ã‚Â¨netoegang \nTaal orig. Versie: Engels\nAudio Dolby Surround2.0\nOndertiteling: Nederlands \ncover: ja\n\n\nWeblink : &lt;a href=&quot; http://www.moviemeter.nl/film/13495&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.moviemeter.nl/film/13495&lt;/a&gt; \nWeblink : &lt;a href=&quot; http://www.imdb.com/title/tt0205214&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0205214&lt;/a&gt;\n\n\n\n*****************************************","torrent":{"xt":"urn:btih:f7a8e3ec6efd05d3ec3fdb240840fb693f347064","amp;dn":"The+magical+legend+of+the+leprechauns+%28eng%29%28nl+subs%29++2Lions-Tea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7a8e3ec6efd05d3ec3fdb240840fb693f347064","infoHashBuffer":{"type":"Buffer","data":[247,168,227,236,110,253,5,211,236,63,219,36,8,64,251,105,63,52,112,100]},"announce":[],"urlList":[]}}