{"title":"Coast to Coast AM - Aug 14 2009 - Frank's Box, Do","uid":5063053,"size":55240657,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:f8575fedfec31ba6ff1fabddeb8aeb0fe51a5bad&amp;dn=Coast+to+Coast+AM+-+Aug+14+2009+-+Frank%5C%27s+Box%2C+Do&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1250796306,"description":"In the first hour, George spoke with documentary producer Bill Murphy and inventor Frank Sumption about the contraption Sumption built, known as &quot;Frank's Box,&quot; that purportedly allows real-time, two-way communication with the other side. Sumption explained that his Box uses broadcast radio fragments as the source for the raw audio that entities make use of to form their messages.\n\nMurphy, who was given Box #21 by Sumption, claims to have received a prophetic warning during a public demonstration of the device at a paranormal-themed conference in July 2007. According to Murphy, the message predicted a nuclear strike against Israel in January 2008, launched from Syria with weapons supplied by North Korea. Murphy said the attack never occurred, but in February 2008 he came across an article on Operation Orchard, an Israeli military operation that may have foiled the Box's forecast and which culminated in the destruction of a supposed nuclear facility in Syria that contained materials supplied by North Korea.\n\nIn addition, the two men noted that various people around the country have been receiving another prophetic message over their Boxes -- this one warning of a some kind of catastrophe on the East Coast of the United States, perhaps involving a meteor strike in the Atlantic ocean. The date given for the disaster is August 15th, year unknown.\n\n---------------------------------------------\n\nResearcher and author Rosemary Ellen Guiley appeared in the second hour to discuss her research into dreams, the afterlife and the paranormal, as well as to comment on the doomsday predictions picked up on &quot;Frank's Box.&quot; Guiley pointed out that George Meek received predictions on the Spiricom machine as well. She cautioned that such predictions should be evaluated carefully, as people tend to look at them in hindsight and fit the event to the prediction. Guiley also mentioned her upcoming online show called &quot;On the Paranormal Road&quot; which will be carried by the Paranormal Television Network.\n\n---------------------------------------------\n\nDuring Open Lines, Arlene in Montreal, Canada told George about entities that she sees in her bedroom. Arlene said she thought the creatures were imaginary until she photographed one that looked like an extraterrestrial. Arlene also claimed to have received an electrical shock from the entities which induced total body paralysis. James in Prescott, Arizona phoned in with a prediction about the American coin collecting industry. According to James, coins will lose value and the industry collapse due to rampant counterfeiting.\n\nRobert in Los Angeles voiced his opinion on the benefits of marijuana and hemp. Robert believes re-legalizing the plants will increase the country's prosperity. He estimated that hundreds of billions of dollars could be generated every year through marijuana/hemp related goods and services. He also warned that the continuation of marijuana/hemp prohibition increases the possibility of a totalitarian takeover of the United States.\n\nAt the beginning of the final hour, George played part of Bob Dylan's &quot;Blowin' in the Wind&quot; on his harmonica.\n\n[This information has been shared to spread knowledge to those who otherwise would not have access to it.  If you can afford it please support www.coasttocoast.com]","torrent":{"xt":"urn:btih:f8575fedfec31ba6ff1fabddeb8aeb0fe51a5bad","amp;dn":"Coast+to+Coast+AM+-+Aug+14+2009+-+Frank%5C%27s+Box%2C+Do","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8575fedfec31ba6ff1fabddeb8aeb0fe51a5bad","infoHashBuffer":{"type":"Buffer","data":[248,87,95,237,254,195,27,166,255,31,171,221,235,138,235,15,229,26,91,173]},"announce":[],"urlList":[]}}