{"title":"The Bastards of Apocalypse- Black Magik","uid":5662538,"size":16728625,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f8ea758f247d2215fe36188bdfeca9c831e2e1f0&amp;dn=The+Bastards+of+Apocalypse-+Black+Magik&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DomZombie","files":1,"time":1278023290,"description":"Title- Black Magik\n\nArtist-The Bastards of Apocalypse\n\nDom Zombie- Vocals &amp; Guitar\nCurtis Graff- Guitar\n\nRecorded 2010 at NekroStudio Canton, OH\n\nTracklisting:\n1. Runaway\n2. Lucifer is Rising\n3. Mercy, Mercy\n4. Sleep\n5. Get Outta This Town!\n6. Black Magik\n\nThis album is the newest material released by The Bastards of Apocalypse. It sets the story for the full length album &quot;Hollow Ground&quot;. The Hollow Ground trilogy starts with &quot;Black Magik&quot; the story of a man overwhelmed by evil. He captures women and uses their body parts in rituals in an attempt to raise a demon to do his biding. The creature he raises is an uncontrollable entity, a lucifer reincarnate. The man realizes to late the evil he has unleashed on the world. As he mourns for the girls he's mutilated the monster throws him into the nightmarish world of Hollow Ground, a half dream horror land where the monsters are all to real. Unfortuatly the souls of the girls he murdered are also trapped with him. Where &quot;Black Magik&quot; ends &quot;Hollow Ground&quot; begins. &quot;Hollow Ground&quot; follows one of the trapped girls through this nightmarish land. It shows the horrors she experiences in a world that feeds off your fears.the ending to &quot;Hollow Ground&quot; is an attempt to wake the girl up and save her from the haunted kingdom. &quot;Ametralladora&quot; is the third installment and by this point the girls are gone, the man is gone. The land of Hollow Ground has slowly begun to leak into the real world. It statrs off with a haunting version of The Mars Voltas &quot;The Widow&quot; to set the mood for the horror in &quot;Un Lobo En Peil De Cordero&quot;. In the second track a species of wolf creatures begin to inhabit a small town in Pennsylvannia. It tells the tale of the people trying to survive and cope with this new horror.  The third track &quot;Bogyphobia&quot; is the final acid drenched vision of the young female sacrifice as she falls victim to &quot;Hollow Ground.&quot;","torrent":{"xt":"urn:btih:f8ea758f247d2215fe36188bdfeca9c831e2e1f0","amp;dn":"The+Bastards+of+Apocalypse-+Black+Magik","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8ea758f247d2215fe36188bdfeca9c831e2e1f0","infoHashBuffer":{"type":"Buffer","data":[248,234,117,143,36,125,34,21,254,54,24,139,223,236,169,200,49,226,225,240]},"announce":[],"urlList":[]}}