{"title":"Coast to Coast AM - Sep 15 2009 - Evolution &amp; Mind","uid":5100020,"size":56518131,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:f91ea699e6be81fd4cbc98a032b7007d2e92b6d7&amp;dn=Coast+to+Coast+AM+-+Sep+15+2009+-+Evolution+%26+Mind&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1253899465,"description":"Evolution &amp; Mind\n\nDate: 09-15-09\nHost: George Noory\nGuests: Bruce Lipton, Steve Bhaerman\n\nInternationally recognized authority in bridging science and spirit, and a leading voice in new biology, Bruce Lipton, Ph.D., spoke about ways humanity can evolve by freeing itself of old belief systems and programming. Political philosopher and humorist Steve Bhaerman, who co-authored with Lipton their new book Spontaneous Evolution, joined in the second hour of the discussion.\n\nLipton outlined what he called the &quot;Four Myth-Perceptions of the Apocalypse&quot;:\n\n- The world or universe is Newtonian in nature-- based on physical matter, and materialistic values. This is being disproved by quantum physics, which shows that an invisible realm is involved in shaping matter, and points to the connection between science and spirituality.\n\n- We're a victim of our genes. We're not a victim of heredity, but can actively participate in the health of our cells/genes through our perceptions and thoughts, and breaking free from subconscious programming.\n\n- The world is based on competition. This kind of Darwinian thinking keeps us armed, guarded and stressed. Evolution actually favors community and cooperation.\n\n- Random evolution occurred. Organisms were designed to bring harmony to the environment; they are adaptive, not random.\n\nWe allow fear, habit, and programming to box us in, and do things against our better nature, Bhaerman commented. He performed for a few minutes as his humorous character Swami Beyondananda, who shared his &quot;little imparticles of wisdom.&quot; &quot;Would you like to be in the now, more?&quot; he asked George, who replied affirmatively. &quot;Well, it's too late, it's already done!&quot; Swami retorted. &quot;We are all in this together...In this planet that we have right now, we have to love thy neighbor as thy selves. Otherwise, there goes the neighborhood,&quot; Swami continued.\n\nInstitutions are failing us, because they are based on false beliefs, said Bhaerman. Lipton noted the need to integrate oppositional viewpoints, such as conservative and progressive. It just takes a small percentage of the population to become more coherent in their thought process, which in turn can alter the entire field and manifest change, and lead to humanity's evolution, he added.\n\nWebsite(s):\nbrucelipton.com\nwakeuplaughing.com\n\nBook(s):\nSpontaneous Evolution: Our Positive Future (and a Way to Get There from Here)\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224","torrent":{"xt":"urn:btih:f91ea699e6be81fd4cbc98a032b7007d2e92b6d7","amp;dn":"Coast+to+Coast+AM+-+Sep+15+2009+-+Evolution+%26+Mind","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f91ea699e6be81fd4cbc98a032b7007d2e92b6d7","infoHashBuffer":{"type":"Buffer","data":[249,30,166,153,230,190,129,253,76,188,152,160,50,183,0,125,46,146,182,215]},"announce":[],"urlList":[]}}