{"title":"It Can't Happen to Me(constitutional crisis&amp;tyranny in Americ","uid":5083537,"size":1509073068,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f9b3c9b287cacd6cedc76a0e4006284e3c534c23&amp;dn=It+Can%5C%27t+Happen+to+Me%28constitutional+crisis%26tyranny+in+Americ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"red_gonzo","files":1,"time":1252532008,"description":"This is Bob Trefz's mindblowing video documentary It Can't Happen to Me which exposes constitutional crisis and outright tyranny in America as president after president signs new laws that restrain the freedoms of everyday Americans. Some people in America have come to the conclusion that the country is in a constitutional crisis. See it in action for yourself. A house of representatives committee battles for freedom over the super-secret NSA spying on citizens. The nation has reached a point of constitutional crisis. Hear some of the most eloquent and best informed defenders of liberty. Hear Richard Hersh, head of The truth project, tell about the infiltration by military intelligence of the Quaker church, about what happened to him - his e-mails, his license plates, his phone calls etc. Hear noted constitutional scholar, Jonathan Turley, tell of the terrible threat to America. Hear noted author, James Bamford, give his stunning testimony about the NSA, that if the government ever became a tyranny, it would be a total tyranny, there would be no way of fighting back, because of the power of technology to find out virtually everything. Find out how the US government has been taken over by people with absolutely totalitarian mentality and what they have been doing behind the backs of Americans on the grounds of battling international terrorism. As you are about to see the plan for a police state has been long in preparation and with every step millions of Americans are pushed into the hands of people who set themselves above every law. 2h long. A must see for everyone.\n\nVideo specs:\nVideo codec: xvid, 720x480, 1500 kbps\nAudio codec: MP3, 48kHz, Stereo\n","torrent":{"xt":"urn:btih:f9b3c9b287cacd6cedc76a0e4006284e3c534c23","amp;dn":"It+Can%5C%27t+Happen+to+Me%28constitutional+crisis%26tyranny+in+Americ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9b3c9b287cacd6cedc76a0e4006284e3c534c23","infoHashBuffer":{"type":"Buffer","data":[249,179,201,178,135,202,205,108,237,199,106,14,64,6,40,78,60,83,76,35]},"announce":[],"urlList":[]}}