{"title":"The.Lazarus.Project..avi","uid":5047815,"size":1539787954,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fa39902e630d8edb4006143e4e6aadafc7c4bdfd&amp;dn=The.Lazarus.Project..avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"thefc","files":1,"time":1249691453,"description":"A harrowing and frightening thriller about a man who has everything he's ever loved stripped away from him; and to earn his life and family back, he must face obstacles of mystical origins, endure countless tests of his faith, struggle with his own sanity, and explore the depth and the power of his soul. Written by Anonymous \n\nIn Dallas, Texas, the family man Ben Garvey is on probation but he is a hard worker of the Fort Garry Brewery Company and lives a simple life with his beloved wife Lisa and their daughter Katie. When his probation period finishes, Ben's brother Rick visits him after being released from prison and invites Ben to heist 12 kg of gold in dust from a laboratory. Ben refuses the invitation but he is fired from his job because of his record; he decides to join Ricky and his partner Phelps in the robbery. However things go wrong and Ricky, Phelps and a security guard die in the heist and Ben is sentenced to death for the murders. After his execution through lethal injection, Ben awakes working as housekeeper of the Monte Angel community in Dundee, Oregon, for Father Ezra, who explains to him that his past life is gone and now he is having a second chance. However he should never cross the boundaries of the location, otherwise he would die\n","torrent":{"xt":"urn:btih:fa39902e630d8edb4006143e4e6aadafc7c4bdfd","amp;dn":"The.Lazarus.Project..avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa39902e630d8edb4006143e4e6aadafc7c4bdfd","infoHashBuffer":{"type":"Buffer","data":[250,57,144,46,99,13,142,219,64,6,20,62,78,106,173,175,199,196,189,253]},"announce":[],"urlList":[]}}