{"title":"[Yiu] Gears of War PC PATCH ONLY","uid":5136166,"size":811613,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fa49ecd673c99e891d9e773c18739e9619780225&amp;dn=%5BYiu%5D+Gears+of+War+PC+PATCH+ONLY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"YIUKOROCHKO","files":2,"time":1256498694,"description":"Install Notes~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n *. Set the date to Dec 1 2007.\n 1. Extract RARs.\n 2. Mount or Burn iso.\n 3. Install.\n 4. Run this patch!\n 5. Set the date to Dec 1 2007 if you haven't already done so!!!\n 6. Play!\n\n Note:\n          The exe is a silent (invisible) self-extracting archive. Durring\n     install, you have the option to change the install directory, however\n     doing so means this patch will not be placed in the right folder.\n          THIS IS A PATCH ONLY. The game is far larger, and must be obtai-\n     -ned elsewhere, like RAZOR or other torrent providers.\n\n          FOR A FULL LIST OF ALL GEARS OF WAR TORRENTS VISIT:\n\n    \n\n\n* Gears of War is the first game developed by Epic Games for Microsoft Game\n  Studios. Gears of War thrusts gamers into a deep and harrowing story of\n  humankind's epic battle for survival against the Locust Horde, a nightmarish\n  race of creatures that surface from the bowels of the planet.\n * Engaging and disturbing cinematic story. Massively scoped worlds, memorable\n   characters and an epic story line play out like an intense and unsettling\n   blockbuster action film. Dramatic in-game camera work and a compelling\n   story bring the brutal, emotionally charged experience to life. Gamers\n   control Marcus Fenix and his fire team as they pit advanced human\n   technology against the overwhelming and horrific Locust Horde.\n * Fire team co-op action. All game modes, levels and scenarios are designed\n   for cooperative fire team play (AI or human). For the first time, AI\n   teammates are indiscernible from human players. They move intelligently,\n   take orders effectively, and seek cover and defend themselves when\n   necessary. Gamers will experience richer cooperative gameplay than ever,\n   through unique characters that require cooperation to survive.\n * Unprecedented visuals in next-generation gaming. Gears of War ushers in\n   the next generation with unprecedented visuals. The Unreal Engine 3\n   technology pushes high-definition visual designs and brings out the\n   smallest details in the largest battle. Gamers will experience a rich\n   dynamic world with an unprecedented level of detail. Characters come to\n   life with unbelievable model quality and a physics-integrated animation\n   system that has them truly reacting intelligently to events as they unfold\n   around them.\n * Hyper-realistic and intense combat. In Gears of War the battlefield is a\n   lethal place and to foolishly stand out in the open is to die. To survive,\n   gamers can create and take cover using interactive and dynamic\n   environments, suppress the enemy with blindfire, and use their weapons and\n   teammates to outwit and outfight their enemies.\n\n\n                                        /\n                                       /__\n                                      /  /\n                                     /__/__","torrent":{"xt":"urn:btih:fa49ecd673c99e891d9e773c18739e9619780225","amp;dn":"%5BYiu%5D+Gears+of+War+PC+PATCH+ONLY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa49ecd673c99e891d9e773c18739e9619780225","infoHashBuffer":{"type":"Buffer","data":[250,73,236,214,115,201,158,137,29,158,119,60,24,115,158,150,25,120,2,37]},"announce":[],"urlList":[]}}