{"title":"ITS COMPLICATED por memitoxxx etorrents.org ( ingles - latino )d","uid":5570438,"size":4509093888,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:fac3fc345893f2e9c73cb1d1b4e87e2fbb61ffbe&amp;dn=ITS+COMPLICATED+por+memitoxxx+etorrents.org+%28+ingles+-+latino+%29d&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"memitoxxx","files":-1,"time":1274233776,"description":"It's Complicated\nTÃƒÂ­tulo \tNo es tan fÃƒÂ¡cil\nFicha tÃƒÂ©cnica\nDirecciÃƒÂ³n \tNancy Meyers\nProducciÃƒÂ³n \tNancy Meyers\nScott Rudin\nMÃƒÂºsica \tHans Zimmer\nHeitor Pereira\nReparto \tMeryl Streep\nAlec Baldwin\nSteve Martin\nDatos y cifras\nPaÃƒÂ­s(es) \tEstados Unidos\nAÃƒÂ±o \t2009\nGÃƒÂ©nero \tComedia\nDuraciÃƒÂ³n \t120 min.\n\nDirected by \tNancy Meyers\nProduced by \tNancy Meyers\nScott Rudin\nWritten by \tNancy Meyers\nStarring \tMeryl Streep\nAlec Baldwin\nSteve Martin\nLake Bell\nJohn Krasinski\nMusic by \tHans Zimmer\nHeitor Pereira\nCinematography \tJohn Toll\nEditing by \tJoe Hutshing\nDavid Moritz\nStudio \tRelativity Media\nDistributed by \tUniversal Pictures\nRelease date(s) \tDecember 25, 2009 (2009-12-25)\nRunning time \t121 minutes\nCountry \tUnited States\nLanguage \tEnglish,espaÃƒÂ±ol latino,portugal\nBudget \t$85 million[1][2]\nGross revenue \t$214,886,336 \n\n[URL=http://img180.imageshack.us/my.php?image=62987974.png][IMG]http://img180.imageshack.us/img180/5186/62987974.png[/IMG][/URL]\n\nJane (Meryl Streep) is a self-reliant divorcÃƒÂ©e who owns a successful bakery in Santa Barbara, California. After 10 years of separation and three grown children, she finally achieves a good relationship with her ex-husband Jake (Alec Baldwin), a successful attorney who has remarried the much-younger Agness (Lake Bell).\n\nJane and Jake attend their son Luke's college graduation in New York. A dinner together develops into an affair, making Jane &quot;the other woman&quot;. Part of Jane knows it is wrong, since Jake and Agness are still married and trying to have a baby; the other part of Jane relishes being &quot;the other woman&quot; and continues the affair with Jake in Santa Barbara. Jake is just enjoying the clandestine sex and doesn't show much interest in Jane's growth as a person. He however feels nostalgic for the family life he once had with Jane, particularly her cooking, and being close with his children, and wonders if he should be growing old with Jane rather than starting a new family in late middle-age with Agness. While Agness has Jake scheduled for regular sessions at the fertility clinic, Jake secretly administers sperm control pills, and leaves one day to meet Jane for lunch.\n\nJake and Jane's children know nothing of their parents' affair, although Harley (John Krasinski), who is engaged to their daughter Lauren, spots them in a hotel and keeps silent. Agness knows nothing, as Jake still has sex with her on demand; her five-year-old son Pedro suspects something when Jake makes phone calls from the bathroom.\n\nComplicating matters is Adam (Steve Martin), an architect hired to remodel Jane's home, who is himself healing from a divorce of his own, and who has begun to fall in love with Jane. He spends time getting to know her as a person. On the night of Luke's graduation party, Jane invites Adam to the party, and when he picks her up she's high because she smoked one of the joints that Jake gave her. Then at the party, Adam takes a swift from the joint too and they both become really high. Jake becomes jealous observing them, but with some cajoling by Jane, he gets high as well. Harley confronts Jake and Jane, stressed from keeping their secret, and eventually agrees to smoke some pot as well. Agness then observes Jake and Jane dancing together, and becomes suspicious of their renewed closeness.\n\nWhen they leave, Adam asks if they could have something to eat so Jane takes him to her bakery-restaurant and offers to make him anything; he asks for a chocolate croissant, which they make from scratch laughing and having fun. This takes hours, and they enjoy the time together. As her architect, he shows great sensitivity in listening to her needs and vision for her remodeled kitchen and bedroom.\n\nJake leaves Agness, who kicks him out of their house as he confesses that he's still in love with Jane, who rebuffs his gesture. Eventually via webcam under embarrassing circumstances, Adam learns Jane is still seeing Jake. Adam knows his boundaries and tells Jane he cannot continue seeing her as this triangle will only lead to heartbreak. Her kids also find out, and they are not happy about Mom and Dad getting together again, as they are still recovering from the divorce ten years ago. Jane tells them she is not getting back with their dad, who then drives off in his Porsche while the children go to Harley and Lauren's house. Jane soon reconciles with the kids, citing that she wanted to do this for herself, which they sympathize. When she returns home, Jake awaits her to talk, and the two end their affair on amicable terms.\n\nThe film ends with Adam returning to Jane's house to work on her addition and before the credits roll Jane and Adam are seen laughing while walking into her house.\n\nLanguage and subtitles English,espaÃƒÂ±ol latino,portugal\n\nIMAGENES DEL DVD &lt;a href=&quot;\nhttp://img41.imageshack.us/img41/2406/38456365.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img41.imageshack.us/img41/2406/38456365.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img20.imageshack.us/img20/1301/32814599.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img20.imageshack.us/img20/1301/32814599.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img132.imageshack.us/img132/5642/14483539.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img132.imageshack.us/img132/5642/14483539.png&lt;/a&gt;","torrent":{"xt":"urn:btih:fac3fc345893f2e9c73cb1d1b4e87e2fbb61ffbe","amp;dn":"ITS+COMPLICATED+por+memitoxxx+etorrents.org+%28+ingles+-+latino+%29d","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fac3fc345893f2e9c73cb1d1b4e87e2fbb61ffbe","infoHashBuffer":{"type":"Buffer","data":[250,195,252,52,88,147,242,233,199,60,177,209,180,232,126,47,187,97,255,190]},"announce":[],"urlList":[]}}