{"title":"Coast to Coast AM - Aug 19 2009 - Lucid Dreams, Astral Travel, &amp;","uid":5063086,"size":55099766,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:faf07b899fe50de233e38d31c8e4f65ee23ed95b&amp;dn=Coast+to+Coast+AM+-+Aug+19+2009+-+Lucid+Dreams%2C+Astral+Travel%2C+%26&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1250797407,"description":"Writer on contemporary spirituality specializing in alchemy, Kabbalah and consciousness studies, Mark Stavish spoke about such topics as lucid dreaming, astral projection, and secret societies and their use of ritual. Lucid dreaming, which is becoming aware that you're dreaming while in a dream state, presents certain advantages, he said. It allows people to consciously interact in their dreams while their mind is awake, and can offer learning opportunities, such as receiving spiritual instruction. To have a lucid dream, he suggested that a person pray fervently with that intent before going to sleep, and repeat this prayer during the day.\n\nLucid dreaming sets a person up for the next phase of their spiritual development with astral projection or OBEs (out-of-body experiences), Stavish said. At the start of a projection, a person might experience a spinning sensation, as they leave their body like a &quot;silken tether being unraveled,&quot; and feel their consciousness extend beyond their physical body. There are two types of astral projections, he detailed: In the first, a person travels to everyday locations like their kitchen or nearby street; the second type involves visits to various astral realms beyond physical reality.\n\nStavish stressed the importance of understanding the mind. Such understanding makes you unafraid of your own thoughts-- you can simply accept or reject them, he commented. Secret societies such as the Free Masons use initiation ceremonies, often with a death/rebirth ritual. Such rituals can stimulate a person's psyche or subconscious so they can gain spiritual insights, and overcome the fear of death, he noted.\n\n[This information has been shared to spread knowledge to those who otherwise would not have access to it.  If you can afford it please support www.coasttocoast.com]","torrent":{"xt":"urn:btih:faf07b899fe50de233e38d31c8e4f65ee23ed95b","amp;dn":"Coast+to+Coast+AM+-+Aug+19+2009+-+Lucid+Dreams%2C+Astral+Travel%2C+%26","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"faf07b899fe50de233e38d31c8e4f65ee23ed95b","infoHashBuffer":{"type":"Buffer","data":[250,240,123,137,159,229,13,226,51,227,141,49,200,228,246,94,226,62,217,91]},"announce":[],"urlList":[]}}