{"title":"10.000BC(2008)DvdRip-[Subtitulos.SRT]-Gozita","uid":5063845,"size":42511,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fb1664dfde1a9119c7a821145ed8d29d31c8cdae&amp;dn=10.000BC%282008%29DvdRip-%5BSubtitulos.SRT%5D-Gozita&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Gozita","files":1,"time":1250839588,"description":"Warner Bros. Pictures, en asociaciÃƒÂ³n con Legendary Pictures, presenta 10.000 B. C., dirigida por Roland Emmerich (Independence Day, The Day After Tomorrow). Esta aventura ÃƒÂ©pica es protagonizada por Steven Strait (Sky High) y Camilla Belle (When a Stranger Calls).\n\nUna producciÃƒÂ³n de Centropolis Entertainment de Roland Emmerich Film, 10.000 a. C. es dirigida por Roland Emmerich, el guiÃƒÂ³n fue realizado por Emmerich y Harald Kloser y fue producida por Michael Wimer (Welcome to America), Roland Emmerich y Mark Gordon (The Day After Tomorrow).\n\nLos productores ejecutivos son Tom Karnowski (Everything is Illuminated), Harald Kloser, Thomas Tull (Superman Returns) y Bill Fay. El coproductor es Ossie Von Richthofen (Welcome to America). El director de fotografÃƒÂ­a es Ueli Steiger (The Day After Tomorrow) y la producciÃƒÂ³n es diseÃƒÂ±ada por Jean Vincent Puzos (Lord of War). La pelÃƒÂ­cula estÃƒÂ¡ siendo editada por Alex Berner (Perfume: The Story of a Murderer). El compositor es Harald Kloser y el vestuario es diseÃƒÂ±ado por Renee April (The Day After Tomorrow).\n\n10.000 B. C. fue filmada en Nueva Zelanda, SudÃƒÂ¡frica y Namibia y serÃƒÂ¡ distribuida por Warner Bros. Pictures, una compaÃƒÂ±ÃƒÂ­a de Warner Bros. Entertainment.\n\nEl director, Roland Emmerich, y el compositor, Harald Kloser, escribieron el guiÃƒÂ³n original. Cuando el proyecto recibiÃƒÂ³ luz verde de Columbia Pictures, el guionista John Orloff empezÃƒÂ³ el trabajo redactando un nuevo proyecto sobre la base del guiÃƒÂ³n original. Columbia, bajo Sony Pictures Entertainment, abandonÃƒÂ³ el proyecto debido a problemas de calendario, por lo que Warner Bros. lo recogiÃƒÂ³ posteriormente.\n","torrent":{"xt":"urn:btih:fb1664dfde1a9119c7a821145ed8d29d31c8cdae","amp;dn":"10.000BC%282008%29DvdRip-%5BSubtitulos.SRT%5D-Gozita","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb1664dfde1a9119c7a821145ed8d29d31c8cdae","infoHashBuffer":{"type":"Buffer","data":[251,22,100,223,222,26,145,25,199,168,33,20,94,216,210,157,49,200,205,174]},"announce":[],"urlList":[]}}