{"title":"La vida privada de pippa lee [BR-Screener][Spanish].avi","uid":5652480,"size":1310504960,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fb33444471f0f4f897e6d97b99bbb9c952e799b2&amp;dn=La+vida+privada+de+pippa+lee+%5BBR-Screener%5D%5BSpanish%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"webchella","files":1,"time":1277680955,"description":"TÃƒÂ­tulo: La vida privada de Pippa Lee\nTÃƒÂ­tulo original: The Private Lives of Pippa Lee\nPaÃƒÂ­s: USA\nEstreno en USA: 25/11/2009\nEstreno en EspaÃƒÂ±a: 25/06/2010\nProductora: Tripictures\nDirector: Rebecca Miller\nGuiÃƒÂ³n: Rebecca Miller (Sobre su propia Novela)\nReparto: Robin Wright Penn, Keanu Reeves, Julianne Moore, Alan Arkin, Winona Ryder, Maria Bello, Monica Bellucci, Zoe Kazan, Mike Binder, Ryan McDonald, Blake Lively\n\nSinopsis:\nVisto desde fuera todo harÃƒÂ­a pensar que Pippa Lee (Robin Wright Penn) lleva una vida maravillosa. Ejemplo de serenidad femenina, es la esposa dedicada de un conocido escritor (Alan Arkin) treinta aÃƒÂ±os mayor que ella; es la orgullosa madre de dos hijos grandes, gran amiga y confidente de todos los que entran en su vida. Pero a medida que Pippa sigue lealmente a su marido hacia una nueva vida en una comunidad de retirados, el idÃƒÂ­lico mundo y la personalidad que ella se ha construido a lo largo de su matrimonio tendrÃƒÂ¡n que enfrentarse a una prueba definitiva.\n\nEn realidad, la amable mujer que vemos hoy ha vivido mucha agitaciÃƒÂ³n en su pasado: una gran variedad de desventuras erÃƒÂ³ticas, una madre adicta a las pÃƒÂ­ldoras para adelgazar y el suicidio de una exÃƒÂ³tica rival, hasta encontrar el amor y la seguridad en el seno de su propia familia. Pippa emprende un viaje agridulce de autodescubrimiento, con la ayuda de un extraÃƒÂ±o que reciÃƒÂ©n conoce, sorprendente y reflexivo (Keanu Reeves). Pippa debe enfrentarse ahora a su volÃƒÂ¡til pasado y a las corrientes ocultas de su mundo aparentemente aplacible, para encontrar el verdadero sentido de sÃƒÂ­ misma que siempre ha eludido.\n\nMezcla de ironÃƒÂ­a, humor y fuerza emotiva, The Private Lives Of Pippa Lee retrata la complejidad de las muchas vidas que se ocultan detrÃƒÂ¡s de una sola persona.\n\nNotas de producciÃƒÂ³n:\nAdaptaciÃƒÂ³n de la novela homÃƒÂ³nima de Rebecca Miller. ","torrent":{"xt":"urn:btih:fb33444471f0f4f897e6d97b99bbb9c952e799b2","amp;dn":"La+vida+privada+de+pippa+lee+%5BBR-Screener%5D%5BSpanish%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb33444471f0f4f897e6d97b99bbb9c952e799b2","infoHashBuffer":{"type":"Buffer","data":[251,51,68,68,113,240,244,248,151,230,217,123,153,187,185,201,82,231,153,178]},"announce":[],"urlList":[]}}