{"title":"The Frosty, Heidi, and Frank Show - October 07, 2009","uid":5113840,"size":96901649,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:fba83e3a797e1506766552841b55b4017c8ff0fe&amp;dn=The+Frosty%2C+Heidi%2C+and+Frank+Show+-+October+07%2C+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fhffan","files":-1,"time":1254953803,"description":"That's right! For those of you who don't know, the Triplets are back on the air again! On October 2nd's podcast, Frank announced that starting Monday, October 5th, Frosty, Heidi, and Frank would be back on the air over on 790 KABC in Los Angeles. I took the opportunity to record the show as it was airing and am now releasing it for you all to enjoy. Despite the fact that it is aired over AM, it actually sounds just as good as their podcasts do.\n\nThese files have been edited using Soundbooth to remove all the commercials, traffic updates, world news, etc. Pretty much everything that isn't them has been removed. I'll be doing this every day, as long as people seed.\n\nUPDATE:\nYes, KABC does in fact release the previous day's episode in what they call &quot;podcast&quot; form (thought it's far from that). I mentioned yesterday that if the audio quality was good on those from KABC, then I wouldn't bother doing this anymore...\n\nWell, as you can see, I am back again. Yes, while KABC does have the original show, the version they release (in three parts), is far from great. It was encoded as a 32 kbps MP3 in mono and sounds terrible compared to the live version. I can understand why KABC would do this, though: bandwidth saving. That's why they need to turn to BitTorrent! ;)\n\nEnjoy, and please...seed!\n\nDetails:\n\nDate Recorded - October 7, 2009\nFile Format - MP3\nBit Rate - 128 kbps\nSample Rate - 44.100 kHz\nFile Size - 92.5 MB\nChannels - Joint Stereo\nLength - 101 Minutes, 10 Seconds","torrent":{"xt":"urn:btih:fba83e3a797e1506766552841b55b4017c8ff0fe","amp;dn":"The+Frosty%2C+Heidi%2C+and+Frank+Show+-+October+07%2C+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fba83e3a797e1506766552841b55b4017c8ff0fe","infoHashBuffer":{"type":"Buffer","data":[251,168,62,58,121,126,21,6,118,101,82,132,27,85,180,1,124,143,240,254]},"announce":[],"urlList":[]}}