{"title":"Watchmen Motion Comics [DVDrip][Spanish][CD1]","uid":5049557,"size":736016384,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fc5bd855cba95f2c7b5355323beabc4ddb072f18&amp;dn=Watchmen+Motion+Comics+%5BDVDrip%5D%5BSpanish%5D%5BCD1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"sahae","files":1,"time":1249926080,"description":"Watchmen (Ã‚Â«VigilantesÃ‚Â» en espaÃƒÂ±ol) es un cÃƒÂ³mic escrito por Alan Moore y dibujado por Dave Gibbons, ambos de nacionalidad britÃƒÂ¡nica. Fue publicado por primera vez por DC Comics durante los aÃƒÂ±os 1986 y 1987 como una serie limitada de 12 nÃƒÂºmeros. Con posterioridad, las entregas fueron reimpresas en un ÃƒÂºnico tomo que ayudÃƒÂ³ a popularizar el formato de novela grÃƒÂ¡fica.\n\nLa obra ha sido reeditada varias veces y traducida a distintos idiomas, entre ellos el espaÃƒÂ±ol. Tras varios proyectos cancelados, Zack Snyder serÃƒÂ¡ el director encargado de adaptar el relato a la pantalla grande.\n\nWatchmen se convirtiÃƒÂ³ en 1988 en la primera novela grÃƒÂ¡fica en conseguir un Premio Hugo, galardÃƒÂ³n otorgado a escritores de los gÃƒÂ©neros de ciencia ficciÃƒÂ³n y fantasÃƒÂ­a. AdemÃƒÂ¡s, es la ÃƒÂºnica obra de su gÃƒÂ©nero que aparece en la lista elaborada en el aÃƒÂ±o 2005 por la revista Time 100 best novels. 1923 to the present, que incluye una selecciÃƒÂ³n de cien novelas en lengua inglesa publicadas desde el aÃƒÂ±o 1923.\n\nLa acciÃƒÂ³n de Watchmen se desarrolla en el aÃƒÂ±o 1985, en el marco de una ucronÃƒÂ­a en la que los Estados Unidos estÃƒÂ¡n a punto de entrar en una guerra nuclear con la UniÃƒÂ³n SoviÃƒÂ©tica. En este escenario, se relata la historia de un grupo de superhÃƒÂ©roes del pasado y del presente y los hechos que rodean el misterioso asesinato de uno de ellos. Watchmen presenta a los superhÃƒÂ©roes como gente corriente que debe enfrentarse a sus propios conflictos ÃƒÂ©ticos y a sus problemas personales, que lucha contra sus trastornos y fracasos y que, con la notable excepciÃƒÂ³n del Doctor Manhattan, carecen por completo de superpoderes. La deconstrucciÃƒÂ³n que la obra realiza del arquetipo convencional del superhÃƒÂ©roe, combinado con el innovador uso de tÃƒÂ©cnicas cinemÃƒÂ¡ticas, de abundante simbolismo y de la metaficciÃƒÂ³n, han ejercido una importante influencia sobre cÃƒÂ³mics y pelÃƒÂ­culas posteriores. \n\n","torrent":{"xt":"urn:btih:fc5bd855cba95f2c7b5355323beabc4ddb072f18","amp;dn":"Watchmen+Motion+Comics+%5BDVDrip%5D%5BSpanish%5D%5BCD1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc5bd855cba95f2c7b5355323beabc4ddb072f18","infoHashBuffer":{"type":"Buffer","data":[252,91,216,85,203,169,95,44,123,83,85,50,59,234,188,77,219,7,47,24]},"announce":[],"urlList":[]}}