{"title":"Review Lecture Session 6 - Math.zip","uid":5593581,"size":76861781,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:fce3381ab17ee9d8eedc8ef40d705745eb3651b3&amp;dn=Review+Lecture+Session+6+-+Math.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Erasariel","files":1,"time":1274957415,"description":"**READ BEFORE DOWNLOADING**\n\nTorrent Information - Review Lecture Session 6 - Math.zip\nTorrent managed and seeded by Erasariel\n\nTechnical Information\n\nFound in:\n\nThe Pirate Bay\n\nTrackers: 6\n\n**please take note that the seeder may not be active at all times**\n-------------------------\n\nContents:\n\nName\t\t\t\t\t\t\tSize\n\nInformation.txt\t\t\t\t\t\t2.21 KB\nReview Lecture Session 6 - Math - Part 1.wav\t\t29.8 MB\nReview Lecture Session 6 - Math - Part 2.wav\t\t28.4 MB\nReview Lecture Session 6 - Math - Part 3.wav\t\t18.6 MB\n                                                       \t---------\n                                                        76.9 MB\n\nContent Synopsis:\n\nThis is a series of three recordings taken at the Ofelia Orate Review Center on the 27th of May, 2010, from 10 AM to 2 PM. This lecture on Mathematics, hosted by Ofelia Orate, covers a wide range of topics in algebra and geometry, from triangles to quadrilaterals, and another pass at algebra which mostly is comprised of solving word problems (both in English and in Filipino). Scattered throughout the recording are tips and advice on taking the college examinations in the Philippines, such as when to start studying and so forth. The quality of the recording is good on most of the recording, and the teacher is very much audible and understandable for most of the recordings. Be warned that, as with all of my recordings, this will take at least two hours to finish, so you might want to listen to it, piece by piece, on the go, or when you just don't have anything to do. Also, this is not absolute review material. Don't rely solely on this!\n\nPlease do take note that this lecture is in Filipino, mostly. There *are* parts in which the lecture is in English, but I strongly recommend having a good or nearly flawless understanding of the language before attempting to download. No, there will be no alternate soundtracks or a word-by-word translation.\n\nBefore anyone asks, these recordings have been executed with permission from both the authorities and the teacher. This is an original recording and has not been &quot;ripped&quot; from any source. You may seed and help distribute this file, but please do not use this for any purpose other than academic (and especially not commercial).\n\nEnjoy the download!\n\nErasariel","torrent":{"xt":"urn:btih:fce3381ab17ee9d8eedc8ef40d705745eb3651b3","amp;dn":"Review+Lecture+Session+6+-+Math.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fce3381ab17ee9d8eedc8ef40d705745eb3651b3","infoHashBuffer":{"type":"Buffer","data":[252,227,56,26,177,126,233,216,238,220,142,244,13,112,87,69,235,54,81,179]},"announce":[],"urlList":[]}}