{"title":"Maleficio.An American Haunting.[dual-DVDRip].[Ac3 5.1].","uid":5132834,"size":1323526144,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fceb0675162b1bd6570ea5fdb35600de02c4b4e7&amp;dn=Maleficio.An+American+Haunting.%5Bdual-DVDRip%5D.%5BAc3+5.1%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zurera","files":1,"time":1256243695,"description":"TÃƒÂ­tulo original: An American Haunting\nDirector: Courtney Solomon\nGÃƒÂ©nero: Thriller, Terror\nAÃƒÂ±o: 2006\nPais: USA\nDuracion 90 minutos\nInterpretes: Donald Sutherland, Rachel Hurd-Wood, James DÃ‚Â´Arcy, Matthew Marsh, Sissy Spacek, Thom Fell, Zoe Thorne, Gaye Brown\n\nSinopsis:Basada en hechos reales, cuenta la historia de John Bell, un hombre que, tras ser maldecido por una bruja, fue 'visitado' por un espÃƒÂ­ritu maligno que aterrorizÃƒÂ³ a su familia. En 1818, la familia Bell comenzÃƒÂ³ a percibir fenÃƒÂ³menos extraÃƒÂ±os en su propiedad. Al principio, se manifestaban en forma de sonidos: pequeÃƒÂ±os ruidos inexplicables, respiraciÃƒÂ³n dificultosa e incluso pasos, pero la potencia de los ataques aumentÃƒÂ³ con el paso del tiempo. El espÃƒÂ­ritu comenzÃƒÂ³ a crecer, como si madurara. Se volviÃƒÂ³ agresivo y comenzÃƒÂ³ a descargar su ira sobre John Bell, el padre de familia, y su ÃƒÂºnica hija, Betsy, que sufrÃƒÂ­a ataques crueles, horribles e imparables. El ente se ensaÃƒÂ±aba con ella, sometiÃƒÂ©ndole habitualmente a palizas brutales. La familia buscÃƒÂ³ desesperadamente la causa que habÃƒÂ­a atraÃƒÂ­do al espÃƒÂ­ritu hacia ellos, con la esperanza de encontrar la manera de derrotarlo y salvar a su hija. Sin embargo, sus esfuerzos fueron en vano y los ataques continuaron, hasta afectar a la salud de la familia, especialmente la de John Bell. Fue en 1998 cuando se encontrÃƒÂ³ un manuscrito del profesor de la escuela local(que habÃƒÂ­a vivido en la propiedad en la ÃƒÂ©poca en que sucedieron los hechos), cuando se conociÃƒÂ³ el terrible motivo que habÃƒÂ­a causado el maleficio y que serÃƒÂ­a finalmente revelado.\n","torrent":{"xt":"urn:btih:fceb0675162b1bd6570ea5fdb35600de02c4b4e7","amp;dn":"Maleficio.An+American+Haunting.%5Bdual-DVDRip%5D.%5BAc3+5.1%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fceb0675162b1bd6570ea5fdb35600de02c4b4e7","infoHashBuffer":{"type":"Buffer","data":[252,235,6,117,22,43,27,214,87,14,165,253,179,86,0,222,2,196,180,231]},"announce":[],"urlList":[]}}