{"title":"Dan Miller: A REALLY Inconvenient Truth","uid":5086653,"size":189930433,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fd2e7eb532fe4cedcd6598d4e0cdc88548952bb6&amp;dn=Dan+Miller%3A+A+REALLY+Inconvenient+Truth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"toblakai","files":1,"time":1252771870,"description":"A REALLY Inconvenient Truth: Dan Miller \n\nDan Miller's presentation focuses on why the UN IPCC (Intergovernmental Panel on Climate Change) reports are actually best case scenarios. For example, IPCC climate models do not include the effect of melting permafrost releasing greenhouse gases, even though the permafrost is melting now and it holds more greenhouse gases than all that mankind has ever released.\n\nAnother example is that IPCC predictions of sea level rise only take into account thermal expansion of the oceans and melting of glaciers; the largest factor, disintegration of glaciers, was not included because it is hard to model. The result is that sea level rise will likely be substantially higher this century than the IPCC predicts.\n\nMiller discusses several other potential catastrophes that are not included in IPCC predictions and also discusses tipping points that could put climate change solutions out of our reach in years or decades, the psychology of climate change, and why it is difficult for people to respond to the threat posed by a warming earth.\n\nHis talk concludes with a discussion of ways to address climate change and the risks and opportunities that companies face due to the climate crisis.\n\nDan Miller - Dan Miller is Managing Director of the Roda Group. He is the former president of Ask Jeeves, Inc., a Roda Group affiliate company. He is currently working with a number of Roda Group affiliated companies to assist them with their business development efforts. Mr. Miller sits on the Board of several Roda Group companies.\n\nAt the end of 1994, Mr. Miller retired from his position as Executive Vice President of TCSI Corporation (Nasdaq: TCSI), a company he co-founded with his Roda Group partner, Roger Strauch. Mr. Miller retired from the Board of Directors of TCSI in June of 1997. TCSI is a leading provider of integrated software products and services for the global telecommunications industry.\n\nPrior to TCSI, Mr. Miller was a systems engineer at Hughes Aircraft's Space and Communications Group where he was responsible for designing communications payloads for commercial communications satellites.","torrent":{"xt":"urn:btih:fd2e7eb532fe4cedcd6598d4e0cdc88548952bb6","amp;dn":"Dan+Miller%3A+A+REALLY+Inconvenient+Truth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd2e7eb532fe4cedcd6598d4e0cdc88548952bb6","infoHashBuffer":{"type":"Buffer","data":[253,46,126,181,50,254,76,237,205,101,152,212,224,205,200,133,72,149,43,182]},"announce":[],"urlList":[]}}