{"title":"More-secure Puppy Linux - WYOMING WARDOG","uid":5129597,"size":121964544,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:fd4056cd91d8efa2970aa8bd0141c84a303248ac&amp;dn=More-secure+Puppy+Linux+-+WYOMING+WARDOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"kittyfeet1","files":1,"time":1255987545,"description":"WarDog\nA puppylinux 4.21 derivative\n\nWarDog build9k2.iso (116MEGS)\nby ZooT aLLures.\n\n\nWardog is privacy enhanced version of puppylinux 4.21\nA backend tool in the war against online privacy.\nThe primary motivation for creating WarDog came from a thread at a discussion board.\n\nWarDog, just like it's puppylinux parents runs as a &quot;live-CD&quot;.\nPut it n your cdrom drive, boot it, and enjoy.\nAgain, like it parents, it's also installable, as either a frugal install(copied to hard disk, but loads and runs from RAM,\nor as a full install, just like any &quot;normal&quot; linux distribution\n\nWarDog contains, in addition to the usual puppylinux software packages:\nseamonkey 1.1.16 browser suite with the enigmail email encryption plugin installed and configured.\n\nGnu Privacy Guard, generic but very full bodied encryption utility suite.\n\nGnu Privacy Assistant, A graphical user interface for Gnu Privacy Guard(Gpg) for the point n' click folks out there.\n\nOpenVPN, with a graphical user interface, &quot;I&quot; wrote, in GTKDialog3 to allow configuration/operation by point n' click users.\nThis interface makes the configuration and operation of a simple &quot;shared key&quot; vpn a very simple matter.\nIt creates the proper environment, including loading the required &quot;tun&quot; modules, wites the iptables, opens the required ports,\n accepts and writes configuration data to the proper files, generates keys, and will start and shutdown the vpn, point n' click style.\nIt also contains the openssh suite allowing one to start an ssh server at one end of the openvpn tunnel and, using included &quot;SSH GUI secure telnet&quot;\nincluded in puppy by default add a double layer of encryption between the computers connected via openVPN.\n\nBookmarkIP, a small desktop utility &quot;I&quot; wrote that does a DNS query on a domain name and writes the results to /etc/hosts thus bypassing the necessity of further DNS queries for any domain bookmarked. (this is helpful if the US government, or any other entity, selectivly deletes any DNS entries, you'll still be able to get to your favorite sites. Idea for that by Michael W. Dean of \nRIGHT ARM OF WYOMING &lt;a href=&quot;\nhttp://www.rightarmofwyoming.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rightarmofwyoming.com&lt;/a&gt;\n\n\nZoot sez: \nI'm releasing this a donationware*, meaning, it's GPL'd software**, but if you find it useful, and would like me to continue it's development,\nTossing me a few, or maybe even more than a few bucks would certainly help*grin*\n\n\nI'd like to give special thanks to the puppylinux crew for their hard work(as if it's not a labor of love ;) )\nAnd to all those who have come before me, and all those yet to come in the world of software development.\n\nDonations can be made to:\nslimedog1\nat\npaypal\ndot\ncom\n\n\nAnd if you don't, won't, or can't use paypal\nEmail me at: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;eb9184849fddd3ddab928a838484c5888486&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nand we'll figure something else out.\nThank you for visiting\n\n*For snoops, spooks, govgoons, pigs, and other thugs of state operating in an either official or unofficial capacity in the name of your god, the state,\nthe price is $350,000 per copy, per seat, per day of usage, and by downloading this package you agree to pay for it.\n**My stuff is ZPL'd, which is the same as GPL, but please don't redistribute it without permission, ask and ye' shall receive\n","torrent":{"xt":"urn:btih:fd4056cd91d8efa2970aa8bd0141c84a303248ac","amp;dn":"More-secure+Puppy+Linux+-+WYOMING+WARDOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd4056cd91d8efa2970aa8bd0141c84a303248ac","infoHashBuffer":{"type":"Buffer","data":[253,64,86,205,145,216,239,162,151,10,168,189,1,65,200,74,48,50,72,172]},"announce":[],"urlList":[]}}