{"title":"Vulture - Fatal Games (1990)","uid":5078220,"size":70044206,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fd491aa65cf8a475a9e5f2b6fa1266b8d07ae19a&amp;dn=Vulture+-+Fatal+Games+%281990%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":-1,"time":1252053119,"description":"VULTURE - Fatal Games\nNetherlands 1990\n\n1. S.O.S. 2. You're Invited (To My Chainsaw Party) 3. I Stand Apart 4. No Romance 5. Psycho 6. Coitus Tormentus (Hard Love) 7. Fatal Games 8. Don't Pray 9. They're Here 10. Not Six But Seven Dead\n\nDespite the vast amount of middle-ground thrash metal released in the late eighties and early nineties, some of the albums even in this category were quite solid releases after all. Vulture's Fatal Games may not be the most distinctive album of its kind, but it carries a consistent stomping feel with a fair deal of variety and even some originality. Not to forget about the production that is very heavy and full, resulting in a warm and organic sound that you can rarely find nowadays. Musically it is an appealing effort, with fine full-speed thrashers like I Stand Apart accompanied by some ultra-heavy stompers like No Romance which must be actually among the best in its class. The vocal performance is laudably intense, and despite using a fairly high range at times it fits the general dark sound very nicely. All this considered, it is no surprise that in the end Fatal Games manages to stand out even in the crowded scene. ","torrent":{"xt":"urn:btih:fd491aa65cf8a475a9e5f2b6fa1266b8d07ae19a","amp;dn":"Vulture+-+Fatal+Games+%281990%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd491aa65cf8a475a9e5f2b6fa1266b8d07ae19a","infoHashBuffer":{"type":"Buffer","data":[253,73,26,166,92,248,164,117,169,229,242,182,250,18,102,184,208,122,225,154]},"announce":[],"urlList":[]}}