{"title":"Wise Disk Cleaner Pro.v4.64Build199","uid":5069802,"size":2679941,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fde8d7a1d9673d5d3ad5ea14b4882ed46eb9b99d&amp;dn=Wise+Disk+Cleaner+Pro.v4.64Build199&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marcco","files":-1,"time":1251297600,"description":"Wise Disk Cleaner Pro 4.64 Build 199\n\nWise Disk Cleaner Pro is a user friendly, fast and easy to use application developed to free up disk space by deleting junk files that are no longer used by any software on your system. Even the least experienced user can easily remove junk files with this tool. Your hard disk is littered with junk files you don't need, taking up precious hard disk space, and potentially slowing down your PC's performance. There are files of all kinds, such as temporary files that applications should delete when they're no longer needed, and various log files, index files and backup files. You'd be amazed at how much space these junk files take up.\n\n\nWise Disk Cleaner can identify more than 50 types of junk files, and you can customize the list. The program only deletes the files that you tell it to. You can choose to have the files permanently deleted, or else first moved to the Recycle Bin. And you can have the program do the cleanup automatically, or you can do it manually. You'll be amazed at how much hard disk space this program can gain for you, so automatically got back plenty of hard disk space. The Professional Edition provides many advanced options. It lets you identify more junk files and old files. And for your safety, you can move these files to a designated folder, allowing you to restore them if needed.\n\nWindows XP/Vista\n\nUse keygen to register.","torrent":{"xt":"urn:btih:fde8d7a1d9673d5d3ad5ea14b4882ed46eb9b99d","amp;dn":"Wise+Disk+Cleaner+Pro.v4.64Build199","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fde8d7a1d9673d5d3ad5ea14b4882ed46eb9b99d","infoHashBuffer":{"type":"Buffer","data":[253,232,215,161,217,103,61,93,58,213,234,20,180,136,46,212,110,185,185,157]},"announce":[],"urlList":[]}}