{"title":"Jay Sean feat. Lil Wayne - Down","uid":5082908,"size":135088132,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:fe3f440fc28dda3ca67e61d1a46bc550120c6ef2&amp;dn=Jay+Sean+feat.+Lil+Wayne+-+Down&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1252485363,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Down&quot; is the American-debut single by British R&amp;B artist Jay Sean, from his American-debut album (third studio album in total) All or Nothing. The single features American rapper and label mate Lil Wayne and was officially released on iTunes on June 30 2009, but began to be played on radio stations across the U.S. from May 31, 2009.\n\nThe video was produced by Shurwin Beckford and directed by Richard Pengelley for Jayded Entertainment/Guerilla Hype/Hey Buddy and edited by Jamie Mac and Adam Wood. It was first shot in London, Buckinghamshire on April 24, 2009 without Lil Wayne, then was finally completed in Miami, Florida to finish the video with Lil Wayne on April 30, 2009. The video was shot over two days. Meanwhile, the music video was being produced alongside the video for &quot;Written On Her&quot;. The Buckinghamshire mansion featured is Hedsor House, an enormous private mansion and park where Mark Ronson hosted his 33rd birthday and the place where The Golden Compass was filmed. The video premiered on July 23, 2009 on Jay Sean's officialprofile.\n\nDuring the week of August 10, 2009, the music video was featured as iTunes' Free Music Video of the Week.\n\nAll or Nothing is the third studio album by UK R&amp;B recording artist Jay Sean due for release in October 2009 by Cash Money Records. It will also serve as the artist's debut American album. Rap-Up.com has reported that the album is set for release on November 24, 2009.\n\n&quot;Down&quot; featuring label-mate Lil Wayne was released on June 30, 2009 in the US as the album's lead single and has so far peaked at number 2 on the Billboard Hot 100. It is being released in the UK in August for digital download and September on CD.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:fe3f440fc28dda3ca67e61d1a46bc550120c6ef2","amp;dn":"Jay+Sean+feat.+Lil+Wayne+-+Down","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe3f440fc28dda3ca67e61d1a46bc550120c6ef2","infoHashBuffer":{"type":"Buffer","data":[254,63,68,15,194,141,218,60,166,126,97,209,164,107,197,80,18,12,110,242]},"announce":[],"urlList":[]}}