{"title":"Coast to Coast AM - Aug 17 2009 - Ghost Investigations &amp; EVPs","uid":5063078,"size":55559383,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:fe5d723c117e808c430ed6505575df1731979408&amp;dn=Coast+to+Coast+AM+-+Aug+17+2009+-+Ghost+Investigations+%26+EVPs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1250797248,"description":"Paranormal investigator and star of the TV show Haunting Evidence, Patrick Burns discussed his work on cold cases such as the Zodiac Killer, and Natalee Holloway, as well as presented a group of EVP recordings. During the three seasons Haunting Evidence aired on Court TV (Tru TV), he, psychic profiler Carla Baron, and medium John J. Oliver, explored 27 different cases. In the Holloway case, interesting details emerged that hadn't been explored in mass media, he said. \nIn their investigation of the Zodiac killings, they revisited the crime scenes, such as Lake Berryessa in Northern California, where a couple was attacked. Burns said he had a thermal sensor set up there (often used to find cold or hot spots), and he monitored a highly anomalous reading-- a drastic temperature shift that went from 45 degrees to -33 (below zero) in one location. \nBurns recently co-wrote The Other Side, a ghost hunting guide for teens. He said teen investigators should always get permission to investigate specific locations, and can benefit from having an adult mentor, such as a police officer, travel with them.\n\nEVP (electronic voice phenomena) is the strongest evidence for ghostly activity, he believes, and a digital audio recorder seems to do the best job capturing such sounds. He noted that the Panasonic RR-DR60 model is thought to be particularly effective, but it was withdrawn from the market because transcriptionists were complaining that it was picking up voices that weren't there. Burns shared some EVPs, including one recorded at a cemetery that sounded like a little girl saying &quot;be nice.&quot; He also revealed that feline sounds had shown up on EVPs, including one at a restaurant where it sounded like two cats were fighting.\n\nUK Releases UFO Files\nFirst hour guests, researcher Nick Pope and investigative reporter Linda Moulton Howe commented on the UK's release of more UFO files. Most of the material is fairly mundane, said Pope, though some of the reports deal with 'Britain's Roswell,' the Rendlesham Forest incident. Col. Charles Hart, who was present at the 1980 incident, as the base commander at RAF Bentwaters, has recently said that the structured craft observed in the forest were of ET origin, Linda detailed. For more on the UK release, see the article below.\n\n[This information has been shared to spread knowledge to those who otherwise would not have access to it.  If you can afford it please support www.coasttocoast.com]","torrent":{"xt":"urn:btih:fe5d723c117e808c430ed6505575df1731979408","amp;dn":"Coast+to+Coast+AM+-+Aug+17+2009+-+Ghost+Investigations+%26+EVPs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe5d723c117e808c430ed6505575df1731979408","infoHashBuffer":{"type":"Buffer","data":[254,93,114,60,17,126,128,140,67,14,214,80,85,117,223,23,49,151,148,8]},"announce":[],"urlList":[]}}