{"title":"Coast to Coast AM - Oct 11 2009 - Natural Highs","uid":5121290,"size":57119784,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fe7bded962c08aea594a8845f53a976757740c5c&amp;dn=Coast+to+Coast+AM+-+Oct+11+2009+-+Natural+Highs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1255364202,"description":"Natural Highs\n\nDate: 10-11-09\nHost: Ian Punnett\nGuests: James Nestor, Ken Gerhard\n\nJournalist James Nestor discussed how the brain achieves the feeling of &quot;being high&quot; in terms of neurology, biology, and physiology through meditations, illusions, common herbs, &amp; audio and visual stimulations, all without using drugs. Breathing exercises or &quot;breathwork&quot; offers one of the most potent and beneficial ways to clear the mind and induce relaxation, he noted. Curiously, certain kinds of cheese, such as Stilton, are said to bring about odd and memorable dreams if eaten (around 1 oz.) just before sleep.\n\nSpecific kinds of audio can induce a variety of mental moods or physiological responses. Binaural Beats, in which a different frequency comes out of the left and right speaker, cause the brain to become confused, and create its own auditory track, he said. And listening to the Theta Wave Brain Sync can lull the mind into a creative and vibrant state, similar to what people experience just before falling asleep. \n\nDifferent visual illusions demonstrate the malleability of the brain, and how perceptions can be altered through imagery. In the 'Vomit Vector,' a series of dots appear to be moving and undulating even though they are completely stationary. He also shared some of his anthropological research, detailing how tribes in Brazil, for instance, ingest bizarre substances such as moth larvae to create altered or psychedelic states.\n\nThunderbird Sightings\n\nFirst hour guest, Ken Gerhard (book link) talked about sightings of Thunderbirds and other huge winged creatures. The legend of the Thunderbird is cross-cultural and runs across North American Indian tribes, he noted. In 1977, just after the Lawndale, Illinois incident where a large bird picked up a small boy, a photographer named John Huffer shot footage of two gigantic birds in Lake Shelbyville, though some dismissed them as being turkey vultures, he detailed. Callers shared stories of their encounters with giant birds in the latter part of the conversation.\n\nWebsite(s):\ngethighnow.com\n\nBook(s):\nGet High Now (without drugs)\nBig Bird! Modern Sightings of Flying Monsters\n\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224","torrent":{"xt":"urn:btih:fe7bded962c08aea594a8845f53a976757740c5c","amp;dn":"Coast+to+Coast+AM+-+Oct+11+2009+-+Natural+Highs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe7bded962c08aea594a8845f53a976757740c5c","infoHashBuffer":{"type":"Buffer","data":[254,123,222,217,98,192,138,234,89,74,136,69,245,58,151,103,87,116,12,92]},"announce":[],"urlList":[]}}