{"title":"Dreamland - 06-26-10 - Help The People Of The Sea","uid":5656655,"size":8394806,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fe85c0b59a425733d981a38f12588c5591322fa1&amp;dn=Dreamland+-+06-26-10+-+Help+The+People+Of+The+Sea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Lyrian","files":2,"time":1277830282,"description":" Saturday June 26th, 2010\n\nHelp the People of the Sea\n\nStarfire Tor considers whales and dolphins the people of the sea. They are sentient, they are sensitive, they are emotionally complex and have good minds, and they are hunted down and eaten by countries like Japan, Iceland, Norway and others.\n\nIn this edition of Dreamland, she issues a call to arms, to completely change the way we look at them, to stop even calling them animals and refer to them instead as the people of the sea, and extend to them the same rights to freedom from interference and the sanctity of life that we extend to each other.\n\nListen as she tells us about her stirring idea, and how simple--and absolutely free--it is to join the effort to keep countries like Japan from overturning the whaling ban that is now in effect.\n\nAlso, as so often happens with Whitley Strieber when he is about to interview Starfire, he had a major time slip on Monday, the day before the interview was recorded. She tells us how we can become more conscious of our movement through different timelines, and why it is that Whitley is beginning to notice timeslips more and more.\n\nThis is a very special and important edition of Dreamland. You can do something to help the people of the sea by listening and taking action. It is simple, it is free, and it could be the start of the next phase of human consciousness. ","torrent":{"xt":"urn:btih:fe85c0b59a425733d981a38f12588c5591322fa1","amp;dn":"Dreamland+-+06-26-10+-+Help+The+People+Of+The+Sea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe85c0b59a425733d981a38f12588c5591322fa1","infoHashBuffer":{"type":"Buffer","data":[254,133,192,181,154,66,87,51,217,129,163,143,18,88,140,85,145,50,47,161]},"announce":[],"urlList":[]}}