{"title":"Registry Repair Wizard 2009 v6.15 Retail","uid":5078850,"size":3602214,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fec10af0249d0ef53db4e4df3a0e10cddd8f8821&amp;dn=Registry+Repair+Wizard+2009+v6.15+Retail&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marcco","files":-1,"time":1252104806,"description":"Registry Repair Wizard 2009 v6.15 Retail\n\n     \n\n\n     Registry Repair Wizard - repair registry and boost Windows performance!\n\n     Registry Repair Wizard scans the Windows registry and finds incorrect or obsolete information in the registry. By repairing these obsolete information in Windows registry, your system will run faster and error free. The backup/restore function of the tool let you backup your whole Windows Registry so you can use it to restore the registry to the current status in case you encounter some system failure. Besides above, the startup and BHO organizer feature let you manage your startup and IE BHO items with ease, and you can control the programs started with Windows and IE more handy with this feature!\n\n     In short, Registry Repair Wizard help you get rid of the bloat in Windows registry and achieve a cleaner, faster system.\n\n     Registry Repair Wizard Features:\n\n#     Automatic Registry Scanning and Cleanup\n   \n# Backup and Restore the full Registry\n   \n# Startup Organizer\n   \n# IE BHO Organizer\n   \n# Improve system performance\n   \n# Remove Trojan which utilize startup items and IE BHO\n\n     Boost System Performance with Registry Repair Wizard 2009\n     The Windows registry is a database repository for information about a computer's configuration. The registry keep growing when you use Windows. As it does so, it attracts obsolete and unnecessary information, and gradually becomes cluttered and fragmented. With the growing of the registry, it can degrade the performance of the whole system and cause many weird software problems.\n\n Repair and Clean  Windows Registry\n     Registry Repair Wizard not only cleans, but also organizes and streamlines your system registry, unclogging the gunk that life online leaves behind...\n\n     Full Windows Registry Backup and Restore\n     The full registry backup and restore feature let you backup the whole Windows registry and you can use it to restore your system to the previous state in case of any system failure...\n\n     Defeat Internet Explorer Hijack and Homepage Hijack\n     IE guard feature will defeat any browser hijack and homepage hijack problem by spyware and adware programs...\n \n     Fully Compatible with Windows Vista and XP\n     Registry Repair Wizard is fully compatible with Windows Vista (both x86 and x64 version of Vista). Our product support Windows Vista, XP, 2003, 2000, ME and Windows 98.","torrent":{"xt":"urn:btih:fec10af0249d0ef53db4e4df3a0e10cddd8f8821","amp;dn":"Registry+Repair+Wizard+2009+v6.15+Retail","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fec10af0249d0ef53db4e4df3a0e10cddd8f8821","infoHashBuffer":{"type":"Buffer","data":[254,193,10,240,36,157,14,245,61,180,228,223,58,14,16,205,221,143,136,33]},"announce":[],"urlList":[]}}