{"title":"Coast to Coast AM - Sep 19 2009 - Phantom Companions","uid":5100142,"size":56613316,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:ff0b60a78337039865fbe959d9daba4fbe3a64ce&amp;dn=Coast+to+Coast+AM+-+Sep+19+2009+-+Phantom+Companions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"0vercast","files":4,"time":1253906409,"description":"Phantom Companions\n\nDate: 09-19-09\nHost: Ian Punnett\nGuests: John Geiger, Sharon Zecchinelli\n\nAward-winning author and explorer John Geiger shared stories from his book, The Third Man Factor: Surviving the Impossible, which chronicles how people endure moments of great stress and crisis, sometimes at the very edge of death, with the help of an unseen companion. Adventurer Peter Hillary, son of Edmund, maintains that he felt the presence of his deceased mother when he was on an Antarctic expedition to reach the South Pole and cross the frozen continent. Hillary believes the experience was something he called up from within himself, Geiger noted.\n\n\nWorld Trade Center survivor Ron DiFrancesco is another such case. On 9/11, DiFrancesco found himself trapped above the airplane impact point in the South Tower, searching for a way out of the burning building. Just as all seemed lost, DiFrancesco claims to have heard an angelic voice directing him to go downstairs toward the flames. He followed the seemingly dangerous instructions and became the last person to exit the South Tower before it collapsed.\n\nGeiger talked about Lynn Robertson, who believes she saw Christ in the lifeboat with her family after their boat was attacked and destroyed by killer whales in the Pacific Ocean. He also mentioned experiences by polar explorer Ann Bancroft, climber Jim Sevigny, as well as mountaineer Reinhold Messner, who says he felt the presence of a phantom helper during a disastrous ascent of Nanga Parbat, where his brother lost his life.\n\nGeiger discussed some scientific explanations for the phenomenon, including the research of Dr. Peter Suedfeld, who concluded that the 'third man' was likely a psychological coping mechanism. Geiger also thinks there is neurological basis for the experience. Other researchers have successfully invoked this 'divine presence' in a clinical setting by using electrical stimulus. However, the replicated event was missing a sense of benevolence and comfort that seems to be a hallmark of the real world experience, Geiger added.\n\nNational Animal Identification System\n\nFirst hour guest, activist Sharon Zecchinelli, talked about her opposition to a government program to identify and track livestock animals in the United States. According to Zecchinelli, the USDA-mandated National Animal Identification System (NAIS), originally designed to help big beef producers gain entry into export markets which required disease controls, does little to contribute to food safety and opens the door for government tracking of real property.\n\nUnder NAIS, every premises that houses at least one livestock animal will need to get a registration number from the USDA, Zecchinelli said. Owners would be required to register a family horse or pet llama, she explained, noting that dogs could also be added to the USDA's list of 'livestock' animals. In addition, NAIS puts an encumbrance on the property by allowing the USDA access to check up on the livestock any time they wish, Zecchinelli added.\n\nWebsite(s):\njohngeiger.net\n\nBook(s):\nThe Third Man Factor: Surviving the Impossible\nFirst They Came For the Cows\n\n\n\nbrought to you by:\n                                                \n .d8888b.                                                      888    \nd88P  Y88b                                                     888    \n888    888                                                     888    \n888    888 888  888  .d88b.  888d888 .d8888b  8888b.  .d8888b  888888 \n888    888 888  888 d8P  Y8b 888P&quot;  d88P&quot;        &quot;88b 88K      888    \n888    888 Y88  88P 88888888 888    888      .d888888 &quot;Y8888b. 888    \nY88b  d88P  Y8bd8P  Y8b.     888    Y88b.    888  888      X88 Y88b.  \n &quot;Y8888P&quot;    Y88P    &quot;Y8888  888     &quot;Y8888P &quot;Y888888  88888P'  &quot;Y888 \n\nTorrents: http://thepiratebay.se/user/0vercast/\nRSS: http://rss.thepiratebay.se/user/2eb7e342dacfa8938e79732ad03e1224","torrent":{"xt":"urn:btih:ff0b60a78337039865fbe959d9daba4fbe3a64ce","amp;dn":"Coast+to+Coast+AM+-+Sep+19+2009+-+Phantom+Companions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff0b60a78337039865fbe959d9daba4fbe3a64ce","infoHashBuffer":{"type":"Buffer","data":[255,11,96,167,131,55,3,152,101,251,233,89,217,218,186,79,190,58,100,206]},"announce":[],"urlList":[]}}