{"title":"Michael Jackson - You Rock My World (Short Version)","uid":5023674,"size":204294148,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ff15f60e302bf0ae1f0c7d0ceecbf429834af46b&amp;dn=Michael+Jackson+-+You+Rock+My+World+%28Short+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":-1,"time":1248597669,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;You Rock My World&quot; is a song by American singer-songwriter Michael Jackson. It was the debut single from his 2001 album Invincible. The song peaked at #10 on the Billboard Hot 100, becoming Jackson's last top ten hit in the United States. It was nominated for a Grammy Award for Best Male Pop Vocal Performance at the 44th Grammy Awards. The music video for the song is the last to feature any participation from Jackson; the follow-up single, &quot;Butterflies&quot;, had no video, and he does not appear in the video for &quot;Cry&quot;.\n\nThe music video for &quot;You Rock My World&quot; was premiered in Europe, Asia, and South Africa on September 21, 2001. In wake of the September 11, 2001 attacks in the U.S., the premiere was delayed there until September 26.\n\nLike many of Jackson's music videos, this one takes the form of a short film, based on a story written by Michael Jackson and Paul Hunter. It follows a story in which Michael Jackson and Chris Tucker spot an attractive woman (played by actress-choreographer Kishaya Dudley) and follow her into a gangster-infested nightclub (called The Waterfront Hotel, in reference to the famous film starring Marlon Brando, who plays the club's owner in this music video). Obviously, they are not wanted there, because it seems the woman already has a love interest (played by Michael Madsen). However, Jackson is determined to meet this woman.\n\nJackson serenades her with a song (&quot;You Rock My World&quot;), as well as performing his complicated dance moves. He is then challenged to a fight by one of the regulars at the club (played by Billy Drago). When asked by Drago to &quot;show me what you got,&quot; Jackson, backed by a line of dancers, pulls off a dance sequence choreographed by himself, Anthony &quot;Tone&quot; Talauega and Richmond Talauega. After the dance sequence Drago says to Jackson, &quot;Is that all you got? You ain't nothin'!&quot; This provokes Jackson into punching Drago, the violence leading to the breakout of a fire in the building. When he evacuates the building and finally meets up with the attractive woman, the two share an intimate moment before driving away in Tucker's car. The cast also includes one of Jackson's confidants, Frank Tyson (who appears in only one shot). The video won an NAACP Image Award for Best Music Video in 2001. There are short-film and single-length versions of the video. There is also a longer version of the video featuring more dialogue between Tucker and Jackson, along with various other changes available on the web. It is unclear whether this third version is an official product or a homemade edit using outtakes.\n\nThe length of this version is 5 minutes 44 seconds.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:ff15f60e302bf0ae1f0c7d0ceecbf429834af46b","amp;dn":"Michael+Jackson+-+You+Rock+My+World+%28Short+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff15f60e302bf0ae1f0c7d0ceecbf429834af46b","infoHashBuffer":{"type":"Buffer","data":[255,21,246,14,48,43,240,174,31,12,125,12,238,203,244,41,131,74,244,107]},"announce":[],"urlList":[]}}